-- 常量
ZDConst={}

ZDConst.TeamMaxMem = 4 -- 队伍最大人数

-- 二级类
ZDConst.subType = {
	[1] = {
			{1001, "不周山一层"},
			{1002, "不周山二层"},
			{1003, "不周山三层"},
			{1004, "轩辕台一层"},
			{1005, "轩辕台二层"},
			{1006, "轩辕台三层"},
			{1007, "青云岭一层"},
			{1008, "青云岭二层"},
			{1009, "青云岭三层"},
			{1010, "巨人野一层"},
			{1011, "巨人野二层"},
			{1012, "巨人野三层"},
			{1013, "断壁谷一层"},
			{1014, "断壁谷二层"},
			{1015, "断壁谷三层"},
		},
	[2] = {
			{2001, "奇兵洞·普通"},
			{2002, "奇兵洞·困难"},
			{2003, "奇兵洞·地狱"},
			{2004, "玄武阵·普通"},
			{2005, "玄武阵·困难"},
			{2006, "玄武阵·地狱"},
			{2007, "炼骨窟·普通"},
			{2008, "炼骨窟·困难"},
			{2009, "炼骨窟·地狱"},
			{2010, "朱雀阵·普通"},
			{2011, "朱雀阵·困难"},
			{2012, "朱雀阵·地狱"},
			{2013, "伏羲陵·普通"},
			{2014, "伏羲陵·困难"},
			{2015, "伏羲陵·地狱"},
			{2016, "青龙阵·普通"},
			{2017, "青龙阵·困难"},
			{2018, "青龙阵·地狱"},
			{2019, "幻海·普通"},
			{2020, "幻海·困难"},
			{2021, "幻海·地狱"},
			{2022, "白虎阵·普通"},
			{2023, "白虎阵·困难"},
			{2024, "白虎阵·地狱"},
			{2025, "相柳泽·普通"},
			{2026, "相柳泽·困难"},
			{2027, "相柳泽·地狱"},
			{2028, "麒麟阵·普通"},
			{2029, "麒麟阵·困难"},
			{2030, "麒麟阵·地狱"},
		},
	[3] = {
			{3001, "斗兽场"},
			{3002, "风后影踪"},
			{3003, "冰原遇险"},
			{3004, "千年老龟"},
			{3005, "决战天蛛"},
			{3006, "龙的轨迹"},
			{3007, "毒龙灾害"},
			{3007, "神秘洞穴"},
		},	
}
-- 一级类型
ZDConst.bigType = {
	[1] = {0, "所有"},
	[2] = {1, "野外", ZDConst.subType[1]},
	[3] = {2, "副本", ZDConst.subType[2]},
	[4] = {3, "活动", ZDConst.subType[3]},
}

-- 目标列表组合
ZDConst.teamTargets = {
	[1] = ZDConst.bigType[1],
	[2] = ZDConst.bigType[2],
	[3] = ZDConst.bigType[3],
	[4] = ZDConst.bigType[4],
}

ZDConst.bigTypeStr = {
	[1] = "自\n由",
	[2] = "野\n外",
	[3] = "副\n本",
	[4] = "活\n动"
}

ZDConst.HALL_CHANGE = "0" -- 队伍大厅数据变化
ZDConst.MINE_CHANGE = "1" -- 我的队伍（成员|队长）变化
ZDConst.FINISH_MATCH_TEAM = "2" -- 结束玩家自动匹配队伍
ZDConst.FOLLOW = "3" -- 跟随队长
ZDConst.APPLYLIST_CHANGE = "4" -- 申请加入队伍列表变化
ZDConst.TXT_AUTO = "自动匹配"
ZDConst.TXT_CANCEL_AUTO = "取消匹配"
-- t[1][1]: 一键组队弹出框内tab标题, t[1][2]: 对应的发言channel id
ZDConst.TXT_HANHUA_PREFIX =
{
	[1] = {"世界", 1},
	[2] = {"附近", 6},
	[3] = {"家族", 2},
	[4] = {"队伍", 3}
}
ZDConst.TXT_HANHUA_SUFFIX = "喊话"
ZDConst.TXT_HANHUA_SUCCESS = "喊话成功"
ZDConst.TXT_HANHUA_FAIL = "喊话太过频繁"