local consign_type={
['1']={'1',1,'装备',1,'武器',50},
['2']={'2',1,'装备',2,'项链',50},
['3']={'3',1,'装备',3,'戒指',50},
['4']={'4',1,'装备',4,'护手',50},
['5']={'5',1,'装备',5,'帽子',50},
['6']={'6',1,'装备',6,'衣服',50},
['7']={'7',1,'装备',7,'裤子',50},
['8']={'8',1,'装备',8,'鞋子',50},
['9']={'9',1,'装备',9,'仙兵',50},
['10']={'10',1,'装备',10,'玄兵',50},
['11']={'11',2,'宝石',1,'生命宝石',50},
['12']={'12',2,'宝石',2,'攻击宝石',50},
['21']={'21',3,'材料',10,'强化材料',50},
['22']={'22',3,'材料',3,'套装材料',50},
['23']={'23',7,'坐骑',1,'坐骑碎片',50},
['24']={'24',3,'材料',4,'境界突破',50}
}
local ks={key=1,type=2,type_name=3,kind=4,kind_name=5,sale_list=6}
local base={__index=function(t,k)if k=='cks' then return ks end local ind=ks[k] return ind and t[ind] or nil end}for k,v in pairs(consign_type)do setmetatable(v,base)end base.__metatable=false
return consign_type
