local experience_lev = {
	[1] = {
		['id'] = 1,	--阶段id
		['min_level'] = 20,	--最小等级
		['icon_id'] = 'fuben_03',	--关卡图标
		['drop'] = {'400002_2','400003_2'},	--几率掉落掉落显示
		['desc'] = '各大宗门为了提升本门实力，共同对抗魔主，纷纷派出弟子前往中天各地历练',	--副本描述
	--
	--
		},
	[2] = {
		['id'] = 2,
		['min_level'] = 45,
		['icon_id'] = 'fuben_03',
		['drop'] = {'400002_2','400003_2'},
		['desc'] = '各大宗门为了提升本门实力，共同对抗魔主，纷纷派出弟子前往中天各地历练',


		},
	[3] = {
		['id'] = 3,
		['min_level'] = 65,
		['icon_id'] = 'fuben_03',
		['drop'] = {'400000_2','400001_2'},
		['desc'] = '各大宗门为了提升本门实力，共同对抗魔主，纷纷派出弟子前往中天各地历练',


		},
	[4] = {
		['id'] = 4,
		['min_level'] = 75,
		['icon_id'] = 'fuben_03',
		['drop'] = {'400002_2','400003_2'},
		['desc'] = '各大宗门为了提升本门实力，共同对抗魔主，纷纷派出弟子前往中天各地历练',


		},
	[5] = {
		['id'] = 5,
		['min_level'] = 85,
		['icon_id'] = 'fuben_03',
		['drop'] = {'400000_2','400001_2'},
		['desc'] = '各大宗门为了提升本门实力，共同对抗魔主，纷纷派出弟子前往中天各地历练',


		}
	}
return experience_lev
