local magic_cimelia={
[310301]={310301,'化阴葫',1,3,'magic_05',310301,8690,0,0,0,0,0,901,0,0,0,0,2,720051,4285,'春风化雨',3,'0',0,206105,'使用生命恢复药品时额外恢复[00ff00]{s}[-]生命值（等级越高效果越好）','[9cff94]完成[ffc320]50级支线[-]【法宝历练一】获得[-]'},
[310302]={310302,'破军蓝',5,4,'magic_06',310302,0,1026,0,1621,0,0,0,0,0,0,0,2,0,16074,'天雷斩击',6,'0',10,206115,'攻击目标为玩家时，所有技能伤害增加[00ff00]10%[-]','[9cff94]完成[ffc320]玄宝寻主[-]【玄宝破军】获得[-]'},
[310303]={310303,'刹月剑',2,3,'magic_02',310303,0,342,0,540,0,0,0,0,0,300,0,2,0,5356,'斗志高昂',2,'0',0,206106,'击杀怪物时额外增加[00ff00]30%[-]经验','[9cff94]完成[ffc320]玄宝寻主[-]【玄宝刹月】获得[-]'},
[310304]={310304,'噬魂鼎',3,3,'magic_03',310304,0,0,358,0,0,0,0,0,1150,0,0,2,0,8896,'风驰电掣',4,'0',10,206111,'攻击目标为怪物且非boss怪时，所有技能伤害增加[00ff00]10%[-]','[9cff94]完成[ffc320]玄宝寻主[-]【玄宝噬魂】获得[-]'},
[310305]={310305,'螭火灯',6,4,'magic_04',310305,0,0,597,0,0,0,0,0,1610,0,5,2,0,14294,'金刚伏魔',5,'0',0,206102,'永久提升角色[00ff00]5%[-]移动速度以及[00ff00]{s}[-]生命上限（等级越高效果越好）','[9cff94]完成[ffc320]玄宝寻主[-]【玄宝螭火】获得[-]'},
[310306]={310306,'金元钟',4,3,'magic_01',310306,13035,0,0,0,0,0,1351,0,0,0,0,2,720054,6427,'分光化影',1,'201130,201140,202110,202120,202130,202140,203110,203120,203130,203140,204130,204140',4,206103,'[00ff00]普通攻击[-]技能变为[00ff00]范围伤害[-]','[9cff94]完成[ffc320]160级支线[-]【法宝历练四】获得[-]'}
}
local ks={id=1,name=2,order=3,quality=4,model_id=5,icon=6,hp_max=7,phy_att=8,phy_def=9,hit=10,eva=11,crit=12,tough=13,fatal=14,block=15,exp_per=16,move_spd=17,act_type=18,act_condition=19,fighting_capacity=20,effect_name=21,effect_type=22,effect_target=23,effect_para=24,effect_icon=25,effect_des=26,obtain_des=27}
local base={__index=function(t,k)if k=='cks' then return ks end local ind=ks[k] return ind and t[ind] or nil end}for k,v in pairs(magic_cimelia)do setmetatable(v,base)end base.__metatable=false
return magic_cimelia
