local map_effect = {
	[1] = {
		['map'] = 701002,	--所在场景
		["type"] = 2,   --类型，1挂在场景，2挂摄像机，3挂角色
		['x'] = 0,	--x轴坐标
		['y'] = -200,	--y轴坐标
		['z'] = 1200,	--z轴坐标
		["rx"] = -35, --x轴旋转
		["ry"] = 0,		--y轴旋转
		["rz"] = 0,	--z轴旋转
		['model'] = "FX_10002_rain"	--模型
		},
	[2] = {
		['map'] = 7010010,	--所在场景
		["type"] = 2,   --类型，1挂在场景，2挂摄像机，3挂角色
		['x'] = 0,	--x轴坐标
		['y'] = -200,	--y轴坐标
		['z'] = 1200,	--z轴坐标
		["rx"] = -35, --x轴旋转
		["ry"] = 0,		--y轴旋转
		["rz"] = 0,	--z轴旋转
		['model'] = "10000_FX_camSnow"	--模型
		},
	[3] = {
		['map'] = 701008,	--所在场景
		["type"] = 2,   --类型，1挂在场景，2挂摄像机，3挂角色
		['x'] = 0,	--x轴坐标
		['y'] = -200,	--y轴坐标
		['z'] = 1200,	--z轴坐标
		["rx"] = -35, --x轴旋转
		["ry"] = 0,		--y轴旋转
		["rz"] = 0,	--z轴旋转
		['model'] = "FXCam_10006_leaf"	--模型
		},
	[4] = {
		['map'] = 701009,	--所在场景
		["type"] = 2,   --类型，1挂在场景，2挂摄像机，3挂角色
		['x'] = 0,	--x轴坐标
		['y'] = -200,	--y轴坐标
		['z'] = 1200,	--z轴坐标
		["rx"] = -35, --x轴旋转
		["ry"] = 0,		--y轴旋转
		["rz"] = 0,	--z轴旋转
		['model'] = "FXCam_10008_wind"	--模型
		},
	}
return map_effect