local new_trump={
[310200]={310200,'浑天镜',3,'trump_htj',310201,208203,1,0,1,4345,0,0,540,0,0,0,0,0,0,7,800055,'[9cff94]完成[ffc320]9级主线[-]【法宝出世】获得[-]','传闻上古古魔界统帅永生中期高手元耀的无上法宝，上古人族与魔族大战之后，被遗留在魔渊塔中。'},
[310201]={310201,'天罚地劫',4,'trump_tfdj',310204,208209,1,0,1,0,684,0,540,0,0,0,0,0,0,9,720055,'[9cff94]完成[ffc320]200级支线[-]【法宝历练五】获得[-]','传闻是上界九天仙尊的无上法宝，为诛杀原始魔主让柳鸣在天洞中获得的顶级玄灵法宝。'},
[310203]={310203,'浑天碑',3,'trump_htb',310207,208215,1,0,1,10428,0,0,0,0,0,0,0,460,0,9,720052,'[9cff94]完成[ffc320]80级支线[-]【法宝历练二】获得[-]','无上通玄大能魔魂之一的魔天炼制的顶级玄灵法宝。'},
[310204]={310204,'陨魔鞭',4,'trump_ymb',310200,208201,1,0,1,21725,0,0,0,0,0,1351,0,0,0,9,720056,'[9cff94]完成[ffc320]240级支线[-]【法宝历练六】获得[-]','万魔大陆四大家族之一的通玄中期柳家家主柳回风，初级玄灵之宝，也是柳家家族的镇族之宝。。'},
[310205]={310205,'元魔斧',3,'trump_ymf',310205,208211,1,0,1,0,0,239,0,0,0,901,0,0,0,9,720053,'[9cff94]完成[ffc320]120级支线[-]【法宝历练三】获得[-]','轮回秘境中永生境高手魔主炼制的顶级玄灵法宝，威力无穷。'},
[310206]={310206,'山河珠',5,'trump_shz',310206,208213,1,0,1,0,855,0,1081,0,0,0,0,0,0,9,720057,'[9cff94]完成[ffc320]280级支线[-]【法宝历练七】获得[-]','柳鸣进去上界废墟上古传承中获得的半成品法宝，经柳鸣苦心炼制，威力奇大。'},
[310208]={310208,'乾坤御雷环',4,'trump_ylh',310202,208205,1,0,1,28677,0,0,0,0,0,0,0,1380,0,9,720058,'[9cff94]完成[ffc320]320级支线[-]【法宝历练八】获得[-]','传闻上古古魔界统帅永生中期高手元耀的无上法宝，上古人族与魔族大战之后，被遗留在魔渊塔中。'},
[310209]={310209,'虚魔鼎',3,'trump_xmd',310203,208207,1,0,1,0,513,0,810,0,0,0,0,0,0,6,15,'[9cff94][ffc320]十五日礼包[-]第2天获得[-]','万魔大陆圆满通玄高手万魔皇朝魔皇皇甫雍所有，中级品质的玄灵之宝。'},
[310299]={310299,'天罚地劫',3,'trump_tfdj',310204,212050,1,0,1,0,96,0,0,0,36,0,0,0,0,6,3,'剧情用','传闻是上界九天仙尊的无上法宝，为诛杀原始魔主让柳鸣在天洞中获得的顶级玄灵法宝。'},
[310202]={310202,'天罚地劫',4,'trump_tfdj',310204,208209,1,0,1,6517,0,0,0,540,0,0,0,0,0,6,15,'物法合并后废弃','传闻是上界九天仙尊的无上法宝，为诛杀原始魔主让柳鸣在天洞中获得的顶级玄灵法宝。'},
[310207]={310207,'山河珠',5,'trump_shz',310206,208213,1,0,1,6517,0,0,0,540,0,0,0,0,0,6,15,'物法合并后废弃','柳鸣进去上界废墟上古传承中获得的半成品法宝，经柳鸣苦心炼制，威力奇大。'},
[310210]={310210,'虚魔鼎',4,'trump_xmd',310203,208207,1,0,1,6517,0,0,0,540,0,0,0,0,0,6,15,'物法合并后废弃','万魔大陆圆满通玄高手万魔皇朝魔皇皇甫雍所有，中级品质的玄灵之宝。'}
}
local ks={id=1,name=2,quality=3,model_id=4,icon=5,act_skill=6,act_skill_lev=7,pass_skill=8,pass_skill_lev=9,hp_max=10,phy_att=11,phy_def=12,hit=13,eva=14,crit=15,tough=16,fatal=17,block=18,direct_dmg=19,act_type=20,act_condition=21,obtain_des=22,des=23}
local base={__index=function(t,k)if k=='cks' then return ks end local ind=ks[k] return ind and t[ind] or nil end}for k,v in pairs(new_trump)do setmetatable(v,base)end base.__metatable=false
return new_trump
