local red_packet={
[1]={1,1,'购买首次充值',0,1,70,10,7,15,1},
[2]={2,2,'购买月卡礼包',0,0,100,15,10,20,1},
[3]={3,3,'购买成长基金',0,1,200,15,10,20,1},
[4]={4,4,'达到vip1',1,1,100,10,7,15,1},
[5]={5,4,'达到vip2',2,1,100,15,10,15,1},
[6]={6,4,'达到vip3',3,1,100,15,10,15,1},
[7]={7,4,'达到vip4',4,1,200,15,10,15,1},
[8]={8,4,'达到vip5',5,1,300,15,10,15,1},
[9]={9,4,'达到vip6',6,1,500,15,10,20,1},
[10]={10,4,'达到vip7',7,1,1000,15,10,20,1},
[11]={11,4,'达到vip8',8,1,1500,15,10,20,1},
[12]={12,4,'达到vip9',9,1,2000,15,10,20,1},
[13]={13,4,'达到vip10',10,1,2000,15,10,20,1},
[14]={14,4,'达到vip11',11,1,2000,15,10,20,1},
[15]={15,4,'达到vip12',12,1,2500,15,10,20,1},
[16]={16,4,'达到vip13',13,1,3000,15,10,20,1},
[17]={17,4,'达到vip14',14,1,3500,15,10,20,1},
[18]={18,4,'达到vip15',15,1,4000,15,10,20,1}
}
local ks={id=1,type=2,name=3,condition=4,type_times=5,total=6,num=7,min_num=8,max_num=9,min_total=10}
local base={__index=function(t,k)if k=='cks' then return ks end local ind=ks[k] return ind and t[ind] or nil end}for k,v in pairs(red_packet)do setmetatable(v,base)end base.__metatable=false
return red_packet
