local ride={
[330000]={330000,'九色鹿',2,330000,'ride_01','ride02','B_RD',1,{170,240,190},1,1,4,'358000_1',864000,400,0,false,0,0,48,0,0,0,0,0,0,0,200,'','[FFF600]商城[-]购买获得','传说中护佑天下太平的神兽，激活后可减少[00ff00]20%[-]受到的伤害，[00ff00]击杀BOSS[-]、[00ff00]PK[-]利器\n'},
[330001]={330001,'寒香鲨',10,330001,'ride_12','ride02','B_RD',1,{180,280,220},1,1,3,'358001_20',0,350,0,false,0,451,0,0,0,0,0,0,810,0,0,'','限时活动奖励','深海之中的霸主，凶猛异常，成年的寒香鲨有堪比化晶高手的实力'},
[330002]={330002,'青月剑',6,330002,'ride_03','ride01','B_RD',1,{180,280,220},1,1,2,'358002_1',864000,350,0,false,6374,0,0,0,0,0,367,0,0,0,0,'','[34E0FF]功勋商店[-]购买获得','云川大陆鼎鼎有名的灵器，剑身青色琉璃，灵光流转'},
[330003]={330003,'轩辕剑',12,330012,'ride_13','ride01','B_RD',0.8,{180,280,220},1,1,3,'358003_20',0,350,0,false,0,0,270,0,0,0,635,0,0,0,0,'','限时活动奖励','一剑出鞘，王者归来。剑的传说，再起风云'},
[330004]={330004,'傀儡兽',9,330004,'ride_07','ride02','B_RD',1,{180,280,220},1,1,4,'358004_20',0,400,0,false,0,0,0,1301,542,0,0,885,0,0,0,'','限时活动奖励','精巧异常的机关傀儡兽，似狮似虎，凶猛霸道'},
[330005]={330005,'冰甲沧海龙',7,330005,'ride_08','ride02','B_RD',0.7,{180,280,220},1,1,5,'358005_20',0,450,0,false,18397,0,0,817,0,0,1135,0,0,0,0,'','限时活动奖励','传说中的九天神龙，龙行天下，身形见首不见尾'},
[330006]={330006,'青鸾',5,330006,'ride_10','ride02','B_RD',0.8,{180,280,220},1,1,5,'358006_20',0,450,0,false,17351,0,0,0,0,2099,0,1530,0,0,0,'','[FFA811]上古魔主活动[-]排名奖励','上古神兽，传闻青鸾的出现通常伴随着巨大的福运\n'},
[330007]={330007,'火焰龙',4,330007,'ride_11','ride02','B_RD',1,{170,240,190},1,1,5,'358007_20',0,450,0,false,0,774,0,0,1063,0,0,0,0,0,0,'','[FFA811]仙盟气运战活动[-]排名奖励','居于小炎界熔岩火海之间的西方异龙，凶猛异常，可给主人加成大量攻击\n'},
[330008]={330008,'骨蝎',1,330008,'ride_09','ride02','B_RD',0.9,{180,280,220},1,1,4,'358008_1',2592000,400,368,true,0,208,0,274,0,0,0,0,0,300,0,'370012','[FFF600]商城[-]购买获得','陪伴柳鸣左右的灵宠，实战利器，为主人增加[00ff00]30%杀怪经验[-]，[00ff00]无尽试炼[-]、[00ff00]野外挂机[-]的必备坐骑'},
[330009]={330009,'碧灵飞舟',8,330009,'ride_06','ride02','B_RD',1.1,{180,280,220},1,1,4,'358009_20',0,400,0,false,13650,0,0,0,0,0,0,0,1806,0,0,'','限时活动奖励','用空间性质材料打造而成，大气辉煌，速度极快'},
[330010]={330010,'赤凰剑',3,330010,'ride_04','ride01','B_RD',0.8,{180,280,220},1,1,4,'358010_1',0,400,0,false,0,443,0,0,390,0,0,0,0,0,0,'','[FFF600]商城[-]购买获得','极品剑胚，极大增加主角攻击力，日行千里，绚丽万分'},
[330011]={330011,'彩梦蝶',11,330011,'ride_05','ride02','B_RD',0.8,{180,280,220},1,1,3,'358011_20',0,350,0,false,0,0,275,0,0,0,0,264,0,0,0,'','限时活动奖励','庄周晓梦迷蝴蝶，相传有使人堕入幻境的能力，但似乎没人见过它，还是见过的人消失了？'},
[330014]={330014,'天马',19,330014,'ride_14','ride02','B_RD',1.1,{180,280,220},1,1,5,'358014_20',0,450,0,false,18397,0,0,817,0,0,1135,0,0,0,0,'','最后一击BOSS','仙宫天马，非大能之士不可趋之'},
[330015]={330015,'莲云',15,330015,'ride_15','ride02','B_RD',0.9,{180,280,220},1,1,4,'358015_20',0,450,0,false,0,500,0,0,600,0,0,0,0,0,0,'','限时活动','碧云莲莲，若神似仙'},
[330016]={330016,'月牙船',16,330016,'ride_16','ride02','B_RD',1,{180,280,220},1,1,5,'358016_20',0,450,0,false,17351,0,0,0,0,2099,0,1530,0,0,0,'','限时活动','月牙弯弯，转眼现天边'},
[330019]={330019,'宝莲灯',14,330019,'ride_19','ride02','B_RD',1.2,{180,280,220},1,1,4,'358019_1',0,450,0,false,13650,0,0,0,0,0,0,0,1806,0,0,'','云购','用空间性质材料打造而成，大气辉煌，速度极快'}
}
local ks={id=1,name=2,order=3,icon_id=4,model_id=5,action_id=6,hang_point=7,model_scale_rate=8,rotate=9,lev=10,req_lev=11,quality=12,synthetic_condition=13,effective_time=14,speed_per=15,gold=16,is_hint=17,hp_max=18,phy_att=19,phy_def=20,hit=21,eva=22,crit=23,tough=24,fatal=25,block=26,exp_per=27,dmg_rate=28,icon=29,obtain_des=30,desc=31}
local base={__index=function(t,k)if k=='cks' then return ks end local ind=ks[k] return ind and t[ind] or nil end}for k,v in pairs(ride)do setmetatable(v,base)end base.__metatable=false
return ride
