local section={
[2]={2,'第二章',{'301410_101000','302410_102000','303410_103000','304410_104000'},'15级金色装备，攻击+1000，战力+1000!\n\n橙色装备比金色装备更强大，可在古魔来袭活动中获得！'},
[3]={3,'第三章',{'301410_101000','302410_102000','303410_103000','304410_104000'},'15级金色装备，攻击+1000，战力+1000!\n\n橙色装备比金色装备更强大，可在古魔来袭活动中获得！'},
[4]={4,'第四章',{'301410_101000','302410_102000','303410_103000','304410_104000'},'15级金色装备，攻击+1000，战力+1000!\n\n橙色装备比金色装备更强大，可在古魔来袭活动中获得！'},
[5]={5,'第五章',{'301410_101000','302410_102000','303410_103000','304410_104000'},'15级金色装备，攻击+1000，战力+1000!\n\n橙色装备比金色装备更强大，可在古魔来袭活动中获得！'}
}
local ks={id=1,section_name=2,career_award=3,section_des=4}
local base={__index=function(t,k)if k=='cks' then return ks end local ind=ks[k] return ind and t[ind] or nil end}for k,v in pairs(section)do setmetatable(v,base)end base.__metatable=false
return section
