local strong_base={
['1_1']={'1_1',1,'我要变强',1,1,'装备穿戴','穿戴更高级更高品质装备可提升战力',60,'BQ_zhuzao',0,11},
['1_2']={'1_2',1,'我要变强',1,2,'境界系统','境界提升可提升战力',999,'BQ_jingjie',0,2},
['1_3']={'1_3',1,'我要变强',1,3,'伙伴系统','伙伴升进阶可提升战力',23,'BQ_huoban',0,3},
['1_5']={'1_5',1,'我要变强',1,5,'法宝收集','收集法宝可提升战力',999,'BQ_fabao',0,5},
['1_6']={'1_6',1,'我要变强',1,6,'坐骑系统','获得坐骑可提升战力',43,'BQ_zuoqi',0,6},
['1_7']={'1_7',1,'我要变强',1,7,'翅膀系统','翅膀升星可提升战力',55,'BQ_chibang',0,7},
['1_8']={'1_8',1,'我要变强',1,8,'技能升级','升级技能可提升战力',1,'BQ_jineng',0,13},
['1_9']={'1_9',1,'我要变强',1,9,'神器系统','升级神器可提升战力',120,'BQ_shenqi',0,14},
['1_10']={'1_10',1,'我要变强',1,10,'命星系统','升级命星可提升战力',65,'BQ_mingxing',0,15},
['1_11']={'1_11',1,'我要变强',1,11,'装备附灵','装备附灵可提升战力',60,'BQ_zhuzao',0,16},
['1_12']={'1_12',1,'我要变强',1,12,'宝石镶嵌','宝石镶嵌可提升战力',85,'BQ_zhuzao',0,17},
['1_13']={'1_13',1,'我要变强',1,13,'装备精炼','装备精炼可提升战力',370,'BQ_zhuzao',0,18},
['1_14']={'1_14',1,'我要变强',1,14,'装备强化','装备强化可提升战力',280,'BQ_zhuzao',0,1},
['1_15']={'1_15',1,'我要变强',1,15,'仙器系统','仙器附魔注魂可提升战力',180,'BQ_xianqi',0,19},
['2_1']={'2_1',2,'获取经验',1,1,'赏金任务','完成每日赏金任务可获得大量经验',50,'BQ_xunhuan',3,11},
['2_2']={'2_2',2,'获取经验',1,2,'无尽试炼','参加无尽试炼可获得大量经验',75,'BQ_mozhu',5,10},
['2_3']={'2_3',2,'获取经验',1,3,'玄榜任务','完成每日玄榜任务可获得大量经验',160,'BQ_xuanbang',4,11},
['3_1']={'3_1',3,'获取铜钱',55,1,'赏金任务','完成每日赏金任务可获得铜钱',50,'BQ_xunhuan',5,11},
['3_2']={'3_2',3,'获取铜钱',55,2,'玄榜任务','完成每日玄榜任务可获得铜钱',160,'BQ_xuanbang',5,11},
['4_1']={'4_1',4,'获取装备',90,1,'剧情副本','挑战剧情副本可获得装备',105,'BQ_fuben',4,11},
['4_2']={'4_2',4,'获取装备',90,2,'古魔来袭','参加古魔来袭活动可能获得装备',90,'BQ_gumo',5,12},
['5_1']={'5_1',5,'获取法宝',50,1,'法宝历练','完成指定的支线任务可以获得法宝',50,'BQ_xunhuan',3,0},
['5_2']={'5_2',5,'获取法宝',50,2,'福利礼包','领取十五日福利礼包可获得法宝',1,'BQ_zaixian',3,0},
['6_1']={'6_1',6,'伙伴材料',100,1,'小炎界','参加小炎界可以获得伙伴材料',100,'BQ_mingzu',5,11},
['7_1']={'7_1',7,'获取宝石',120,1,'上界争霸','参加上界争霸战场可能获得镶嵌宝石',120,'BQ_zhanchang',5,12},
['8_1']={'8_1',8,'获取坐骑',120,1,'魔主之影','参加魔主之影可获得坐骑碎片',120,'BQ_mozhu',5,12},
['9_1']={'9_1',9,'翅膀材料',190,1,'九幽王座','挑战九幽王座副本可获得翅膀材料',190,'BQ_fuben',5,11}
}
local ks={key=1,type_id=2,type_name=3,type_lev=4,kind_id=5,kind_name=6,kind_des=7,kind_lev=8,icon=9,max_star=10,interface=11}
local base={__index=function(t,k)if k=='cks' then return ks end local ind=ks[k] return ind and t[ind] or nil end}for k,v in pairs(strong_base)do setmetatable(v,base)end base.__metatable=false
return strong_base
