local week_list={
[1]={1,'11:30','上古妖兽','上古妖兽','上古妖兽','上古妖兽','上古妖兽','上古妖兽','上古妖兽'},
[2]={2,'12:00','心机大冒险','心机大冒险','心机大冒险','心机大冒险','心机大冒险','心机大冒险','心机大冒险'},
[3]={3,'12:30','禁忌之地','禁忌之地','禁忌之地','禁忌之地','禁忌之地','禁忌之地','禁忌之地'},
[4]={4,'16:00','鬼王赐宝','鬼王赐宝','鬼王赐宝','鬼王赐宝','鬼王赐宝','鬼王赐宝','鬼王赐宝'},
[5]={5,'16:30','上古妖兽','上古妖兽','上古妖兽','上古妖兽','上古妖兽','上古妖兽','上古妖兽'},
[6]={6,'19:30','上古妖兽','上古妖兽','上古妖兽','上古妖兽','上古妖兽','上古妖兽','上古妖兽'},
[7]={7,'20:00','世界BOSS','上界争霸','世界BOSS','上界争霸','上界争霸','世界BOSS','上界争霸'},
[8]={8,'20:30','仙盟聚会','仙盟聚会','仙盟聚会','仙盟聚会','仙盟聚会','仙盟聚会','仙盟聚会'},
[9]={9,'21:00','仙盟首领','仙盟战','仙盟首领','仙盟首领','仙盟战','仙盟首领','跨服仙盟战'},
[10]={10,'21:30','禁忌之地','禁忌之地','禁忌之地','禁忌之地','禁忌之地','禁忌之地','禁忌之地'},
[11]={11,'22:30','上古妖兽','上古妖兽','上古妖兽','上古妖兽','上古妖兽','上古妖兽','上古妖兽'}
}
local ks={id=1,open_time=2,name1=3,name2=4,name3=5,name4=6,name5=7,name6=8,name7=9}
local base={__index=function(t,k)if k=='cks' then return ks end local ind=ks[k] return ind and t[ind] or nil end}for k,v in pairs(week_list)do setmetatable(v,base)end base.__metatable=false
return week_list
