data_ExtraExpBonus = {
  [1] = {
    OpenTime = {
      {},
      {
        {
          {17, 0},
          {18, 0}
        },
        {
          {20, 0},
          {21, 0}
        }
      },
      {},
      {
        {
          {17, 0},
          {18, 0}
        },
        {
          {20, 0},
          {21, 0}
        }
      },
      {},
      {
        {
          {17, 0},
          {18, 0}
        },
        {
          {20, 0},
          {21, 0}
        }
      },
      {
        {
          {17, 0},
          {18, 0}
        },
        {
          {20, 0},
          {21, 0}
        }
      }
    },
    ExpPercent = 25,
    OpenBulletTip = "抓鬼节节高活动开始了,经验收益+25%,赶紧去地府钟馗、地藏王处接受任务吧",
    CloseBulletTip = "抓鬼节节高活动已结束",
    BeforeOpenChannelTip = "抓鬼节节高活动将于10分钟后开始了,经验收益+25%,赶紧去地府钟馗、地藏王处接受任务吧",
    OpenChannelTip = "抓鬼节节高活动开始了,经验收益+25%,赶紧去地府钟馗、地藏王处接受任务吧"
  },
  [2] = {
    OpenTime = {
      {
        {
          {17, 0},
          {18, 0}
        },
        {
          {20, 0},
          {21, 0}
        }
      },
      {},
      {
        {
          {17, 0},
          {18, 0}
        },
        {
          {20, 0},
          {21, 0}
        }
      },
      {},
      {
        {
          {17, 0},
          {18, 0}
        },
        {
          {20, 0},
          {21, 0}
        }
      },
      {},
      {}
    },
    ExpPercent = 25,
    OpenBulletTip = "天庭任务节节高活动开始了,经验收益+25%,赶紧去天庭玉帝处接受任务吧",
    CloseBulletTip = "天庭任务节节高活动已结束",
    BeforeOpenChannelTip = "天庭任务节节高活动将于10分钟后开始了,经验收益+25%,赶紧去天庭玉帝处接受任务吧",
    OpenChannelTip = "天庭任务节节高活动开始了,经验收益+25%,赶紧去天庭玉帝处接受任务吧"
  },
  [3] = {
    OpenTime = {
      {},
      {
        {
          {17, 0},
          {18, 0}
        },
        {
          {20, 0},
          {21, 0}
        }
      },
      {},
      {
        {
          {17, 0},
          {18, 0}
        },
        {
          {20, 0},
          {21, 0}
        }
      },
      {},
      {
        {
          {17, 0},
          {18, 0}
        },
        {
          {20, 0},
          {21, 0}
        }
      },
      {
        {
          {17, 0},
          {18, 0}
        },
        {
          {20, 0},
          {21, 0}
        }
      }
    },
    ExpPercent = 25,
    OpenBulletTip = "",
    CloseBulletTip = "",
    BeforeOpenChannelTip = "",
    OpenChannelTip = ""
  }
}
