data_LifeSkill = {
  [1] = {
    Name = "制药",
    Desc = "使用#<Y,>甘草#和#<Y,>灵芝#为原料,制造补充#<Y,>气血值#与#<Y,>法力值#的丹药。",
    upgradeDesc = "1、提升炼制药物的品质\n2、降低炼制药物时的活力值消耗\n3、可制造更多的药物\n4、在长安城#<Y,>杜如晦#处可重修技能"
  },
  [2] = {
    Name = "制符",
    Desc = "使用#<Y,>元气石#和#<Y,>玲珑石#为原料,制造#<Y,>加源泉万斛术#的符文,以及其它神奇的符文。",
    upgradeDesc = "1、提升制造符文的品质\n2、降低烹饪时的活力消耗\n3、可制造更多种类的符文\n4、在长安城#<Y,>杜如晦#处可重修技能"
  },
  [3] = {
    Name = "烹饪",
    Desc = "使用#<Y,>稻谷#和#<Y,>鸡肉#为原料,制造补充#<Y,>饱食度#的食物。以及酿制提升#<Y,>抗性#与#<Y,>五行强克#的美酒。",
    upgradeDesc = "1、提升制造食物与美酒的品质\n2、降低烹饪时的活力消耗\n3、可制造更多类型的食物与美酒\n4、在长安城#<Y,>杜如晦#处可重修技能"
  },
  [4] = {
    Name = "捉宠",
    Desc = "可拥有捕捉#<Y,>高级守护#的能力,在遇到#<Y,>高级守护#后进行自动捕捉。并提高捕捉的成功率。",
    upgradeDesc = "1、提高捉宠的成功率\n2、降低怪物的逃跑概率\n3、降低捉宠时的法力消耗\n4、在长安城#<Y,>杜如晦#处可重修技能"
  }
}
return data_LifeSkill
