data_MapTeleporter = {
  [10003] = {
    name = "长安郊外",
    type = 1,
    tomap = 4,
    pos = {
      2,
      5,
      92
    },
    toPos = {
      {
        67,
        15,
        5
      },
      {
        64,
        20,
        3
      }
    }
  },
  [10004] = {
    name = "长安城",
    type = 1,
    tomap = 2,
    pos = {
      4,
      70,
      13
    },
    toPos = {
      {
        11,
        88,
        2
      },
      {
        9,
        90,
        2
      }
    }
  },
  [10005] = {
    name = "双叉岭",
    type = 1,
    tomap = 3,
    pos = {
      4,
      19,
      60
    },
    toPos = {
      {
        37,
        33,
        5
      }
    }
  },
  [10006] = {
    name = "长安郊外",
    type = 1,
    tomap = 4,
    pos = {
      3,
      42,
      34
    },
    toPos = {
      {
        22,
        54,
        2
      },
      {
        21,
        54,
        2
      }
    }
  },
  [10007] = {
    name = "女儿国",
    type = 1,
    tomap = 7,
    pos = {
      3,
      4,
      10
    },
    toPos = {
      {
        36,
        34,
        1
      }
    }
  },
  [10008] = {
    name = "双叉岭",
    type = 1,
    tomap = 3,
    pos = {
      7,
      41,
      32
    },
    toPos = {
      {
        8,
        11,
        6
      }
    }
  },
  [10009] = {
    name = "魔王寨",
    type = 1,
    tomap = 9,
    pos = {
      7,
      33,
      8
    },
    toPos = {
      {
        45,
        37,
        1
      }
    }
  },
  [10010] = {
    name = "女儿国",
    type = 1,
    tomap = 7,
    pos = {
      9,
      48,
      46
    },
    toPos = {
      {
        31,
        10,
        5
      }
    }
  },
  [10013] = {
    name = "火焰山",
    type = 1,
    tomap = 5,
    pos = {
      9,
      16,
      7
    },
    toPos = {
      {
        21,
        14,
        3
      }
    }
  },
  [10014] = {
    name = "魔王寨",
    type = 1,
    tomap = 9,
    pos = {
      5,
      12,
      9
    },
    toPos = {
      {
        13,
        13,
        4
      }
    }
  },
  [10015] = {
    name = "东海渔村",
    type = 1,
    tomap = 1,
    pos = {
      4,
      63,
      62
    },
    toPos = {
      {
        71,
        14,
        8
      },
      {
        72,
        15,
        8
      }
    }
  },
  [10016] = {
    name = "长安郊外",
    type = 1,
    tomap = 4,
    pos = {
      1,
      75,
      13
    },
    toPos = {
      {
        62,
        58,
        7
      },
      {
        63,
        58,
        7
      }
    }
  },
  [10017] = {
    name = "龙宫",
    type = 1,
    tomap = 12,
    pos = {
      1,
      85,
      53
    },
    toPos = {
      {
        40,
        31,
        2
      }
    }
  },
  [10018] = {
    name = "东海渔村",
    type = 1,
    tomap = 1,
    pos = {
      12,
      41,
      33
    },
    toPos = {
      {
        81,
        53,
        2
      }
    }
  },
  [10019] = {
    name = "地府",
    type = 1,
    tomap = 10,
    pos = {
      12,
      41,
      14
    },
    toPos = {
      {
        43,
        32,
        2
      },
      {
        41,
        32,
        2
      }
    }
  },
  [10020] = {
    name = "龙宫",
    type = 1,
    tomap = 12,
    pos = {
      10,
      47,
      33
    },
    toPos = {
      {
        38,
        16,
        6
      }
    }
  },
  [10022] = {
    name = "长安城",
    type = 1,
    tomap = 2,
    pos = {
      13,
      51,
      27
    },
    toPos = {
      {
        105,
        55,
        2
      }
    }
  },
  [10025] = {
    name = "方寸山",
    type = 1,
    tomap = 6,
    pos = {
      11,
      10,
      8
    },
    toPos = {
      {
        49,
        13,
        2
      }
    }
  },
  [10026] = {
    name = "天宫",
    type = 1,
    tomap = 11,
    pos = {
      6,
      59,
      11
    },
    toPos = {
      {
        10,
        11,
        4
      }
    }
  },
  [10027] = {
    name = "宝象国东",
    type = 1,
    tomap = 301,
    pos = {
      5,
      72,
      56
    },
    toPos = {
      {
        37,
        30,
        7
      }
    }
  },
  [10028] = {
    name = "火焰山",
    type = 1,
    tomap = 5,
    pos = {
      301,
      54,
      28
    },
    toPos = {
      {
        65,
        53,
        7
      }
    }
  },
  [10029] = {
    name = "宝象国南",
    type = 1,
    tomap = 302,
    pos = {
      301,
      7,
      5
    },
    toPos = {
      {
        26,
        22,
        7
      }
    }
  },
  [10031] = {
    name = "宝象国西",
    type = 1,
    tomap = 303,
    pos = {
      302,
      43,
      19
    },
    toPos = {
      {
        32,
        25,
        7
      }
    }
  },
  [10033] = {
    name = "宝象国北",
    type = 1,
    tomap = 304,
    pos = {
      303,
      42,
      20
    },
    toPos = {
      {
        9,
        12,
        24
      }
    }
  },
  [10035] = {
    name = "宝象国东",
    type = 1,
    tomap = 301,
    pos = {
      304,
      39,
      12
    },
    toPos = {
      {
        9,
        16,
        13
      }
    }
  },
  [10037] = {
    name = "洞府一层",
    type = 1,
    tomap = 305,
    pos = {
      9,
      49,
      10
    },
    toPos = {
      {
        10,
        29,
        3
      }
    }
  },
  [10038] = {
    name = "魔王寨",
    type = 1,
    tomap = 9,
    pos = {
      305,
      5,
      27
    },
    toPos = {
      {
        49,
        15,
        6
      }
    }
  },
  [10039] = {
    name = "洞府二层",
    type = 1,
    tomap = 306,
    pos = {
      305,
      10,
      5
    },
    toPos = {
      {
        10,
        29,
        3
      }
    }
  },
  [10040] = {
    name = "洞府一层",
    type = 1,
    tomap = 305,
    pos = {
      306,
      5,
      27
    },
    toPos = {
      {
        11,
        10,
        5
      }
    }
  },
  [10041] = {
    name = "洞府三层",
    type = 1,
    tomap = 307,
    pos = {
      306,
      10,
      5
    },
    toPos = {
      {
        10,
        29,
        3
      }
    }
  },
  [10042] = {
    name = "洞府二层",
    type = 1,
    tomap = 306,
    pos = {
      307,
      5,
      27
    },
    toPos = {
      {
        11,
        10,
        5
      }
    }
  },
  [10043] = {
    name = "魔王寨",
    type = 1,
    tomap = 9,
    pos = {
      307,
      10,
      5
    },
    toPos = {
      {
        49,
        15,
        6
      }
    }
  },
  [10044] = {
    name = "北俱芦洲东",
    type = 1,
    tomap = 308,
    pos = {
      2,
      161,
      95
    },
    toPos = {
      {
        36,
        27,
        7
      }
    }
  },
  [10045] = {
    name = "长安城",
    type = 1,
    tomap = 2,
    pos = {
      308,
      42,
      31
    },
    toPos = {
      {
        135,
        75,
        5
      }
    }
  },
  [10046] = {
    name = "北俱芦洲南",
    type = 1,
    tomap = 309,
    pos = {
      308,
      4,
      23
    },
    toPos = {
      {
        19,
        19,
        5
      }
    }
  },
  [10047] = {
    name = "北俱芦洲西",
    type = 1,
    tomap = 310,
    pos = {
      309,
      6,
      6
    },
    toPos = {
      {
        5,
        19,
        5
      }
    }
  },
  [10048] = {
    name = "北俱芦洲北",
    type = 1,
    tomap = 311,
    pos = {
      310,
      42,
      22
    },
    toPos = {
      {
        7,
        5,
        5
      }
    }
  },
  [10049] = {
    name = "北俱芦洲东",
    type = 1,
    tomap = 308,
    pos = {
      311,
      40,
      33
    },
    toPos = {
      {
        36,
        27,
        7
      }
    }
  }
}
data_MapNormalTeleporter = {
  [1] = {10016, 10017},
  [2] = {10003, 10044},
  [3] = {10006, 10007},
  [4] = {
    10004,
    10005,
    10015
  },
  [5] = {10014, 10027},
  [6] = {10026},
  [7] = {10008, 10009},
  [9] = {
    10010,
    10013,
    10037
  },
  [10] = {10020},
  [11] = {10025},
  [12] = {10018, 10019},
  [13] = {10022},
  [301] = {10028, 10029},
  [302] = {10031},
  [303] = {10033},
  [304] = {10035},
  [305] = {10038, 10039},
  [306] = {10040, 10041},
  [307] = {10042, 10043},
  [308] = {10045, 10046},
  [309] = {10047},
  [310] = {10048},
  [311] = {10049}
}
