data_HuodongOpenType = {
  [1] = {
    Name = "科举乡试",
    sName = "科举\n乡试",
    Desc = "#<r:255,g:245,b:121>活动时间:##<W>每天10:00-18:45\n##<r:255,g:245,b:121>任务形式##<W>:单人\n##<r:255,g:245,b:121>等级要求:##<W>35级\n##<r:255,g:245,b:121>活动描述:##<W>唐王开科取士选拔人才的日子,在长安城科举官员处参加乡试。\n##<r:255,g:245,b:121>活动奖励:##<W>经验、铜钱#"
  },
  [2] = {
    Name = "抓鬼节节高",
    sName = "抓鬼\n节节高",
    Desc = "#<r:255,g:245,b:121>活动时间:##<W>周二、周四、周六、周日17:00-18:00、20:00-21:00\n##<r:255,g:245,b:121>任务形式##<W>:组队\n##<r:255,g:245,b:121>等级要求:##<W>25级\n##<r:255,g:245,b:121>活动描述:##<W>活动时间内,抓鬼、鬼王任务基础收益+25%。\n##<r:255,g:245,b:122>活动奖励:##<W>经验#"
  },
  [3] = {
    Name = "天庭节节高",
    sName = "天庭\n节节高",
    Desc = "#<r:255,g:245,b:121>活动时间:##<W>周一、周三、周五17:00-18:00、20:00-21:00\n##<r:255,g:245,b:121>任务形式##<W>:组队\n##<r:255,g:245,b:121>等级要求:##<W>60级\n##<r:255,g:245,b:121>活动描述:##<W>活动时间内,天庭任务基础收益+25%。\n##<r:255,g:245,b:122>活动奖励:##<W>经验#"
  },
  [4] = {
    Name = "通天幻境",
    sName = "通天\n幻境",
    Desc = "#<r:255,g:245,b:121>活动时间:##<W>每日11:00-23:00\n##<r:255,g:245,b:121>任务形式##<W>:组队\n##<r:255,g:245,b:121>等级要求:##<W>70级\n##<r:255,g:245,b:121>活动描述:##<W>活动时间内在长安城皇城守将处发起通天幻境挑战,消灭幻境塔里的妖怪。\n##<r:255,g:245,b:122>活动奖励:##<W>经验、铜钱、解封石、召唤兽技能书、成长丹等#"
  },
  [5] = {
    Name = "帮战",
    sName = "帮战",
    Desc = "#<r:255,g:245,b:121>活动时间:##<W>周二、周五20:50-22:00\n##<r:255,g:245,b:121>任务形式##<W>:组队\n##<r:255,g:245,b:121>等级要求:##<W>30级\n##<r:255,g:245,b:121>活动描述:##<W>报名成功的8个帮派的非学徒成员均可以参加帮战。\n##<r:255,g:245,b:125>活动奖励:##<W>铜钱、银币、帮派建设度、帮派贡献、帮派成就#"
  },
  [6] = {
    Name = "擂台争霸",
    sName = "擂台\n争霸",
    Desc = "#<r:255,g:245,b:121>活动时间:##<W>周一、周四21:00-21:30\n##<r:255,g:245,b:121>任务形式##<W>:单人\n##<r:255,g:245,b:121>等级要求:##<W>60级\n##<r:255,g:245,b:121>活动描述:##<W>单人的PK活动,看看谁才是擂台霸主。\n##<r:255,g:245,b:126>活动奖励:##<W>荣誉、金柳露、灵珠#"
  },
  [7] = {
    Name = "天兵神将",
    sName = "天兵\n神将",
    Desc = "#<r:255,g:245,b:121>活动时间:##<W>周一、周三19:30-21:30\n##<r:255,g:245,b:121>任务形式##<W>:组队\n##<r:255,g:245,b:121>等级要求:##<W>30级\n##<r:255,g:245,b:121>活动描述:##<W>活动时间可去袁天罡处报名参加活动。依次到达指定的地方挑战各位仙将,胜利者将会获得仙人嘉奖。\n##<r:255,g:245,b:125>活动奖励:##<W>强化符、宝石#"
  },
  [8] = {
    Name = "一战到底",
    sName = "一战\n到底",
    Desc = "#<r:255,g:245,b:121>活动时间:##<W>周三、周六20:40-22:00\n##<r:255,g:245,b:121>任务形式##<W>:3人队伍\n##<r:255,g:245,b:121>等级要求:##<W>65级\n##<r:255,g:245,b:121>活动描述:##<W>组成你的铁三角队伍,看看哪队才能一战到底?\n##<r:255,g:245,b:126>活动奖励:##<W>荣誉、宝图残卷#"
  },
  [9] = {
    Name = "血战沙场",
    sName = "血战\n沙场",
    Desc = "#<r:255,g:245,b:121>活动时间:##<W>周日20:55-22:00\n##<r:255,g:245,b:121>任务形式##<W>:5人队伍\n##<r:255,g:245,b:121>等级要求:##<W>65级\n##<r:255,g:245,b:121>活动描述:##<W>组成5人团队,挑战最高积分\n##<r:255,g:245,b:126>活动奖励:##<W>荣誉、铜钱、人参果王、宝图残卷#"
  },
  [10] = {
    Name = "天降宝箱",
    sName = "天降\n宝箱",
    Desc = "#<r:255,g:245,b:121>活动时间:##<W>周日19:30-20:30\n##<r:255,g:245,b:121>任务形式##<W>:不限\n##<r:255,g:245,b:121>等级要求:##<W>40级\n##<r:255,g:245,b:121>活动描述:##<W>收集宝箱碎片,开启黄金宝箱,战胜贪婪的妖怪,获取宝物\n##<r:255,g:245,b:126>活动奖励:##<W>银宝箱等宝物#"
  },
  [11] = {
    Name = "天地奇书",
    sName = "天地\n奇书",
    Desc = "#<r:255,g:245,b:121>活动时间:##<W>周六19:30-20:40\n##<r:255,g:245,b:121>任务形式##<W>:3人队伍\n##<r:255,g:245,b:121>等级要求:##<W>80级(服务器等级≥85级)\n##<r:255,g:245,b:121>活动描述:##<W>挑战天地奇书,获取终极技能残卷\n##<r:255,g:245,b:126>活动奖励:##<W>终极技能残卷、太虚丹、成长丹、金骰子、3倍召唤兽经验#"
  },
  [12] = {
    Name = "师徒游长安",
    sName = "师徒\n长安",
    Desc = "#<r:255,g:245,b:121>活动时间:##<W>周二、四、五19:30-20:00\n##<r:255,g:245,b:121>任务形式##<W>:组队\n##<r:255,g:245,b:121>等级要求:##<W>60级\n##<r:255,g:245,b:121>活动描述:##<W>去长安城寻找唐僧一行人，击败他们可以活动丰厚经验道具\n##<r:255,g:245,b:126>活动奖励:##<W>技能残卷、高级神兽丹、超级亲密丹、达叔的电影票套餐#"
  }
}
