data_NpcFightTalk = {
  [10001] = {
    [2] = {
      {
        tType = 1,
        talk = "吼！吼！"
      }
    }
  },
  [10002] = {
    [1] = {
      {
        tType = 5,
        talk = "只有将我打败，才能得到我的认可。"
      }
    }
  },
  [10003] = {
    [1] = {
      {
        tType = 1,
        talk = "小心我老大将你打成小白。"
      }
    }
  },
  [10004] = {
    [1] = {
      {
        tType = 5,
        talk = "哪来的小贼，想偷我的灵草！"
      }
    },
    [2] = {
      {
        tType = 1,
        talk = "想要灵草，除非能战胜我！"
      }
    }
  },
  [10005] = {
    [1] = {
      {
        tType = 1,
        talk = "#<E:12>#受死吧！"
      }
    }
  },
  [10006] = {
    [1] = {
      {
        tType = 1,
        talk = "跟着哥干，保管你吃香的、喝辣的。"
      }
    },
    ["magic"] = {
      {
        times = 1,
        talk = "买卖来了，大家一起齐心协力奔小康。"
      }
    }
  },
  [10007] = {
    [1] = {
      {
        tType = 5,
        talk = "一个个都是废物，居然能让敌人打上门来。"
      }
    },
    ["attack"] = {
      {
        times = 1,
        talk = "#<E:12>#受死吧。"
      }
    }
  },
  [10008] = {
    [1] = {
      {
        tType = 1,
        talk = "胆子不小嘛，居然敢闯知府府邸。"
      }
    },
    ["attack"] = {
      {
        times = 1,
        talk = "#<E:12>#让你尝尝本大爷的厉害。"
      }
    }
  },
  [10009] = {
    [1] = {
      {
        tType = 1,
        talk = "阿弥陀佛，老衲以慈悲之心，度万民百疾。"
      }
    },
    ["magic"] = {
      {
        times = 1,
        talk = "#<E:12>#让你尝尝本妖的厉害。"
      }
    }
  },
  [10010] = {
    [1] = {
      {
        tType = 5,
        talk = "天堂有路你不走，地狱无门你偏要来。"
      }
    },
    ["magic"] = {
      {
        times = 1,
        talk = "#<E:12>#受死吧！"
      }
    }
  },
  [10011] = {
    [1] = {
      {
        tType = 1,
        talk = "迷路的人呀，就让我来带你走出这片树林吧！"
      }
    }
  },
  [10012] = {
    attack = {
      {
        times = 1,
        talk = "为什么，为什么，为什么！"
      }
    },
    magic = {
      {
        times = 1,
        talk = "去死吧！"
      }
    }
  },
  [10013] = {
    [1] = {
      {
        tType = 1,
        talk = "加油，弟兄们！阵法马上就要完成了。"
      }
    },
    ["attack"] = {
      {
        times = 1,
        talk = "#<E:40>#你是阻止不了我们的。"
      }
    }
  },
  [10014] = {
    attack = {
      {
        times = 1,
        talk = "#<E:12>#受俺老猪一记。"
      }
    }
  },
  [10015] = {
    [1] = {
      {
        tType = 1,
        talk = "若不想受那皮肉之苦，就乖乖地让我捆了你。"
      }
    },
    [2] = {
      {
        tType = 1,
        talk = "你就死了这条心，我是不会告诉你唐僧的下落的。"
      }
    }
  },
  [10016] = {
    [1] = {
      {
        tType = 5,
        talk = "了前尘旧梦，断前因后果"
      }
    },
    [2] = {
      {
        tType = 1,
        talk = "来了就别走了，留在此地陪我吧。"
      }
    }
  },
  [10017] = {
    [1] = {
      {
        tType = 5,
        talk = "此乃地府重地，何人敢擅自闯入。"
      }
    },
    ["attack"] = {
      {
        times = 1,
        talk = "即来地府，就为阴灵，老老实实在此地呆着吧。"
      }
    }
  },
  [10018] = {
    [1] = {
      {
        tType = 1,
        talk = "小的们，布阵！助本将擒拿此人。"
      }
    },
    ["magic"] = {
      {
        times = 1,
        talk = "老虎不发威，你当我是病猫"
      }
    }
  },
  [10019] = {
    [1] = {
      {
        tType = 5,
        talk = "此乃龙宫禁地，擅闯此地者斩！"
      }
    },
    ["attack"] = {
      {
        times = 1,
        talk = "#<E:12>#受死吧。"
      }
    }
  },
  [10020] = {
    magic = {
      {
        times = 2,
        talk = "#<E:12>#受我一击。"
      }
    }
  },
  [10021] = {
    [1] = {
      {
        tType = 5,
        talk = "闯我青云洞，打扰我修炼，受死吧！"
      }
    }
  },
  [10022] = {
    [1] = {
      {
        tType = 1,
        talk = "哼，杀了我兄弟，还想跑？"
      }
    },
    ["magic"] = {
      {
        times = 1,
        talk = "#<E:12>#受死吧。"
      }
    }
  },
  [10023] = {
    [1] = {
      {
        tType = 5,
        talk = "吾乃真火之灵，只要贡献你的灵魂，汝将受到吾的保护。"
      }
    }
  },
  [10024] = {
    [1] = {
      {
        tType = 5,
        talk = "儿郎们，上！"
      }
    },
    [2] = {
      {
        tType = 1,
        talk = "你是猴子派来的救兵吗？"
      }
    },
    ["magic"] = {
      {
        times = 1,
        talk = "让你尝尝我的三味真火。"
      }
    }
  },
  [10025] = {
    [1] = {
      {
        tType = 5,
        talk = "敢惹我们长生教，让你尝尝我的厉害。"
      }
    },
    ["attack"] = {
      {
        times = 1,
        talk = "#<E:12>#受死吧。"
      }
    },
    ["magic"] = {
      {
        times = 1,
        talk = "你会后悔与我们为敌。"
      }
    }
  },
  [10026] = {
    [1] = {
      {
        tType = 5,
        talk = "长生长生，德配天地；威镇寰宇，古今长生；"
      }
    }
  },
  [10027] = {
    attack = {
      {
        times = 1,
        talk = "吼！吼！"
      },
      {
        times = 1,
        talk = "我要将你撕碎！"
      },
      {
        times = 1,
        talk = "接我一掌。"
      }
    }
  },
  [10028] = {
    [1] = {
      {
        tType = 5,
        talk = "伙计们，这里有活人。"
      }
    },
    ["attack"] = {
      {
        times = 1,
        talk = "刚好抓了你打打牙祭"
      }
    },
    ["magic"] = {
      {
        times = 1,
        talk = "吃我一雷！"
      }
    }
  },
  [10029] = {
    magic = {
      {
        times = 1,
        talk = "尝尝我的厉害吧！"
      }
    }
  },
  [10030] = {
    [1] = {
      {
        tType = 1,
        talk = "美不美看大腿，没有大腿看鱼尾。"
      },
      {
        tType = 1,
        talk = "姐妹们，可别和我争。"
      },
      {
        tType = 1,
        talk = "嘻嘻，可别乱喝子母河河中之水哟！"
      }
    }
  },
  [10031] = {
    [1] = {
      {
        tType = 5,
        talk = "天下熙熙皆为利来，天下攘攘皆为利往。"
      }
    },
    ["attack"] = {
      {
        times = 1,
        talk = "你扰人发财，应遭天谴。"
      }
    },
    ["magic"] = {
      {
        times = 1,
        talk = "#<E:12>#受死吧。"
      }
    }
  },
  [10032] = {
    [1] = {
      {
        tType = 5,
        talk = "我家女王看上那个和尚是他的福气。"
      }
    },
    [2] = {
      {
        tType = 1,
        talk = "我是不会让你过去的。"
      }
    }
  },
  [10033] = {
    [1] = {
      {
        tType = 5,
        talk = "嘿嘿，早起的鸟儿有肉吃。"
      }
    },
    ["attack"] = {
      {
        times = 1,
        talk = "我是不会让嘴边的肉飞走的，看招！"
      }
    }
  },
  [10034] = {
    [1] = {
      {
        tType = 5,
        talk = "大家醒目点,刚收到消息说有人趁机逃跑."
      }
    },
    [2] = {
      {
        tType = 1,
        talk = "看你两条腿能不能跑赢我四条腿快。"
      }
    },
    [3] = {
      {
        tType = 1,
        talk = "#<E:12>#受我一击。"
      }
    }
  },
  [10035] = {
    [1] = {
      {
        tType = 1,
        talk = "一个个都细皮嫩肉的，正好抓来下火锅。"
      }
    },
    [2] = {
      {
        tType = 1,
        talk = "吃我一耙！"
      }
    }
  },
  [10036] = {
    [1] = {
      {
        tType = 5,
        talk = "臭死了，臭死了！"
      }
    },
    [2] = {
      {
        tType = 1,
        talk = "居然比我们妖怪还臭，真是恬不知耻。"
      }
    }
  },
  [10037] = {
    [1] = {
      {
        tType = 5,
        talk = "凡是有文殊庙出现的地方都要砸掉。"
      }
    },
    [2] = {
      {
        tType = 1,
        talk = "#<E:12>#给我砸，狠狠的砸！"
      }
    }
  },
  [10038] = {
    [1] = {
      {
        tType = 5,
        talk = "恶贼，还我夫君的命来！"
      }
    }
  },
  [10039] = {
    [1] = {
      {
        tType = 5,
        talk = "众天兵听令，将此恶贼围住。"
      }
    }
  },
  [10040] = {
    [1] = {
      {tType = 1, talk = "得令。"}
    }
  },
  [10041] = {
    [1] = {
      {
        tType = 5,
        talk = "众弟子听令，列阵！"
      }
    }
  },
  [10042] = {
    [1] = {
      {
        tType = 1,
        talk = "阿弥陀佛。"
      }
    }
  },
  [19991] = {
    [1] = {
      {
        tType = 1,
        talk = "姑娘长的如此美丽，死了怪可惜的，不如随我回去做我老婆吧！"
      },
      {
        tType = 1,
        talk = "升级了，你们就打不死我#<E:5>#!"
      }
    },
    ["attack"] = {
      {
        times = 1,
        talk = "吃俺老熊一爪！"
      },
      {
        times = 1,
        talk = "你们真是一天不打，上房揭瓦#<E:12>#"
      }
    },
    ["callup"] = {
      {
        times = 2,
        talk = "你们成功惹怒了本王，受死吧！"
      }
    }
  },
  [19992] = {
    [1] = {
      {
        tType = 1,
        talk = "在我的地盘得听我的。"
      },
      {
        tType = 1,
        talk = "蓝色的天空，这还不是拜我所赐。"
      }
    },
    ["attack"] = {
      {
        times = 1,
        talk = "我另外兼职摸骨算命，来，让我摸你一下。"
      },
      {
        times = 1,
        talk = "骨头硬好不好我不知道，我只知道命硬才是真好。"
      }
    },
    ["magic"] = {
      {
        times = 1,
        talk = "倒地吧！"
      },
      {
        times = 1,
        talk = "尝尝本王的万年毒术。"
      }
    },
    ["callup"] = {
      {
        times = 2,
        talk = "一,二,三，出来。"
      }
    }
  },
  [19993] = {
    [1] = {
      {
        tType = 1,
        talk = "我被这天上该死的神仙封印了一万年！"
      },
      {
        tType = 1,
        talk = "混乱之源皆由心生。"
      }
    },
    ["attack"] = {
      {
        times = 1,
        talk = "不将你打趴下，你是不知道服字怎么写。"
      },
      {
        times = 1,
        talk = "只有杀戮，才能安抚我心中的愤怒。"
      }
    },
    ["magic"] = {
      {
        times = 1,
        talk = "尝尝混乱的滋味吧#<E:40>#"
      },
      {
        times = 1,
        talk = "杀，杀，杀.....杀尽天下所有生灵。"
      }
    },
    ["callup"] = {
      {
        times = 2,
        talk = "孩儿们，听吾口令，解。"
      }
    }
  },
  [19994] = {
    [1] = {
      {
        tType = 1,
        talk = "天堂有路你不走，地狱无门你偏要来。"
      },
      {
        tType = 1,
        talk = "吾要用鲜血将大地染红#<E:12>#"
      }
    },
    ["attack"] = {
      {
        times = 1,
        talk = "颤抖吧！凡人。"
      },
      {
        times = 1,
        talk = "一群蝼蚁也敢在本王面前嚣张。"
      }
    },
    ["magic"] = {
      {
        times = 1,
        talk = "不给点厉害的让你们瞧瞧，你们就不知道花儿为什么这样红。"
      },
      {
        times = 1,
        talk = "燃烧吧！"
      }
    },
    ["callup"] = {
      {
        times = 2,
        talk = "杀鸡且用牛刀，小的们，给我上。"
      }
    }
  },
  [10043] = {
    [1] = {
      {
        tType = 5,
        talk = "敢打扰小爷喝花酒，我看你是不想活了。"
      }
    },
    ["magic"] = {
      {
        times = 1,
        talk = "给点颜色让你瞧瞧。"
      }
    }
  },
  [10044] = {
    [1] = {
      {
        tType = 5,
        talk = "想要乌草，得掂量掂量自己有没有这个本事。"
      }
    },
    ["attack"] = {
      {
        times = 1,
        talk = "#<E:12>#受我一击。"
      }
    }
  },
  [10045] = {
    [1] = {
      {
        tType = 5,
        talk = "居然被你们发现了。"
      }
    },
    ["attack"] = {
      {
        times = 1,
        talk = "此地的情况已被我摸清楚，就不同你墨迹了，看招！"
      }
    }
  },
  [10046] = {
    [1] = {
      {
        tType = 5,
        talk = "要不是为了调查此地状况，我才不会来这穷山沟呢。"
      },
      {
        tType = 1,
        talk = "你居然敢打我，你知不知道我一身值多少钱？#<E:12>#"
      }
    }
  },
  [10047] = {
    [1] = {
      {
        tType = 5,
        talk = "大王叫我来巡山。"
      }
    },
    ["magic"] = {
      {
        times = 1,
        talk = "#<E:40>#杀了你，魔罗大人就能升我为巡逻队长。"
      }
    }
  },
  [10048] = {
    [1] = {
      {
        tType = 5,
        talk = "我们最喜欢拿着宝物到处炫耀的豪了。"
      }
    },
    ["attack"] = {
      {
        times = 1,
        talk = "#<E:12>#受死吧。"
      }
    }
  },
  [10049] = {
    [1] = {
      {
        tType = 5,
        talk = "哎哟，居然被发现了。"
      }
    },
    ["attack"] = {
      {
        times = 1,
        talk = "#<E:12>#受我一击。"
      },
      {
        times = 1,
        talk = "难得魔罗大人如此看重我，派我探查此地军情，我必定完成任务。"
      }
    }
  },
  [10050] = {
    [1] = {
      {
        tType = 5,
        talk = "哈哈，有人上钩了。"
      }
    },
    ["attack"] = {
      {
        times = 1,
        talk = "吾为刀俎尔为鱼肉，是生吃？还是油炸？好难选呀！"
      }
    },
    ["magic"] = {
      {
        times = 1,
        talk = "#<E:12>#水来！"
      }
    }
  },
  [10051] = {
    [1] = {
      {
        tType = 5,
        talk = "见义勇为是好事，自不量力会坏事。"
      }
    },
    ["attack"] = {
      {
        times = 1,
        talk = "无天魔罗兵临三界是迟早的事情..."
      }
    }
  },
  [10052] = {
    [1] = {
      {
        tType = 1,
        talk = "此地并没有我需要的消息，走!"
      }
    },
    ["attack"] = {
      {
        times = 1,
        talk = "阻我去路，死吧！"
      }
    },
    ["magic"] = {
      {
        times = 1,
        talk = "让你尝尝我的厉害！"
      }
    }
  },
  [10053] = {
    escape = {
      {
        times = 1,
        talk = "风紧,扯呼。"
      }
    }
  },
  [10054] = {
    escape = {
      {
        times = 1,
        talk = "点子扎手，我先撤了。"
      }
    }
  },
  [10055] = {
    escape = {
      {
        times = 1,
        talk = "等我吃饱肚子再与你大战三百回合。"
      }
    }
  },
  [10056] = {
    escape = {
      {
        times = 1,
        talk = "三十六计走为上计。"
      }
    }
  },
  [10057] = {
    escape = {
      {
        times = 1,
        talk = "世界那么大，我还没有活够。"
      }
    }
  },
  [10058] = {
    escape = {
      {
        times = 1,
        talk = "够厉害，有胆在这里等我。"
      }
    }
  },
  [10059] = {
    magic = {
      {
        times = 1,
        talk = "我有魔罗赐予的法宝，你是杀不死我的。"
      }
    }
  },
  [10060] = {
    callup = {
      {
        times = -1,
        talk = "先古之灵，出来倾听我的《离骚》吧！"
      }
    },
    attack = {
      {
        times = -1,
        talk = "日月忽其不淹兮，春与秋其代序"
      },
      {
        times = -1,
        talk = "惟草木之零落兮，恐美人之迟暮"
      },
      {
        times = -1,
        talk = "不抚壮而弃秽兮，何不改乎此度？"
      },
      {
        times = -1,
        talk = "乘骐骥以驰骋兮，来吾道夫先路！"
      },
      {
        times = -1,
        talk = "昔三后之纯粹兮，固众芳之所在"
      },
      {
        times = -1,
        talk = "彼尧、舜之耿介兮，既遵道而得路"
      },
      {
        times = -1,
        talk = "何桀纣之猖披兮，夫惟捷径以窘步"
      }
    },
    magic = {
      {
        times = -1,
        talk = "初既与余成言兮，后悔遁而有他"
      },
      {
        times = -1,
        talk = "曰黄昏以为期兮，羌中道而改路！"
      },
      {
        times = -1,
        talk = "指九天以为正兮，夫惟灵修之故也。"
      },
      {
        times = -1,
        talk = "余固知謇謇之为患兮，忍而不能舍也。"
      },
      {
        times = -1,
        talk = "世并举而好朋兮，夫何茕独而不予听？"
      },
      {
        times = -1,
        talk = "依前圣以节中兮，喟凭心而历兹。"
      }
    }
  },
  [10061] = {
    escapeC = {
      {
        times = -1,
        talk = "呃!我感觉很难受!我先撤了#<E:26>#"
      },
      {
        times = -1,
        talk = "敌人太强了！我先撤了#<E:26>#"
      },
      {
        times = -1,
        talk = "我的膝盖中箭了！我先撤了#<E:26>#"
      },
      {
        times = -1,
        talk = "再不逃就来不及了！我先撤了#<E:26>#"
      },
      {
        times = -1,
        talk = "妈妈喊我回家！我先撤了#<E:26>#"
      }
    }
  },
  [10062] = {
    [1] = {
      {
        tType = 5,
        talk = "你就是我，我就是你！#<E：12>#"
      },
      {
        tType = 1,
        talk = "尝尝心魔侵噬的滋味吧！#<E：12>#"
      }
    }
  },
  [90001] = {
    "尝尝爆裂的滋味吧！#<E：12>#"
  },
  [90002] = {
    "魔族虐我千百遍，俺待魔族如初恋"
  },
  [90004] = {
    "出来混要讲义气，没我同意谁能杀死他们"
  },
  [90005] = {
    "看我的治愈"
  },
  [90006] = {
    "有本事就正大光明打一场，使用毒术算什么英雄"
  },
  [90007] = {
    "敌人太强了！我先撤了#<E:26>#"
  },
  [90008] = {
    "怪物特性技能8对话内容"
  },
  [90009] = {
    "小伙伴都不见了，我闪。"
  },
  [90010] = {
    "尝尝吾的狂暴之力！#<E:12>#"
  },
  [90011] = {
    "看我的厉害"
  },
  [90012] = {
    "不把场上小怪清掉，就别想杀死我。"
  },
  [90013] = {
    "我的力量源自头目，不杀死它就别想杀死我#<E:28>#"
  },
  [10063] = {
    magic = {
      {
        times = -1,
        talk = "一念三生，罡风护真"
      }
    }
  },
  [10064] = {
    magic = {
      {
        times = -1,
        talk = "焚火将至，万火聚身，印"
      }
    }
  },
  [10065] = {
    magic = {
      {
        times = -1,
        talk = "吾乃雷罡之灵，雷系法术是伤不了我的#<E:5>#!"
      }
    }
  },
  [10066] = {
    magic = {
      {
        times = -1,
        talk = "千万别用水系法术打我，不然你会后悔的"
      }
    }
  },
  [10067] = {
    [1] = {
      {
        tType = 5,
        talk = "敏魔虐我千百遍，俺待敏魔族如初恋"
      }
    }
  },
  [10068] = {
    [1] = {
      {
        tType = 5,
        talk = "要是队伍里面有人族，我就会溜"
      }
    }
  },
  [10069] = {
    [1] = {
      {
        tType = 5,
        talk = "莫要使用什么劳子毒术，明刀明枪才是英雄"
      }
    }
  },
  [10070] = {
    [1] = {
      {
        tType = 5,
        talk = "打扰吾的沉睡，接受吾的怒火吧#<E:12>#"
      }
    },
    [4] = {
      {
        tType = 1,
        talk = "吼！吼！这里是我的地盘。"
      }
    },
    [5] = {
      {
        tType = 1,
        talk = "#<E:12>#受死吧。"
      }
    }
  },
  [10071] = {
    [1] = {
      {
        tType = 5,
        talk = "请大家守护我10回合，天蓬元帅很快就会前来支援了。"
      }
    },
    [-1] = {
      {
        tType = 1,
        talk = "无天魔罗的走狗！休想夺得不死仙丹！#<E:30>#"
      },
      {
        tType = 1,
        talk = "大家一定要坚持住，绝对不能让邪魔获得不死仙丹#<E:12>#"
      },
      {
        tType = 1,
        talk = "一定要坚持10回合，天蓬元帅很快就会前来支援了。"
      }
    }
  },
  [10072] = {
    [10] = {
      {
        tType = 5,
        talk = "嫦娥妹妹，我来救你了！#<E:30>#"
      }
    },
    [-1] = {
      {
        tType = 1,
        talk = "邪魔外道，居然敢伤害我的嫦娥妹妹，受死吧！#<E:12>#"
      },
      {
        tType = 1,
        talk = "邪魔受死，受老猪一耙子！"
      }
    }
  },
  [10073] = {
    [1] = {
      {
        tType = 5,
        talk = "嫦娥仙子赶快交出不死仙丹！#<E:30>#"
      }
    },
    [10] = {
      {
        tType = 5,
        talk = "怎么连这只猪也来了，不好了……"
      }
    },
    [-1] = {
      {
        tType = 1,
        talk = "嫦娥仙子，赶快交出不死仙丹！可免受皮肉之苦！！#<E:23>#"
      },
      {
        tType = 1,
        talk = "没人可以阻止魔罗大人征服三界！"
      }
    }
  }
}
