data_MapLoadingTips = {
  [1] = {
    zs = 0,
    lv = 30,
    zsmax = 0,
    lvmax = 100,
    tips = "#<K,>比武场#中战胜排名比你高的对手后将会取代他的排名。",
    week = 0,
    time = 0
  },
  [2] = {
    zs = 0,
    lv = 30,
    zsmax = 3,
    lvmax = 180,
    tips = "#<K,>比武场#里获得的#<K,>荣誉点#可以在#<K,>荣誉商店#购买物品。",
    week = 0,
    time = 0
  },
  [3] = {
    zs = 0,
    lv = 30,
    zsmax = 3,
    lvmax = 180,
    tips = "每天早上都会根据昨天的比武总排行榜的排名奖励荣誉、铜钱。",
    week = 0,
    time = 0
  },
  [4] = {
    zs = 0,
    lv = 22,
    zsmax = 3,
    lvmax = 180,
    tips = "每日完成#<G,>20#环#<K,>师门任务#可以获得丰富的经验、铜钱奖励。",
    week = 0,
    time = 0
  },
  [5] = {
    zs = 0,
    lv = 22,
    zsmax = 3,
    lvmax = 180,
    tips = "#<K,>师门任务#是当天有效的，接受了师门任务后别忘了去完成。",
    week = 0,
    time = 0
  },
  [6] = {
    zs = 0,
    lv = 25,
    zsmax = 3,
    lvmax = 180,
    tips = "今天#<G,>17:00-18:00，20:00-21:00#抓鬼节节高活动时间内，抓鬼、鬼王任务基础收益#<G,>+25%#。",
    week = {
      2,
      4,
      6,
      7
    },
    time = {9, 21}
  },
  [7] = {
    zs = 0,
    lv = 60,
    zsmax = 3,
    lvmax = 180,
    tips = "今天#<G,>17:00-18:00，20:00-21:00#天庭节节高活动时间内，天庭任务基础收益#<G,>+25%#。",
    week = {
      1,
      3,
      5
    },
    time = {9, 21}
  },
  [8] = {
    zs = 0,
    lv = 15,
    zsmax = 3,
    lvmax = 180,
    tips = "#<K,>月卡#的时间是#<K,>可以叠加#的,每购买一张#<K,>月卡#将可以获得连续30天每天领取#<G,>300000元宝#和3个奖券的奖励。",
    week = 0,
    time = 0
  },
  [9] = {
    zs = 0,
    lv = 90,
    zsmax = 0,
    lvmax = 102,
    tips = "#<K,>主角#可以在#<G,>102级#的时候在#<K,>孟婆#处接到转生任务（1转）。",
    week = 0,
    time = 0
  },
  [10] = {
    zs = 1,
    lv = 102,
    zsmax = 1,
    lvmax = 122,
    tips = "#<K,>主角#可以在#<G,>122级#的时候在#<K,>孟婆#处接到转生任务（2转）。",
    week = 0,
    time = 0
  },
  [11] = {
    zs = 2,
    lv = 122,
    zsmax = 2,
    lvmax = 142,
    tips = "#<K,>主角#可以在#<G,>142级#的时候在#<K,>孟婆#处接到转生任务（3转）。",
    week = 0,
    time = 0
  },
  [12] = {
    zs = 0,
    lv = 95,
    zsmax = 3,
    lvmax = 180,
    tips = "#<K,>伙伴#的转生是跟随主角转生而自动转生的。",
    week = 0,
    time = 0
  },
  [13] = {
    zs = 0,
    lv = 95,
    zsmax = 3,
    lvmax = 180,
    tips = "#<K,>主角#完成转生后，装备会自动转换成新种族可以穿戴的装备。",
    week = 0,
    time = 0
  },
  [14] = {
    zs = 0,
    lv = 95,
    zsmax = 3,
    lvmax = 180,
    tips = "#<K,>主角和伙伴#每次转生后会增加额外的#<G,>40点#可分配的属性点。",
    week = 0,
    time = 0
  },
  [15] = {
    zs = 0,
    lv = 95,
    zsmax = 3,
    lvmax = 180,
    tips = "#<K,>召唤兽#每次转生后会增加额外的#<G,>30点#可分配的属性点。",
    week = 0,
    time = 0
  },
  [16] = {
    zs = 0,
    lv = 90,
    zsmax = 0,
    lvmax = 102,
    tips = "#<K,>召唤兽#可以在#<G,>100级#的时候在#<K,>灵兽仙#处进行转生（1转）。",
    week = 0,
    time = 0
  },
  [17] = {
    zs = 1,
    lv = 102,
    zsmax = 1,
    lvmax = 122,
    tips = "#<K,>召唤兽#可以在#<G,>120级#的时候在#<K,>灵兽仙#处进行转生（2转）。",
    week = 0,
    time = 0
  },
  [18] = {
    zs = 2,
    lv = 122,
    zsmax = 2,
    lvmax = 142,
    tips = "#<K,>召唤兽#可以在#<G,>140级#的时候在#<K,>灵兽仙#处进行转生（3转）。",
    week = 0,
    time = 0
  },
  [19] = {
    zs = 0,
    lv = 95,
    zsmax = 3,
    lvmax = 180,
    tips = "#<K,>召唤兽的魂石#在召唤兽转生之后也可以手动进行转生，提升其潜力上限。",
    week = 0,
    time = 0
  },
  [20] = {
    zs = 0,
    lv = 95,
    zsmax = 3,
    lvmax = 180,
    tips = "转生之后不仅会有额外的可分配属性点奖励，还会提高转生角色的#<K,>抗性#。",
    week = 0,
    time = 0
  },
  [21] = {
    zs = 0,
    lv = 95,
    zsmax = 1,
    lvmax = 50,
    tips = "转生不仅需要击败强大的转生怪物，还需要大量铜钱，以及主线剧情的称号。",
    week = 0,
    time = 0
  },
  [22] = {
    zs = 0,
    lv = 1,
    zsmax = 3,
    lvmax = 180,
    tips = "在战斗中每使用#<G,>1次#法术提高#<G,>1点#熟练度，法术的能力随着#<K,>法术熟练度#和人物等级的提高而变强。 ",
    week = 0,
    time = 0
  },
  [23] = {
    zs = 0,
    lv = 15,
    zsmax = 0,
    lvmax = 50,
    tips = "#<G,>20级#后开启手动升级#<K,>法术熟练度#。",
    week = 0,
    time = 0
  },
  [24] = {
    zs = 0,
    lv = 5,
    zsmax = 0,
    lvmax = 90,
    tips = "人族的#<K,>控制法术#在挑战强大敌人的过程中不可或缺的。",
    week = 0,
    time = 0
  },
  [25] = {
    zs = 0,
    lv = 1,
    zsmax = 3,
    lvmax = 180,
    tips = "#<K,>神秘商店#的刷新货物的时间是每天#<G,>9:00、14:00、19:00、22:00#。",
    week = 0,
    time = 0
  },
  [26] = {
    zs = 0,
    lv = 9,
    zsmax = 0,
    lvmax = 50,
    tips = "#<K,>召唤兽#参战后才会随主人一同出战。",
    week = 0,
    time = 0
  },
  [27] = {
    zs = 0,
    lv = 10,
    zsmax = 0,
    lvmax = 75,
    tips = "#<K,>召唤兽的魂石#需要手动提升等级。",
    week = 0,
    time = 0
  },
  [28] = {
    zs = 0,
    lv = 10,
    zsmax = 3,
    lvmax = 180,
    tips = "#<K,>召唤兽#可以通过战斗自行#<K,>领悟技能#以及#<K,>解封#新的技能空格。",
    week = 0,
    time = 0
  },
  [29] = {
    zs = 0,
    lv = 40,
    zsmax = 3,
    lvmax = 180,
    tips = "提高#<K,>召唤兽#的#<K,>亲密度#是提高召唤兽战斗力的重要途径。",
    week = 0,
    time = 0
  },
  [30] = {
    zs = 0,
    lv = 26,
    zsmax = 3,
    lvmax = 180,
    tips = "对#<K,>高级技能数量达到上限#的召唤兽使用#<K,>高级技能书#时，将会有一定概率使得新学到的高级技能#<K,>替换#掉原有普通技能，从而#<K,>获得超出上限#的高级技能。",
    week = 0,
    time = 0
  },
  [31] = {
    zs = 0,
    lv = 26,
    zsmax = 3,
    lvmax = 180,
    tips = "#<K,>普通召唤兽#可以学习#<G,>1个#高级技能，若想要学习#<K,>超出上限#的高级技能，可以尝试使用新的高级技能书#<K,>替换#原有普通技能。",
    week = 0,
    time = 0
  },
  [32] = {
    zs = 0,
    lv = 26,
    zsmax = 3,
    lvmax = 180,
    tips = "#<K,>高级守护#可以学习#<G,>1个#高级技能，若想要学习#<K,>超出上限#的高级技能，可以尝试使用新的高级技能书#<K,>替换#原有普通技能。",
    week = 0,
    time = 0
  },
  [33] = {
    zs = 0,
    lv = 26,
    zsmax = 3,
    lvmax = 180,
    tips = "#<K,>灵兽#可以学习#<G,>2个#高级技能，若想要学习#<K,>超出上限#的高级技能，可以尝试使用新的高级技能书#<K,>替换#原有普通技能。",
    week = 0,
    time = 0
  },
  [34] = {
    zs = 0,
    lv = 26,
    zsmax = 3,
    lvmax = 180,
    tips = "#<K,>神兽#可以学习#<G,>2个#高级技能，若想要学习#<K,>超出上限#的高级技能，可以尝试使用新的高级技能书#<K,>替换#原有普通技能。",
    week = 0,
    time = 0
  },
  [35] = {
    zs = 0,
    lv = 26,
    zsmax = 3,
    lvmax = 180,
    tips = "#<K,>高级技能数量达到上限#后，召唤兽身上携带的高级技能数目越少，使用新的高级技能书#<K,>替换#掉原有普通技能#<K,>获得超出上限#的高级技能的概率越高。",
    week = 0,
    time = 0
  },
  [36] = {
    zs = 0,
    lv = 9,
    zsmax = 3,
    lvmax = 180,
    tips = "#<K,>类型相近#的召唤兽技能是会#<K,>相互产生冲突#的，请合理搭配召唤兽技能。",
    week = 0,
    time = 0
  },
  [37] = {
    zs = 0,
    lv = 5,
    zsmax = 3,
    lvmax = 180,
    tips = "#<K,>装备炼化#时最多可以炼化出#<G,>5个#属性，越高级的装备炼化的价值越大。",
    week = 0,
    time = 0
  },
  [38] = {
    zs = 0,
    lv = 22,
    zsmax = 0,
    lvmax = 75,
    tips = "#<K,>装备#都有#<K,>属性要求#，购买和打造装备前请注意。",
    week = 0,
    time = 0
  },
  [39] = {
    zs = 0,
    lv = 45,
    zsmax = 3,
    lvmax = 180,
    tips = "#<G,>1级高级装备#和#<G,>1级仙器#升级到#<K,>2级#之后，原有的#<K,>炼化#与#<K,>强化#不会消失。",
    week = 0,
    time = 0
  },
  [40] = {
    zs = 0,
    lv = 45,
    zsmax = 3,
    lvmax = 180,
    tips = "#<K,>重铸#装备时不勾选#<K,>保留属性要求#，可以更变装备装备的属性要求类型。",
    week = 0,
    time = 0
  },
  [41] = {
    zs = 0,
    lv = 30,
    zsmax = 3,
    lvmax = 180,
    tips = "#<K,>伙伴的装备#自动升级之后，原有的炼化不会消失。",
    week = 0,
    time = 0
  },
  [42] = {
    zs = 0,
    lv = 15,
    zsmax = 3,
    lvmax = 180,
    tips = "#<K,>伙伴的法术威力#是会根据主角的#<K,>法术熟练度#提升而整体提高的。",
    week = 0,
    time = 0
  },
  [43] = {
    zs = 0,
    lv = 15,
    zsmax = 3,
    lvmax = 180,
    tips = "#<K,>伙伴的装备#是会根据等级提高而自动更换成更高级的装备的。",
    week = 0,
    time = 0
  },
  [44] = {
    zs = 0,
    lv = 15,
    zsmax = 0,
    lvmax = 50,
    tips = "#<K,>伙伴#出战后才会随主角一同出战。",
    week = 0,
    time = 0
  },
  [45] = {
    zs = 0,
    lv = 55,
    zsmax = 3,
    lvmax = 180,
    tips = "#<K,>三界历练##<G,>（300环）#每到周一#<G,>5:00#都会#<K,>自动重置#，接受任务后请及时完成。",
    week = 0,
    time = 0
  },
  [46] = {
    zs = 0,
    lv = 55,
    zsmax = 3,
    lvmax = 180,
    tips = "每周完成#<K,>三界历练##<G,>（300环）#任务可以获得非常丰富的极品道具奖励。",
    week = 0,
    time = 0
  },
  [47] = {
    zs = 0,
    lv = 55,
    zsmax = 3,
    lvmax = 180,
    tips = "协助队长击败#<K,>三界历练##<G,>（300环）#其中每#<G,>50环#遇到的山贼头目均能获得丰富的铜钱奖励。",
    week = 0,
    time = 0
  },
  [48] = {
    zs = 0,
    lv = 1,
    zsmax = 0,
    lvmax = 75,
    tips = "#<K,>主角、召唤兽#升级后默认自动加点，每次升级都会根据设置自动分配点数。",
    week = 0,
    time = 0
  },
  [49] = {
    zs = 0,
    lv = 25,
    zsmax = 0,
    lvmax = 75,
    tips = "#<G,>40级#后主角开放手动配点，每个职业的加点方式会有所不同，详细可参考【提升>成长宝典>提升主角>人物配点】。",
    week = 0,
    time = 0
  },
  [50] = {
    zs = 0,
    lv = 35,
    zsmax = 0,
    lvmax = 75,
    tips = "属性点中根骨影响气血、灵性影响法力、力量影响物理攻击力、敏捷影响出手速度。",
    week = 0,
    time = 0
  },
  [51] = {
    zs = 0,
    lv = 20,
    zsmax = 0,
    lvmax = 90,
    tips = "仙族法术的攻击力的高低是根据#<K,>角色等级#和#<K,>技能的熟练度#。与灵性无关，灵性只影响法力值的高低。",
    week = 0,
    time = 0
  },
  [52] = {
    zs = 0,
    lv = 35,
    zsmax = 3,
    lvmax = 180,
    tips = "不同的种族都有各自的属性修正，配合自己的#<K,>种族特长#进行加点可以使得属性点的收益最大化。",
    week = 0,
    time = 0
  },
  [53] = {
    zs = 0,
    lv = 1,
    zsmax = 3,
    lvmax = 180,
    tips = "自动战斗时#<K,>主角#和#<K,>召唤兽#会自动执行设置好的战斗指令。",
    week = 0,
    time = 0
  },
  [54] = {
    zs = 0,
    lv = 5,
    zsmax = 3,
    lvmax = 180,
    tips = "提升等级、提升法术熟练度、强化装备是令你变强的三大途径。",
    week = 0,
    time = 0
  },
  [55] = {
    zs = 0,
    lv = 1,
    zsmax = 0,
    lvmax = 75,
    tips = "打开#<K,>世界地图#点击地点位置可快速传送。",
    week = 0,
    time = 0
  },
  [56] = {
    zs = 0,
    lv = 22,
    zsmax = 0,
    lvmax = 75,
    tips = "#<K,>图标#旁边的#<K,>红点#意味着你最好打开看一看里面有什么东西。",
    week = 0,
    time = 0
  },
  [57] = {
    zs = 0,
    lv = 1,
    zsmax = 0,
    lvmax = 75,
    tips = "点击#<K,>头像#可以看到你的角色信息和系统设置。",
    week = 0,
    time = 0
  },
  [58] = {
    zs = 0,
    lv = 1,
    zsmax = 0,
    lvmax = 90,
    tips = "点击#<K,>聊天频道#旁边的#<K,>齿轮#可以管理屏蔽名单。",
    week = 0,
    time = 0
  },
  [59] = {
    zs = 0,
    lv = 25,
    zsmax = 0,
    lvmax = 90,
    tips = "按住#<K,>聊天频道#旁边的世界、帮派、队伍语音后，可以使用#<K,>语音#进行聊天，省却打字的烦恼。",
    week = 0,
    time = 0
  },
  [60] = {
    zs = 0,
    lv = 5,
    zsmax = 0,
    lvmax = 90,
    tips = "#<K,>新手#有什么不懂的可以按#<K,>提升>成长宝典#，成长宝典有大部分#<K,>新手问题#的答案。",
    week = 0,
    time = 0
  },
  [61] = {
    zs = 0,
    lv = 25,
    zsmax = 0,
    lvmax = 95,
    tips = "队长#<K,>勾选默认允许同意申请队长#选项后，队员按#<K,>申请队长#，系统将会自动把队长转移给队员。",
    week = 0,
    time = 0
  },
  [62] = {
    zs = 0,
    lv = 1,
    zsmax = 0,
    lvmax = 90,
    tips = "点击#<K,>聊天频道#旁边的#<K,>齿轮#可以设置聊天频道。",
    week = 0,
    time = 0
  },
  [63] = {
    zs = 0,
    lv = 1,
    zsmax = 0,
    lvmax = 90,
    tips = "点击#<K,>聊天频道#旁边的#<K,>齿轮#可以设置语音播放。",
    week = 0,
    time = 0
  },
  [64] = {
    zs = 0,
    lv = 25,
    zsmax = 3,
    lvmax = 180,
    tips = "玩家可以在#<K,>世界频道、喇叭频道#点击其他玩家头像，对发表不当言论的玩家进行#<K,>举报或屏蔽#。",
    week = 0,
    time = 0
  },
  [65] = {
    zs = 0,
    lv = 25,
    zsmax = 0,
    lvmax = 90,
    tips = "充足的#<K,>饱食度#可以令你在战斗结束后#<K,>回复#损失的#<K,>血量#和#<K,>法力#。",
    week = 0,
    time = 0
  },
  [66] = {
    zs = 0,
    lv = 25,
    zsmax = 0,
    lvmax = 90,
    tips = "在野外挂机地图的#<K,>挂机#按钮中#<K,>勾选自动补充饱食度#，可以在饱食度不足的时候自动使用铜钱补充饱食度。",
    week = 0,
    time = 0
  },
  [67] = {
    zs = 0,
    lv = 26,
    zsmax = 3,
    lvmax = 180,
    tips = "使用#<K,>烹饪#技能制作的食物比使用铜钱直接恢复饱食度更加经济实惠。",
    week = 0,
    time = 0
  },
  [68] = {
    zs = 0,
    lv = 26,
    zsmax = 3,
    lvmax = 180,
    tips = "使用#<K,>制符#技能制作的符文可以让你的战斗力提升一个台阶。",
    week = 0,
    time = 0
  },
  [69] = {
    zs = 0,
    lv = 60,
    zsmax = 3,
    lvmax = 180,
    tips = "使用#<K,>制符#技能制作的神行符可以让你的移动速度得到极大的提升。",
    week = 0,
    time = 0
  },
  [70] = {
    zs = 0,
    lv = 26,
    zsmax = 3,
    lvmax = 180,
    tips = "使用#<K,>烹饪#技能制作的五行酒可以增加人物的强克属性。",
    week = 0,
    time = 0
  },
  [71] = {
    zs = 0,
    lv = 26,
    zsmax = 3,
    lvmax = 180,
    tips = "使用#<K,>烹饪#技能制作的抗性酒可以让你的生存能力得到提高。",
    week = 0,
    time = 0
  },
  [72] = {
    zs = 0,
    lv = 26,
    zsmax = 3,
    lvmax = 180,
    tips = "使用#<K,>制药#技能制作的药品比使用在系统商店购买的药品更加经济实惠。",
    week = 0,
    time = 0
  },
  [73] = {
    zs = 0,
    lv = 26,
    zsmax = 3,
    lvmax = 180,
    tips = "只有学习了#<K,>捉宠#技能才能够在野外挂机地图捕捉高级守护。",
    week = 0,
    time = 0
  },
  [74] = {
    zs = 0,
    lv = 30,
    zsmax = 0,
    lvmax = 50,
    tips = "#<K,>创建#或#<K,>申请加入#一个帮派可以让你享受到众多帮派福利。",
    week = 0,
    time = 0
  },
  [75] = {
    zs = 0,
    lv = 5,
    zsmax = 0,
    lvmax = 50,
    tips = "#<G,>30级#后可以自己#<K,>创建#或者#<K,>申请加入#一个帮派。",
    week = 0,
    time = 0
  },
  [76] = {
    zs = 0,
    lv = 30,
    zsmax = 3,
    lvmax = 180,
    tips = "每日完成#<K,>帮派跑商#可以让帮派资金快速增加，也会获得丰富的铜钱奖励。",
    week = 0,
    time = 0
  },
  [77] = {
    zs = 0,
    lv = 30,
    zsmax = 3,
    lvmax = 180,
    tips = "只有在#<K,>捐献#了一定的#<K,>帮贡#之后才能让帮派图腾对你产生效果。",
    week = 0,
    time = 0
  },
  [78] = {
    zs = 0,
    lv = 30,
    zsmax = 3,
    lvmax = 180,
    tips = "每日完成#<K,>帮派除奸#或者#<K,>帮派暗战#帮派任务可以获得大量帮派成就点",
    week = 0,
    time = 0
  },
  [79] = {
    zs = 0,
    lv = 30,
    zsmax = 3,
    lvmax = 180,
    tips = "在#<K,>帮派福利#页面可以根据帮派建设度领取帮派成就点。",
    week = 0,
    time = 0
  },
  [80] = {
    zs = 0,
    lv = 30,
    zsmax = 3,
    lvmax = 180,
    tips = "参加#<K,>帮战#可以获得帮派成就点奖励，帮战结束后还能够获得非常不错的银币奖励。",
    week = {2, 5},
    time = {9, 21}
  },
  [81] = {
    zs = 0,
    lv = 21,
    zsmax = 0,
    lvmax = 75,
    tips = "完成#<K,>每日活动#可获得大量的#<K,>铜币#，同时还会获得#<K,>活力#。",
    week = 0,
    time = 0
  },
  [82] = {
    zs = 0,
    lv = 21,
    zsmax = 0,
    lvmax = 75,
    tips = "在#<K,>活动页面>签到#可以获得每日#<K,>登录奖励#。",
    week = 0,
    time = 0
  },
  [83] = {
    zs = 0,
    lv = 35,
    zsmax = 3,
    lvmax = 180,
    tips = "每天的#<G,>10:00-18:45#将会举行#<K,>科举#的乡试与省试，在省试中排名#<G,>前35名#的玩家可以获得参与殿试的资格。",
    week = 0,
    time = {9, 18.5}
  },
  [84] = {
    zs = 0,
    lv = 35,
    zsmax = 0,
    lvmax = 95,
    tips = "在当天的省试中排名#<G,>前35名#的玩家将会获得参与#<K,>殿试#的资格，获得大量经验、铜钱奖励。",
    week = 0,
    time = {9, 18.5}
  },
  [85] = {
    zs = 0,
    lv = 65,
    zsmax = 3,
    lvmax = 180,
    tips = "每天的#<G,>11:00-23:00#将会开启#<K,>通天幻境#，通关通天幻境将会获得丰富的召唤兽道具奖励。",
    week = 0,
    time = {10, 23}
  },
  [86] = {
    zs = 0,
    lv = 30,
    zsmax = 3,
    lvmax = 180,
    tips = "今天#<G,>19:30-21:30#将会开启#<K,>天兵神将#，每击败一位首领将会获得丰富的奖励。",
    week = {1, 3},
    time = {9, 21.5}
  },
  [87] = {
    zs = 0,
    lv = 60,
    zsmax = 3,
    lvmax = 180,
    tips = "今天#<G,>21:00-21:30#将会开启#<K,>擂台争霸#，每击败一位玩家将会获得荣誉奖励。",
    week = {1, 4},
    time = {9, 21.5}
  },
  [88] = {
    zs = 0,
    lv = 30,
    zsmax = 3,
    lvmax = 180,
    tips = "今天#<G,>20:50-22:00#将会开启#<K,>帮战#，请在帮主或副帮主在帮战当天#<G,>18:00#前完成报名。",
    week = {2, 5},
    time = {9, 21}
  },
  [89] = {
    zs = 0,
    lv = 65,
    zsmax = 3,
    lvmax = 180,
    tips = "今天#<G,>20:40-22:00#将会开启#<K,>一战到底#，击败其他对手站到最后的玩家将会获得荣誉和宝图残卷奖励。",
    week = {3, 6},
    time = {9, 21}
  },
  [90] = {
    zs = 0,
    lv = 65,
    zsmax = 3,
    lvmax = 180,
    tips = "今天#<G,>20:55-22:00#将会开启#<K,>血战沙场#，击败其他对手获得更多积分领取经验、荣誉和宝图残卷奖励。",
    week = {7},
    time = {9, 22}
  },
  [91] = {
    zs = 2,
    lv = 123,
    zsmax = 3,
    lvmax = 180,
    tips = "今天#<G,>14:00-24:00#将会开启#<K,>修罗之争#，击败修罗王将会获得大量经验。",
    week = 0,
    time = {13, 24}
  },
  [92] = {
    zs = 0,
    lv = 40,
    zsmax = 3,
    lvmax = 180,
    tips = "今天#<G,>19:30-20:30#将会开启#<K,>天降宝箱#，开启宝箱、击败青狮王将会获得丰富的奖励。",
    week = {7},
    time = {9, 20.5}
  },
  [93] = {
    zs = 0,
    lv = 80,
    zsmax = 3,
    lvmax = 180,
    tips = "今天#<G,>19:30-20:40#将会开启#<K,>天地奇书#，击败守卫将会获得丰富的召唤兽道具奖励和大量召唤兽经验。",
    week = {6},
    time = {9, 19.5}
  },
  [94] = {
    zs = 0,
    lv = 40,
    zsmax = 3,
    lvmax = 180,
    tips = "每天都可以在#<K,>大雁塔#副本门口的#<K,>慈恩寺主持#处将除妖奖章兑换成大量经验。",
    week = 0,
    time = 0
  },
  [95] = {
    zs = 0,
    lv = 40,
    zsmax = 3,
    lvmax = 180,
    tips = "通关#<K,>大雁塔#副本可以获得丰富的装备打造材料奖励。",
    week = 0,
    time = 0
  },
  [96] = {
    zs = 0,
    lv = 55,
    zsmax = 3,
    lvmax = 180,
    tips = "通关#<K,>天庭除妖#副本可以获得非常丰富的经验奖励。",
    week = 0,
    time = 0
  },
  [97] = {
    zs = 0,
    lv = 30,
    zsmax = 0,
    lvmax = 75,
    tips = "在#<K,>科举#中每答对一条题目就能立刻获得经验奖励。",
    week = 0,
    time = {9, 18.5}
  },
  [98] = {
    zs = 0,
    lv = 35,
    zsmax = 3,
    lvmax = 180,
    tips = "在#<K,>殿试#中成绩排行#<G,>前3名#的玩家可以获得装备强化道具以及科举称号奖励。",
    week = None,
    time = {9, 18.5}
  },
  [99] = {
    zs = 0,
    lv = 30,
    zsmax = 3,
    lvmax = 180,
    tips = "每天都可以在酒馆老板处领取#<K,>宝图任务#获得#<K,>藏宝图#。",
    week = 0,
    time = 0
  },
  [100] = {
    zs = 0,
    lv = 30,
    zsmax = 0,
    lvmax = 75,
    tips = "挖掘#<K,>藏宝图#的宝藏可以获得丰富的奖励。",
    week = 0,
    time = 0
  },
  [101] = {
    zs = 0,
    lv = 65,
    zsmax = 3,
    lvmax = 180,
    tips = "通关#<K,>通天幻境#有几率掉落#<K,>灵兽之源#，#<K,>灵兽之源#可以在#<K,>神兽仙子#处兑换灵兽。",
    week = 0,
    time = {10, 23}
  },
  [102] = {
    zs = 0,
    lv = 25,
    zsmax = 0,
    lvmax = 75,
    tips = "完成#<K,>试炼(201环)任务#会获得非常丰富的经验和铜币奖励。",
    week = 0,
    time = 0
  },
  [103] = {
    zs = 0,
    lv = 45,
    zsmax = 3,
    lvmax = 180,
    tips = "每击败#<K,>二十八星宿#中的一位星宿都能获得非常丰富的经验和铜钱奖励。",
    week = 0,
    time = 0
  },
  [104] = {
    zs = 0,
    lv = 50,
    zsmax = 0,
    lvmax = 95,
    tips = "#<K,>二十八星宿#会在每天的#<K,>整点#出现。",
    week = 0,
    time = 0
  },
  [105] = {
    zs = 0,
    lv = 50,
    zsmax = 0,
    lvmax = 95,
    tips = "挑战#<K,>二十八星宿#有一定几率会遇到#<K,>隐藏BOSS#。",
    week = 0,
    time = 0
  },
  [106] = {
    zs = 0,
    lv = 25,
    zsmax = 0,
    lvmax = 90,
    tips = "#<K,>主线任务#当中的#<K,>称谓任务#难度非常大，建议#<K,>组队#完成。",
    week = 0,
    time = 0
  },
  [107] = {
    zs = 0,
    lv = 25,
    zsmax = 0,
    lvmax = 90,
    tips = "觉得#<K,>主线任务#难度太大的玩家，建议先提高主角等级和技能熟练度后再#<K,>组队#挑战。",
    week = 0,
    time = 0
  },
  [108] = {
    zs = 0,
    lv = 25,
    zsmax = 0,
    lvmax = 95,
    tips = "协助队长击败#<K,>主线任务#的敌人会获得侠义值奖励。",
    week = 0,
    time = 0
  },
  [109] = {
    zs = 0,
    lv = 60,
    zsmax = 3,
    lvmax = 180,
    tips = "在#<K,>生死决斗#中击败对手可以让对手丢失角色#<K,>经验#，决斗结果还会在世界频道进行#<K,>公告#。",
    week = 0,
    time = 0
  },
  [110] = {
    zs = 0,
    lv = 60,
    zsmax = 3,
    lvmax = 180,
    tips = "在游戏中有什么恩怨都可以在长安城-#<K,>生死决斗#中得到解决，在世界频道当中恶意刷屏或发布不当用语有可能会导致#<K,>禁言#。",
    week = 0,
    time = 0
  },
  [111] = {
    zs = 0,
    lv = 26,
    zsmax = 0,
    lvmax = 50,
    tips = "学习一个#<K,>生活技能#可以让你更好地消耗#<K,>活力#，出售多余的#<K,>生活技能产品#还能赚取铜钱。",
    week = 0,
    time = 0
  },
  [112] = {
    zs = 0,
    lv = 26,
    zsmax = 0,
    lvmax = 90,
    tips = "学习#<K,>生活技能#的时候请#<K,>慎重选择#，#<K,>重修生活技能#后生活技能等级不会保留。",
    week = 0,
    time = 0
  },
  [113] = {
    zs = 0,
    lv = 26,
    zsmax = 0,
    lvmax = 90,
    tips = "玩家可以在#<K,>铜钱货摊#当中购买其他玩家出售的商品。",
    week = 0,
    time = 0
  },
  [114] = {
    zs = 0,
    lv = 26,
    zsmax = 3,
    lvmax = 180,
    tips = "#<K,>铜钱货摊#每隔#<G,>10分钟#就会自动免费刷新一次商品。",
    week = 0,
    time = 0
  },
  [115] = {
    zs = 0,
    lv = 26,
    zsmax = 0,
    lvmax = 90,
    tips = "在#<K,>铜钱货摊#购买到的商品会变成绑定，无法在摆摊再次寄售。",
    week = 0,
    time = 0
  },
  [116] = {
    zs = 0,
    lv = 60,
    zsmax = 3,
    lvmax = 180,
    tips = "让#<K,>坐骑#管制#<K,>召唤兽#可以让被管制的#<K,>召唤兽#获得#<K,>坐骑技能#的效果。",
    week = 0,
    time = 0
  },
  [117] = {
    zs = 0,
    lv = 60,
    zsmax = 0,
    lvmax = 95,
    tips = "根据不同#<K,>坐骑#的属性选择合适的#<K,>坐骑技能#可以使得技能效果作用最大化。",
    week = 0,
    time = 0
  },
  [118] = {
    zs = 0,
    lv = 45,
    zsmax = 0,
    lvmax = 100,
    tips = "在师父那里可以转换分配#<K,>主角的五行属性#。",
    week = 0,
    time = 0
  },
  [119] = {
    zs = 0,
    lv = 45,
    zsmax = 3,
    lvmax = 180,
    tips = "小伙伴的#<K,>五行属性#是跟随主角的。",
    week = 0,
    time = 0
  },
  [120] = {
    zs = 0,
    lv = 45,
    zsmax = 3,
    lvmax = 180,
    tips = "仙法伤害的属性种类跟#<K,>五行属性#之间并没有直接关系。",
    week = 0,
    time = 0
  },
  [121] = {
    zs = 0,
    lv = 45,
    zsmax = 3,
    lvmax = 180,
    tips = "合理搭配角色的#<K,>五行属性#以及#<K,>加强五行克属性#，可以有效提高主角的#<K,>法术伤害#。",
    week = 0,
    time = 0
  },
  [122] = {
    zs = 0,
    lv = 45,
    zsmax = 3,
    lvmax = 180,
    tips = "角色的#<K,>五行属性#对敌人的#<K,>五行属性#产生#<K,>克制#效果时，#<K,>法术伤害#会显著提高。",
    week = 0,
    time = 0
  },
  [123] = {
    zs = 1,
    lv = 40,
    zsmax = 1,
    lvmax = 120,
    tips = "#<K,>主角#完成转生后，可以在#<K,>孟婆#处更改自己的转生修正。",
    week = 0,
    time = 0
  },
  [124] = {
    zs = 0,
    lv = 40,
    zsmax = 3,
    lvmax = 180,
    tips = "#<K,>帮助#其他玩家完成#<K,>主线任务、帮派任务、转生任务#会获得丰富的侠义值。",
    week = 0,
    time = 0
  },
  [125] = {
    zs = 0,
    lv = 40,
    zsmax = 3,
    lvmax = 180,
    tips = "主角最多可以携带超过上限#<G,>1倍#的侠义值，但每天#<G,>5:00#都会#<K,>扣除#超出上限的侠义值。",
    week = 0,
    time = 0
  },
  [126] = {
    zs = 0,
    lv = 40,
    zsmax = 3,
    lvmax = 180,
    tips = "#<K,>侠义商店#的商品售完即止，直到每周周一#<G,>5:00#才会自动刷新侠义商店。",
    week = 0,
    time = 0
  },
  [127] = {
    zs = 0,
    lv = 25,
    zsmax = 3,
    lvmax = 180,
    tips = "大部分怪物都拥有#<K,>抗致命#的属性，但没有怪物拥有#<K,>抗狂暴#的属性。",
    week = 0,
    time = 0
  },
  [128] = {
    zs = 0,
    lv = 45,
    zsmax = 3,
    lvmax = 180,
    tips = "在背包里的非自身种族可以装备的#<K,>高级装备、仙器#，可以在#<K,>长安城-铁匠#处进行#<K,>回炉#。",
    week = 0,
    time = 0
  },
  [129] = {
    zs = 0,
    lv = 55,
    zsmax = 0,
    lvmax = 95,
    tips = "#<K,>主角#到达60级以后，便可和心仪的异性前往#<K,>红娘#处申请结婚了。",
    week = 0,
    time = 0
  },
  [130] = {
    zs = 0,
    lv = 60,
    zsmax = 3,
    lvmax = 180,
    tips = "一旦与配偶#<K,>解除婚姻#关系后，所有的#<K,>亲密技能#都将无法使用。",
    week = 0,
    time = 0
  },
  [131] = {
    zs = 0,
    lv = 60,
    zsmax = 3,
    lvmax = 180,
    tips = "在天庭的#<K,>嫦娥仙子#处为准备结婚的新人献上#<K,>祝福#可以获得#<K,>红包#奖励。",
    week = 0,
    time = 0
  },
  [132] = {
    zs = 0,
    lv = 60,
    zsmax = 0,
    lvmax = 95,
    tips = "参加其他人的#<K,>婚礼巡游#将有机会获得各种#<K,>礼物#。",
    week = 0,
    time = 0
  },
  [133] = {
    zs = 0,
    lv = 55,
    zsmax = 0,
    lvmax = 95,
    tips = "#<K,>主角#到达60级以后，便可和志同道合的同性前往#<K,>红娘#处申请结契了。",
    week = 0,
    time = 0
  },
  [134] = {
    zs = 0,
    lv = 60,
    zsmax = 3,
    lvmax = 180,
    tips = "一旦与兄弟或姐妹#<K,>解除结契#关系后，所有的#<K,>亲密技能#都将无法使用。",
    week = 0,
    time = 0
  },
  [135] = {
    zs = 0,
    lv = 45,
    zsmax = 3,
    lvmax = 180,
    tips = "装备和帮派图腾所能提供的#<K,>仙法抗性上限#为#<G,>75%#，但是由转生修正、种族修正等其他方式所提供的抗性并不在限制之内。",
    week = 0,
    time = 0
  },
  [136] = {
    zs = 0,
    lv = 45,
    zsmax = 3,
    lvmax = 180,
    tips = "在#<K,>天宫-黄大仙#处可以#<K,>更换造型或种族#，装备会自动转换成新种族可以穿戴的装备。",
    week = 0,
    time = 0
  }
}
