data_ProvinceQuestionLib = {
  [20001] = {
    ID = 20001,
    Question = "我国现有文献中最早引用勾股定理的是?",
    Option = {
      A = "《九章算术》",
      B = "《周髀算经》",
      C = "《纵横图》",
      D = "《孙子算经》"
    },
    Answer = "B"
  },
  [20002] = {
    ID = 20002,
    Question = "在哥德巴赫猜想问题上取得迄今最大进展的数学家是谁?",
    Option = {
      A = "陈景润",
      B = "布拉格",
      C = "莱布尼茨",
      D = "冯*诺伊曼"
    },
    Answer = "A"
  },
  [20003] = {
    ID = 20003,
    Question = "世界上最大的古代土石建筑工程是哪一个?",
    Option = {
      A = "中国的万里长城",
      B = "埃及的金字塔　",
      C = "古罗马的斗兽场　",
      D = "中国的故宫"
    },
    Answer = "A"
  },
  [20004] = {
    ID = 20004,
    Question = "下列哪一项是与计算机,半导体和原子能齐名的20世纪四项重大发明之一?",
    Option = {
      A = "超音速飞机 ",
      B = "激光器",
      C = "航天飞机",
      D = "人造卫星"
    },
    Answer = "B"
  },
  [20005] = {
    ID = 20005,
    Question = "人们最早是从那种动物身上得知咖啡的作用?",
    Option = {
      A = "老虎",
      B = "羊",
      C = "狮子",
      D = "牛"
    },
    Answer = "B"
  },
  [20006] = {
    ID = 20006,
    Question = "“碧云天,黄叶地,北雁南飞”是语出?",
    Option = {
      A = "西厢记",
      B = "西游记",
      C = "大唐双龙传",
      D = "水浒传"
    },
    Answer = "A"
  },
  [20007] = {
    ID = 20007,
    Question = "好莱坞位于美国那个州?",
    Option = {
      A = "纽约",
      B = "加利福尼亚",
      C = "华盛顿",
      D = "旧金山"
    },
    Answer = "B"
  },
  [20008] = {
    ID = 20008,
    Question = "最不耐酸的织品是?",
    Option = {
      A = "棉织品",
      B = "麻织品",
      C = "涤纶",
      D = "锦纶"
    },
    Answer = "A"
  },
  [20009] = {
    ID = 20009,
    Question = "“东山再起”的典故是和哪一位人物有关?",
    Option = {
      A = "谢平",
      B = "谢心",
      C = "谢安",
      D = "谢裒"
    },
    Answer = "C"
  },
  [20010] = {
    ID = 20010,
    Question = "用哪个季节的竹子做出的竹席质量最好?",
    Option = {
      A = "春",
      B = "夏",
      C = "秋",
      D = "冬"
    },
    Answer = "B"
  },
  [20011] = {
    ID = 20011,
    Question = "《三国演义》中,张颌的死因是?",
    Option = {
      A = "中毒而死",
      B = "砍杀而死",
      C = "堕马而死",
      D = "中箭而死"
    },
    Answer = "D"
  },
  [20012] = {
    ID = 20012,
    Question = "围棋棋盘共有几个交叉点?",
    Option = {
      A = "361",
      B = "360",
      C = "359",
      D = "358"
    },
    Answer = "A"
  },
  [20013] = {
    ID = 20013,
    Question = "比利时著名的撒尿小孩铜像,平时他尿的是自来水,那狂欢节他尿的是?",
    Option = {
      A = "啤酒",
      B = "可乐",
      C = "橙汁",
      D = "葡萄酒"
    },
    Answer = "A"
  },
  [20014] = {
    ID = 20014,
    Question = "一般来说,声音在多少分贝以下为安静环境?",
    Option = {
      A = "80分贝",
      B = "50分贝",
      C = "60分贝",
      D = "70分贝"
    },
    Answer = "B"
  },
  [20015] = {
    ID = 20015,
    Question = "最小的物质是?",
    Option = {
      A = "离子",
      B = "分子",
      C = "分母",
      D = "负离子"
    },
    Answer = "B"
  },
  [20016] = {
    ID = 20016,
    Question = "新石器时代是属于石器时代的哪个阶段?",
    Option = {
      A = "前期",
      B = "后期",
      C = "中期",
      D = "星期"
    },
    Answer = "B"
  },
  [20017] = {
    ID = 20017,
    Question = "蜂王浆中含量最高的是什么?",
    Option = {
      A = "脂肪",
      B = "蛋白质",
      C = "糖类",
      D = "维生素"
    },
    Answer = "B"
  },
  [20018] = {
    ID = 20018,
    Question = "用多少温度的水洗澡最好?",
    Option = {
      A = "50~60度",
      B = "45~50度",
      C = "55~65度",
      D = "35~40度"
    },
    Answer = "D"
  },
  [20019] = {
    ID = 20019,
    Question = "蟋蟀的“耳朵”长在什么地方?",
    Option = {
      A = "头上",
      B = "身上",
      C = "小腿上",
      D = "大腿上"
    },
    Answer = "C"
  },
  [20020] = {
    ID = 20020,
    Question = "“冲天香阵透长安,满城尽带黄金甲”是从谁的诗作中摘录的?",
    Option = {
      A = "张端义",
      B = "张全义",
      C = "黄巢",
      D = "毕正义"
    },
    Answer = "C"
  },
  [20021] = {
    ID = 20021,
    Question = "挂红灯的习俗和唐末的谁有关? ",
    Option = {
      A = "张端义",
      B = "张全义",
      C = "黄巢",
      D = "毕正义"
    },
    Answer = "C"
  },
  [20022] = {
    ID = 20022,
    Question = "被武则天赞叹很有才气,说“宰相安得失此人”的诗人是谁?",
    Option = {
      A = "王勃",
      B = "卢照邻",
      C = "骆宾王",
      D = "杨炯"
    },
    Answer = "C"
  },
  [20023] = {
    ID = 20023,
    Question = "“初唐四杰”除了杨炯,王勃,卢照邻,还有谁? ",
    Option = {
      A = "柳宗元",
      B = "韩愈",
      C = "骆宾王",
      D = "白居易"
    },
    Answer = "C"
  },
  [20024] = {
    ID = 20024,
    Question = "陋室铭的作者是谁?",
    Option = {
      A = "柳宗元",
      B = "韩愈",
      C = "刘禹锡",
      D = "杨炯"
    },
    Answer = "C"
  },
  [20025] = {
    ID = 20025,
    Question = "初唐凌云阁二十四功臣之中被唐高祖李渊赐姓李的名将是谁? ",
    Option = {
      A = "李靖",
      B = "李孝恭",
      C = "李绩",
      D = "李勣"
    },
    Answer = "C"
  },
  [20026] = {
    ID = 20026,
    Question = "成语“口蜜腹剑”出自唐朝哪一位奸臣? ",
    Option = {
      A = "秦桧",
      B = "赵高",
      C = "李林甫",
      D = "吴三桂"
    },
    Answer = "C"
  },
  [20027] = {
    ID = 20027,
    Question = "成语“请君入瓮”有关人物一个是周兴,另一个是谁? ",
    Option = {
      A = "周杰",
      B = "来俊仁",
      C = "来俊臣",
      D = "周行"
    },
    Answer = "C"
  },
  [20028] = {
    ID = 20028,
    Question = "大昭寺和小昭寺是哪位藏王在位期间建立的? ",
    Option = {
      A = "木赤赞布",
      B = "定赤赞布",
      C = "松赞干布",
      D = "思赤赞布"
    },
    Answer = "C"
  },
  [20029] = {
    ID = 20029,
    Question = "推翻唐朝统治建立后梁的是谁?",
    Option = {
      A = "刘温",
      B = "李温",
      C = "朱温",
      D = "黄温"
    },
    Answer = "C"
  },
  [20030] = {
    ID = 20030,
    Question = "唐太宗时期中国北方少数民族专称李世民为? ",
    Option = {
      A = "地可汗",
      B = "民可汗",
      C = "天可汗",
      D = "国可汗"
    },
    Answer = "C"
  },
  [20031] = {
    ID = 20031,
    Question = "“噫吁唏,危乎高哉！蜀道之难难于上青天”是谁的名句? ",
    Option = {
      A = "韩愈",
      B = "骆宾王",
      C = "白居易",
      D = "李白"
    },
    Answer = "D"
  },
  [20032] = {
    ID = 20032,
    Question = "唐文宗曾向天下发布一个罕见的诏书,称张旭的草书,斐旻的剑舞和谁的诗歌可成为天下三绝? ",
    Option = {
      A = "韩愈",
      B = "骆宾王",
      C = "白居易",
      D = "李白"
    },
    Answer = "D"
  },
  [20033] = {
    ID = 20033,
    Question = "唐太宗临终前被招为顾命大臣,又是初唐四家之一的是? ",
    Option = {
      A = "韩愈",
      B = "骆宾王",
      C = "白居易",
      D = "褚遂良"
    },
    Answer = "D"
  },
  [20034] = {
    ID = 20034,
    Question = "唐宋八大家之首是谁? ",
    Option = {
      A = "骆宾王",
      B = "白居易",
      C = "李白",
      D = "韩愈"
    },
    Answer = "D"
  },
  [20035] = {
    ID = 20035,
    Question = "唐代著名的古文运动的倡导者是韩愈和谁? ",
    Option = {
      A = "骆宾王",
      B = "白居易",
      C = "李白",
      D = "柳宗元"
    },
    Answer = "D"
  },
  [20036] = {
    ID = 20036,
    Question = "李世民随父灭隋后被封为? ",
    Option = {
      A = "唐王",
      B = "明王",
      C = "隋王",
      D = "秦王"
    },
    Answer = "D"
  },
  [20037] = {
    ID = 20037,
    Question = "《千金方》的作者,被称为医圣的是? ",
    Option = {
      A = "李时珍",
      B = "华佗",
      C = "祖冲之",
      D = "孙思邈"
    },
    Answer = "D"
  },
  [20038] = {
    ID = 20038,
    Question = "与杜牧并称为“小李杜”的是谁? ",
    Option = {
      A = "李白",
      B = "李商隐",
      C = "李益",
      D = "李端"
    },
    Answer = "B"
  },
  [20039] = {
    ID = 20039,
    Question = "唐朝著名诗人被称作诗佛的是谁?",
    Option = {
      A = "杜甫",
      B = "李白",
      C = " 王维",
      D = "孟浩然"
    },
    Answer = "C"
  },
  [20040] = {
    ID = 20040,
    Question = "唐朝诗人白居易,字乐天,号什么? ",
    Option = {
      A = "香山隐士",
      B = "香山术士",
      C = "香山居士",
      D = "香山道士"
    },
    Answer = "C"
  },
  [20041] = {
    ID = 20041,
    Question = "唐代著名数学家,天文学家李淳风有一部预言后世的名书,叫什么? ",
    Option = {
      A = "推敲图",
      B = "推行图",
      C = "推背图",
      D = "推测图"
    },
    Answer = "C"
  },
  [20042] = {
    ID = 20042,
    Question = "韩愈曾写过一篇有关教育的文章是? ",
    Option = {
      A = "原道",
      B = "讳辩",
      C = "杂说",
      D = "师说"
    },
    Answer = "D"
  },
  [20043] = {
    ID = 20043,
    Question = "唐宋八大家之一的柳宗元曾经写过一篇以捕蛇人遭遇揭露赋税的苛酷的文章,这篇文章是? ",
    Option = {
      A = "捕蛇者说",
      B = "捕蛇人说",
      C = "捕蛇户说",
      D = "捕蛇民说"
    },
    Answer = "A"
  },
  [20044] = {
    ID = 20044,
    Question = "“落霞与孤鹜齐飞,秋水共长天一色”出自王勃的哪篇名作? ",
    Option = {
      A = "次论语",
      B = " 滕王阁序",
      C = "元经传",
      D = "合论"
    },
    Answer = "B"
  },
  [20045] = {
    ID = 20045,
    Question = "“千里莺啼绿映红 水郭山村酒旗风”出自哪首诗?",
    Option = {
      A = "清明",
      B = " 江南春",
      C = "山行",
      D = "赤壁"
    },
    Answer = "B"
  },
  [20046] = {
    ID = 20046,
    Question = "“九曲黄河万里沙”下一句是什么? ",
    Option = {
      A = "一月周流六十回",
      B = "一重浪灭一重生",
      C = "浪淘风簸自天涯",
      D = "一树春风万万枝"
    },
    Answer = "C"
  },
  [20047] = {
    ID = 20047,
    Question = "“沧海月明珠有泪”下一句是什么? ",
    Option = {
      A = "轻罗已薄未更衣",
      B = "香烟欲傍衮龙浮",
      C = "桃李阴阴柳絮飞",
      D = "蓝田日暖玉生烟"
    },
    Answer = "D"
  },
  [20048] = {
    ID = 20048,
    Question = "“白云深处有人家”上一句是什么?",
    Option = {
      A = "每逢佳节倍思亲",
      B = "省中啼鸟吏人稀",
      C = "雨中春树万人家",
      D = "远上寒山石径斜"
    },
    Answer = "D"
  },
  [20049] = {
    ID = 20049,
    Question = "“折戟沉沙铁未销”下一句是什么? ",
    Option = {
      A = "玉碗盛来琥珀光",
      B = "战罢沙场月色寒",
      C = "匣里金刀血未干",
      D = "自将磨洗认前朝"
    },
    Answer = "D"
  },
  [20050] = {
    ID = 20050,
    Question = "“大珠小珠落玉盘”下一句是什么? ",
    Option = {
      A = "别作深宫一段愁",
      B = "卷帷望月空长叹",
      C = "散入春风满洛城",
      D = "间关莺语花底滑"
    },
    Answer = "D"
  },
  [20051] = {
    ID = 20051,
    Question = "程咬金在投归大唐之前是什么地方的起义军?",
    Option = {
      A = "瓦岗寨",
      B = "白水寨",
      C = "天堂寨",
      D = "椰风寨"
    },
    Answer = "A"
  },
  [20052] = {
    ID = 20052,
    Question = "唐代供奉开国二十四位功臣画像的地点是? ",
    Option = {
      A = "云烟阁",
      B = "凌烟阁",
      C = "出云阁",
      D = "凝香阁"
    },
    Answer = "B"
  },
  [20053] = {
    ID = 20053,
    Question = "“紫泉宫殿锁烟霞,欲取芜城作帝家”中的紫泉指什么? ",
    Option = {
      A = "泉水",
      B = "长安",
      C = "河流",
      D = "云朵"
    },
    Answer = "B"
  },
  [20054] = {
    ID = 20054,
    Question = "唐诗的近体诗分为两部分,分别是律诗和什么? ",
    Option = {
      A = "韵脚诗",
      B = "歌行体",
      C = "绝句",
      D = "楚辞"
    },
    Answer = "C"
  },
  [20055] = {
    ID = 20055,
    Question = "“皮皴似龟手,叶小如鼠耳”(打一植物)",
    Option = {
      A = "银杏树",
      B = "荔枝树",
      C = "樱花树",
      D = "枣树"
    },
    Answer = "D"
  },
  [20056] = {
    ID = 20056,
    Question = "按字数唐诗被分为五言和什么? ",
    Option = {
      A = "七言",
      B = "八言",
      C = "六言",
      D = "九言"
    },
    Answer = "A"
  },
  [20057] = {
    ID = 20057,
    Question = "在杭州西湖与白居易有关的建筑是? ",
    Option = {
      A = "小亭",
      B = "白堤",
      C = "宫殿",
      D = "阁楼"
    },
    Answer = "B"
  },
  [20058] = {
    ID = 20058,
    Question = "数字1到100中,包含有9的数字一共有多少个呢? ",
    Option = {
      A = "20",
      B = "19",
      C = "18",
      D = "17"
    },
    Answer = "A"
  },
  [20059] = {
    ID = 20059,
    Question = "有人将一张纸对折两次都没有成功,一次长1CM,一次短1CM,两折痕宽多少?",
    Option = {
      A = "2厘米",
      B = "3厘米",
      C = "1厘米",
      D = "4厘米"
    },
    Answer = "C"
  },
  [20060] = {
    ID = 20060,
    Question = "一堆西瓜一半的一半的一半比一半的一半少半个这堆西瓜有几个?",
    Option = {
      A = "2",
      B = "3",
      C = "4",
      D = "5"
    },
    Answer = "C"
  },
  [20061] = {
    ID = 20061,
    Question = "“七步成诗”是哪位文人的故事？",
    Option = {
      A = "曹洪",
      B = "曹操",
      C = "曹植",
      D = "曹丕"
    },
    Answer = "C"
  },
  [20062] = {
    ID = 20062,
    Question = "鉴真和尚东渡曰本几次才成功? ",
    Option = {
      A = "4",
      B = "5",
      C = "6",
      D = "7"
    },
    Answer = "C"
  },
  [20063] = {
    ID = 20063,
    Question = "一个挂钟敲6下要30秒,敲12下要多少秒? ",
    Option = {
      A = "44",
      B = "55",
      C = "77",
      D = "66"
    },
    Answer = "D"
  },
  [20064] = {
    ID = 20064,
    Question = "10道题,对得10分,错扣5分,小明得70分,他做对了几道题?",
    Option = {
      A = "6",
      B = "7",
      C = "9",
      D = "8"
    },
    Answer = "D"
  },
  [20065] = {
    ID = 20065,
    Question = "篮子里的鸡蛋一分钟增加1倍,12分钟满,篮子里有一半鸡蛋的时候是什么时候? ",
    Option = {
      A = "11分钟",
      B = "12分钟",
      C = "13分钟",
      D = "14分钟"
    },
    Answer = "A"
  },
  [20066] = {
    ID = 20066,
    Question = "王大婶有三个儿子,这三个儿子又分别有一个姐姐和一个妹妹,问王大婶一共有几个孩子?",
    Option = {
      A = "4",
      B = "5",
      C = "6",
      D = "7"
    },
    Answer = "B"
  },
  [20067] = {
    ID = 20067,
    Question = "《西游记》里孙悟空的武器是什么? ",
    Option = {
      A = "九齿钉耙",
      B = "金箍棒",
      C = "芭蕉扇",
      D = "三尖两刃枪"
    },
    Answer = "B"
  },
  [20068] = {
    ID = 20068,
    Question = "《西游记》里猪八戒的武器是什么? ",
    Option = {
      A = "九齿钉耙",
      B = "金箍棒",
      C = "芭蕉扇",
      D = "三尖两刃枪"
    },
    Answer = "A"
  },
  [20069] = {
    ID = 20069,
    Question = "有个农场,鸡的数目是鸭的四倍,但是鸭又比猪少九只,鸭跟猪的数目加起来是六十七只,请问整个农场所有动物的脚一共有几只? ",
    Option = {
      A = "422",
      B = "224",
      C = "402",
      D = "442"
    },
    Answer = "D"
  },
  [20070] = {
    ID = 20070,
    Question = "程咬金后来更名为? ",
    Option = {
      A = "程知节",
      B = "程知礼",
      C = "程知足",
      D = "程土豪"
    },
    Answer = "A"
  },
  [20071] = {
    ID = 20071,
    Question = "“前度刘郎今又来”中的刘郎是指? ",
    Option = {
      A = "刘禹锡",
      B = "刘备",
      C = "刘邦",
      D = "刘牧"
    },
    Answer = "A"
  },
  [20072] = {
    ID = 20072,
    Question = "采莲南塘秋,莲花过人头,低头弄莲子,莲子清如水,出于__? ",
    Option = {
      A = "东洲曲",
      B = "南洲曲",
      C = "西洲曲",
      D = "北洲曲"
    },
    Answer = "C"
  },
  [20073] = {
    ID = 20073,
    Question = "按古代兄弟排行的次序,次子应该称为?",
    Option = {
      A = "伯",
      B = "叔",
      C = "仲",
      D = "季"
    },
    Answer = "C"
  },
  [20074] = {
    ID = 20074,
    Question = "“百二关河”是指什么? ",
    Option = {
      A = "坦荡如砥",
      B = "乘高居险",
      C = "山河险峻",
      D = "高山深涧"
    },
    Answer = "C"
  },
  [20075] = {
    ID = 20075,
    Question = "“书中自有颜如玉”是谁说的? ",
    Option = {
      A = "宋太宗",
      B = "唐太宗",
      C = "清太宗",
      D = "宋真宗"
    },
    Answer = "D"
  },
  [20076] = {
    ID = 20076,
    Question = "“问君西游何时还”是出自李白的哪一首诗? ",
    Option = {
      A = "行路难",
      B = "蜀道难",
      C = "将进酒",
      D = "静夜思"
    },
    Answer = "B"
  },
  [20077] = {
    ID = 20077,
    Question = "“刘伶好醉三年梦”,酿出让刘伶一醉三年的造酒师是谁? ",
    Option = {
      A = "杜康",
      B = "狄希",
      C = "关羽",
      D = "张飞"
    },
    Answer = "A"
  },
  [20078] = {
    ID = 20078,
    Question = "“牛李党争”是由什么考试而起?",
    Option = {
      A = "秀才",
      B = "进士",
      C = "举人",
      D = "探花"
    },
    Answer = "B"
  },
  [20079] = {
    ID = 20079,
    Question = "“月既不解饮,影徒随我身”出自哪一首诗? ",
    Option = {
      A = "凉州词",
      B = "月下独酌",
      C = "游子吟",
      D = "渔歌子"
    },
    Answer = "B"
  },
  [20080] = {
    ID = 20080,
    Question = "释迦牟尼的父亲叫什么? ",
    Option = {
      A = "罗睺罗",
      B = "玄奘",
      C = "十力迦叶",
      D = "净饭王"
    },
    Answer = "D"
  },
  [20081] = {
    ID = 20081,
    Question = "围棋对弈时用落子进行交流成为什么?",
    Option = {
      A = "空谈",
      B = "交谈",
      C = "拒谈",
      D = "手谈"
    },
    Answer = "D"
  },
  [20082] = {
    ID = 20082,
    Question = "箫笛同源,都是源于古代的什么? ",
    Option = {
      A = "骨哨",
      B = "羌笛",
      C = "九节箫",
      D = "玉屏箫"
    },
    Answer = "A"
  },
  [20083] = {
    ID = 20083,
    Question = "释迦牟尼的父亲净饭王有三个兄弟分别叫斛饭,甘露饭和什么?",
    Option = {
      A = "煲仔饭",
      B = "黄鳝饭",
      C = "白饭",
      D = "悟饭"
    },
    Answer = "C"
  },
  [20084] = {
    ID = 20084,
    Question = "在我国,青铜的出现是什么时代到来的重要标志?",
    Option = {
      A = "战国时代",
      B = "腐败时代",
      C = "帝王时代",
      D = "文明时代"
    },
    Answer = "D"
  },
  [20085] = {
    ID = 20085,
    Question = "相对论是关于时空和什么的理论? ",
    Option = {
      A = "核结构",
      B = "静电学",
      C = "传热学",
      D = "引力"
    },
    Answer = "D"
  },
  [20086] = {
    ID = 20086,
    Question = "白色彼岸花的学名是什么? ",
    Option = {
      A = "曼陀罗华",
      B = "康乃馨",
      C = "蒲公英",
      D = "薰衣草"
    },
    Answer = "A"
  },
  [20087] = {
    ID = 20087,
    Question = "红色彼岸花的学名是什么? ",
    Option = {
      A = "曼珠沙华",
      B = "康乃馨",
      C = "蒲公英",
      D = "薰衣草"
    },
    Answer = "A"
  },
  [20088] = {
    ID = 20088,
    Question = "钱永健获得了诺贝尔什么奖? ",
    Option = {
      A = "和平",
      B = "化学",
      C = "物理",
      D = "文学"
    },
    Answer = "B"
  },
  [20089] = {
    ID = 20089,
    Question = "狭义相对论最著名的推论是什么公式? ",
    Option = {
      A = "圆的周长公式",
      B = "质能公式",
      C = "欧拉公式",
      D = "圆的面积公式"
    },
    Answer = "B"
  },
  [20090] = {
    ID = 20090,
    Question = "曼珠沙华在中国的花语是什么?",
    Option = {
      A = "恩爱关怀",
      B = "美丽长新",
      C = "优美纯洁",
      D = "坚强高雅"
    },
    Answer = "C"
  },
  [20091] = {
    ID = 20091,
    Question = "《山海经》分为山经和什么?",
    Option = {
      A = "三字经",
      B = "四十二章经",
      C = "海经",
      D = "金刚经"
    },
    Answer = "C"
  },
  [20092] = {
    ID = 20092,
    Question = "曼珠沙华出自 《法华经》 ,其本名是什么?",
    Option = {
      A = "摩诃曼陀罗华芬陀利华",
      B = "摩诃芬陀利华曼珠沙华",
      C = "摩诃芬陀利华曼殊沙华",
      D = "摩诃曼陀罗华曼珠沙华"
    },
    Answer = "D"
  },
  [20093] = {
    ID = 20093,
    Question = "相对论分为狭义论和什么论? ",
    Option = {
      A = "电磁学理论",
      B = "量子场论",
      C = "广义相对论",
      D = "唯象论"
    },
    Answer = "C"
  },
  [20094] = {
    ID = 20094,
    Question = "相对论和什么是现代物理学的两大基本支柱? ",
    Option = {
      A = "牛顿力学",
      B = "电磁学",
      C = "量子力学",
      D = "粒子物理学"
    },
    Answer = "C"
  },
  [20095] = {
    ID = 20095,
    Question = "四书是指论语,孟子,大学和什么? ",
    Option = {
      A = "中庸",
      B = "诗经",
      C = "春秋",
      D = "尚书"
    },
    Answer = "A"
  },
  [20096] = {
    ID = 20096,
    Question = "阴阳家是战国时期重要学派之一,这一学派,当源于上古执掌天文历数的统治阶层,也称什么?",
    Option = {
      A = "蛋黄派",
      B = "阴阳五行学派",
      C = "阴阳相克学派",
      D = "阴阳相生学派"
    },
    Answer = "B"
  },
  [20097] = {
    ID = 20097,
    Question = "春秋战国时期,诸侯之间不断爆发战争,从事军事的智谋有识之士,总结军事方面的经验教训,研究制胜的规律,这一类学者故称之为?",
    Option = {
      A = "学家",
      B = "老人家",
      C = "兵家",
      D = "墨家"
    },
    Answer = "C"
  },
  [20098] = {
    ID = 20098,
    Question = "纵横家的主要人物是谁?",
    Option = {
      A = "老子",
      B = "孟子",
      C = "鬼谷子",
      D = "孔子"
    },
    Answer = "C"
  },
  [20099] = {
    ID = 20099,
    Question = "西汉初年,汉文帝,汉景帝以道家思想治国,使人民从秦朝苛政中得以休养生息。历史称之为什么?",
    Option = {
      A = "贞观之治",
      B = "混乱之治",
      C = "开元之治",
      D = "文景之治"
    },
    Answer = "D"
  },
  [20100] = {
    ID = 20100,
    Question = "韩非子被派出使秦国后,韩非子曾上书劝秦始皇先伐赵缓伐韩,后来遭到了亲王手下姚贾和谁的残害,最后自尽身亡? ",
    Option = {
      A = "李信",
      B = "蒙恬",
      C = "蒙武",
      D = "李斯"
    },
    Answer = "D"
  },
  [20101] = {
    ID = 20101,
    Question = "被李世民称为“我有天下,多为此人”的是谁? ",
    Option = {
      A = "长孙无忌",
      B = "李孝恭",
      C = "杜如晦",
      D = "魏征"
    },
    Answer = "A"
  },
  [20102] = {
    ID = 20102,
    Question = "墨家的创始人是谁?",
    Option = {
      A = "墨翟",
      B = "墨西哥",
      C = "墨霍",
      D = "墨安"
    },
    Answer = "A"
  },
  [20103] = {
    ID = 20103,
    Question = "韩非子名叫什么?",
    Option = {
      A = "韩非",
      B = "韩子",
      C = "韩信",
      D = "韩愈"
    },
    Answer = "A"
  },
  [20104] = {
    ID = 20104,
    Question = "四书五经属于哪家的经典学说?",
    Option = {
      A = "墨家",
      B = "儒家",
      C = "孟家",
      D = "孔家"
    },
    Answer = "B"
  },
  [20105] = {
    ID = 20105,
    Question = "前期墨家在战国初即有很大影响,与儒家并称什么?",
    Option = {
      A = "化学",
      B = "显学",
      C = "数学",
      D = "大学"
    },
    Answer = "B"
  },
  [20106] = {
    ID = 20106,
    Question = "五经是指《诗经》,《尚书》,《礼记》,《周易》和什么?",
    Option = {
      A = "三字经",
      B = "金刚经",
      C = "春秋",
      D = "山海经"
    },
    Answer = "C"
  },
  [20107] = {
    ID = 20107,
    Question = "“游学徐土,兼通数经。沛相陈圭举孝廉,太尉黄琬辟,皆不就”描写的是三国志里哪一位人物? ",
    Option = {
      A = "扁鹊",
      B = "关羽",
      C = "吕布",
      D = "华佗"
    },
    Answer = "D"
  },
  [20108] = {
    ID = 20108,
    Question = "祝融神话传说中的古帝,以火施化,号什么?",
    Option = {
      A = "赤帝",
      B = "火帝",
      C = "炎帝",
      D = "黄帝"
    },
    Answer = "A"
  },
  [20109] = {
    ID = 20109,
    Question = "《伤寒杂病论》是谁的著作? ",
    Option = {
      A = "李时珍",
      B = "张仲景",
      C = "华佗",
      D = "扁鹊"
    },
    Answer = "B"
  },
  [20110] = {
    ID = 20110,
    Question = "中国哪位数学家计算出圆周率到小数点后7位? ",
    Option = {
      A = "华罗庚",
      B = "刘徽",
      C = "张丘建",
      D = "祖冲之"
    },
    Answer = "D"
  },
  [20111] = {
    ID = 20111,
    Question = "“沧浪之水清兮,可以濯吾缨;沧浪之水浊兮,可以濯吾足”出自屈原写的哪首词?",
    Option = {
      A = "离骚",
      B = "天问",
      C = "九歌",
      D = "渔父"
    },
    Answer = "D"
  },
  [20112] = {
    ID = 20112,
    Question = "初唐风尘三侠是李靖,红拂女和谁?",
    Option = {
      A = "虬髯客",
      B = "李世民",
      C = "长孙无忌",
      D = "魏征"
    },
    Answer = "A"
  },
  [20113] = {
    ID = 20113,
    Question = "古时用“十二生肖”对应十二地支,其中“辰”对应的是?",
    Option = {
      A = "牛",
      B = "马",
      C = "龙",
      D = "猴"
    },
    Answer = "C"
  },
  [20114] = {
    ID = 20114,
    Question = "陶渊明号? ",
    Option = {
      A = "三柳先生",
      B = "四柳先生",
      C = "五柳先生",
      D = "六柳先生"
    },
    Answer = "C"
  },
  [20115] = {
    ID = 20115,
    Question = "“一去二三里,烟村四五家,亭台六七座,八九十枝花”属于哪种诗? ",
    Option = {
      A = "抒情诗",
      B = "叙事诗",
      C = "律诗",
      D = "数字诗"
    },
    Answer = "D"
  },
  [20116] = {
    ID = 20116,
    Question = "道教奉老子为教祖,尊称他为什么?",
    Option = {
      A = "太上老君",
      B = "中斗星君",
      C = "南斗星君",
      D = "百变星君"
    },
    Answer = "A"
  },
  [20117] = {
    ID = 20117,
    Question = "“红豆生南国,春来发几枝”出处? ",
    Option = {
      A = "相约",
      B = "相思",
      C = "相见",
      D = "相交"
    },
    Answer = "B"
  },
  [20118] = {
    ID = 20118,
    Question = "“商女不知亡国恨,隔江犹唱后庭花”是谁的诗句? ",
    Option = {
      A = "李白",
      B = "王维",
      C = "杜牧",
      D = "王勃"
    },
    Answer = "C"
  },
  [20119] = {
    ID = 20119,
    Question = "“夕阳无限好,只是近黄昏”是谁的诗句? ",
    Option = {
      A = "骆宾王",
      B = "孟浩然",
      C = "王昌龄",
      D = "李商隐"
    },
    Answer = "D"
  },
  [20120] = {
    ID = 20120,
    Question = "凌烟阁二十四功臣中的哪一位后来因为谋反被杀?",
    Option = {
      A = "侯君集",
      B = "魏征",
      C = "尉迟恭",
      D = "杜如晦"
    },
    Answer = "A"
  },
  [20121] = {
    ID = 20121,
    Question = "诗歌在唐代发展到了一个高峰,唐朝诗人杜甫被尊称为? ",
    Option = {
      A = "诗神",
      B = "诗王",
      C = "诗侠",
      D = "诗圣"
    },
    Answer = "D"
  },
  [20122] = {
    ID = 20122,
    Question = "郑和下了几次西洋? ",
    Option = {
      A = "7",
      B = "6",
      C = "5",
      D = "4"
    },
    Answer = "A"
  },
  [20123] = {
    ID = 20123,
    Question = "一颗质量大于钱德拉塞卡极限的恒星演化到末期,发生坍塌收缩有可能形成什么? ",
    Option = {
      A = "黑洞",
      B = "星球",
      C = "流星",
      D = "台风"
    },
    Answer = "A"
  },
  [20124] = {
    ID = 20124,
    Question = "地壳被分为上下两层,上层化学成分以氧硅铝为主,被称为什么? ",
    Option = {
      A = "对流层",
      B = "硅铝层",
      C = "平流层",
      D = "散逸层"
    },
    Answer = "B"
  },
  [20125] = {
    ID = 20125,
    Question = "唐武宗崇信道教,深恶佛教,在位期间发动了打击佛教的运动被佛教徒称为什么? ",
    Option = {
      A = "会平法难",
      B = "会太法难",
      C = "会盛法难",
      D = "会昌法难"
    },
    Answer = "D"
  },
  [20126] = {
    ID = 20126,
    Question = "爱迪生拥有多少个发明专利权,被人们称之为发明之王?",
    Option = {
      A = "1099",
      B = "1098",
      C = "1097",
      D = "1096"
    },
    Answer = "A"
  },
  [20127] = {
    ID = 20127,
    Question = "解放战争三大战役分别是辽沈战役,淮海战役,和什么? ",
    Option = {
      A = "平津",
      B = "官渡",
      C = "赤壁",
      D = "长平"
    },
    Answer = "A"
  },
  [20128] = {
    ID = 20128,
    Question = "我国发现的最早的青花瓷标本是什么朝代的? ",
    Option = {
      A = "清朝",
      B = "唐朝",
      C = "明朝",
      D = "汉朝"
    },
    Answer = "B"
  },
  [20129] = {
    ID = 20129,
    Question = "根据伽利略晚年的学生维维亚尼记载,伽利略进行的“自由落体定律”是在意大利哪个名胜古迹上进行?",
    Option = {
      A = "凯旋门",
      B = "比萨斜塔",
      C = "罗马斗兽场",
      D = "双塔"
    },
    Answer = "B"
  },
  [20130] = {
    ID = 20130,
    Question = "细胞是由膜包围着含有什么的原生质所组成,是生物体的结构和功能的基本单位,也是生命活动的基本单位?",
    Option = {
      A = "细胞壁",
      B = "细胞膜",
      C = "细胞核",
      D = "细胞质"
    },
    Answer = "C"
  },
  [20131] = {
    ID = 20131,
    Question = "病毒由蛋白质和什么构成? ",
    Option = {
      A = "核甜",
      B = "核酸",
      C = "核苦",
      D = "核辣"
    },
    Answer = "B"
  },
  [20132] = {
    ID = 20132,
    Question = "五代后周赵匡胤在陈桥兵变,诸将给他披上黄袍,拥立为帝。历史上称为? ",
    Option = {
      A = "黄袍上身",
      B = "黄袍加身",
      C = "黄袍拥身",
      D = "黄袍裹身"
    },
    Answer = "B"
  },
  [20133] = {
    ID = 20133,
    Question = "光合作用膜中的绿色色素.捕获光的主要成分是什么? ",
    Option = {
      A = "黑色素",
      B = "植绿素",
      C = "叶绿素",
      D = "物绿素"
    },
    Answer = "C"
  },
  [20134] = {
    ID = 20134,
    Question = "宦官仇士良一生弑杀多少个皇帝? ",
    Option = {
      A = "2",
      B = "3",
      C = "4",
      D = "5"
    },
    Answer = "A"
  },
  [20135] = {
    ID = 20135,
    Question = "李世民第一次吃败仗输给隋将的谁? ",
    Option = {
      A = "薛举",
      B = "屈突",
      C = "尉迟",
      D = "马周"
    },
    Answer = "A"
  },
  [20136] = {
    ID = 20136,
    Question = "三师指太师,太傅跟什么? ",
    Option = {
      A = "太保",
      B = "太尉",
      C = "太仆",
      D = "太宰"
    },
    Answer = "A"
  },
  [20137] = {
    ID = 20137,
    Question = "药王孙思邈所著医书叫什么? ",
    Option = {
      A = "万金方",
      B = "千金方",
      C = "百金方",
      D = "十金方"
    },
    Answer = "B"
  },
  [20138] = {
    ID = 20138,
    Question = "“中秋”一词,最早见于我国哪部古籍? ",
    Option = {
      A = "仪礼",
      B = "礼记",
      C = "周礼",
      D = "春秋"
    },
    Answer = "C"
  },
  [20139] = {
    ID = 20139,
    Question = "地壳被分为上下两层.下层富含硅和镁,被称为什么? ",
    Option = {
      A = "硅铝层",
      B = "对流层",
      C = "硅镁层",
      D = "硅胶层"
    },
    Answer = "C"
  },
  [20140] = {
    ID = 20140,
    Question = "侏罗纪是中生代是第几纪?",
    Option = {
      A = "4",
      B = "3",
      C = "2",
      D = "1"
    },
    Answer = "C"
  },
  [20141] = {
    ID = 20141,
    Question = "地壳下面主要由致密的造岩物质构成,这是地球内部体积最大,质量最大的地球的中间层,叫什么?",
    Option = {
      A = "地壳",
      B = "地核",
      C = "地面",
      D = "地幔"
    },
    Answer = "D"
  },
  [20142] = {
    ID = 20142,
    Question = "德国气象学家阿尔弗雷德·魏格纳提出中生代地球表面存在一个泛大陆后来分裂,经过2亿年的漂移形成现在的海洋和陆地的学说是?",
    Option = {
      A = "摆动学说",
      B = "种质学说",
      C = "归还学说",
      D = "大陆漂移学说"
    },
    Answer = "D"
  },
  [20143] = {
    ID = 20143,
    Question = "声源体发生振动会引起四周空气振荡,那种振荡方式是什么? ",
    Option = {
      A = "声波",
      B = "音波",
      C = "震荡波",
      D = "自动波"
    },
    Answer = "A"
  },
  [20144] = {
    ID = 20144,
    Question = "春联起源于什么? ",
    Option = {
      A = "道符",
      B = "桃符",
      C = "八卦",
      D = "门铃"
    },
    Answer = "B"
  },
  [20145] = {
    ID = 20145,
    Question = "清明起源于何时? ",
    Option = {
      A = "三国",
      B = "春秋战国",
      C = "西楚",
      D = "西汉"
    },
    Answer = "B"
  },
  [20146] = {
    ID = 20146,
    Question = "化学元素周期表最后一个元素是什么?",
    Option = {
      A = "氮",
      B = "氧",
      C = "汞",
      D = "铹"
    },
    Answer = "D"
  },
  [20147] = {
    ID = 20147,
    Question = "创立年号同时也是中国第一个使用年号的皇帝是谁?",
    Option = {
      A = "汉武帝",
      B = "光武帝",
      C = "昭烈帝",
      D = "秦始皇"
    },
    Answer = "A"
  },
  [20148] = {
    ID = 20148,
    Question = "三藏是佛教典籍的三种形态,分别是经藏,律藏和什么? ",
    Option = {
      A = "诗藏",
      B = "词藏",
      C = "论藏",
      D = "佛藏"
    },
    Answer = "C"
  },
  [20149] = {
    ID = 20149,
    Question = "西游记属于古代小说中的什么主义流派? ",
    Option = {
      A = "现实主义",
      B = "自然主义",
      C = "古典主义",
      D = "浪漫主义"
    },
    Answer = "D"
  },
  [20150] = {
    ID = 20150,
    Question = "地球表面附近的物体,在仅受重力作用时具有的加速度叫做什么?",
    Option = {
      A = "重力加速度",
      B = "重力加传感",
      C = "传感加速度",
      D = "重力加时间"
    },
    Answer = "A"
  },
  [20151] = {
    ID = 20151,
    Question = "满汉全席是原官场中举办宴会时满人和汉人合座的一种全席,分多少天吃完?",
    Option = {
      A = "3",
      B = "4",
      C = "5",
      D = "6"
    },
    Answer = "A"
  },
  [20152] = {
    ID = 20152,
    Question = "脐带血是一种非常重要的人类生物资源,血中的什么可以用来治疗多种血液系统疾病和免疫系统疾病?",
    Option = {
      A = "造血干细胞",
      B = "成体干细胞",
      C = "肌肉干细胞",
      D = "神经干细胞"
    },
    Answer = "A"
  },
  [20153] = {
    ID = 20153,
    Question = "对流层中随着高度上升温度是下降还是上升?",
    Option = {
      A = "上升",
      B = "下降",
      C = "不变",
      D = "不可控"
    },
    Answer = "B"
  },
  [20154] = {
    ID = 20154,
    Question = "平流层中随高度的上升温度是上升还是下降?",
    Option = {
      A = "下降",
      B = "上升",
      C = "不变",
      D = "不可控"
    },
    Answer = "B"
  },
  [20155] = {
    ID = 20155,
    Question = "古有“清明节”前一天为寒食节一说,相传起源于春秋战国时期晋文公悼念介子推的什么事迹? ",
    Option = {
      A = "老马识途",
      B = "负荆请罪",
      C = "割股充饥",
      D = "窃符救赵"
    },
    Answer = "C"
  },
  [20156] = {
    ID = 20156,
    Question = "寒食节是纪念谁的? ",
    Option = {
      A = "孔子",
      B = "项羽",
      C = "介之推",
      D = "秦始皇"
    },
    Answer = "C"
  },
  [20157] = {
    ID = 20157,
    Question = "吴承恩的《射阳先生存稿》一共有多少卷? ",
    Option = {
      A = "1",
      B = "2",
      C = "3",
      D = "4"
    },
    Answer = "D"
  },
  [20158] = {
    ID = 20158,
    Question = "满汉全席的万寿宴是清朝帝王的什么大宴?",
    Option = {
      A = "寿诞宴",
      B = "鸿门宴",
      C = "文学宴",
      D = "雅士宴"
    },
    Answer = "A"
  },
  [20159] = {
    ID = 20159,
    Question = "秦始皇下令李斯进行文字整理工作,创造出来的新文字作为官方规范文字,叫什么?",
    Option = {
      A = "棣书",
      B = "小篆",
      C = "行书",
      D = "黑体"
    },
    Answer = "B"
  },
  [20160] = {
    ID = 20160,
    Question = "“千呼万唤始出来”下一句是什么?",
    Option = {
      A = "欲饮琵琶马上催",
      B = "犹抱琵琶半遮面",
      C = "烟花三月下扬州",
      D = "江枫渔火对愁眠"
    },
    Answer = "B"
  },
  [20161] = {
    ID = 20161,
    Question = "碧螺春属于什么茶?",
    Option = {
      A = "红茶",
      B = "绿茶",
      C = "黑茶",
      D = "菊花茶"
    },
    Answer = "B"
  },
  [20162] = {
    ID = 20162,
    Question = "小熊星座中最亮的一颗恒星是什么星?",
    Option = {
      A = "猎户星",
      B = "北极星",
      C = "天狼星",
      D = "大犬星"
    },
    Answer = "B"
  },
  [20163] = {
    ID = 20163,
    Question = "杨家将的第一代名将是谁?",
    Option = {
      A = "杨泰",
      B = "杨永",
      C = "杨业",
      D = "杨贵"
    },
    Answer = "C"
  },
  [20164] = {
    ID = 20164,
    Question = "七夕起源于什么时候? ",
    Option = {
      A = "汉代",
      B = "现代",
      C = "清代",
      D = "明代"
    },
    Answer = "A"
  },
  [20165] = {
    ID = 20165,
    Question = "武则天的尊号是什么? ",
    Option = {
      A = "则天武圣皇帝",
      B = "则天大胜皇帝",
      C = "则天大圣皇帝",
      D = "则天大圣皇后"
    },
    Answer = "C"
  },
  [20166] = {
    ID = 20166,
    Question = "盂兰盆节又被称作?",
    Option = {
      A = "中秋节",
      B = "清明节",
      C = "元旦节",
      D = "中元节"
    },
    Answer = "D"
  },
  [20167] = {
    ID = 20167,
    Question = "“竹外桃花三两枝”下一句是什么?",
    Option = {
      A = "春江水暖鸭先知",
      B = "乌衣巷口夕阳斜",
      C = "客舍青青柳色新",
      D = "一片孤城万仞山"
    },
    Answer = "A"
  },
  [20168] = {
    ID = 20168,
    Question = "中国华北地区旧石器时代晚期的人类化石被称为什么人?",
    Option = {
      A = "元谋人",
      B = "山顶洞人",
      C = "蓝田人",
      D = "河姆渡人"
    },
    Answer = "B"
  },
  [20169] = {
    ID = 20169,
    Question = "黄河的发源地位于青海哪里?",
    Option = {
      A = "昆仑山",
      B = "巴颜喀拉山",
      C = "唐古拉山",
      D = "冈底斯山"
    },
    Answer = "B"
  },
  [20170] = {
    ID = 20170,
    Question = "哪位伟大的航海家发现了美洲大陆?",
    Option = {
      A = "郑和",
      B = "麦哲伦",
      C = "哥伦布",
      D = "达迦马"
    },
    Answer = "C"
  },
  [20171] = {
    ID = 20171,
    Question = "宋朝,徽,钦二帝同时被金国士兵掳去,被封为昏德公,昏德侯的事件历史上称为什么?",
    Option = {
      A = "甲申国难",
      B = "甲午海战",
      C = "靖康之耻",
      D = "鸦片战争"
    },
    Answer = "C"
  },
  [20172] = {
    ID = 20172,
    Question = "满汉全席中的千叟宴源于清朝哪个皇帝?",
    Option = {
      A = "顺治",
      B = "雍正",
      C = "康熙",
      D = "乾隆"
    },
    Answer = "C"
  },
  [20173] = {
    ID = 20173,
    Question = "天然气是一种多组分的混合气体,主要成分是什么?",
    Option = {
      A = "乙烷",
      B = "丙烷",
      C = "丁烷",
      D = "烷烃"
    },
    Answer = "D"
  },
  [20174] = {
    ID = 20174,
    Question = "上官婉儿被唐中宗封为什么? ",
    Option = {
      A = "昭容",
      B = "昭儿",
      C = "昭君",
      D = "昭妃"
    },
    Answer = "A"
  },
  [20175] = {
    ID = 20175,
    Question = "谁趁武则天年老病危,拥立中宗复位,重新建立唐朝? ",
    Option = {
      A = "张柬之",
      B = "姚元之",
      C = "桓彦范",
      D = "敬晖"
    },
    Answer = "A"
  },
  [20176] = {
    ID = 20176,
    Question = "武则天在位期间创立了殿试和什么制度? ",
    Option = {
      A = "童试",
      B = "武举",
      C = "乡试",
      D = "会试"
    },
    Answer = "B"
  },
  [20177] = {
    ID = 20177,
    Question = "一片青草地,猜一花?",
    Option = {
      A = "桃花",
      B = "梅花",
      C = "菊花",
      D = "兰花"
    },
    Answer = "B"
  },
  [20178] = {
    ID = 20178,
    Question = "埃及最大的金字塔是哪个国王的陵墓?",
    Option = {
      A = "孟卡拉",
      B = "卡赫吉",
      C = "哈弗拉",
      D = "胡夫"
    },
    Answer = "D"
  },
  [20179] = {
    ID = 20179,
    Question = "满汉全席中清宫内廷按固定的年节时令而设的筵席被成为什么? ",
    Option = {
      A = "鸿门宴",
      B = "延寿宴",
      C = "雅士宴",
      D = "节令宴"
    },
    Answer = "D"
  },
  [20180] = {
    ID = 20180,
    Question = "来自于宇宙中的一种具有相当大能量的带电粒子流称为什么?",
    Option = {
      A = "宇宙射线",
      B = "宇宙直线",
      C = "宇宙折线",
      D = "宇宙米线"
    },
    Answer = "A"
  },
  [20181] = {
    ID = 20181,
    Question = "皇帝穿的龙袍又称什么? ",
    Option = {
      A = "龙被",
      B = "龙衮",
      C = "龙甲",
      D = "龙衣"
    },
    Answer = "B"
  },
  [20182] = {
    ID = 20182,
    Question = "唐高宗李治和武则天的合葬陵是什么陵? ",
    Option = {
      A = "名景陵",
      B = "乾陵",
      C = "宋陵",
      D = "明孝陵"
    },
    Answer = "B"
  },
  [20183] = {
    ID = 20183,
    Question = "魏晋最为特殊的“援道入儒,儒道合流”的意识形态是什么? ",
    Option = {
      A = "数学",
      B = "玄学",
      C = "物理学",
      D = "戏剧学"
    },
    Answer = "B"
  },
  [20184] = {
    ID = 20184,
    Question = "五胡指匈奴,羯,氐,羌和什么?",
    Option = {
      A = "西南夷",
      B = "南平僚",
      C = "鲜卑",
      D = "女真"
    },
    Answer = "C"
  },
  [20185] = {
    ID = 20185,
    Question = "武则天前后执政近半个世纪,上承“贞观之治”下启“开元盛世”史称为什么历史功绩? ",
    Option = {
      A = "北伐匈奴",
      B = "沟通水路",
      C = "贞观遗风",
      D = "统一货币"
    },
    Answer = "C"
  },
  [20186] = {
    ID = 20186,
    Question = "杜甫的诗词作品“三别”分别是《新婚别》《垂老别》和什么?",
    Option = {
      A = "有家别",
      B = "人家别",
      C = "对家别",
      D = "无家别"
    },
    Answer = "D"
  },
  [20187] = {
    ID = 20187,
    Question = "煤根据煤化程度的不同,可分为泥炭,褐煤,烟煤和什么四类?",
    Option = {
      A = "泥煤",
      B = "草泥煤",
      C = "有烟煤",
      D = "无烟煤"
    },
    Answer = "D"
  },
  [20188] = {
    ID = 20188,
    Question = "冬季夜空最亮的一颗恒星是?",
    Option = {
      A = "天狼星",
      B = "猎户星",
      C = "大犬星",
      D = "北极星"
    },
    Answer = "A"
  },
  [20189] = {
    ID = 20189,
    Question = "长江是世界第几长河? ",
    Option = {
      A = "2",
      B = "3",
      C = "5",
      D = "4"
    },
    Answer = "B"
  },
  [20190] = {
    ID = 20190,
    Question = "北京人又称北京猿人,正式名称是什么?",
    Option = {
      A = "中国人猿北京种",
      B = "中国猿人北京种",
      C = "中国北京种猿人",
      D = "中国北京种人猿"
    },
    Answer = "B"
  },
  [20191] = {
    ID = 20191,
    Question = "魏晋风流为文化史上的专有名词,也称作什么? ",
    Option = {
      A = "魏晋风流",
      B = "魏晋风气",
      C = "魏晋风度",
      D = "魏晋风潮"
    },
    Answer = "C"
  },
  [20192] = {
    ID = 20192,
    Question = "“横眉冷对千夫指”下一句是什么? ",
    Option = {
      A = "一片孤城万仞山",
      B = "千朵万朵压枝低",
      C = "烟波江上使人愁",
      D = "俯首甘为孺子牛"
    },
    Answer = "D"
  },
  [20193] = {
    ID = 20193,
    Question = "北京大学的校园在建国前是什么教会大学的校园?",
    Option = {
      A = "葡京大学",
      B = "研京大学",
      C = "闫京大学",
      D = "燕京大学"
    },
    Answer = "D"
  },
  [20194] = {
    ID = 20194,
    Question = "草履虫是什么动物?",
    Option = {
      A = "单细胞动物",
      B = "多细胞动物",
      C = "刺细胞动物",
      D = "单细胞植物"
    },
    Answer = "A"
  },
  [20195] = {
    ID = 20195,
    Question = "为了确定物体的位置和描述物体的运动而被选作参考的物体或物体系称为什么? ",
    Option = {
      A = "参考物",
      B = "参照物",
      C = "动物",
      D = "死物"
    },
    Answer = "B"
  },
  [20196] = {
    ID = 20196,
    Question = "编钟是我国古代的一种打击乐器,用什么制成?",
    Option = {
      A = "竹子",
      B = "青铜",
      C = "石头",
      D = "布匹"
    },
    Answer = "B"
  },
  [20197] = {
    ID = 20197,
    Question = "元朝的创始皇帝是谁?",
    Option = {
      A = "忽必烈",
      B = "铁木耳",
      C = "铁木真",
      D = "蒙哥"
    },
    Answer = "A"
  },
  [20198] = {
    ID = 20198,
    Question = "在太阳的光球层上,有一些旋涡状的气流,像是一个浅盘,中间下凹,看起来是黑色的,这些旋涡状气流是?",
    Option = {
      A = "太阳黑子",
      B = "太阳粒子",
      C = "太阳棋子",
      D = "太阳石子"
    },
    Answer = "A"
  },
  [20199] = {
    ID = 20199,
    Question = "黄山山体主要由什么岩石构成?",
    Option = {
      A = "侵入岩",
      B = "花岗岩",
      C = "玄武岩",
      D = "安山岩"
    },
    Answer = "B"
  },
  [20200] = {
    ID = 20200,
    Question = "相传孔子有多少弟子?",
    Option = {
      A = "两千",
      B = "三千",
      C = "四千",
      D = "五千"
    },
    Answer = "B"
  },
  [20201] = {
    ID = 20201,
    Question = "根据牛顿第三运动定律,两个物体之间的作用力和反作用力,在同一条直线上,大小相等,方向怎样?",
    Option = {
      A = "相同",
      B = "相交",
      C = "相反",
      D = "相连"
    },
    Answer = "C"
  },
  [20202] = {
    ID = 20202,
    Question = "作家舒庆春的笔名是什么? ",
    Option = {
      A = "鲁迅",
      B = "巴金",
      C = "老舍",
      D = "冰心"
    },
    Answer = "C"
  },
  [20203] = {
    ID = 20203,
    Question = "将100颗绿豆和100颗黄豆混在一起又分为AB,需要几次才能是A堆中黄豆和B堆中的绿豆相等呢? ",
    Option = {
      A = "3",
      B = "2",
      C = "1",
      D = "4"
    },
    Answer = "C"
  },
  [20204] = {
    ID = 20204,
    Question = "唐玄宗设立的音乐学校叫什么?",
    Option = {
      A = "果园",
      B = "花园",
      C = "乐园",
      D = "梨园"
    },
    Answer = "D"
  },
  [20205] = {
    ID = 20205,
    Question = "“太一贡兮天马下,沾赤汗兮末流诸,骋容与兮万里,今安匹兮龙为友,”的确作者是谁? ",
    Option = {
      A = "高武帝",
      B = "汉武帝",
      C = "章帝",
      D = "和帝"
    },
    Answer = "B"
  },
  [20206] = {
    ID = 20206,
    Question = "长寿龟的学名叫什么?",
    Option = {
      A = "黄喉拟水龟",
      B = "中华草龟",
      C = "巴西红鳄龟",
      D = "乌拉龟"
    },
    Answer = "B"
  },
  [20207] = {
    ID = 20207,
    Question = "1968年因为已辞世而无法成为我国第一位获得诺贝尔文学奖的作家是?",
    Option = {
      A = "鲁迅",
      B = "老舍",
      C = "巴金",
      D = "冰心"
    },
    Answer = "B"
  },
  [20208] = {
    ID = 20208,
    Question = "世界第二高的山峰是什么?",
    Option = {
      A = "珠穆朗玛峰",
      B = "干城章嘉峰",
      C = "乔戈里峰",
      D = "希夏帮马峰"
    },
    Answer = "C"
  },
  [20209] = {
    ID = 20209,
    Question = "“匈奴未灭,何以家为”是西汉哪位名将的名句?",
    Option = {
      A = "公孙敖",
      B = "李敢",
      C = "霍去病",
      D = "韩信"
    },
    Answer = "C"
  },
  [20210] = {
    ID = 20210,
    Question = "篮球运动中后卫分为控球后卫和什么?",
    Option = {
      A = "助攻后卫",
      B = "篮板后卫",
      C = "得分后卫",
      D = "抢断后卫"
    },
    Answer = "C"
  },
  [20211] = {
    ID = 20211,
    Question = "光由太阳到达地球大约需要多少分钟?",
    Option = {
      A = "15分钟",
      B = "26分钟",
      C = "37分钟",
      D = "8分钟"
    },
    Answer = "D"
  },
  [20212] = {
    ID = 20212,
    Question = "钱永健获得了诺贝尔什么奖? ",
    Option = {
      A = "化学",
      B = "和平",
      C = "物理",
      D = "经济"
    },
    Answer = "A"
  },
  [20213] = {
    ID = 20213,
    Question = "北京大学的原名是什么? ",
    Option = {
      A = "北京大学堂",
      B = "北平大学堂",
      C = "京师大学堂",
      D = "京都大学堂"
    },
    Answer = "C"
  },
  [20214] = {
    ID = 20214,
    Question = "大清帝国和俄罗斯帝国签定的第一个不平等条约是? ",
    Option = {
      A = "虎门条约",
      B = "南京条约",
      C = "黄埔条约",
      D = "尼布楚条约"
    },
    Answer = "D"
  },
  [20215] = {
    ID = 20215,
    Question = "太阳的主要气体成分?",
    Option = {
      A = "氧",
      B = "氮",
      C = "氰",
      D = "氢"
    },
    Answer = "D"
  },
  [20216] = {
    ID = 20216,
    Question = "第一次鸦片战争发生在哪一年?",
    Option = {
      A = "1840",
      B = "1850",
      C = "1860",
      D = "1870"
    },
    Answer = "A"
  },
  [20217] = {
    ID = 20217,
    Question = "相对论是关于时空和什么的理论? ",
    Option = {
      A = "动力",
      B = "协力",
      C = "引力",
      D = "发力"
    },
    Answer = "C"
  },
  [20218] = {
    ID = 20218,
    Question = "嵩山少林寺位于“五岳”中的哪一岳?",
    Option = {
      A = "东岳",
      B = "南岳",
      C = "西岳",
      D = "中岳"
    },
    Answer = "D"
  },
  [20219] = {
    ID = 20219,
    Question = "浮力的作用点叫什么?",
    Option = {
      A = "浮心",
      B = "浮华",
      C = "浮点",
      D = "浮夸"
    },
    Answer = "A"
  },
  [20220] = {
    ID = 20220,
    Question = "毕达哥拉斯定理又叫什么?",
    Option = {
      A = "勾股定理",
      B = "手表定理",
      C = "韦奇定理",
      D = "格瑞斯特定理"
    },
    Answer = "A"
  },
  [20221] = {
    ID = 20221,
    Question = "中国史上第一篇白话小说是鲁迅先生的什么?",
    Option = {
      A = "狂人日记",
      B = "阿Q正传",
      C = "白光",
      D = "明天"
    },
    Answer = "A"
  },
  [20222] = {
    ID = 20222,
    Question = "无脊椎动物占动物总类数的百分之多少?",
    Option = {
      A = "94",
      B = "95",
      C = "85",
      D = "84"
    },
    Answer = "B"
  },
  [20223] = {
    ID = 20223,
    Question = "哪位华人被国际权威杂志《黑带》所列为世界七大武术名家?",
    Option = {
      A = "陈真",
      B = "霍元甲",
      C = "叶问",
      D = "李小龙"
    },
    Answer = "D"
  },
  [20224] = {
    ID = 20224,
    Question = "构成自然界各种元素的基本单位.化学变化中的最小粒子是什么? ",
    Option = {
      A = "原子",
      B = "微子",
      C = "衲子",
      D = "辛子"
    },
    Answer = "A"
  },
  [20225] = {
    ID = 20225,
    Question = "三氧化二砷即是什么?",
    Option = {
      A = "砒霜",
      B = "罂粟",
      C = "雄黄",
      D = "鸦胆子"
    },
    Answer = "A"
  },
  [20226] = {
    ID = 20226,
    Question = "宋太祖使用和平手段,不伤君臣和气就解除了大臣的军权威胁,成功地防止了军队的政变这一事件称为什么? ",
    Option = {
      A = "昭君出塞",
      B = "焚书坑儒",
      C = "杯酒释兵权",
      D = "破釜沉舟"
    },
    Answer = "C"
  },
  [20227] = {
    ID = 20227,
    Question = "丁肇中先生在1976年获得诺贝尔什么奖? ",
    Option = {
      A = "化学",
      B = "经济",
      C = "物理",
      D = "和平"
    },
    Answer = "C"
  },
  [20228] = {
    ID = 20228,
    Question = "三国魏时期以“弃经典而尚老庄,蔑礼法而嵩放达”闻名的七位名士被人称为什么? ",
    Option = {
      A = "竹林七贤",
      B = "树林七贤",
      C = "森林七贤",
      D = "密林七贤"
    },
    Answer = "A"
  },
  [20229] = {
    ID = 20229,
    Question = "“月既不解饮,影徒随我身” 的作者是谁?",
    Option = {
      A = "杜甫",
      B = "李白",
      C = "王维",
      D = "王勃"
    },
    Answer = "B"
  },
  [20230] = {
    ID = 20230,
    Question = "戊戌变法又名? ",
    Option = {
      A = "吴起变法",
      B = "维新变法",
      C = "李悝变法",
      D = "商鞅变法"
    },
    Answer = "B"
  },
  [20231] = {
    ID = 20231,
    Question = "大气中最多什么气体?",
    Option = {
      A = "氧气",
      B = "氢气",
      C = "氮气",
      D = "漏气"
    },
    Answer = "C"
  },
  [20232] = {
    ID = 20232,
    Question = "哈雷彗星多少年出现一次?",
    Option = {
      A = "73",
      B = "74",
      C = "75",
      D = "76"
    },
    Answer = "D"
  },
  [20233] = {
    ID = 20233,
    Question = "矩形的面积等于长乘以什么? ",
    Option = {
      A = "高",
      B = "宽",
      C = "厚",
      D = "薄"
    },
    Answer = "B"
  },
  [20234] = {
    ID = 20234,
    Question = "商鞅主张的是哪家学说?",
    Option = {
      A = "墨家",
      B = "法家",
      C = "孟家",
      D = "孔家"
    },
    Answer = "B"
  },
  [20235] = {
    ID = 20235,
    Question = "位于四川省乐山市的凌云大佛又名什么?",
    Option = {
      A = "金鼎大佛",
      B = "中原大佛",
      C = "乐山大佛",
      D = "南山大佛"
    },
    Answer = "C"
  },
  [20236] = {
    ID = 20236,
    Question = "莫高窟俗称什么? ",
    Option = {
      A = "千佛窟",
      B = "千佛地",
      C = "千佛洞",
      D = "千佛座"
    },
    Answer = "C"
  },
  [20237] = {
    ID = 20237,
    Question = "苏辙在文学上最擅长写什么?",
    Option = {
      A = "小说",
      B = "戏剧",
      C = "散文",
      D = "英文"
    },
    Answer = "C"
  },
  [20238] = {
    ID = 20238,
    Question = "司马迁是什么朝代的史学家,文学家,思想家?",
    Option = {
      A = "西楚",
      B = "晚唐",
      C = "西汉",
      D = "三国"
    },
    Answer = "C"
  },
  [20239] = {
    ID = 20239,
    Question = "中国依靠自己的力量掌握的核技术和空间技术的统称为什么?",
    Option = {
      A = "三弹一星",
      B = "两弹三星",
      C = "三弹四星",
      D = "两弹一星"
    },
    Answer = "D"
  },
  [20240] = {
    ID = 20240,
    Question = "京杭运河北起北京,南到哪里?",
    Option = {
      A = "杭州",
      B = "梧州",
      C = "广州",
      D = "吴洲"
    },
    Answer = "A"
  },
  [20241] = {
    ID = 20241,
    Question = "苏轼的父亲叫什么?",
    Option = {
      A = "苏序",
      B = "苏洵",
      C = "苏东坡",
      D = "苏辙"
    },
    Answer = "B"
  },
  [20242] = {
    ID = 20242,
    Question = "长江三角洲是长江和什么江在入海口冲积成的三角洲?",
    Option = {
      A = "珠江",
      B = "辽江",
      C = "钱塘江",
      D = "松花江"
    },
    Answer = "C"
  },
  [20243] = {
    ID = 20243,
    Question = "苏轼的弟弟是谁?",
    Option = {
      A = "苏序",
      B = "苏杭",
      C = "苏东坡",
      D = "苏辙"
    },
    Answer = "D"
  },
  [20244] = {
    ID = 20244,
    Question = "欧阳修是北宋文坛上什么运动的领导者?",
    Option = {
      A = "辛亥革命",
      B = "土地革命",
      C = "国民大革命",
      D = "诗文革新"
    },
    Answer = "D"
  },
  [20245] = {
    ID = 20245,
    Question = "春秋五霸之首齐桓公叫什么名字?",
    Option = {
      A = "姜小黑",
      B = "姜小齐",
      C = "姜小白",
      D = "姜小恒"
    },
    Answer = "C"
  },
  [20246] = {
    ID = 20246,
    Question = "唐明皇是谁?",
    Option = {
      A = "李渊",
      B = "李世民",
      C = "李隆基",
      D = "李治"
    },
    Answer = "C"
  },
  [20247] = {
    ID = 20247,
    Question = "兵马俑被誉为世界第几大奇迹?",
    Option = {
      A = "6",
      B = "7",
      C = "8",
      D = "9"
    },
    Answer = "C"
  },
  [20248] = {
    ID = 20248,
    Question = "中国古代传说中创立八卦的人是谁? ",
    Option = {
      A = "邵雍",
      B = "朱熹",
      C = "张政烺",
      D = "伏羲"
    },
    Answer = "D"
  },
  [20249] = {
    ID = 20249,
    Question = "我国第一大油田是什么? ",
    Option = {
      A = "中原油田",
      B = "华北油田",
      C = "胜利油田",
      D = "大庆油田"
    },
    Answer = "D"
  },
  [20250] = {
    ID = 20250,
    Question = "中国春节时,传说百姓们用爆竹来驱赶的怪兽是什么?",
    Option = {
      A = "年兽",
      B = "妖兽",
      C = "魔兽",
      D = "古兽"
    },
    Answer = "A"
  },
  [20251] = {
    ID = 20251,
    Question = "春秋时期我国从什么社会向封建社会转化了?",
    Option = {
      A = "奴隶社会",
      B = "民主社会",
      C = "世袭社会",
      D = "腐败社会"
    },
    Answer = "A"
  },
  [20252] = {
    ID = 20252,
    Question = "中国古代神话中,与颛顼争为帝,一怒之下撞到了不周山的古神是谁?",
    Option = {
      A = "蚩尤",
      B = "共工",
      C = "伏羲",
      D = "夸父"
    },
    Answer = "B"
  },
  [20253] = {
    ID = 20253,
    Question = "中国第一大盆地是什么?",
    Option = {
      A = "准噶尔盆地",
      B = "柴达木盆地",
      C = "塔里木盆地",
      D = "四川盆地"
    },
    Answer = "C"
  },
  [20254] = {
    ID = 20254,
    Question = "世界第二大沙漠是?",
    Option = {
      A = "戈壁沙漠",
      B = "撒哈拉沙漠",
      C = "蓝湖沙漠",
      D = "阿拉伯沙漠"
    },
    Answer = "D"
  },
  [20255] = {
    ID = 20255,
    Question = "地球的天然卫星是什么?",
    Option = {
      A = "水星",
      B = "月亮",
      C = "金星",
      D = "猩猩"
    },
    Answer = "B"
  },
  [20256] = {
    ID = 20256,
    Question = "大泽乡起义的领导者是陈胜和谁?",
    Option = {
      A = "吴用",
      B = "吴广",
      C = "吴刚",
      D = "吴起"
    },
    Answer = "B"
  },
  [20257] = {
    ID = 20257,
    Question = "物体的单位面积上受到的压力的大小叫什么?",
    Option = {
      A = "密度",
      B = "动量",
      C = "压强",
      D = "冲量"
    },
    Answer = "C"
  },
  [20258] = {
    ID = 20258,
    Question = "我国第二大油田是什么?",
    Option = {
      A = "华北油田",
      B = "中原油田",
      C = "胜利油田",
      D = "大庆油田"
    },
    Answer = "C"
  },
  [20259] = {
    ID = 20259,
    Question = "“吾爱孟夫子,风流天下闻”中的孟夫子指得是谁?",
    Option = {
      A = "孟子",
      B = "孟云卿",
      C = "孟郊",
      D = "孟浩然"
    },
    Answer = "D"
  },
  [20260] = {
    ID = 20260,
    Question = "“念天地之悠悠”下一句是什么?",
    Option = {
      A = "独怆然而涕下",
      B = "云连雁宕仙家",
      C = "惯看山鸟山花",
      D = "不知何处天边"
    },
    Answer = "A"
  },
  [20261] = {
    ID = 20261,
    Question = "“乡音无改鬓毛衰”上一句是什么?",
    Option = {
      A = "窗含西岭千秋雪",
      B = "少小离家老大回",
      C = "留连戏蝶时时舞",
      D = "儿童散学归来早"
    },
    Answer = "B"
  },
  [20262] = {
    ID = 20262,
    Question = "“战士军前半死生”下一句是什么?",
    Option = {
      A = "西出阳关无故人",
      B = "烈火焚烧若等闲",
      C = "万马齐暗究可哀",
      D = "美人帐下犹歌舞"
    },
    Answer = "D"
  },
  [20263] = {
    ID = 20263,
    Question = "“人生在世不称意”下一句是什么?",
    Option = {
      A = "便下襄阳向洛阳",
      B = "明月何时照我还",
      C = "拂堤杨柳醉春烟",
      D = "明朝散发弄扁舟"
    },
    Answer = "D"
  },
  [20264] = {
    ID = 20264,
    Question = "“绿蚁新醅酒”下一句是什么?",
    Option = {
      A = "红泥小火炉",
      B = "歌声振林樾",
      C = "莲叶何田田",
      D = "凌寒独自开"
    },
    Answer = "A"
  },
  [20265] = {
    ID = 20265,
    Question = "白居易之诗“缓歌曼舞凝丝竹,尽日君王看不足”写的是唐代哪位妃嫔? ",
    Option = {
      A = "武则天",
      B = "杨玉环",
      C = "上官婉儿",
      D = "徐婕妤 "
    },
    Answer = "B"
  },
  [20266] = {
    ID = 20266,
    Question = "“忽如一夜春风来”下一句是什么?",
    Option = {
      A = "湖光秋月两相和",
      B = "春宵一刻值千金",
      C = "千树万树梨花开",
      D = "泉眼无声惜细流"
    },
    Answer = "C"
  },
  [20267] = {
    ID = 20267,
    Question = "“下终南山过斛斯山人宿置酒”的作者是谁?",
    Option = {
      A = "杜甫",
      B = "王维",
      C = "王勃",
      D = "李白"
    },
    Answer = "D"
  },
  [20268] = {
    ID = 20268,
    Question = "“黄河远上白云间”下一句是什么?",
    Option = {
      A = "一片孤城万仞山",
      B = "不破楼兰终不还",
      C = "子规声里雨如烟",
      D = "南望王师又一年"
    },
    Answer = "A"
  },
  [20269] = {
    ID = 20269,
    Question = "“王孙自可留”一句中的“王孙”是指谁? ",
    Option = {
      A = "王之涣",
      B = "王维",
      C = "王昌龄",
      D = "王勃"
    },
    Answer = "B"
  },
  [20270] = {
    ID = 20270,
    Question = "亚历山大大帝是古代什么国家的国王?",
    Option = {
      A = "波斯",
      B = "叙利亚",
      C = "马其顿",
      D = "伊苏"
    },
    Answer = "C"
  },
  [20271] = {
    ID = 20271,
    Question = "“春草年年绿”下一句是什么? ",
    Option = {
      A = "复照青苔上",
      B = "春来发几枝",
      C = "寒梅著花未",
      D = "王孙归不归"
    },
    Answer = "D"
  },
  [20272] = {
    ID = 20272,
    Question = "希腊神话中为民盗火的是谁？",
    Option = {
      A = "赫菲斯托斯",
      B = "狄俄尼索斯",
      C = "赫拉克勒斯",
      D = "普罗米修斯"
    },
    Answer = "D"
  },
  [20273] = {
    ID = 20273,
    Question = "“君问归期未有期”下一句是什么?",
    Option = {
      A = "巴山夜雨涨秋池",
      B = "惟见长江天际流",
      C = "白云千载空悠悠",
      D = "牧童遥指杏花村"
    },
    Answer = "A"
  },
  [20274] = {
    ID = 20274,
    Question = "“但见新人笑”下一句是什么?",
    Option = {
      A = "那闻旧人哭",
      B = "后不见来者",
      C = "独钓寒江雪",
      D = "缘愁似个长"
    },
    Answer = "A"
  },
  [20275] = {
    ID = 20275,
    Question = "“绝代有佳人”下一句是什么?",
    Option = {
      A = "幽居在空谷",
      B = "后不见来者",
      C = "独钓寒江雪",
      D = "缘愁似个长"
    },
    Answer = "A"
  },
  [20276] = {
    ID = 20276,
    Question = "“来往不逢人”下一句是什么?",
    Option = {
      A = "春风花草香",
      B = "长歌楚天碧",
      C = "独钓寒江雪",
      D = "鱼戏莲叶东"
    },
    Answer = "B"
  },
  [20277] = {
    ID = 20277,
    Question = "两河流域文明又称什么?",
    Option = {
      A = "哈苏纳文明",
      B = "美索不达米亚文明",
      C = "哈拉夫文明",
      D = "欧贝德文明"
    },
    Answer = "B"
  },
  [20278] = {
    ID = 20278,
    Question = "“一声何满子” 下一句是什么?",
    Option = {
      A = "何处得秋霜",
      B = "众鸟高飞尽",
      C = "双泪落君前",
      D = "不敢高声语"
    },
    Answer = "C"
  },
  [20279] = {
    ID = 20279,
    Question = "相传泰阿是春秋时期干将和谁铸造的?",
    Option = {
      A = "赵奢",
      B = "廉颇",
      C = "欧冶子",
      D = "孙膑"
    },
    Answer = "C"
  },
  [20280] = {
    ID = 20280,
    Question = "名剑湛泸是哪位铸剑师所铸?",
    Option = {
      A = "欧冶子",
      B = "干将",
      C = "赵奢",
      D = "廉颇"
    },
    Answer = "A"
  },
  [20281] = {
    ID = 20281,
    Question = "“正是江南好风景”下一句是什么? ",
    Option = {
      A = "落花时节又逢君",
      B = "惟见长江天际流",
      C = "白云千载空悠悠",
      D = "牧童遥指杏花村"
    },
    Answer = "A"
  },
  [20282] = {
    ID = 20282,
    Question = "世界上最早采用全身麻醉方法的医生是谁?",
    Option = {
      A = "华佗",
      B = "扁鹊",
      C = "李时珍",
      D = "神农"
    },
    Answer = "A"
  },
  [20283] = {
    ID = 20283,
    Question = "“别有幽愁暗恨生”下一句是什么?",
    Option = {
      A = "古来征战几人回",
      B = "此时无声胜有声",
      C = "春风不度玉门关",
      D = "烟波江上使人愁"
    },
    Answer = "B"
  },
  [20284] = {
    ID = 20284,
    Question = "“青青子吟”下一句是什么? ",
    Option = {
      A = "忧从中来",
      B = "久住相知",
      C = "悠悠我心",
      D = "人寿几何"
    },
    Answer = "C"
  },
  [20285] = {
    ID = 20285,
    Question = "“白也诗无敌,飘然思不群”赞扬的是哪位诗人?",
    Option = {
      A = "王翰",
      B = "骆宾王",
      C = "白居易",
      D = "李白"
    },
    Answer = "D"
  },
  [20286] = {
    ID = 20286,
    Question = "“月明星稀,乌鹊南飞”是何人所写?",
    Option = {
      A = "孙权",
      B = "陆逊",
      C = "孙策",
      D = "曹操"
    },
    Answer = "D"
  },
  [20287] = {
    ID = 20287,
    Question = "正史上施行草船借箭之计的人是谁?",
    Option = {
      A = "庞宠",
      B = "诸葛亮",
      C = "刘备",
      D = "孙权"
    },
    Answer = "D"
  },
  [20288] = {
    ID = 20288,
    Question = "“随意春芳歇”下一句是什么?",
    Option = {
      A = "王孙自可留",
      B = "何处得秋霜",
      C = "众鸟高飞尽",
      D = "大雪满弓刀"
    },
    Answer = "A"
  },
  [20289] = {
    ID = 20289,
    Question = "红拂女的丈夫是谁? ",
    Option = {
      A = "李世民",
      B = "李靖",
      C = "李邦",
      D = "李白"
    },
    Answer = "B"
  },
  [20290] = {
    ID = 20290,
    Question = "曹植字什么?",
    Option = {
      A = "子衡",
      B = "子明",
      C = "子建",
      D = "子初"
    },
    Answer = "C"
  },
  [20291] = {
    ID = 20291,
    Question = "曹丕谥号什么? ",
    Option = {
      A = "文皇帝",
      B = "武皇帝",
      C = "慈皇帝",
      D = "安皇帝"
    },
    Answer = "A"
  },
  [20292] = {
    ID = 20292,
    Question = "“钟鼓缀玉何足贵”下一句是什么? ",
    Option = {
      A = "烟花三月下扬州",
      B = "莫使金樽空对月",
      C = "但愿长醉不愿醒",
      D = "人面桃花相映红"
    },
    Answer = "C"
  },
  [20293] = {
    ID = 20293,
    Question = "太阳系第二大行星是什么?",
    Option = {
      A = "土星",
      B = "火星",
      C = "木星",
      D = "金星"
    },
    Answer = "A"
  },
  [20294] = {
    ID = 20294,
    Question = "“红豆生南国” 下一句是什么?",
    Option = {
      A = "家书抵万金",
      B = "春来发几枝",
      C = "孤舟蓑笠翁",
      D = "白发三千丈"
    },
    Answer = "B"
  },
  [20295] = {
    ID = 20295,
    Question = "太阳系第7大行星是? ",
    Option = {
      A = "水星",
      B = "火星",
      C = "木星",
      D = "金星"
    },
    Answer = "B"
  },
  [20296] = {
    ID = 20296,
    Question = "“待到重阳日”下一句是什么?",
    Option = {
      A = "何处得秋霜",
      B = "还来就菊花",
      C = "春草年年绿",
      D = "快走踏清秋"
    },
    Answer = "B"
  },
  [20297] = {
    ID = 20297,
    Question = "太阳系中的第五大行星是? ",
    Option = {
      A = "月球",
      B = "土星",
      C = "地球",
      D = "火星"
    },
    Answer = "C"
  },
  [20298] = {
    ID = 20298,
    Question = "“露从今夜白”下一句是什么?",
    Option = {
      A = "何处得秋霜",
      B = "还来就菊花",
      C = "春草年年绿",
      D = "月是故乡明"
    },
    Answer = "D"
  },
  [20299] = {
    ID = 20299,
    Question = "红细胞中含有什么,因而使血液呈红色?",
    Option = {
      A = "免疫球蛋白",
      B = "胶原蛋白",
      C = "尿蛋白",
      D = "血红蛋白"
    },
    Answer = "D"
  },
  [20300] = {
    ID = 20300,
    Question = "“西安事变”又称什么?",
    Option = {
      A = "双十一事变",
      B = "双十三事变",
      C = "双十事变",
      D = "双十二事变"
    },
    Answer = "D"
  },
  [20301] = {
    ID = 20301,
    Question = "在血管损伤后的止血过程中起着重要作用的血液细胞是什么? ",
    Option = {
      A = "血小板",
      B = "红细胞",
      C = "白细胞",
      D = "单核细胞"
    },
    Answer = "A"
  },
  [20302] = {
    ID = 20302,
    Question = "“老夫聊发少年狂,左牵黄,右擎苍”出自哪位词人之手? ",
    Option = {
      A = "苏轼",
      B = "李白",
      C = "杜甫",
      D = "王维"
    },
    Answer = "A"
  },
  [20303] = {
    ID = 20303,
    Question = "白细胞又称为什么?",
    Option = {
      A = "血红细胞",
      B = "单核细胞",
      C = "免疫细胞",
      D = "巨核细胞"
    },
    Answer = "C"
  },
  [20304] = {
    ID = 20304,
    Question = "“圆明园”是由哪位皇帝命名的?",
    Option = {
      A = "康熙",
      B = "乾隆",
      C = "雍正",
      D = "崇德"
    },
    Answer = "A"
  },
  [20305] = {
    ID = 20305,
    Question = "“冰肌玉骨”下一句是什么?",
    Option = {
      A = "自清凉无汗",
      B = "万户捣衣声",
      C = "胡窥青海湾",
      D = "妇啼一何苦"
    },
    Answer = "A"
  },
  [20306] = {
    ID = 20306,
    Question = "“大江东去,浪淘尽”下一句是什么?",
    Option = {
      A = "退咏汉女湘娥",
      B = "复道春风不还",
      C = "千古风流人物",
      D = "嫁得长安少年"
    },
    Answer = "C"
  },
  [20307] = {
    ID = 20307,
    Question = "人体最大的淋巴器官是什么?",
    Option = {
      A = "心脏",
      B = "肺部",
      C = "肝脏",
      D = "脾脏"
    },
    Answer = "D"
  },
  [20308] = {
    ID = 20308,
    Question = "“爆竹声中一岁除”下一句是什么?",
    Option = {
      A = "春风送暖入屠苏",
      B = "万条垂下绿丝绦",
      C = "白云千载空悠悠",
      D = "桃花依旧笑春风"
    },
    Answer = "A"
  },
  [20309] = {
    ID = 20309,
    Question = "最早的压岁钱也叫什么? ",
    Option = {
      A = "厌胜钱",
      B = "新岁钱",
      C = "铜钱",
      D = "春钱"
    },
    Answer = "A"
  },
  [20310] = {
    ID = 20310,
    Question = "古称正旦岁首三元的我国传统节日是什么?",
    Option = {
      A = "七夕",
      B = "春节",
      C = "腊八",
      D = "重阳"
    },
    Answer = "B"
  },
  [20311] = {
    ID = 20311,
    Question = "液态二氧化碳蒸发时吸收大量的热而凝成固体二氧化碳,俗称什么?",
    Option = {
      A = "干蒸",
      B = "干冰",
      C = "干枯",
      D = "杆菌"
    },
    Answer = "B"
  },
  [20312] = {
    ID = 20312,
    Question = "“长风破浪会有时”下一句是什么?",
    Option = {
      A = "春风送暖入屠苏",
      B = "直挂云帆济沧海",
      C = "春风又绿江南岸",
      D = "也无人惜从教坠"
    },
    Answer = "B"
  },
  [20313] = {
    ID = 20313,
    Question = "每年公历的3月5日是我国二十四节气之一的什么?",
    Option = {
      A = "谷雨",
      B = "梅雨",
      C = "惊蛰",
      D = "小雪"
    },
    Answer = "C"
  },
  [20314] = {
    ID = 20314,
    Question = "每年的3月12日是什么节日?",
    Option = {
      A = "妇女节",
      B = "青年节",
      C = "屠妖节",
      D = "植树节"
    },
    Answer = "D"
  },
  [20315] = {
    ID = 20315,
    Question = "“天阶夜色凉如水”下一句是什么?",
    Option = {
      A = "江枫渔火对愁眠",
      B = "一片孤城万仞山",
      C = "芳草萋萋鹦鹉洲",
      D = "卧看牵牛织女星"
    },
    Answer = "D"
  },
  [20316] = {
    ID = 20316,
    Question = "“爆竹声中除旧岁”下一句是什么?",
    Option = {
      A = "自在娇莺恰恰啼",
      B = "总把新桃换旧符",
      C = "人面桃花相映红",
      D = "桃花依旧笑春风"
    },
    Answer = "B"
  },
  [20317] = {
    ID = 20317,
    Question = "“古来圣贤皆寂寞”下一句是什么?",
    Option = {
      A = "白云生处有人家",
      B = "惟有饮者留其名",
      C = "烟波江上使人愁",
      D = "此地空余黄鹤楼"
    },
    Answer = "B"
  },
  [20318] = {
    ID = 20318,
    Question = "“空山不见人”下一句是什么?",
    Option = {
      A = "两小无嫌猜",
      B = "但闻人语响",
      C = "应知故乡事",
      D = "万户捣衣声"
    },
    Answer = "B"
  },
  [20319] = {
    ID = 20319,
    Question = "古代男子八九十岁称为什么? ",
    Option = {
      A = "花甲",
      B = "喜寿",
      C = "古稀",
      D = "耄耋"
    },
    Answer = "D"
  },
  [20320] = {
    ID = 20320,
    Question = "古代男子二十岁行冠礼,表示已经成人,因为还没达到壮年,故称什么?",
    Option = {
      A = "花甲",
      B = "喜寿",
      C = "古稀",
      D = "弱冠"
    },
    Answer = "D"
  },
  [20321] = {
    ID = 20321,
    Question = "诗经中的诗歌以多少言为主?",
    Option = {
      A = "4",
      B = "6",
      C = "7",
      D = "5"
    },
    Answer = "A"
  },
  [20322] = {
    ID = 20322,
    Question = "人造金刚石以什么为原料制造的?",
    Option = {
      A = "石墨",
      B = "竹炭",
      C = "钻石",
      D = "萤石"
    },
    Answer = "A"
  },
  [20323] = {
    ID = 20323,
    Question = "杜牧字什么? ",
    Option = {
      A = "鲁直",
      B = "牧之",
      C = "重光",
      D = "尚白"
    },
    Answer = "B"
  },
  [20324] = {
    ID = 20324,
    Question = "古代男子六十岁称为什么? ",
    Option = {
      A = "总角",
      B = "喜寿",
      C = "花甲",
      D = "古稀"
    },
    Answer = "C"
  },
  [20325] = {
    ID = 20325,
    Question = "玛瑙的主要化学成分是什么? ",
    Option = {
      A = "四氧化硅",
      B = "三氧化硅",
      C = "二氧化硅",
      D = "一氧化硅"
    },
    Answer = "C"
  },
  [20326] = {
    ID = 20326,
    Question = "“同居长千里,两小无嫌猜”这2句诗中哪个字是错别字? ",
    Option = {
      A = "嫌",
      B = "无",
      C = "长",
      D = "千"
    },
    Answer = "D"
  },
  [20327] = {
    ID = 20327,
    Question = "“蒹葭苍苍”下一句是什么? ",
    Option = {
      A = "忧从中来",
      B = "不可断绝",
      C = "沉吟至今",
      D = "白露为霜"
    },
    Answer = "D"
  },
  [20328] = {
    ID = 20328,
    Question = "“虢国夫人承主恩,平明骑马入宫门”中的虢国夫人和杨贵妃是什么关系? ",
    Option = {
      A = "姐妹",
      B = "母女",
      C = "主仆",
      D = "朋友"
    },
    Answer = "A"
  },
  [20329] = {
    ID = 20329,
    Question = "翡翠的主要化学成分是铝硅酸盐和什么? ",
    Option = {
      A = "钠",
      B = "铅",
      C = "镉",
      D = "铬"
    },
    Answer = "A"
  },
  [20330] = {
    ID = 20330,
    Question = "一般所称中国四大名玉分别是指岫玉、独山玉、绿松石和什么?",
    Option = {
      A = "玛瑙",
      B = "和田玉",
      C = "孔雀石",
      D = "羊脂玉"
    },
    Answer = "B"
  },
  [20331] = {
    ID = 20331,
    Question = "中国古代七十岁称为什么?",
    Option = {
      A = "总角",
      B = "喜寿",
      C = "古稀",
      D = "弱冠"
    },
    Answer = "C"
  },
  [20332] = {
    ID = 20332,
    Question = "西晋时期,皇族为了争夺政权发动的动乱被称作?",
    Option = {
      A = "安史之乱",
      B = "三藩之乱",
      C = "永嘉之乱",
      D = "八王之乱"
    },
    Answer = "D"
  },
  [20333] = {
    ID = 20333,
    Question = "“相见时难别亦难”下一句是什么? ",
    Option = {
      A = "东风无力百花残",
      B = "芳草萋萋鹦鹉洲",
      C = "客舍青青柳色新",
      D = "白云千载空悠悠"
    },
    Answer = "A"
  },
  [20334] = {
    ID = 20334,
    Question = "“返影入深林”下一句是什么? ",
    Option = {
      A = "复照青苔上",
      B = "言师采药去",
      C = "秦桑低绿枝",
      D = "大雪满弓刀"
    },
    Answer = "A"
  },
  [20335] = {
    ID = 20335,
    Question = "“白日放歌须纵酒”下一句是什么?",
    Option = {
      A = "东风无力百花残",
      B = "总把新桃换旧符",
      C = "青春作伴好还乡",
      D = "桃花依旧笑春风"
    },
    Answer = "C"
  },
  [20336] = {
    ID = 20336,
    Question = "“春风十里扬州路”下一句是什么?",
    Option = {
      A = "青春作伴好还乡",
      B = "芳草萋萋鹦鹉洲",
      C = "只是当时已惘然",
      D = "卷上珠帘总不如"
    },
    Answer = "D"
  },
  [20337] = {
    ID = 20337,
    Question = "“春心莫共花争发”下一句是什么? ",
    Option = {
      A = "一寸相思一寸灰",
      B = "春江水暖鸭先知",
      C = "乌衣巷口夕阳斜",
      D = "客舍青青柳色新"
    },
    Answer = "A"
  },
  [20338] = {
    ID = 20338,
    Question = "《玉树后庭花》为陈后主所作,故后人称此作为什么?",
    Option = {
      A = "绕梁之音",
      B = "亡国之音",
      C = "兴国之音",
      D = "强国之音"
    },
    Answer = "B"
  },
  [20339] = {
    ID = 20339,
    Question = "男子五十叫什么? ",
    Option = {
      A = "还历寿",
      B = "知天命",
      C = "不惑",
      D = "而立"
    },
    Answer = "B"
  },
  [20340] = {
    ID = 20340,
    Question = "“深林人不知”下一句是什么? ",
    Option = {
      A = "言师采药去",
      B = "复照青苔上",
      C = "明月来相照",
      D = "何似在人间"
    },
    Answer = "C"
  },
  [20341] = {
    ID = 20341,
    Question = "最能体现中国茶文化特色,中国茶的代表是什么茶? ",
    Option = {
      A = "铁观音",
      B = "普洱茶",
      C = "乌龙茶",
      D = "菊花茶"
    },
    Answer = "C"
  },
  [20342] = {
    ID = 20342,
    Question = "辛弃疾是什么朝代的人? ",
    Option = {
      A = "北宋",
      B = "西汉",
      C = "东汉",
      D = "南宋"
    },
    Answer = "D"
  },
  [20343] = {
    ID = 20343,
    Question = "居里夫人是哪个国家的人? ",
    Option = {
      A = "雅典",
      B = "希腊",
      C = "古巴",
      D = "波兰"
    },
    Answer = "D"
  },
  [20344] = {
    ID = 20344,
    Question = "“生当作人杰”下一句是什么? ",
    Option = {
      A = "死亦为鬼雄",
      B = "凭轩涕泗流",
      C = "今上岳阳楼",
      D = "还寝梦佳期"
    },
    Answer = "A"
  },
  [20345] = {
    ID = 20345,
    Question = "李清照与丈夫赵明诚共同致力于书画金石的整理,编写了什么书? ",
    Option = {
      A = "金石录",
      B = "金玉录",
      C = "金书录",
      D = "金布录"
    },
    Answer = "A"
  },
  [20346] = {
    ID = 20346,
    Question = "历史上与济南历城人辛弃疾并称“济南二安”的著名女词人是谁? ",
    Option = {
      A = "李清照",
      B = "朱淑真",
      C = "吴淑姬",
      D = "张玉娘"
    },
    Answer = "A"
  },
  [20347] = {
    ID = 20347,
    Question = "辛弃疾字什么? ",
    Option = {
      A = "幼安",
      B = "元晦",
      C = "从嘉",
      D = "务观"
    },
    Answer = "A"
  },
  [20348] = {
    ID = 20348,
    Question = "我国的第一部药学专著是什么? ",
    Option = {
      A = "神农本草经",
      B = "本草纲目",
      C = "黄帝内经",
      D = "千金方"
    },
    Answer = "A"
  },
  [20349] = {
    ID = 20349,
    Question = "汽锅鸡是我国哪个菜系的名菜? ",
    Option = {
      A = "滇菜",
      B = "鲁菜",
      C = "川菜",
      D = "粤菜"
    },
    Answer = "A"
  },
  [20350] = {
    ID = 20350,
    Question = " 《梁甫吟》的作者是谁?",
    Option = {
      A = "李白",
      B = "陆游",
      C = "柳永",
      D = "杜甫"
    },
    Answer = "A"
  },
  [20351] = {
    ID = 20351,
    Question = "龙井虾仁是我国哪个地方的名菜?",
    Option = {
      A = "苏州",
      B = "梧州",
      C = "广州",
      D = "杭州"
    },
    Answer = "D"
  },
  [20352] = {
    ID = 20352,
    Question = "宫爆鸡丁(宫保鸡丁)属于什么菜系?",
    Option = {
      A = "黔菜",
      B = "苏菜",
      C = "湘菜",
      D = "浙菜"
    },
    Answer = "A"
  },
  [20353] = {
    ID = 20353,
    Question = "东北菜是包括辽宁,黑龙江和哪个省的菜肴? ",
    Option = {
      A = "吉林",
      B = "广东",
      C = "广西",
      D = "东北"
    },
    Answer = "A"
  },
  [20354] = {
    ID = 20354,
    Question = "“叫花童鸡”是我国哪个省份的名菜? ",
    Option = {
      A = "浙江",
      B = "吉林",
      C = "辽宁",
      D = "黑龙江"
    },
    Answer = "A"
  },
  [20355] = {
    ID = 20355,
    Question = "“清炖蟹粉狮子头”是哪个菜系的名菜? ",
    Option = {
      A = "黔菜",
      B = "苏菜",
      C = "湘菜",
      D = "浙菜"
    },
    Answer = "B"
  },
  [20356] = {
    ID = 20356,
    Question = "荷叶粉蒸肉是哪个城市的名菜? ",
    Option = {
      A = "广州",
      B = "杭州",
      C = "梧州",
      D = "苏州"
    },
    Answer = "B"
  },
  [20357] = {
    ID = 20357,
    Question = "“组庵鱼翅”是哪个地方的名菜? ",
    Option = {
      A = "湖北",
      B = "湖南",
      C = "桂林",
      D = "重庆"
    },
    Answer = "B"
  },
  [20358] = {
    ID = 20358,
    Question = "“徽州圆子”是哪个菜系的名菜? ",
    Option = {
      A = "苏菜",
      B = "黔菜",
      C = "徽菜",
      D = "浙菜"
    },
    Answer = "C"
  },
  [20359] = {
    ID = 20359,
    Question = "我国八大菜系分别是：浙菜,鲁菜,粤菜,苏菜,湘菜,闽菜,徽菜和什么? ",
    Option = {
      A = "东北菜",
      B = "济南菜",
      C = "川菜",
      D = "孔府菜"
    },
    Answer = "C"
  },
  [20360] = {
    ID = 20360,
    Question = "“水煮牛肉”是哪个地方的名菜? ",
    Option = {
      A = "粤菜",
      B = "黔菜",
      C = "川菜",
      D = "鲁菜"
    },
    Answer = "C"
  },
  [20361] = {
    ID = 20361,
    Question = "“宋嫂鱼羹”是什么朝代的一种名菜? ",
    Option = {
      A = "北宋",
      B = "晚唐",
      C = "晚清",
      D = "南宋"
    },
    Answer = "D"
  },
  [20362] = {
    ID = 20362,
    Question = "龙井虾仁的创制,据说是受苏东坡哪首词的影响? ",
    Option = {
      A = "秋风辞",
      B = "燕歌行",
      C = "易水歌",
      D = "望江南"
    },
    Answer = "D"
  },
  [20363] = {
    ID = 20363,
    Question = "“麒麟鲈鱼”是哪个菜系的名菜?",
    Option = {
      A = "湘菜",
      B = "鲁菜",
      C = "浙菜",
      D = "粤菜"
    },
    Answer = "D"
  },
  [20364] = {
    ID = 20364,
    Question = "“剁椒鱼头”是哪个菜系的名菜?",
    Option = {
      A = "粤菜",
      B = "鲁菜",
      C = "浙菜",
      D = "湘菜"
    },
    Answer = "D"
  },
  [20365] = {
    ID = 20365,
    Question = "小鸡炖蘑菇是哪个菜系的名菜? ",
    Option = {
      A = "东北菜",
      B = "粤菜",
      C = "济南菜",
      D = "川菜"
    },
    Answer = "A"
  },
  [20366] = {
    ID = 20366,
    Question = "“金陵丸子”是哪个菜系的名菜? ",
    Option = {
      A = "苏菜",
      B = "东北菜",
      C = "济南菜",
      D = "川菜"
    },
    Answer = "A"
  },
  [20367] = {
    ID = 20367,
    Question = "我国八大菜系分别是鲁菜,川菜,粤菜,闽菜,苏菜,浙菜,湘菜和什么? ",
    Option = {
      A = "徽菜",
      B = "东北菜",
      C = "济南菜",
      D = "孔府菜"
    },
    Answer = "A"
  },
  [20368] = {
    ID = 20368,
    Question = "点心“蚝皇凤爪”是哪个城市的名菜? ",
    Option = {
      A = "广州",
      B = "东北",
      C = "辽宁",
      D = "广西"
    },
    Answer = "A"
  },
  [20369] = {
    ID = 20369,
    Question = "鲁菜发源于春秋战国时的齐国和哪国? ",
    Option = {
      A = "赵国",
      B = "鲁国",
      C = "燕国",
      D = "秦国"
    },
    Answer = "B"
  },
  [20370] = {
    ID = 20370,
    Question = "“百鸟朝凤”是哪个菜系的传统名菜? ",
    Option = {
      A = "粤菜",
      B = "湘菜",
      C = "浙菜",
      D = "川菜"
    },
    Answer = "B"
  },
  [20371] = {
    ID = 20371,
    Question = "“嘉兴粽子”是我国哪个省份的名菜? ",
    Option = {
      A = "辽宁",
      B = "浙江",
      C = "东北",
      D = "湖南"
    },
    Answer = "B"
  },
  [20372] = {
    ID = 20372,
    Question = "鲁菜系分为胶东派和什么派两个流派? ",
    Option = {
      A = "济南菜",
      B = "孔府菜",
      C = "客家菜",
      D = "潮州菜"
    },
    Answer = "A"
  },
  [20373] = {
    ID = 20373,
    Question = "佛跳墙是哪儿的名菜? ",
    Option = {
      A = "闽菜",
      B = "潮州菜",
      C = "东江菜",
      D = "客家菜"
    },
    Answer = "A"
  },
  [20374] = {
    ID = 20374,
    Question = "“炸子鸡”是哪个省份的菜? ",
    Option = {
      A = "广东",
      B = "安徽",
      C = "湖南",
      D = "浙江"
    },
    Answer = "A"
  },
  [20375] = {
    ID = 20375,
    Question = "“葫芦鸡”属于哪个菜系? ",
    Option = {
      A = "顺德菜",
      B = "秦菜",
      C = "广府菜",
      D = "厦门菜"
    },
    Answer = "B"
  },
  [20376] = {
    ID = 20376,
    Question = "“葫芦鸡”是我国哪个城市的名菜? ",
    Option = {
      A = "广州",
      B = "西安",
      C = "桂林",
      D = "潮州"
    },
    Answer = "B"
  },
  [20377] = {
    ID = 20377,
    Question = "“牛羊肉泡馍”是我国哪个省份的著名小吃? ",
    Option = {
      A = "安徽",
      B = "陕西",
      C = "黑龙江",
      D = "辽宁"
    },
    Answer = "B"
  },
  [20378] = {
    ID = 20378,
    Question = "我国哪个省份的汾酒最著名? ",
    Option = {
      A = "山东",
      B = "湖南",
      C = "山西",
      D = "四川"
    },
    Answer = "C"
  },
  [20379] = {
    ID = 20379,
    Question = "刀削面是我国哪个省份的人们日常喜爱的面食? ",
    Option = {
      A = "山东",
      B = "湖南",
      C = "山西",
      D = "四川"
    },
    Answer = "C"
  },
  [20380] = {
    ID = 20380,
    Question = "馄饨在江西俗称为什么? ",
    Option = {
      A = "云吞",
      B = "水饺",
      C = "扁食",
      D = "清汤"
    },
    Answer = "D"
  },
  [20381] = {
    ID = 20381,
    Question = "黄酒是我国的民族特产,也称为什么? ",
    Option = {
      A = "白酒",
      B = "红酒",
      C = "啤酒",
      D = "米酒"
    },
    Answer = "D"
  },
  [20382] = {
    ID = 20382,
    Question = "在中国古代,咸鱼称作什么? ",
    Option = {
      A = "鲍鱼",
      B = "鲨鱼",
      C = "金鱼",
      D = "海鱼"
    },
    Answer = "A"
  },
  [20383] = {
    ID = 20383,
    Question = "陕西月饼也称为什么? ",
    Option = {
      A = "中式月饼",
      B = "秦式月饼",
      C = "西式月饼",
      D = "法式月饼"
    },
    Answer = "B"
  },
  [20384] = {
    ID = 20384,
    Question = "我国五大名面分别是炸酱面,刀削面,热干面,担担面和什么? ",
    Option = {
      A = "云吞面",
      B = "伊府面",
      C = "牛腩面",
      D = "清汤面"
    },
    Answer = "B"
  },
  [20385] = {
    ID = 20385,
    Question = "我国五大名面分别是炸酱面,刀削面,伊府面,热干面和什么? ",
    Option = {
      A = "云吞面",
      B = "担担面",
      C = "牛腩面",
      D = "清汤面"
    },
    Answer = "B"
  },
  [20386] = {
    ID = 20386,
    Question = "“西湖莼菜汤”是我国哪个省份的名菜?",
    Option = {
      A = "东北",
      B = "陕西",
      C = "浙江",
      D = "安徽"
    },
    Answer = "C"
  },
  [20387] = {
    ID = 20387,
    Question = "汤圆最早叫什么? ",
    Option = {
      A = "饺子",
      B = "云吞",
      C = "包子",
      D = "浮元子"
    },
    Answer = "D"
  },
  [20388] = {
    ID = 20388,
    Question = "月食可分为月全食,半影月食和什么?",
    Option = {
      A = "月偏食",
      B = "天狗食",
      C = "月晕食",
      D = "黑月食"
    },
    Answer = "A"
  },
  [20389] = {
    ID = 20389,
    Question = "曾获国家领导人夸奖,以火宫殿为代表的臭豆腐场地是哪 ?",
    Option = {
      A = "长沙",
      B = "杭州",
      C = "苏州",
      D = "山西"
    },
    Answer = "A"
  },
  [20390] = {
    ID = 20390,
    Question = "著名的绍兴“花雕酒”又名什么?",
    Option = {
      A = "糯米酒",
      B = "女儿红",
      C = "药材酒",
      D = "茅台酒"
    },
    Answer = "B"
  },
  [20391] = {
    ID = 20391,
    Question = "中国十大名茶中唯一以单片嫩叶炒制而成的名茶叫什么? ",
    Option = {
      A = "普洱",
      B = "铁观音",
      C = "六安瓜片",
      D = "龙井"
    },
    Answer = "C"
  },
  [20392] = {
    ID = 20392,
    Question = "中国十大名茶之一岳阳君山银针属于什么茶? ",
    Option = {
      A = "绿茶",
      B = "青茶",
      C = "红茶",
      D = "黄茶"
    },
    Answer = "D"
  },
  [20393] = {
    ID = 20393,
    Question = "“我已天地为栋宇,屋室为褌衣,请君何为入我褌中!”这句话是何人所说? ",
    Option = {
      A = "刘邦",
      B = "刘备",
      C = "刘表",
      D = "刘伶"
    },
    Answer = "D"
  },
  [20394] = {
    ID = 20394,
    Question = "十年生死两茫茫的作者是谁?",
    Option = {
      A = "王维",
      B = "苏洵",
      C = "李白",
      D = "苏轼"
    },
    Answer = "D"
  },
  [20395] = {
    ID = 20395,
    Question = "谁废除了唐朝最后一位皇帝建立了后梁?",
    Option = {
      A = "朱高炽",
      B = "朱棣",
      C = "朱允文",
      D = "朱温"
    },
    Answer = "D"
  },
  [20396] = {
    ID = 20396,
    Question = "唐朝三公分别为司徒,司空和? ",
    Option = {
      A = "太师",
      B = "太尉",
      C = "太保",
      D = "太傅"
    },
    Answer = "B"
  },
  [20397] = {
    ID = 20397,
    Question = "一个穿金色衣服的人,打一成语",
    Option = {
      A = "狐假虎威",
      B = "一鸣惊人",
      C = "杯水车薪",
      D = "摇手顿足"
    },
    Answer = "B"
  },
  [20398] = {
    ID = 20398,
    Question = "哺乳动物是最高等的脊椎动物,靠母体的乳腺分泌乳汁哺育初生幼体。下面哪种是哺乳动物?",
    Option = {
      A = "海豚",
      B = "海马",
      C = "海星",
      D = "海龙"
    },
    Answer = "A"
  },
  [20399] = {
    ID = 20399,
    Question = "蝙蝠晚上捉蚊子不靠眼睛,靠什么呢?",
    Option = {
      A = "超声波",
      B = "电磁波",
      C = "脑电波",
      D = "动感光波"
    },
    Answer = "A"
  },
  [20400] = {
    ID = 20400,
    Question = "用冰块冷冻食物,最好把冰块放在食物：",
    Option = {
      A = "上方",
      B = "下方",
      C = "中间",
      D = "旁边"
    },
    Answer = "B"
  },
  [20401] = {
    ID = 20401,
    Question = "冬天用手摸室外的铁和木头,哪个比较凉?",
    Option = {
      A = "一样凉",
      B = "铁比木头凉",
      C = "木头比铁凉",
      D = "都不凉"
    },
    Answer = "B"
  },
  [20402] = {
    ID = 20402,
    Question = "发射第一颗人造卫星的国家是?",
    Option = {
      A = "美国",
      B = "前苏联",
      C = "意大利",
      D = "英国"
    },
    Answer = "B"
  },
  [20403] = {
    ID = 20403,
    Question = "“藕”是莲的?",
    Option = {
      A = "茎",
      B = "根",
      C = "叶",
      D = "果实"
    },
    Answer = "A"
  },
  [20404] = {
    ID = 20404,
    Question = "“光年”是什么单位?",
    Option = {
      A = "长度单位",
      B = "时间单位",
      C = "体积单位",
      D = "面积单位"
    },
    Answer = "A"
  },
  [20405] = {
    ID = 20405,
    Question = "人体含水量百分比最高的器官是?",
    Option = {
      A = "膀胱",
      B = "眼球",
      C = "嘴唇",
      D = "耳朵"
    },
    Answer = "B"
  },
  [20406] = {
    ID = 20406,
    Question = "下面哪一种树被称为“活化石”?",
    Option = {
      A = "梨花树",
      B = "银杏",
      C = "松树",
      D = "桉树"
    },
    Answer = "B"
  },
  [20407] = {
    ID = 20407,
    Question = "我国家用电器使用的是?",
    Option = {
      A = "直流电",
      B = "交流电",
      C = "无线电",
      D = "未接来电"
    },
    Answer = "B"
  },
  [20408] = {
    ID = 20408,
    Question = "坦克是哪个国家发明的?",
    Option = {
      A = "德国",
      B = "美国",
      C = "英国",
      D = "苏联"
    },
    Answer = "C"
  },
  [20409] = {
    ID = 20409,
    Question = "被称为“世界第八奇观”的是?",
    Option = {
      A = "长城",
      B = "秦始皇兵马俑坑",
      C = "袁隆平杂交水稻",
      D = "广场舞大妈"
    },
    Answer = "B"
  },
  [20410] = {
    ID = 20410,
    Question = "有3米多长,750-800千克。世界上最大的熊是?",
    Option = {
      A = "黑熊",
      B = "棕熊",
      C = "树袋熊",
      D = "浣熊"
    },
    Answer = "B"
  },
  [20411] = {
    ID = 20411,
    Question = "除了食用含碘盐外,还能防治“大脖子病”的食物是?",
    Option = {
      A = "西红柿",
      B = "红萝卜",
      C = "海带",
      D = "苹果"
    },
    Answer = "C"
  },
  [20412] = {
    ID = 20412,
    Question = "地方性甲状腺肿俗称“大脖子病”的主要病因是?",
    Option = {
      A = "缺铁",
      B = "缺碘",
      C = "缺钾",
      D = "缺钙"
    },
    Answer = "B"
  },
  [20413] = {
    ID = 20413,
    Question = "爱国卫生运动所称的“四害”是?",
    Option = {
      A = "鼠、蚊、蝇、蚂蚁",
      B = "鼠、蚊、蝇、蟑螂",
      C = "鼠、蚊、蝇、臭虫",
      D = "鼠、蚊、蝇、蝗虫"
    },
    Answer = "B"
  },
  [20414] = {
    ID = 20414,
    Question = "第一次乘坐阿波罗11号宇宙飞船成功登上月球的航天员是哪国的? ",
    Option = {
      A = "英国",
      B = "中国",
      C = "美国",
      D = "德国"
    },
    Answer = "C"
  },
  [20415] = {
    ID = 20415,
    Question = "镜子主要利用的是光的?",
    Option = {
      A = "折射",
      B = "反射",
      C = "投射",
      D = "全反射"
    },
    Answer = "B"
  },
  [20416] = {
    ID = 20416,
    Question = "为什么有时用手摸金属门把手会有火花?",
    Option = {
      A = "一种放电现象",
      B = "静电",
      C = "把手放电",
      D = "把手通了电"
    },
    Answer = "B"
  },
  [20417] = {
    ID = 20417,
    Question = "汽车轮胎上的沟纹主要作用是?",
    Option = {
      A = "增加与地面的摩擦",
      B = "排除雨水和泥水",
      C = "增加车身的缓冲",
      D = "让轮胎好看一点"
    },
    Answer = "A"
  },
  [20418] = {
    ID = 20418,
    Question = "属于国家一级保护动物的是?",
    Option = {
      A = "天鹅",
      B = "娃娃鱼",
      C = "孔雀",
      D = "丹顶鹤"
    },
    Answer = "D"
  },
  [20419] = {
    ID = 20419,
    Question = "发烧时不宜喝什么饮料?",
    Option = {
      A = "果汁",
      B = "白开水",
      C = "浓茶",
      D = "可乐"
    },
    Answer = "C"
  },
  [20420] = {
    ID = 20420,
    Question = "生物体的基本单位是?",
    Option = {
      A = "器官",
      B = "分子",
      C = "组织",
      D = "细胞"
    },
    Answer = "D"
  },
  [20421] = {
    ID = 20421,
    Question = "父亲的血型为A型,母亲的血型为AB型,所生子女的血型不可能为?",
    Option = {
      A = "A型",
      B = "B型",
      C = "O型",
      D = "AB型"
    },
    Answer = "C"
  },
  [20422] = {
    ID = 20422,
    Question = "2008年北京奥运会的主题是什么? ",
    Option = {
      A = "和平",
      B = "绿色",
      C = "发展",
      D = "团结"
    },
    Answer = "B"
  },
  [20423] = {
    ID = 20423,
    Question = "互联网上传输速率的单位是___?",
    Option = {
      A = "比特/秒",
      B = "文件/秒",
      C = "帧/秒",
      D = "米/秒"
    },
    Answer = "A"
  },
  [20424] = {
    ID = 20424,
    Question = "“吸烟有害健康”世界无烟日是指每年的?",
    Option = {
      A = "4月7日",
      B = "4月22日",
      C = "5月31日",
      D = "8月15日"
    },
    Answer = "C"
  },
  [20425] = {
    ID = 20425,
    Question = "选用无磷洗衣粉的目的是?",
    Option = {
      A = "保护衣物",
      B = "防止污染",
      C = "保护双手",
      D = "保护洗衣机"
    },
    Answer = "B"
  },
  [20426] = {
    ID = 20426,
    Question = "我国第一大岛是?",
    Option = {
      A = "台湾岛",
      B = "海南岛",
      C = "西沙群岛",
      D = "青岛"
    },
    Answer = "A"
  },
  [20427] = {
    ID = 20427,
    Question = "世界野生生物基金会的会徽是采用了我国特有的珍贵动物是?",
    Option = {
      A = "丹顶鹤",
      B = "大熊猫",
      C = "骆驼",
      D = "东北虎"
    },
    Answer = "B"
  },
  [20428] = {
    ID = 20428,
    Question = "在下列回收废品中,如果没有回收,对环境造成危害最大的是?",
    Option = {
      A = "废纸",
      B = "废玻璃",
      C = "废电池",
      D = "废话"
    },
    Answer = "C"
  },
  [20429] = {
    ID = 20429,
    Question = "大雨过后,蚯蚓常常爬到地面活动,其原因是?",
    Option = {
      A = "洞中缺少食物",
      B = "洞中缺少阳光",
      C = "洞中缺少氧气",
      D = "洞中温度过低"
    },
    Answer = "C"
  },
  [20430] = {
    ID = 20430,
    Question = "如果切完辣椒后,感觉手火辣辣的,像被火烧了一样疼,用下列哪种液体洗手不能够去除沾在手上的辣味?",
    Option = {
      A = "白酒",
      B = "热水",
      C = "冷水",
      D = "食醋"
    },
    Answer = "C"
  },
  [20431] = {
    ID = 20431,
    Question = "破坏臭氧层的主要物质是?",
    Option = {
      A = "甲烷",
      B = "二氧化碳",
      C = "氟利昂",
      D = "二氧化硫"
    },
    Answer = "C"
  },
  [20432] = {
    ID = 20432,
    Question = "第二次世界大战末期,美国把代号“小男孩”的原子弹投在?",
    Option = {
      A = "横滨",
      B = "长崎",
      C = "东京",
      D = "广岛"
    },
    Answer = "D"
  },
  [20433] = {
    ID = 20433,
    Question = "太阳离我们地球很远,大约有多少公里?",
    Option = {
      A = "1.5亿",
      B = "3.5亿",
      C = "2.5亿",
      D = "4.5亿"
    },
    Answer = "A"
  },
  [20434] = {
    ID = 20434,
    Question = "新西兰的几维鸟是曾与恐龙生活在同一时代的古老鸟类,它?",
    Option = {
      A = "有翅无尾",
      B = "有尾无翅",
      C = "无尾无翅",
      D = "有尾有翅"
    },
    Answer = "C"
  },
  [20435] = {
    ID = 20435,
    Question = "世界国土面积最小的国家是?",
    Option = {
      A = "梵蒂冈",
      B = "摩纳哥",
      C = "瑙鲁",
      D = "图瓦卢"
    },
    Answer = "A"
  },
  [20436] = {
    ID = 20436,
    Question = "比喻变被动为主动是“三十六计”中的哪一计?",
    Option = {
      A = "声东击西",
      B = "李代桃僵",
      C = "欲擒故纵",
      D = "反客为主"
    },
    Answer = "D"
  },
  [20437] = {
    ID = 20437,
    Question = "“人不可有傲气,但不可无傲骨”是谁的座右铭?",
    Option = {
      A = "孙中山",
      B = "李大钊",
      C = "徐悲鸿",
      D = "周恩来"
    },
    Answer = "C"
  },
  [20438] = {
    ID = 20438,
    Question = "冬天倒开水时,容易爆破的杯子是?",
    Option = {
      A = "薄的玻璃杯",
      B = "厚的玻璃杯",
      C = "薄的塑料杯",
      D = "厚的塑料杯"
    },
    Answer = "B"
  },
  [20439] = {
    ID = 20439,
    Question = "“百家姓”中的第一个姓氏是什么?",
    Option = {
      A = "陈",
      B = "李",
      C = "黄",
      D = "赵"
    },
    Answer = "D"
  },
  [20440] = {
    ID = 20440,
    Question = "感冒忌用下列哪一种食物?",
    Option = {
      A = "海鱼",
      B = "豆浆",
      C = "青菜",
      D = "生姜"
    },
    Answer = "A"
  },
  [20441] = {
    ID = 20441,
    Question = "柠檬汁有哪些营养含量?",
    Option = {
      A = "维生素A和维生素C",
      B = "维生素B1和维生素C",
      C = "维生素C ",
      D = "维生素B6 "
    },
    Answer = "A"
  },
  [20442] = {
    ID = 20442,
    Question = "方便面里必然有哪种食品添加剂?",
    Option = {
      A = "防腐剂",
      B = "合成抗氧化剂",
      C = "食用色素",
      D = "漂白剂"
    },
    Answer = "B"
  },
  [20443] = {
    ID = 20443,
    Question = "低盐饮食有利于预防什么疾病?",
    Option = {
      A = "乙型肝炎",
      B = "糖尿病",
      C = "高血压",
      D = "贫血"
    },
    Answer = "C"
  },
  [20444] = {
    ID = 20444,
    Question = "碘缺乏会导致儿童、青少年___?",
    Option = {
      A = "甲亢",
      B = "无力",
      C = "心理疾病",
      D = "生长发育和智力受影响"
    },
    Answer = "D"
  },
  [20445] = {
    ID = 20445,
    Question = "夏季在烈日下工作或运动量过大出汗多时,为预防中暑应多喝___?",
    Option = {
      A = "糖水",
      B = "糖醋水",
      C = "盐开水",
      D = "白开水"
    },
    Answer = "C"
  },
  [20446] = {
    ID = 20446,
    Question = "某人由于营养不良,身体浮肿,其食疗补救措施是?",
    Option = {
      A = "多吃蔬菜",
      B = "多喝豆汁",
      C = "多吃馒头",
      D = "多喝水"
    },
    Answer = "B"
  },
  [20447] = {
    ID = 20447,
    Question = "理发吹风前,在头上喷一点___,洗烫的发式样能长久保持。",
    Option = {
      A = "盐",
      B = "醋",
      C = "酒精",
      D = "酱油"
    },
    Answer = "B"
  },
  [20448] = {
    ID = 20448,
    Question = "食品的保质期是指它的?",
    Option = {
      A = "生产日期",
      B = "最终食用期",
      C = "最佳食用期",
      D = "出厂日期"
    },
    Answer = "C"
  },
  [20449] = {
    ID = 20449,
    Question = "以下哪种食品可以食用?",
    Option = {
      A = "发霉的茶叶",
      B = "发芽的土豆",
      C = "变绿的豆芽",
      D = "变红的汤圆"
    },
    Answer = "C"
  },
  [20450] = {
    ID = 20450,
    Question = "现代体育运动会“火炬”火炬中常用的火炬燃料是?",
    Option = {
      A = "汽油",
      B = "柴油",
      C = "丁烷和煤油",
      D = "重油和酒精"
    },
    Answer = "C"
  },
  [20451] = {
    ID = 20451,
    Question = "煮鸡蛋时不宜用以下哪种容器?",
    Option = {
      A = "银制容器",
      B = "不锈钢制容器",
      C = "陶制容器",
      D = "铝制容器"
    },
    Answer = "A"
  },
  [20452] = {
    ID = 20452,
    Question = "金饰品常用K代表其含金量,18K 金饰品的含金量是?",
    Option = {
      A = "百分之55",
      B = "百分之65",
      C = "百分之75",
      D = "百分之85"
    },
    Answer = "C"
  },
  [20453] = {
    ID = 20453,
    Question = "绿色蔬菜营养丰富,下列不属于绿色蔬菜所含营养物质的为?",
    Option = {
      A = "钙质",
      B = "叶酸",
      C = "维生素C",
      D = "维生素A"
    },
    Answer = "A"
  },
  [20454] = {
    ID = 20454,
    Question = "哪个活动是近百年来全球气候变暖的主要原因?",
    Option = {
      A = "火山活动 ",
      B = "太阳活动",
      C = "人类活动",
      D = "动物活动"
    },
    Answer = "C"
  },
  [20455] = {
    ID = 20455,
    Question = "塑料在自然界可停留?",
    Option = {
      A = "100-200年",
      B = "60-50年",
      C = "20-10年",
      D = "10-5年"
    },
    Answer = "A"
  },
  [20456] = {
    ID = 20456,
    Question = "我国古代“十恶不赦”中的首恶是?",
    Option = {
      A = "不义",
      B = "不道",
      C = "内乱",
      D = "谋反"
    },
    Answer = "D"
  },
  [20457] = {
    ID = 20457,
    Question = "我国植树节定在每年的3月12日,这也是为纪念哪位人物而定的? ",
    Option = {
      A = "屈原",
      B = "孙中山",
      C = "白求恩",
      D = "雷锋"
    },
    Answer = "B"
  },
  [20458] = {
    ID = 20458,
    Question = "我国要被选为国家主席、副主席年龄要在多少周岁以上?",
    Option = {
      A = "35周岁",
      B = "40周岁",
      C = "45周岁",
      D = "50周岁"
    },
    Answer = "C"
  },
  [20459] = {
    ID = 20459,
    Question = "下列数字中哪一个是西方人最忌讳的?",
    Option = {
      A = "4",
      B = "7",
      C = "8",
      D = "13"
    },
    Answer = "D"
  },
  [20460] = {
    ID = 20460,
    Question = "供给人的机体热能的最主要营养物质是? ",
    Option = {
      A = "蛋白质",
      B = "脂肪",
      C = "糖",
      D = "维生素C"
    },
    Answer = "C"
  },
  [20461] = {
    ID = 20461,
    Question = "“天下兴亡,匹夫有责”是哪位思想家的名言?",
    Option = {
      A = "黄宗羲",
      B = "顾炎武",
      C = "王夫之",
      D = "王充"
    },
    Answer = "B"
  },
  [20462] = {
    ID = 20462,
    Question = "“持剑,坐莲花宝座,骑狮子”的形象是哪位菩萨?",
    Option = {
      A = "文殊",
      B = "普贤",
      C = "观音",
      D = "地藏"
    },
    Answer = "A"
  },
  [20463] = {
    ID = 20463,
    Question = "毒系法术是哪个人物的专属技能?",
    Option = {
      A = "男人",
      B = "男仙",
      C = "女人",
      D = "女魔"
    },
    Answer = "C"
  },
  [20464] = {
    ID = 20464,
    Question = "风系法术是哪个人物的专属技能?",
    Option = {
      A = "男魔",
      B = "女仙",
      C = "女人",
      D = "男仙"
    },
    Answer = "D"
  },
  [20465] = {
    ID = 20465,
    Question = "火系法术是哪个人物的专属技能?",
    Option = {
      A = "女仙",
      B = "女人",
      C = "女魔",
      D = "男仙"
    },
    Answer = "A"
  },
  [20466] = {
    ID = 20466,
    Question = "混乱法术是哪个人物的专属技能?",
    Option = {
      A = "男人",
      B = "男仙",
      C = "女人",
      D = "女魔"
    },
    Answer = "A"
  },
  [20467] = {
    ID = 20467,
    Question = "抓鬼任务必须满足几人队才能进行?",
    Option = {
      A = "2",
      B = "4",
      C = "3",
      D = "5"
    },
    Answer = "C"
  },
  [20468] = {
    ID = 20468,
    Question = "天庭任务必须满足几人队才能进行?",
    Option = {
      A = "4",
      B = "3",
      C = "5",
      D = "2"
    },
    Answer = "B"
  },
  [20469] = {
    ID = 20469,
    Question = "大雁塔任务必须满足几人队才能进行?",
    Option = {
      A = "3",
      B = "5",
      C = "4",
      D = "2"
    },
    Answer = "A"
  },
  [20470] = {
    ID = 20470,
    Question = "使用以下哪组道具能够强化装备?",
    Option = {
      A = "强化符和宝石",
      B = "金柳露和成长丹",
      C = "断续丸和舒心丹",
      D = "神兽丹和解封石"
    },
    Answer = "A"
  },
  [20471] = {
    ID = 20471,
    Question = "使用以下哪个道具能够炼化装备?",
    Option = {
      A = "金柳露",
      B = "灵珠",
      C = "成长丹",
      D = "解封石"
    },
    Answer = "B"
  },
  [20472] = {
    ID = 20472,
    Question = "使用以下哪个道具能够重铸装备?",
    Option = {
      A = "灵珠",
      B = "强化符",
      C = "九天玄玉",
      D = "宝石"
    },
    Answer = "C"
  },
  [20473] = {
    ID = 20473,
    Question = "宠物的亲密度越高什么就越高?",
    Option = {
      A = "气血",
      B = "法力",
      C = "魂石效果",
      D = "速度"
    },
    Answer = "C"
  },
  [20474] = {
    ID = 20474,
    Question = "使用以下哪个道具能够兑换灵兽?",
    Option = {
      A = "灵兽碎片",
      B = "神兽碎片",
      C = "仙器碎片",
      D = "神兽丹"
    },
    Answer = "A"
  },
  [20475] = {
    ID = 20475,
    Question = "使用以下哪个道具能够兑换神兽?",
    Option = {
      A = "灵兽碎片",
      B = "神兽碎片",
      C = "仙器碎片",
      D = "神兽丹"
    },
    Answer = "B"
  },
  [20476] = {
    ID = 20476,
    Question = "在铜币货摊里成功出售物品可以获得什么？",
    Option = {
      A = "银币",
      B = "元宝",
      C = "铜币",
      D = "侠义值"
    },
    Answer = "C"
  },
  [20477] = {
    ID = 20477,
    Question = "宠物最多可以装备几个魂石?",
    Option = {
      A = "2",
      B = "5",
      C = "3",
      D = "4"
    },
    Answer = "C"
  },
  [20478] = {
    ID = 20478,
    Question = "灵兽仙是干什么的?",
    Option = {
      A = "出售药品",
      B = "出售装备",
      C = "打酱油的",
      D = "帮助宠物转生"
    },
    Answer = "D"
  },
  [20479] = {
    ID = 20479,
    Question = "通过什么可以获得翅膀?",
    Option = {
      A = "强化装备",
      B = "装备炼化",
      C = "升级装备",
      D = "重铸装备"
    },
    Answer = "A"
  },
  [20480] = {
    ID = 20480,
    Question = "假设玄剑娥的火系法术伤害是1000,对方的火系抗性是30%,那么对方受到多少伤害?",
    Option = {
      A = "800",
      B = "700",
      C = "850",
      D = "750"
    },
    Answer = "B"
  },
  [20481] = {
    ID = 20481,
    Question = "假设神天兵的火系法术伤害是1200,对方的火系抗性是30%,那么对方受到多少伤害?",
    Option = {
      A = "840",
      B = "700",
      C = "1000",
      D = "男仙是没有火系法术的"
    },
    Answer = "D"
  },
  [20482] = {
    ID = 20482,
    Question = "孙悟空被压在哪?",
    Option = {
      A = "五行山",
      B = "五毛山",
      C = "无影洞",
      D = "火焰山"
    },
    Answer = "A"
  },
  [20483] = {
    ID = 20483,
    Question = "《西游记》中师徒一共有几人?",
    Option = {
      A = "4",
      B = "5",
      C = "3",
      D = "2"
    },
    Answer = "B"
  },
  [20484] = {
    ID = 20484,
    Question = "唐僧在刚收孙悟空为徒弟时,送他了什么礼物?",
    Option = {
      A = "鞋和裤子",
      B = "虎皮衣",
      C = "金箍圈",
      D = "神兽"
    },
    Answer = "A"
  },
  [20485] = {
    ID = 20485,
    Question = "红孩儿被南海观音封为了什么?",
    Option = {
      A = "净坛使者",
      B = "善财童子",
      C = "金身罗汉",
      D = "程序猿"
    },
    Answer = "B"
  },
  [20486] = {
    ID = 20486,
    Question = "车迟国的三个妖怪分别是什么?",
    Option = {
      A = "虎,鹿,羊",
      B = "狮,鹿,羊",
      C = "虎,牛,羊",
      D = "鸡,狗,猪"
    },
    Answer = "A"
  },
  [20487] = {
    ID = 20487,
    Question = "孙悟空被封为?",
    Option = {
      A = "净坛使者",
      B = "斗战胜佛",
      C = "金身罗汉",
      D = "齐天大圣"
    },
    Answer = "B"
  },
  [20488] = {
    ID = 20488,
    Question = "沙悟净被封为?",
    Option = {
      A = "净坛使者",
      B = "斗战胜佛",
      C = "金身罗汉",
      D = "托塔天王"
    },
    Answer = "C"
  },
  [20489] = {
    ID = 20489,
    Question = "猪八戒被封为?",
    Option = {
      A = "净坛使者",
      B = "斗战胜佛",
      C = "金身罗汉",
      D = "托塔天王"
    },
    Answer = "A"
  },
  [20490] = {
    ID = 20490,
    Question = "菜汤上浮着一层油会使菜汤?",
    Option = {
      A = "凉得更慢",
      B = "凉得更快",
      C = "不会有变化",
      D = "更好喝"
    },
    Answer = "A"
  },
  [20491] = {
    ID = 20491,
    Question = "\"山外青山楼外楼\"在原诗《题临安邸》中的下句是?",
    Option = {
      A = "画楼西畔桂堂东",
      B = "西湖歌舞几时休",
      C = "强中自有强中手",
      D = "春风不度玉门关"
    },
    Answer = "B"
  },
  [20492] = {
    ID = 20492,
    Question = "薄公英靠什么传播种子?",
    Option = {
      A = "交配",
      B = "蝴蝶",
      C = "风力",
      D = "蜜蜂"
    },
    Answer = "C"
  },
  [20493] = {
    ID = 20493,
    Question = "我国四大名砚之冠——端砚产自哪里?",
    Option = {
      A = "广西",
      B = "湛江",
      C = "东北",
      D = "广东"
    },
    Answer = "D"
  },
  [20494] = {
    ID = 20494,
    Question = "以下哪些果实是核果?",
    Option = {
      A = "樱桃",
      B = "李子",
      C = "山竹",
      D = "石榴"
    },
    Answer = "A"
  },
  [20495] = {
    ID = 20495,
    Question = "每一个少数民族都有自己喜爱的颜色,生长在大草原的蒙古族喜爱?",
    Option = {
      A = "红色",
      B = "白色",
      C = "黑色",
      D = "绿色"
    },
    Answer = "B"
  },
  [20496] = {
    ID = 20496,
    Question = "为了便于让望远镜观测天体,天文台的房子屋顶被设计成?",
    Option = {
      A = "方顶",
      B = "锥形顶",
      C = "圆顶",
      D = "星形顶"
    },
    Answer = "C"
  },
  [20497] = {
    ID = 20497,
    Question = "1根绳子对折,再对折,再第三次对折,然后从中间剪断,共剪成多少段？",
    Option = {
      A = "9段",
      B = "5段",
      C = "3段",
      D = "7段"
    },
    Answer = "A"
  },
  [20498] = {
    ID = 20498,
    Question = "五条直线相交,最多能有多少个交点呢？",
    Option = {
      A = "20个",
      B = "10个",
      C = "15个",
      D = "5个"
    },
    Answer = "B"
  },
  [20499] = {
    ID = 20499,
    Question = "哪种容器适用于电磁炉？",
    Option = {
      A = "瓦罐",
      B = "玻璃茶杯",
      C = "塑料盆",
      D = "不锈钢锅"
    },
    Answer = "D"
  },
  [20500] = {
    ID = 20500,
    Question = "无油而抛锚的汽车向其他车借汽油时,一般是通过一根皮管,一端放入那辆车的油箱,另一端用嘴将汽油吸出,然后放入空油箱由它自流,这是什么现象？",
    Option = {
      A = "自流现象",
      B = "引力作用",
      C = "虹吸现象",
      D = "天平现象"
    },
    Answer = "C"
  },
  [20501] = {
    ID = 20501,
    Question = "断了尾巴的秤杆称重,谁吃亏？",
    Option = {
      A = "买方吃亏",
      B = "卖方吃亏",
      C = "两方都不亏",
      D = "两方都吃亏"
    },
    Answer = "A"
  },
  [20502] = {
    ID = 20502,
    Question = "理论上,虫洞是连接了哪两个洞多维空间隧道？",
    Option = {
      A = "过去与未来",
      B = "黑洞与灰洞",
      C = "黑洞与白洞",
      D = "未来与现在"
    },
    Answer = "C"
  },
  [20503] = {
    ID = 20503,
    Question = "反向闪电又被称为？",
    Option = {
      A = "反劈闪电",
      B = "雷暴电",
      C = "大喷气式飞机",
      D = "杜克现象"
    },
    Answer = "C"
  },
  [20504] = {
    ID = 20504,
    Question = "饺子煮熟了为什么能够浮起来？",
    Option = {
      A = "重量轻了",
      B = "压力小了",
      C = "引力大了",
      D = "浮力大了"
    },
    Answer = "D"
  },
  [20505] = {
    ID = 20505,
    Question = "广义相对论成功解释了哪个星球的近日点活动？",
    Option = {
      A = "金星",
      B = "木星",
      C = "水星",
      D = "火星"
    },
    Answer = "C"
  },
  [20506] = {
    ID = 20506,
    Question = "人眼可以看到的电磁波是？",
    Option = {
      A = "紫外线",
      B = "红外线",
      C = "微波",
      D = "可见光"
    },
    Answer = "D"
  },
  [20507] = {
    ID = 20507,
    Question = "夏天游泳时,一上岸就感到凉快；当有风吹来时,更觉得冷。这是物理学问题？",
    Option = {
      A = "力学",
      B = "热学",
      C = "电学",
      D = "生活学"
    },
    Answer = "B"
  },
  [20508] = {
    ID = 20508,
    Question = "在玻璃杯里装满水盖上纸片倒立过来纸片不会掉落则是什么力量托住纸片？",
    Option = {
      A = "万有引力",
      B = "大气压",
      C = "浮力",
      D = "电磁力"
    },
    Answer = "B"
  },
  [20509] = {
    ID = 20509,
    Question = "一个物体在另一物体表面上有相对运动趋势所受到的另一个物体对它的阻碍作用,是指？",
    Option = {
      A = "静摩擦力",
      B = "滑动摩擦力",
      C = "相对摩擦力",
      D = "动态摩擦力"
    },
    Answer = "A"
  },
  [20510] = {
    ID = 20510,
    Question = "可以在太空真空环境中生存的动物是？",
    Option = {
      A = "猴子",
      B = "企鹅",
      C = "水熊",
      D = "恐龙"
    },
    Answer = "C"
  },
  [20511] = {
    ID = 20511,
    Question = "恐怖谷理论是指人类对什么东西感到恐惧？",
    Option = {
      A = "灵魂类",
      B = "未知生物",
      C = "人类本身",
      D = "机器人"
    },
    Answer = "D"
  },
  [20512] = {
    ID = 20512,
    Question = "曾经在《盗梦空间》出现过的四条楼梯,四角相连的阶梯,现实中被称为什么？",
    Option = {
      A = "维斯洛阶梯",
      B = "潘洛斯阶梯",
      C = "伪三维阶梯",
      D = "回廊阶梯"
    },
    Answer = "B"
  },
  [20513] = {
    ID = 20513,
    Question = "属于国家二级保护动物的是？",
    Option = {
      A = "熊猫",
      B = "天鹅",
      C = "台湾猴",
      D = "棕熊"
    },
    Answer = "D"
  },
  [20514] = {
    ID = 20514,
    Question = "最早制造香水瓶的原料是？",
    Option = {
      A = "石膏",
      B = "香精",
      C = "塑料",
      D = "琉璃"
    },
    Answer = "A"
  },
  [20515] = {
    ID = 20515,
    Question = "最早的四冲程内燃机用的是什么燃料？",
    Option = {
      A = "石油",
      B = "煤油",
      C = "煤气",
      D = "天然气"
    },
    Answer = "C"
  },
  [20516] = {
    ID = 20516,
    Question = "世界上最大的宫殿是？",
    Option = {
      A = "布达拉宫",
      B = "白宫",
      C = "故宫",
      D = "埃及金字塔"
    },
    Answer = "C"
  },
  [20517] = {
    ID = 20517,
    Question = "哪种病人不宜饮茶？",
    Option = {
      A = "糖尿病",
      B = "高血压",
      C = "溃疡病",
      D = "白血病"
    },
    Answer = "D"
  },
  [20518] = {
    ID = 20518,
    Question = "小儿生长发育最快的时期是？",
    Option = {
      A = "婴儿期",
      B = "幼儿期",
      C = "青春期",
      D = "中年"
    },
    Answer = "A"
  },
  [20519] = {
    ID = 20519,
    Question = "传统彩瓷“素三彩”之所以称“素”是因不用什么颜色？",
    Option = {
      A = "蓝色",
      B = "白色",
      C = "红色",
      D = "黑色"
    },
    Answer = "C"
  },
  [20520] = {
    ID = 20520,
    Question = "遗传病中的伴性遗传病是？",
    Option = {
      A = "小儿痴呆",
      B = "先天性心脏病",
      C = "白化病",
      D = "血友病"
    },
    Answer = "D"
  },
  [20521] = {
    ID = 20521,
    Question = "作为医疗急救、随行保健、抢险救援中的便携氧源使用的是什么？",
    Option = {
      A = "氧烛",
      B = "氧球",
      C = "氧瓶",
      D = "氧梅"
    },
    Answer = "A"
  },
  [20522] = {
    ID = 20522,
    Question = "在元素周期表中,原子半径由左到右依次？",
    Option = {
      A = "增大",
      B = "减小",
      C = "不变",
      D = "无规律"
    },
    Answer = "B"
  },
  [20523] = {
    ID = 20523,
    Question = "A级无机剧毒物品中,外表白色圆球硬块,入口即死的是哪种化学物？",
    Option = {
      A = "氰化钾",
      B = "氯化铵",
      C = "炳烯醇",
      D = "磷化铝"
    },
    Answer = "A"
  },
  [20524] = {
    ID = 20524,
    Question = "涡虫一旦失去了身体某个部位,则会进行再生,再生出一个头部,这现象叫做？",
    Option = {
      A = "变态再生",
      B = "异性再生",
      C = "原形再生",
      D = "同卵再生"
    },
    Answer = "B"
  },
  [20525] = {
    ID = 20525,
    Question = "除了萤火虫外,哪些生物也可以发出生物荧光？",
    Option = {
      A = "水母",
      B = "章鱼",
      C = "水蛇",
      D = "害羞草"
    },
    Answer = "A"
  }
}
return data_ProvinceQuestionLib
