data_FriendGifts = {
  [93011] = {
    name = "普通玫瑰",
    close = 20
  },
  [93012] = {
    name = "浪漫玫瑰",
    close = 50
  },
  [93013] = {
    name = "永恒玫瑰",
    close = 600
  },
  [93018] = {name = "同心锁", close = 0},
  [700001] = {
    name = "1★金创药",
    close = 0
  },
  [700002] = {
    name = "2★金创药",
    close = 0
  },
  [700003] = {
    name = "3★金创药",
    close = 0
  },
  [700004] = {
    name = "4★金创药",
    close = 0
  },
  [700005] = {
    name = "5★金创药",
    close = 0
  },
  [700006] = {
    name = "1★活血丹",
    close = 0
  },
  [700007] = {
    name = "2★活血丹",
    close = 0
  },
  [700008] = {
    name = "3★活血丹",
    close = 0
  },
  [700009] = {
    name = "4★活血丹",
    close = 0
  },
  [700010] = {
    name = "5★活血丹",
    close = 0
  },
  [700011] = {
    name = "1★正骨丸",
    close = 0
  },
  [700012] = {
    name = "2★正骨丸",
    close = 0
  },
  [700013] = {
    name = "3★正骨丸",
    close = 0
  },
  [700014] = {
    name = "4★正骨丸",
    close = 0
  },
  [700015] = {
    name = "5★正骨丸",
    close = 0
  },
  [700016] = {
    name = "1★护心丸",
    close = 0
  },
  [700017] = {
    name = "2★护心丸",
    close = 0
  },
  [700018] = {
    name = "3★护心丸",
    close = 0
  },
  [700019] = {
    name = "4★护心丸",
    close = 0
  },
  [700020] = {
    name = "5★护心丸",
    close = 0
  },
  [700021] = {
    name = "1★保神丹",
    close = 0
  },
  [700022] = {
    name = "2★保神丹",
    close = 0
  },
  [700023] = {
    name = "3★保神丹",
    close = 0
  },
  [700024] = {
    name = "4★保神丹",
    close = 0
  },
  [700025] = {
    name = "5★保神丹",
    close = 0
  },
  [700026] = {
    name = "1★碧露散",
    close = 0
  },
  [700027] = {
    name = "2★碧露散",
    close = 0
  },
  [700028] = {
    name = "3★碧露散",
    close = 0
  },
  [700029] = {
    name = "4★碧露散",
    close = 0
  },
  [700030] = {
    name = "5★碧露散",
    close = 0
  },
  [700031] = {
    name = "1★玉露散",
    close = 0
  },
  [700032] = {
    name = "2★玉露散",
    close = 0
  },
  [700033] = {
    name = "3★玉露散",
    close = 0
  },
  [700034] = {
    name = "4★玉露散",
    close = 0
  },
  [700035] = {
    name = "5★玉露散",
    close = 0
  },
  [700036] = {
    name = "1★补筋散",
    close = 0
  },
  [700037] = {
    name = "2★补筋散",
    close = 0
  },
  [700038] = {
    name = "3★补筋散",
    close = 0
  },
  [700039] = {
    name = "4★补筋散",
    close = 0
  },
  [700040] = {
    name = "5★补筋散",
    close = 0
  },
  [700041] = {
    name = "1★上元散",
    close = 0
  },
  [700042] = {
    name = "2★上元散",
    close = 0
  },
  [700043] = {
    name = "3★上元散",
    close = 0
  },
  [700044] = {
    name = "4★上元散",
    close = 0
  },
  [700045] = {
    name = "5★上元散",
    close = 0
  },
  [700046] = {
    name = "1★万灵散",
    close = 0
  },
  [700047] = {
    name = "2★万灵散",
    close = 0
  },
  [700048] = {
    name = "3★万灵散",
    close = 0
  },
  [700049] = {
    name = "4★万灵散",
    close = 0
  },
  [700050] = {
    name = "5★万灵散",
    close = 0
  },
  [700051] = {
    name = "1★强身丸",
    close = 0
  },
  [700052] = {
    name = "2★强身丸",
    close = 0
  },
  [700053] = {
    name = "3★强身丸",
    close = 0
  },
  [700054] = {
    name = "4★强身丸",
    close = 0
  },
  [700055] = {
    name = "5★强身丸",
    close = 0
  },
  [700056] = {
    name = "1★调和散",
    close = 0
  },
  [700057] = {
    name = "2★调和散",
    close = 0
  },
  [700058] = {
    name = "3★调和散",
    close = 0
  },
  [700059] = {
    name = "4★调和散",
    close = 0
  },
  [700060] = {
    name = "5★调和散",
    close = 0
  },
  [700061] = {
    name = "1★凝神丸",
    close = 0
  },
  [700062] = {
    name = "2★凝神丸",
    close = 0
  },
  [700063] = {
    name = "3★凝神丸",
    close = 0
  },
  [700064] = {
    name = "4★凝神丸",
    close = 0
  },
  [700065] = {
    name = "5★凝神丸",
    close = 0
  },
  [700066] = {
    name = "1★纳元丹",
    close = 0
  },
  [700067] = {
    name = "2★纳元丹",
    close = 0
  },
  [700068] = {
    name = "3★纳元丹",
    close = 0
  },
  [700069] = {
    name = "4★纳元丹",
    close = 0
  },
  [700070] = {
    name = "5★纳元丹",
    close = 0
  },
  [700071] = {
    name = "1★亢龙丹",
    close = 0
  },
  [700072] = {
    name = "2★亢龙丹",
    close = 0
  },
  [700073] = {
    name = "3★亢龙丹",
    close = 0
  },
  [700074] = {
    name = "4★亢龙丹",
    close = 0
  },
  [700075] = {
    name = "5★亢龙丹",
    close = 0
  }
}
