data_GoodItem = {
  [90003] = {Name = "成长丹"},
  [90009] = {
    Name = "超级亲密丹"
  },
  [90021] = {
    Name = "坐骑提气丸"
  },
  [90026] = {
    Name = "帮派成就册"
  },
  [90038] = {
    Name = "人参果王"
  },
  [90043] = {Name = "蟠桃王"},
  [92101] = {Name = "扶伤"},
  [92102] = {
    Name = "朗月清风"
  },
  [92103] = {Name = "遗患"},
  [92104] = {Name = "悬刃"},
  [92105] = {
    Name = "高级清明术"
  },
  [92106] = {
    Name = "高级脱困术"
  },
  [92107] = {
    Name = "高级分裂攻击"
  },
  [92108] = {
    Name = "高级慈乌反哺"
  },
  [92109] = {
    Name = "高级反哺之私"
  },
  [92110] = {Name = "人来疯"},
  [92111] = {Name = "讨命"},
  [92112] = {Name = "回源"},
  [92113] = {Name = "报复"},
  [92114] = {Name = "低调"},
  [92115] = {
    Name = "飞燕回翔"
  },
  [92116] = {
    Name = "步步生莲"
  },
  [92117] = {
    Name = "柳暗花明"
  },
  [92118] = {
    Name = "进退自如"
  },
  [92119] = {
    Name = "龙战于野"
  },
  [92120] = {
    Name = "横云断峰"
  },
  [92121] = {
    Name = "束手无策"
  },
  [92122] = {
    Name = "顺水推舟"
  },
  [92123] = {
    Name = "拈花一笑"
  },
  [92124] = {
    Name = "分花拂柳"
  },
  [92125] = {
    Name = "福禄双全"
  },
  [92126] = {
    Name = "吉人天相"
  },
  [92127] = {
    Name = "妙笔生花"
  },
  [92128] = {
    Name = "炊金馔玉"
  },
  [92129] = {
    Name = "枯木逢春"
  },
  [92130] = {
    Name = "如人饮水"
  },
  [92131] = {
    Name = "风火燎原"
  },
  [92132] = {
    Name = "西天净土"
  },
  [92135] = {
    Name = "天地同寿"
  },
  [92136] = {
    Name = "视死如归"
  },
  [92137] = {
    Name = "春风拂面"
  },
  [92145] = {
    Name = "神出鬼没"
  },
  [75004] = {
    Name = "灵兽碎片"
  },
  [71007] = {
    Name = "仙器碎片"
  },
  [75005] = {
    Name = "神兽碎片"
  },
  [82001] = {
    Name = "抗毒蟾蜍"
  },
  [82002] = {Name = "抗雷玉"},
  [82003] = {Name = "抗混角"},
  [82004] = {Name = "抗水珠"},
  [82005] = {Name = "抗物壳"},
  [82006] = {Name = "抗睡散"},
  [82007] = {Name = "抗风皿"},
  [82009] = {Name = "抗封帐"},
  [82010] = {Name = "抗火砂"},
  [76028] = {
    Name = "红色强化符(男人）"
  },
  [76029] = {
    Name = "红色强化符(女人）"
  },
  [76030] = {
    Name = "红色强化符(男仙）"
  },
  [76031] = {
    Name = "红色强化符(女仙）"
  },
  [76032] = {
    Name = "红色强化符(男魔）"
  },
  [76033] = {
    Name = "红色强化符(女魔）"
  },
  [75004] = {
    Name = "灵兽碎片"
  },
  [76512] = {
    Name = "1级仙器卷轴(男人)"
  },
  [76513] = {
    Name = "1级仙器卷轴(女人)"
  },
  [76514] = {
    Name = "1级仙器卷轴(男仙)"
  },
  [76515] = {
    Name = "1级仙器卷轴(女仙)"
  },
  [76516] = {
    Name = "1级仙器卷轴(男魔)"
  },
  [76517] = {
    Name = "1级仙器卷轴(女魔)"
  },
  [76518] = {
    Name = "2级仙器卷轴(男人)"
  },
  [76519] = {
    Name = "2级仙器卷轴(女人)"
  },
  [76520] = {
    Name = "2级仙器卷轴(男仙)"
  },
  [76521] = {
    Name = "2级仙器卷轴(女仙)"
  },
  [76522] = {
    Name = "2级仙器卷轴(男魔)"
  },
  [76523] = {
    Name = "2级仙器卷轴(女魔)"
  },
  [90051] = {
    Name = "灵兽之源·嫦娥"
  },
  [90052] = {
    Name = "灵兽之源·剑魂"
  },
  [90053] = {
    Name = "灵兽之源·玉面"
  },
  [90054] = {
    Name = "灵兽之源·公主"
  },
  [90056] = {
    Name = "灵兽之源·天王"
  },
  [93026] = {
    Name = "高级技能书"
  },
  [93027] = {
    Name = "1级仙器卷轴"
  },
  [93028] = {
    Name = "2级仙器卷轴"
  },
  [90005] = {
    Name = "一转易经丸"
  },
  [93030] = {
    Name = "技能残卷"
  },
  [93031] = {Name = "太虚丹"},
  [92201] = {
    Name = "绝境逢生"
  },
  [92202] = {
    Name = "子虚乌有"
  },
  [92203] = {Name = "化无"},
  [92204] = {Name = "将死"},
  [92205] = {
    Name = "当头棒喝"
  },
  [92206] = {
    Name = "明察秋毫"
  },
  [92207] = {
    Name = "双管齐下"
  },
  [92208] = {
    Name = "作鸟兽散"
  },
  [92209] = {
    Name = "春暖花开"
  },
  [92210] = {
    Name = "以牙还牙"
  },
  [92211] = {
    Name = "春回大地"
  },
  [92212] = {
    Name = "夺魂索命"
  },
  [93036] = {
    Name = "终极技能书"
  },
  [76532] = {
    Name = "红色强化符(男鬼）"
  },
  [76533] = {
    Name = "红色强化符(女鬼）"
  },
  [76538] = {
    Name = "1级仙器卷轴(男鬼)"
  },
  [76539] = {
    Name = "1级仙器卷轴(女鬼)"
  },
  [76540] = {
    Name = "2级仙器卷轴(男鬼)"
  },
  [76541] = {
    Name = "2级仙器卷轴(女鬼)"
  },
  [82008] = {Name = "抗忘符"},
  [82011] = {Name = "抗嚎珠"},
  [92146] = {
    Name = "高级强心"
  }
}
