data_NpcRubbish = {
  [2048] = {
    "我最喜欢帮人捞斧头了，你有没有掉斧头，需不需要我帮忙？"
  },
  [2049] = {
    "老天开眼，我终于知道男人长什么样子了。"
  },
  [2050] = {
    "我身为女王，饱享荣华富贵，可是从未享受人间欢乐。"
  },
  [2051] = {
    "古人云，万事从宽。"
  },
  [2052] = {
    "谢谢你救了我，在这里，也只有你一个好人了。"
  },
  [2053] = {
    "菩萨新传授给我的法术好难啊，我完全参透不了其中的奥妙。"
  },
  [2054] = {
    "你本该摆脱这六道轮回之苦，为何还入这红尘之中。"
  },
  [2055] = {
    "世界上最坏的人就是孙悟空了，他总是喜欢乱扔东西，将那些花草砸伤。"
  },
  [2056] = {
    "食谷者则有智而劳神，食草者则愚痴而多力，食肉者则勇猛而多辰。"
  },
  [2057] = {
    "不进则退！记住，每天都要有所增长。"
  },
  [2058] = {
    "世人都说神仙好，可是神仙也有神仙的烦恼。"
  },
  [2059] = {
    "我们这个小村子可是好客和热爱和平的噢。在这里谁也不会欺侮你。"
  },
  [2060] = {
    "到处都有强盗出现，这个世界怎么了。"
  },
  [2061] = {
    "大哥哥，咱们来玩捉迷藏吧。"
  },
  [2062] = {
    "想不到那妖怪这般厉害，我到是轻敌了.."
  },
  [2063] = {
    "百年修得同船渡,千年修得共枕眠。"
  },
  [2064] = {
    "过去心不可得，现在心不可得，未来心不可得。"
  },
  [2065] = {
    "道可道，非常道。恶鬼横行，请助我收服。队长可获30%的经验加成。　"
  },
  [2066] = {
    "叵耐这个猴精，能有多大手段？"
  },
  [2067] = {
    "护持佛法，导佑众生。"
  },
  [2068] = {
    "雁湿行无次，花沾色更鲜。对此欣登岁，披襟弄五弦。"
  },
  [2069] = {
    "恶人只有恶人磨。"
  },
  [2070] = {
    "一支穿云箭，千军万马来相见。"
  },
  [2071] = {
    "做熊，就得有个熊样。"
  },
  [2072] = {
    "此生最大的愿望就是希望稀柿衕里不在有臭味。"
  },
  [2073] = {
    "努力修炼，说不定我也成为一只赤金兽。"
  },
  [2074] = {
    "要是父王还活着，我定不会受你们这班人如此欺负。"
  },
  [2075] = {
    "天下武功无坚不破，唯快不破。"
  },
  [2076] = {
    "天下熙熙皆为利来，天下攘攘皆为利往。"
  },
  [2077] = {
    "身为帮派一员，应当每日自省三问。"
  },
  [2078] = {
    "入了帮派就要以帮派为家，遵守帮规。"
  },
  [2079] = {
    "一夫当关万夫莫开，冲锋陷阵，要的就是这股气势。"
  },
  [2080] = {
    "三界历练共为300环，每周一5:00重置刷新。"
  },
  [2081] = {
    "认物不认人。"
  },
  [2082] = {
    "明码实价，童叟无欺！"
  },
  [2083] = {
    "人靠衣装，佛靠金装，打扮也是很紧要的。"
  },
  [2084] = {
    "活了这么大岁数，没什么别的心愿，只希望女儿乔乔能过得好。"
  },
  [2085] = {
    "有我在此，闲杂人等休想入宫半步！"
  },
  [2086] = {
    "我观你骨骼惊奇，日后必成大器。"
  },
  [2087] = {
    "此乃天庭，尔等不可造次。"
  },
  [2088] = {
    "老天保佑，希望我那孙子一生平平安安。"
  },
  [2089] = {
    "恶王横行，为祸三界，请助我收服。队长可获30%的经验加成。　"
  },
  [2090] = {
    "当帅哥是件很痛苦的事情。"
  },
  [2091] = {
    "车到山前必有路，船到桥头自然直。"
  },
  [2092] = {
    "一念天堂，一念地狱。"
  },
  [2093] = {
    "我知道要想不被人拒绝，最好的办法就是先拒绝别人。"
  },
  [2094] = {
    "一花一世界，一叶一追寻。一曲一长叹，一生为一人。"
  },
  [2095] = {
    "也许似乎大概是，然而未必不见得。"
  },
  [2096] = {
    "人若无名，便可专心。  "
  },
  [2097] = {
    "要想抓住狐狸,必须比狐狸更狡猾。"
  },
  [2098] = {
    "来瞧一瞧，看一看呀！不怕货比货，就怕不识货。"
  },
  [2099] = {
    "为扫除妖魔，陛下特命我在此等候天下豪杰。活动时间:每天11:00-23:00"
  },
  [2100] = {
    "天下之本为民，民之本为生活！"
  },
  [2101] = {
    "奉玉帝之命,为防妖魔四处作乱,特此前来巡视。"
  },
  [2102] = {
    "感谢参加测试，请留下你的祝福吧。"
  },
  [2103] = {
    "在我这里可以学习神兽技能。"
  },
  [2104] = {
    "参加周一、三的天兵神将活动，即可向我发起挑战。"
  },
  [2105] = {
    "大树底下好乘凉。"
  },
  [2106] = {
    "奉皇上口谕，镇守此地。"
  },
  [2107] = {
    "一念放下，万般自在。"
  },
  [2108] = {
    "秉天地之正，御雷霆之力，破妄驱邪。"
  },
  [2109] = {
    "此处是为仙界，尔等不可造次。"
  },
  [2110] = {
    "舞低杨柳楼心月，歌尽桃花扇底风。 "
  },
  [2111] = {
    "请期待我的礼物哦！"
  },
  [2112] = {
    "请听我一段离骚！"
  },
  [2113] = {
    "如果你已经转生，但不满意转生后的修正，可以找我帮你转换修正。"
  },
  [2114] = {
    "生死由命，富贵在天。"
  },
  [2115] = {
    "但愿人长久，千里共婵娟。"
  },
  [2116] = {
    "修罗生性凶残，为三界宁和，请及时消灭。队长可获30%的经验加成。　"
  },
  [2117] = {
    "如果你想换种族，可以找我黄大仙。你要不要换？要不要换？要不要换？"
  },
  [2118] = {
    "银宝箱可兑换次数"
  },
  [2119] = {
    "每逢周六19:30~20:40可来我这里参加天地奇书活动"
  },
  [2120] = {
    "三界暴乱,黄金万两，阁下只要收集齐10本“三界宝典”,就能兑换一份奖品"
  },
  [5000] = {
    "看什么看，小心我把你放到我宝箱里！",
    "此地没有宝箱!"
  },
  [3000] = {
    "看什么看，小心我吃了你！",
    "别来捉我！别来捉我！",
    "你想惹麻烦吗？",
    "我可不是好惹的！哇哇！"
  },
  [3001] = {
    "打了我就有一大波经验!",
    "打了我就有一大波经验2!"
  },
  [2001] = {
    "来挑选一下，我这里出售的都是物美价廉的武器！"
  },
  [2002] = {
    "人靠衣装。"
  },
  [2003] = {
    "你的坐骑不错哦!"
  },
  [2004] = {
    "少年！你要去哪里？"
  },
  [2005] = {
    "召唤兽还是得练！"
  },
  [2006] = {
    "南无阿弥陀佛！善哉！善哉！"
  },
  [2007] = {
    "对付男人一定要用高明的手段。"
  },
  [2008] = {
    "五星镇彩，光照玄冥。千神万圣，护我真灵 。"
  },
  [2009] = {
    "天罗神，地罗神，人离难，难离身，一切灾殃化为尘。"
  },
  [2010] = {
    "我得赶紧走，不要告诉我老婆。"
  },
  [2011] = {
    "我与姐姐都是如来佛祖座前日月神灯的灯芯。"
  },
  [2012] = {
    "天地有异，风云变色。能阻止魔罗的只有天命之人。"
  },
  [2013] = {
    "我老婆疼子心切，在送儿子上学的第一天就向师傅要求不能惩罚儿子。"
  },
  [2014] = {
    "本周银宝箱可兑换次数"
  },
  [2015] = {
    "朋友！需要补一补身子吗？"
  },
  [2016] = {
    "阿弥陀佛！善哉！善哉！"
  },
  [2017] = {
    "最近很不太平啊！"
  },
  [2018] = {
    "最近很不太平啊！"
  },
  [2019] = {
    "别小看我是个打铁的，好多神兵都是出自我的手中！"
  },
  [2020] = {
    "每日通过宝图任务可获得10张藏宝图。"
  },
  [2021] = {
    "想要参加省试，先来过我这一关，必须答中12题以上才可以报名参加省试哟。"
  },
  [2022] = {
    "只要你在乡试中答对了12题后就可以在我这里参加省试，前35名可获得参加殿试的资格。"
  },
  [2023] = {
    "奉皇上之命，举办殿试招才纳贤，省试成绩的前35名可以参加殿试，有幸获得嘉奖。"
  },
  [2024] = {
    "大雁塔封妖今日剩余次数："
  },
  [2025] = {
    "方丈特派我在此准备了些小东西，侠士们可以用除妖得到的奖章来换取。"
  },
  [2026] = {
    "召唤兽经历磨难、修炼得道，可以转生为更强的召唤兽。"
  },
  [2027] = {
    "有钱能使鬼推磨，只要你机灵点，什么都好说。"
  },
  [2028] = {
    "天塌下来有皇帝顶着，你说对不？"
  },
  [2029] = {
    "做人要时刻保持着一颗善心，不然和畜生没什么区别。"
  },
  [2030] = {
    "十八年了，老天终于开眼了。"
  },
  [2031] = {
    "人在做天在看，举头三尺有神明。"
  },
  [2032] = {
    "身为一村之长，要时刻维护村民的利益。"
  },
  [2033] = {
    "神啊！救救我吧。"
  },
  [2034] = {
    "妖魔当道，正值乱世，该是英雄出世之时。可茫茫人海，谁是英雄呢？"
  },
  [2035] = {
    "天兵神将活动开放时间:周一、周三19:30~21:30"
  },
  [2036] = {
    "程老将军是天下最好的人，他对我们这些下人可好了。"
  },
  [2037] = {
    "占星卜卦如浩瀚烟尘，贫道穷极一生也才摸到皮毛。"
  },
  [2038] = {
    "天干物燥，小心火烛！"
  },
  [2039] = {
    "三七二十一，八八，八八多少来着？"
  },
  [2040] = {
    "菩萨保佑，保佑我家孩子一生平安。"
  },
  [2041] = {
    "地狱不空，誓不成佛；妖魔不善，誓不成僧；"
  },
  [2042] = {
    "招女婿招到一个妖怪，这让我这块老脸往哪里搁呀。"
  },
  [2043] = {
    "英雄救命之恩……奴家无以为报……"
  },
  [2044] = {
    "仙长，且听小神一劝，万事以和为贵啊！"
  },
  [2045] = {
    "在这个世界上，没有什么东西能比金元宝更好看了。"
  },
  [2046] = {
    "身为方寸山的大师兄，压力真大呀。"
  },
  [2047] = {
    "为什么牛魔王就不明白我的一番苦心呢。"
  }
}
