data_CountryQuestionLib = {
  [10001] = {
    ID = 10001,
    Question = "零时到八九点钟,有许多称谓,如：凌晨,黎明,清晨,早晨等,你知道凌晨是哪一段时间?",
    Option = {
      A = "零时至六时",
      B = "参时到六时",
      C = "天快亮时",
      D = "天刚亮时"
    },
    Answer = "A"
  },
  [10002] = {
    ID = 10002,
    Question = "世界地球日是每年的几月几日?",
    Option = {
      A = "4月22日",
      B = "12月1日",
      C = "3月12日",
      D = "5月1日"
    },
    Answer = "A"
  },
  [10003] = {
    ID = 10003,
    Question = "植树节是每年的几月几日?",
    Option = {
      A = "4月12日",
      B = "12月12日",
      C = "8月12日",
      D = "3月12日"
    },
    Answer = "D"
  },
  [10004] = {
    ID = 10004,
    Question = "动物园里谁是百兽之王? ",
    Option = {
      A = "老虎",
      B = "狮子",
      C = "园长",
      D = "Hello kitty"
    },
    Answer = "C"
  },
  [10005] = {
    ID = 10005,
    Question = "门神一个是尉迟恭,另一个是?",
    Option = {
      A = "秦琼",
      B = "关公",
      C = "刘备",
      D = "张飞"
    },
    Answer = "A"
  },
  [10006] = {
    ID = 10006,
    Question = "地球上什么动物最大?",
    Option = {
      A = "座头鲸",
      B = "虎鲸",
      C = "长须鲸",
      D = "蓝鲸"
    },
    Answer = "D"
  },
  [10007] = {
    ID = 10007,
    Question = "一般金婚是纪念结婚?",
    Option = {
      A = "30年",
      B = "40年",
      C = "50年",
      D = "60年"
    },
    Answer = "C"
  },
  [10008] = {
    ID = 10008,
    Question = "人类最古老的绘画形式是?",
    Option = {
      A = "油画",
      B = "壁画",
      C = "沙画",
      D = "漫画"
    },
    Answer = "B"
  },
  [10009] = {
    ID = 10009,
    Question = "什么地方没有佛?",
    Option = {
      A = "东",
      B = "南",
      C = "西",
      D = "北"
    },
    Answer = "B"
  },
  [10010] = {
    ID = 10010,
    Question = "老天有了什么也会变老?",
    Option = {
      A = "有天",
      B = "有地",
      C = "有义",
      D = "有情"
    },
    Answer = "D"
  },
  [10011] = {
    ID = 10011,
    Question = "初出茅庐的“茅庐”本意是指谁的住处?",
    Option = {
      A = "张飞",
      B = "刘备",
      C = "诸葛亮",
      D = "曹操"
    },
    Answer = "C"
  },
  [10012] = {
    ID = 10012,
    Question = "鱼是用身体哪一部分保持平衡的?",
    Option = {
      A = "尾巴",
      B = "鱼鳍",
      C = "胃",
      D = "头部"
    },
    Answer = "B"
  },
  [10013] = {
    ID = 10013,
    Question = "蟋蟀是靠什么发出鸣叫声的?",
    Option = {
      A = "嘴巴",
      B = "屁股",
      C = "大腿",
      D = "翅膀"
    },
    Answer = "D"
  },
  [10014] = {
    ID = 10014,
    Question = "和尚打着一把伞（打一歇后语）",
    Option = {
      A = "有法可依",
      B = "有法必依",
      C = "化无",
      D = "有天有地"
    },
    Answer = "C"
  },
  [10015] = {
    ID = 10015,
    Question = "屈原是春秋时代哪国人?",
    Option = {
      A = "楚国",
      B = "秦国",
      C = "赵国",
      D = "齐国"
    },
    Answer = "A"
  },
  [10016] = {
    ID = 10016,
    Question = "鸡蛋用哪种吃法最能保持维生素B2?",
    Option = {
      A = "煎",
      B = "炖",
      C = "炒",
      D = "白煮"
    },
    Answer = "D"
  },
  [10017] = {
    ID = 10017,
    Question = "果汁在什么温度饮用最适宜?",
    Option = {
      A = "10度",
      B = "20度",
      C = "30度",
      D = "40度"
    },
    Answer = "A"
  },
  [10018] = {
    ID = 10018,
    Question = "一堆西瓜,一半的一半比一半的一半的一半多半个,请问这堆西瓜有多少个?",
    Option = {
      A = "1个",
      B = "2个",
      C = "3个",
      D = "4个"
    },
    Answer = "D"
  },
  [10019] = {
    ID = 10019,
    Question = "烹调海参不宜加什么?",
    Option = {
      A = "糖",
      B = "盐",
      C = "水",
      D = " 醋"
    },
    Answer = "D"
  },
  [10020] = {
    ID = 10020,
    Question = "什么样的人见到阳光,会消失的子虚乌有?",
    Option = {
      A = "雪人",
      B = "陌生人",
      C = "黑人",
      D = "阴阳人"
    },
    Answer = "A"
  },
  [10021] = {
    ID = 10021,
    Question = "希腊神话中,战争女神和智慧女神是?",
    Option = {
      A = "赫拉",
      B = "阿忒弥斯",
      C = "雅典娜",
      D = "赫斯提亚"
    },
    Answer = "C"
  },
  [10022] = {
    ID = 10022,
    Question = "热咖啡在多少度才香甜可口?",
    Option = {
      A = "40度",
      B = "50度",
      C = "60度",
      D = "70度"
    },
    Answer = "D"
  },
  [10023] = {
    ID = 10023,
    Question = "什么票最危险?",
    Option = {
      A = "绑票",
      B = "彩票",
      C = "电影票",
      D = "车票"
    },
    Answer = "A"
  },
  [10024] = {
    ID = 10024,
    Question = "现代第一届夏季奥运会在哪举行?",
    Option = {
      A = "雅典",
      B = "罗马",
      C = "悉尼",
      D = "巴塞罗那"
    },
    Answer = "A"
  },
  [10025] = {
    ID = 10025,
    Question = "狼来了(猜一水果名)",
    Option = {
      A = "杨桃",
      B = "香蕉",
      C = "榴莲",
      D = "苹果"
    },
    Answer = "A"
  },
  [10026] = {
    ID = 10026,
    Question = "蔬菜和水果主要向人提供什么营养?",
    Option = {
      A = "膳食纤维",
      B = "蛋白质",
      C = "糖份",
      D = "维生素"
    },
    Answer = "A"
  },
  [10027] = {
    ID = 10027,
    Question = "六弦琴是什么乐器的别称? ",
    Option = {
      A = "吉他",
      B = "琵琶",
      C = "小提琴",
      D = "大提琴"
    },
    Answer = "A"
  },
  [10028] = {
    ID = 10028,
    Question = "万有引力是哪位科学家提出的?",
    Option = {
      A = "爱因斯坦",
      B = "牛顿",
      C = "阿基米德",
      D = "斯蒂芬·霍金"
    },
    Answer = "B"
  },
  [10029] = {
    ID = 10029,
    Question = "猴子最讨厌什么线?",
    Option = {
      A = "直角线",
      B = "平行线",
      C = "十字线",
      D = "针线"
    },
    Answer = "B"
  },
  [10030] = {
    ID = 10030,
    Question = "一个黑孩,从不开口,要是开口,掉出舌头。(打一植物果实)",
    Option = {
      A = "芝麻",
      B = "瓜子",
      C = "绿豆",
      D = "黑豆"
    },
    Answer = "B"
  },
  [10031] = {
    ID = 10031,
    Question = "什么牛不吃草? ",
    Option = {
      A = "黄牛",
      B = "蜗牛",
      C = "水牛",
      D = "牦牛"
    },
    Answer = "B"
  },
  [10032] = {
    ID = 10032,
    Question = "地球自转方向是自西向什么方向转的?",
    Option = {
      A = "东",
      B = "南",
      C = "西",
      D = "北"
    },
    Answer = "A"
  },
  [10033] = {
    ID = 10033,
    Question = "小白加上小白等于什么?",
    Option = {
      A = "小白",
      B = "小白兔",
      C = "大白",
      D = "超白"
    },
    Answer = "B"
  },
  [10034] = {
    ID = 10034,
    Question = "什么鸡没有翅膀?",
    Option = {
      A = "野鸡",
      B = "田鸡",
      C = "家鸡",
      D = "斗鸡"
    },
    Answer = "B"
  },
  [10035] = {
    ID = 10035,
    Question = "地球自转一圈需要多长时间?",
    Option = {
      A = "21小时",
      B = "24小时",
      C = "22小时",
      D = "23小时"
    },
    Answer = "B"
  },
  [10036] = {
    ID = 10036,
    Question = "“一骑红尘妃子笑,无人知是荔枝来”中的妃子是指谁? ",
    Option = {
      A = "李贵妃",
      B = "陈贵妃",
      C = "杨贵妃",
      D = "张贵妃"
    },
    Answer = "C"
  },
  [10037] = {
    ID = 10037,
    Question = "古代四大美女在唐朝的是? ",
    Option = {
      A = "西施",
      B = "王昭君",
      C = "杨玉环",
      D = "貂蝉"
    },
    Answer = "C"
  },
  [10038] = {
    ID = 10038,
    Question = "唐代大书法家,以草书而闻名,被誉为“草圣”的人是谁?",
    Option = {
      A = "欧阳询",
      B = "虞世南",
      C = "张旭",
      D = "颜真卿"
    },
    Answer = "C"
  },
  [10039] = {
    ID = 10039,
    Question = "唐朝的开国皇帝是? ",
    Option = {
      A = "李世民",
      B = "李治",
      C = "李渊",
      D = "李显"
    },
    Answer = "C"
  },
  [10040] = {
    ID = 10040,
    Question = "凌烟阁24功臣排名第一位的是谁? ",
    Option = {
      A = "李孝恭",
      B = "杜如晦",
      C = "长孙无忌",
      D = "李靖"
    },
    Answer = "C"
  },
  [10041] = {
    ID = 10041,
    Question = "“房谋杜断”中的房是指? ",
    Option = {
      A = "房祖名",
      B = "房事龙",
      C = "房玄龄",
      D = "房玄机"
    },
    Answer = "C"
  },
  [10042] = {
    ID = 10042,
    Question = "“房谋杜断”中的杜是指? ",
    Option = {
      A = "杜蕾斯",
      B = "杜淳",
      C = "杜如晦",
      D = "杜德伟"
    },
    Answer = "C"
  },
  [10043] = {
    ID = 10043,
    Question = "东渡曰本为两地作出杰出贡献的和尚是? ",
    Option = {
      A = "慧远",
      B = "法显",
      C = "鉴真",
      D = "道生"
    },
    Answer = "C"
  },
  [10044] = {
    ID = 10044,
    Question = "经历了唐高宗和武则天两代,被后人称为“唐室砥柱”的是谁? ",
    Option = {
      A = "元芳",
      B = "狄如燕",
      C = "狄仁杰",
      D = "元齐"
    },
    Answer = "C"
  },
  [10045] = {
    ID = 10045,
    Question = "平定安史之乱,采取结盟回纥,打击吐蕃的策略,保卫了国家安宁的唐朝名将是谁? ",
    Option = {
      A = "李靖",
      B = "薛仁贵",
      C = "郭子仪",
      D = "李晟"
    },
    Answer = "C"
  },
  [10046] = {
    ID = 10046,
    Question = "开元盛世是哪个皇帝所创? ",
    Option = {
      A = "李治",
      B = "李渊",
      C = "李隆基",
      D = "李世民"
    },
    Answer = "C"
  },
  [10047] = {
    ID = 10047,
    Question = "唐朝两位最著名的诗人中,被称为诗仙的是? ",
    Option = {
      A = "韩愈",
      B = "骆宾王",
      C = "白居易",
      D = "李白"
    },
    Answer = "D"
  },
  [10048] = {
    ID = 10048,
    Question = "中国有个女皇帝武则天,但还有个女丞相是谁? ",
    Option = {
      A = "吕二娘",
      B = "洪宣娇",
      C = "吕四娘",
      D = "上官婉儿"
    },
    Answer = "D"
  },
  [10049] = {
    ID = 10049,
    Question = "唐朝的画圣是? ",
    Option = {
      A = "韩滉",
      B = "李公麟",
      C = "任伯年",
      D = "吴道子"
    },
    Answer = "D"
  },
  [10050] = {
    ID = 10050,
    Question = "唐朝“三箭定天山”等事迹有关的人物是谁?",
    Option = {
      A = "薛仁贵",
      B = "尉迟敬德",
      C = "长孙无忌",
      D = "魏征"
    },
    Answer = "A"
  },
  [10051] = {
    ID = 10051,
    Question = "杜甫曾任工部侍郎,所以后人称他为?",
    Option = {
      A = "杜工正",
      B = "杜工部",
      C = "杜议郎",
      D = "杜侍郎"
    },
    Answer = "B"
  },
  [10052] = {
    ID = 10052,
    Question = "唐朝两位最著名的诗人中,被称为诗圣的是?",
    Option = {
      A = "王维",
      B = "杜甫",
      C = "李白",
      D = "孟浩然"
    },
    Answer = "B"
  },
  [10053] = {
    ID = 10053,
    Question = "编制《大衍历》的唐代著名佛教天文学家是谁? ",
    Option = {
      A = "二行(僧二行)",
      B = "一行(僧一行)",
      C = "四行(僧四行)",
      D = "三行(僧三行)"
    },
    Answer = "B"
  },
  [10054] = {
    ID = 10054,
    Question = "玄奘口述,弟子记的西方见闻书是什么? ",
    Option = {
      A = "大唐西游记",
      B = "大唐西行记",
      C = "大唐西域记",
      D = "大唐西历记"
    },
    Answer = "C"
  },
  [10055] = {
    ID = 10055,
    Question = "“国破山河在,城春草木深”出自杜甫的哪首诗? ",
    Option = {
      A = "绝句",
      B = "登高",
      C = "山行",
      D = "春望"
    },
    Answer = "D"
  },
  [10056] = {
    ID = 10056,
    Question = "“天长地久有时尽,此恨绵绵无绝期”出自哪首诗? ",
    Option = {
      A = "暮江吟",
      B = "忆江南",
      C = "长相思",
      D = "长恨歌"
    },
    Answer = "D"
  },
  [10057] = {
    ID = 10057,
    Question = "阎立本为李世民接见和亲使者禄东赞所画的是什么? ",
    Option = {
      A = "步辇图",
      B = "古帝王图",
      C = "职贡图",
      D = "西域图"
    },
    Answer = "A"
  },
  [10058] = {
    ID = 10058,
    Question = "杜甫《新婚别》《垂老别》《无家别》合称什么? ",
    Option = {
      A = "三别",
      B = "三离",
      C = "三绝",
      D = "三见"
    },
    Answer = "A"
  },
  [10059] = {
    ID = 10059,
    Question = "“东风无力百花残”上一句是什么? ",
    Option = {
      A = "柳暗花明又一村",
      B = "相见时难别亦难",
      C = "轻舟已过万重山",
      D = "两只黄鹂鸣翠柳"
    },
    Answer = "B"
  },
  [10060] = {
    ID = 10060,
    Question = "“客舍青青柳色新”上一句是什么? ",
    Option = {
      A = "又岂在暮暮朝朝",
      B = "渭城朝雨邑轻尘",
      C = "两岸猿声啼不住",
      D = "一骑红尘妃子笑"
    },
    Answer = "B"
  },
  [10061] = {
    ID = 10061,
    Question = "“朝辞白帝彩云间”下一句是什么?",
    Option = {
      A = "银烛秋光冷画屏",
      B = "青山隐隐水迢迢",
      C = "千里江陵一日还",
      D = "二十四桥明月夜"
    },
    Answer = "C"
  },
  [10062] = {
    ID = 10062,
    Question = "“碧玉妆成一树高”下一句是什么? ",
    Option = {
      A = "雁点湖飞渡亦难",
      B = "紫薇花对紫薇郎",
      C = "万条垂下绿丝绦",
      D = "荷花深处小舟通"
    },
    Answer = "C"
  },
  [10063] = {
    ID = 10063,
    Question = "“几处早莺争暖树”下一句是什么? ",
    Option = {
      A = "谁家新燕啄春泥",
      B = "鸿雁那从北地来",
      C = "相望相思不相见",
      D = "那及春朝携手度"
    },
    Answer = "A"
  },
  [10064] = {
    ID = 10064,
    Question = "文成公主前往和亲的国家? ",
    Option = {
      A = "吐蕃",
      B = "高句丽",
      C = "西突厥",
      D = "天竺"
    },
    Answer = "A"
  },
  [10065] = {
    ID = 10065,
    Question = "李世民在什么地方诛李建成? ",
    Option = {
      A = "玄武门",
      B = "仙鹤门",
      C = "麒麟门",
      D = "神策门"
    },
    Answer = "A"
  },
  [10066] = {
    ID = 10066,
    Question = "“会当凌绝顶,一览众山小”指的是哪座名山? ",
    Option = {
      A = "泰山",
      B = "衡山",
      C = "华山",
      D = "恒山"
    },
    Answer = "A"
  },
  [10067] = {
    ID = 10067,
    Question = "“日照香庐升紫烟”诗句中哪座山? ",
    Option = {
      A = "衡山",
      B = "庐山",
      C = "华山",
      D = "恒山"
    },
    Answer = "B"
  },
  [10068] = {
    ID = 10068,
    Question = "由唐玄宗天宝十四年开始的,安禄山等人领导的起兵反对唐王朝的叛乱,历史上称为什么? ",
    Option = {
      A = "八王之乱",
      B = "侯景之乱",
      C = "安史之乱",
      D = "三藩之乱"
    },
    Answer = "C"
  },
  [10069] = {
    ID = 10069,
    Question = "“春蚕到死丝方尽,蜡炬成灰泪始干”常被用来歌颂什么职业的人? ",
    Option = {
      A = "厨师",
      B = "武师",
      C = "教师",
      D = "医师"
    },
    Answer = "C"
  },
  [10070] = {
    ID = 10070,
    Question = "唐代最出名的文学是什么? ",
    Option = {
      A = "小说",
      B = "散文",
      C = "唐诗",
      D = "戏剧"
    },
    Answer = "C"
  },
  [10071] = {
    ID = 10071,
    Question = "“白日依山尽,黄河入海流,欲穷千里目,更上一层楼”按字数和句数可分为? ",
    Option = {
      A = "四言绝句",
      B = "七言绝句",
      C = "六言绝句",
      D = "五言绝句"
    },
    Answer = "D"
  },
  [10072] = {
    ID = 10072,
    Question = "“火云犹未敛奇峰,欹枕初惊一叶风”描写的是哪个季节?",
    Option = {
      A = "春天",
      B = "冬天",
      C = "夏天",
      D = "秋天"
    },
    Answer = "D"
  },
  [10073] = {
    ID = 10073,
    Question = "“曾逐东风拂舞筵,乐游春苑断肠天,如何肯到清秋日,已带斜阳又带蝉” 描写的是什么植物? ",
    Option = {
      A = "银杏树",
      B = "荔枝树",
      C = "樱花树",
      D = "柳树"
    },
    Answer = "D"
  },
  [10074] = {
    ID = 10074,
    Question = "三横三竖是什么字? ",
    Option = {
      A = "田",
      B = "日",
      C = "目",
      D = "旦"
    },
    Answer = "A"
  },
  [10075] = {
    ID = 10075,
    Question = "武则天建立的朝代,国号是什么? ",
    Option = {
      A = "周",
      B = "夏",
      C = "清",
      D = "明"
    },
    Answer = "A"
  },
  [10076] = {
    ID = 10076,
    Question = "“随风潜入夜,润物细无声”描写的是什么天气? ",
    Option = {
      A = "暴雨",
      B = "小雨",
      C = "小雪",
      D = "酷热"
    },
    Answer = "B"
  },
  [10077] = {
    ID = 10077,
    Question = "李世民统治时期,唐朝的年号是? ",
    Option = {
      A = "西汉",
      B = "贞观",
      C = "东汉",
      D = "新朝"
    },
    Answer = "B"
  },
  [10078] = {
    ID = 10078,
    Question = "什么布剪不断? ",
    Option = {
      A = "牛津布",
      B = "瀑布",
      C = "无纺布",
      D = "无尘布"
    },
    Answer = "B"
  },
  [10079] = {
    ID = 10079,
    Question = "什么东西天气越热,它爬的越高? ",
    Option = {
      A = "蚂蚁",
      B = "蛇",
      C = "温度计",
      D = "老鼠"
    },
    Answer = "C"
  },
  [10080] = {
    ID = 10080,
    Question = "一堆沙加一堆沙等于几堆沙? ",
    Option = {
      A = "2",
      B = "3",
      C = "1",
      D = "4"
    },
    Answer = "C"
  },
  [10081] = {
    ID = 10081,
    Question = "“促膝长谈”猜一物理理论?",
    Option = {
      A = "弦理论",
      B = "声学理论",
      C = "M理论",
      D = "相对论"
    },
    Answer = "D"
  },
  [10082] = {
    ID = 10082,
    Question = "巧克力和花生米打架,巧克力赢了,打一食物,",
    Option = {
      A = "巧克力饼",
      B = "巧克力奶",
      C = "巧克力糖",
      D = "巧克力棒"
    },
    Answer = "D"
  },
  [10083] = {
    ID = 10083,
    Question = "哪个月有28天? ",
    Option = {
      A = "2月",
      B = "3月",
      C = "4月",
      D = "每个月"
    },
    Answer = "D"
  },
  [10084] = {
    ID = 10084,
    Question = "阿建比小虎高,小虎的弟弟小小虎比阿宝要高,但是阿建并不是4个人中最高的,那谁最高? ",
    Option = {
      A = "小小虎",
      B = "阿建",
      C = "阿宝",
      D = "小虎"
    },
    Answer = "A"
  },
  [10085] = {
    ID = 10085,
    Question = "99*99=? ",
    Option = {
      A = "9801",
      B = "9810",
      C = "9701",
      D = "9601"
    },
    Answer = "A"
  },
  [10086] = {
    ID = 10086,
    Question = "8个人同时吃8份快餐需要10分钟,16个人同时吃16份快餐需要几分钟? ",
    Option = {
      A = "10分钟",
      B = "11分钟",
      C = "12分钟",
      D = "13分钟"
    },
    Answer = "A"
  },
  [10087] = {
    ID = 10087,
    Question = "猴子每分钟能掰1个玉米,在果园里,一只猴子5分钟能掰几个玉米?",
    Option = {
      A = "1",
      B = "0",
      C = "3",
      D = "2"
    },
    Answer = "B"
  },
  [10088] = {
    ID = 10088,
    Question = "甲对乙说：“当我是你这么大时你才3岁,乙说：当我有你那么大时你刚好15岁“请问甲多少岁?",
    Option = {
      A = "10",
      B = "11",
      C = "12",
      D = "13"
    },
    Answer = "B"
  },
  [10089] = {
    ID = 10089,
    Question = "桌子4个角,每个角上有1只猫,每只猫附近有3只猫?请问桌子上有几只猫? ",
    Option = {
      A = "3",
      B = "4",
      C = "5",
      D = "6"
    },
    Answer = "B"
  },
  [10090] = {
    ID = 10090,
    Question = "小明家位在9楼,他每天从一楼爬到家门口要爬几楼? ",
    Option = {
      A = "6",
      B = "7",
      C = "9",
      D = "8"
    },
    Answer = "D"
  },
  [10091] = {
    ID = 10091,
    Question = "秦始皇是哪国出生的？",
    Option = {
      A = "魏",
      B = "燕",
      C = "楚",
      D = "赵"
    },
    Answer = "D"
  },
  [10092] = {
    ID = 10092,
    Question = "鱼缸里有10条鱼,死了一条还有几条? ",
    Option = {
      A = "10",
      B = "9",
      C = "8",
      D = "7"
    },
    Answer = "A"
  },
  [10093] = {
    ID = 10093,
    Question = "数字规律题：-1,1,-1,-2,2,（）里应该填什么数字? ",
    Option = {
      A = "-2",
      B = "2",
      C = "-1",
      D = "1"
    },
    Answer = "A"
  },
  [10094] = {
    ID = 10094,
    Question = "一颗树上有20个果子,一阵风吹落了一半,后来果农摘了一半,请问树上还有多少果子?",
    Option = {
      A = "4",
      B = "5",
      C = "6",
      D = "7"
    },
    Answer = "B"
  },
  [10095] = {
    ID = 10095,
    Question = "小丽走进教室,看见教室里只有7名同学,那么现在教室里有几名同学? ",
    Option = {
      A = "6",
      B = "7",
      C = "8",
      D = "9"
    },
    Answer = "C"
  },
  [10096] = {
    ID = 10096,
    Question = "5匹马,两个人,三条狗和7只鸡一共有多少条腿?",
    Option = {
      A = "30",
      B = "40",
      C = "50",
      D = "60"
    },
    Answer = "C"
  },
  [10097] = {
    ID = 10097,
    Question = "一只鸡蛋煮熟需要5分钟,同时煮熟4只鸡蛋需几分钟? ",
    Option = {
      A = "20",
      B = "10",
      C = "8",
      D = "5"
    },
    Answer = "D"
  },
  [10098] = {
    ID = 10098,
    Question = "“身体虽不大,钢针满身插,遇敌蜷一团,老虎也无法”（打一动物） ",
    Option = {
      A = "蜈蚣",
      B = "刺猬",
      C = "乌龟",
      D = "蟒蛇"
    },
    Answer = "B"
  },
  [10099] = {
    ID = 10099,
    Question = "孟浩然字什么? ",
    Option = {
      A = "太白",
      B = "浩然",
      C = "乐天",
      D = "子美"
    },
    Answer = "B"
  },
  [10100] = {
    ID = 10100,
    Question = "《道德经》的作者是? ",
    Option = {
      A = "孔子",
      B = "墨子",
      C = "庄子",
      D = "老子"
    },
    Answer = "D"
  },
  [10101] = {
    ID = 10101,
    Question = "唐三藏西天取的什么经? ",
    Option = {
      A = "大乘佛法",
      B = "玉女真经",
      C = "吸星大法",
      D = "三字经"
    },
    Answer = "A"
  },
  [10102] = {
    ID = 10102,
    Question = "“魏武青虹”中的魏武是指? ",
    Option = {
      A = "曹操",
      B = "刘备",
      C = "袁绍",
      D = "孙权"
    },
    Answer = "A"
  },
  [10103] = {
    ID = 10103,
    Question = "“胄”是古代士兵使用的防护用具,用来保护哪个部位?",
    Option = {
      A = "头部",
      B = "腿部",
      C = "肩部",
      D = "颈部"
    },
    Answer = "A"
  },
  [10104] = {
    ID = 10104,
    Question = "小小诸葛亮,独坐军中帐,摆下八阵图,专捉飞来将,是指? ",
    Option = {
      A = "蝙蝠",
      B = "蜘蛛",
      C = "螳螂",
      D = "黄雀"
    },
    Answer = "B"
  },
  [10105] = {
    ID = 10105,
    Question = "喜好饮酒,自称“酒中仙”的著名诗人是? ",
    Option = {
      A = "杜甫",
      B = "李白",
      C = "王维",
      D = "白居易"
    },
    Answer = "B"
  },
  [10106] = {
    ID = 10106,
    Question = "一对小小船,载客各五员,无水走天下,有水不开船,是指? ",
    Option = {
      A = "手套",
      B = "拖鞋",
      C = "布鞋",
      D = "袜子"
    },
    Answer = "C"
  },
  [10107] = {
    ID = 10107,
    Question = "“一物生来真稀奇,身穿三百多件衣,每天给他脱一件,年底剩下一层皮”(打一生活用品)",
    Option = {
      A = "笔记簿",
      B = "便签贴",
      C = "黄历",
      D = "小说"
    },
    Answer = "C"
  },
  [10108] = {
    ID = 10108,
    Question = "“有朵花,人喜爱,有时闭来有时开,雨天开在大街上,花根就在手中栽”(打一生活用品)",
    Option = {
      A = "背包",
      B = "菜刀",
      C = "雨伞",
      D = "杯子"
    },
    Answer = "C"
  },
  [10109] = {
    ID = 10109,
    Question = "中国古代人们所说的“元旦”是指哪一天?",
    Option = {
      A = "冬至",
      B = "清明",
      C = "中秋",
      D = "春节"
    },
    Answer = "D"
  },
  [10110] = {
    ID = 10110,
    Question = "“何以解忧,唯有杜康”杜康指什么? ",
    Option = {
      A = "酒",
      B = "水",
      C = "茶",
      D = "奶"
    },
    Answer = "A"
  },
  [10111] = {
    ID = 10111,
    Question = "“四不像”的动物是指?",
    Option = {
      A = "大象",
      B = "麋鹿",
      C = "狮子",
      D = "老虎"
    },
    Answer = "B"
  },
  [10112] = {
    ID = 10112,
    Question = "“奔流到海不复回”上一句是什么? ",
    Option = {
      A = "二月春风似剪刀",
      B = "黄河之水天上来",
      C = "一片冰心在玉壶",
      D = "西出阳关无故人"
    },
    Answer = "B"
  },
  [10113] = {
    ID = 10113,
    Question = "释迦牟尼佛的名字叫什么 ?",
    Option = {
      A = "罗睺罗",
      B = "玄奘",
      C = "十力迦叶",
      D = "悉达多"
    },
    Answer = "D"
  },
  [10114] = {
    ID = 10114,
    Question = "“太一贡兮天马下,沾赤汗兮末流诸。骋容与兮万里,今安匹兮龙为友”描述的是什么动物?",
    Option = {
      A = "阿拉伯马",
      B = "奥巴马",
      C = "裹海马",
      D = "汗血宝马"
    },
    Answer = "D"
  },
  [10115] = {
    ID = 10115,
    Question = "有一个字,我们从小到大都念错,是什么字? ",
    Option = {
      A = "错字",
      B = "犇字",
      C = "骉字",
      D = "猋字"
    },
    Answer = "A"
  },
  [10116] = {
    ID = 10116,
    Question = "去动物园,看到的第一个关在笼子里的动物是什么?",
    Option = {
      A = "保安员",
      B = "售票员",
      C = "长颈鹿",
      D = "大笨象"
    },
    Answer = "B"
  },
  [10117] = {
    ID = 10117,
    Question = "围棋起源于哪个国家?",
    Option = {
      A = "日本",
      B = "中国",
      C = "美国",
      D = "英国"
    },
    Answer = "B"
  },
  [10118] = {
    ID = 10118,
    Question = "一年里,有些月份像一月有三十一日的,也有些月份像六月有三十日的,有二十八日的总共有几个月份呢? ",
    Option = {
      A = "7",
      B = "9",
      C = "12",
      D = "10"
    },
    Answer = "C"
  },
  [10119] = {
    ID = 10119,
    Question = "“春宵一刻值千金”下一句是什么? ",
    Option = {
      A = "夜半钟声到客船",
      B = "花有清香月有阴",
      C = "斜风细雨不须归",
      D = "白银盘里一青螺"
    },
    Answer = "B"
  },
  [10120] = {
    ID = 10120,
    Question = "相对论主要由哪位科学家创立? ",
    Option = {
      A = "牛津",
      B = "爱迪生",
      C = "阿基米德",
      D = "爱因斯坦"
    },
    Answer = "D"
  },
  [10121] = {
    ID = 10121,
    Question = "“日啖荔枝三百颗”下一句是什么? ",
    Option = {
      A = "不辞长作岭南人",
      B = "只缘身在此山中",
      C = "为谁辛苦为谁甜",
      D = "不及汪伦送我情"
    },
    Answer = "A"
  },
  [10122] = {
    ID = 10122,
    Question = "著名原著《法华经》的本名是什么?",
    Option = {
      A = "妙法莲华经",
      B = "四十二章经",
      C = "金刚经",
      D = "三字经"
    },
    Answer = "A"
  },
  [10123] = {
    ID = 10123,
    Question = "2008年奥运会在哪个国家举行? ",
    Option = {
      A = "中国",
      B = "美国",
      C = "法国",
      D = "韩国"
    },
    Answer = "A"
  },
  [10124] = {
    ID = 10124,
    Question = "“在天愿作比翼鸟”下一句是什么? ",
    Option = {
      A = "天下谁人不识君",
      B = "在地愿为连理枝",
      C = "自在娇莺恰恰啼",
      D = "直把杭州作汴州"
    },
    Answer = "B"
  },
  [10125] = {
    ID = 10125,
    Question = "法家学说主张什么治理国家的理论? ",
    Option = {
      A = "以暴治国",
      B = "以法治国",
      C = "以愚治国",
      D = "以色治国"
    },
    Answer = "B"
  },
  [10126] = {
    ID = 10126,
    Question = "“多情自古空余恨”下一句是什么?",
    Option = {
      A = "惟有蜻蜓蛱蝶飞",
      B = "斜风细雨不须归",
      C = "一枝红杏出墙来",
      D = "好梦由来最易醒"
    },
    Answer = "D"
  },
  [10127] = {
    ID = 10127,
    Question = "《时间简史》是由英国伟大的物理学家,黑洞理论和“大爆炸”理论的创立人谁所编撰?",
    Option = {
      A = "霍金",
      B = "鲍威尔",
      C = "布拉格",
      D = "卡文迪什"
    },
    Answer = "A"
  },
  [10128] = {
    ID = 10128,
    Question = "一天夜里刮起了狂风,这时一个桌子上总共有12支点燃的蜡烛,先被风吹灭了3根,不久又一阵风吹灭了2根,最后桌子上还剩几根蜡烛?",
    Option = {
      A = "7",
      B = "12",
      C = "5",
      D = "8"
    },
    Answer = "C"
  },
  [10129] = {
    ID = 10129,
    Question = "谁发明了飞机? ",
    Option = {
      A = "雪人兄弟",
      B = "南洋兄弟",
      C = "十兄弟",
      D = "莱特兄弟"
    },
    Answer = "D"
  },
  [10130] = {
    ID = 10130,
    Question = "聊斋志异作者是? ",
    Option = {
      A = "罗贯中",
      B = "曹雪芹",
      C = "吴承恩",
      D = "蒲松龄"
    },
    Answer = "D"
  },
  [10131] = {
    ID = 10131,
    Question = "北宋平民发明家谁发明了活字印刷术? ",
    Option = {
      A = "毕升",
      B = "包拯",
      C = "苏轼",
      D = "赵匡胤"
    },
    Answer = "A"
  },
  [10132] = {
    ID = 10132,
    Question = "用椰子和西瓜打头那个比较痛 ? ",
    Option = {
      A = "椰子",
      B = "头",
      C = "西瓜",
      D = "手"
    },
    Answer = "B"
  },
  [10133] = {
    ID = 10133,
    Question = "“伫灵匹于星期,眷神姿于月夕”描写的是哪个节日? ",
    Option = {
      A = "中秋",
      B = "夏至",
      C = "七夕",
      D = "元旦"
    },
    Answer = "C"
  },
  [10134] = {
    ID = 10134,
    Question = "诸葛亮字什么?",
    Option = {
      A = "玄德",
      B = "翼德",
      C = "孔明",
      D = "云长"
    },
    Answer = "C"
  },
  [10135] = {
    ID = 10135,
    Question = "秦始皇从公元前213年开始的焚毁书籍,活埋儒士方士的事件被称为什么? ",
    Option = {
      A = "封禅大典",
      B = "焚书坑儒",
      C = "统一文字",
      D = "五德学说"
    },
    Answer = "B"
  },
  [10136] = {
    ID = 10136,
    Question = "被称为“小李杜”的晚唐诗人是李商隐和谁? ",
    Option = {
      A = "杜甫",
      B = "杜牧",
      C = "李白",
      D = "苏轼"
    },
    Answer = "B"
  },
  [10137] = {
    ID = 10137,
    Question = "造纸术是由东汉宦官谁发明的?",
    Option = {
      A = "张让",
      B = "苏康",
      C = "管霸",
      D = "蔡伦"
    },
    Answer = "D"
  },
  [10138] = {
    ID = 10138,
    Question = "屈原所作的中国古代最长的抒情诗是? ",
    Option = {
      A = "天问",
      B = "九歌",
      C = "渔父",
      D = "离骚"
    },
    Answer = "D"
  },
  [10139] = {
    ID = 10139,
    Question = "吃苹果吃出1条虫子很恶心,那么吃出几只虫子更恶心? ",
    Option = {
      A = "2只",
      B = "3只",
      C = "4只",
      D = "半只"
    },
    Answer = "D"
  },
  [10140] = {
    ID = 10140,
    Question = "东汉末年,张角领导的一次有组织有准备的全国性农民起义历史上称作什么?",
    Option = {
      A = "黄巾起义",
      B = "宋江起义",
      C = "绿林起义",
      D = "赤眉起义"
    },
    Answer = "A"
  },
  [10141] = {
    ID = 10141,
    Question = "指南针的前身是? ",
    Option = {
      A = "司南",
      B = "罗庚",
      C = "大头针",
      D = "日晷"
    },
    Answer = "A"
  },
  [10142] = {
    ID = 10142,
    Question = "刻在龟骨和兽骨上的文字称什么? ",
    Option = {
      A = "甲骨文",
      B = "金文",
      C = "石鼓文",
      D = "行书"
    },
    Answer = "A"
  },
  [10143] = {
    ID = 10143,
    Question = "神医华佗曾把自己丰富的医疗经验整理成一部医学著作,可惜没有流传下来,此部著作叫什么?",
    Option = {
      A = "三字经",
      B = "青囊经",
      C = "金刚经",
      D = "山海经"
    },
    Answer = "B"
  },
  [10144] = {
    ID = 10144,
    Question = "伟大的音乐家贝多芬患了什么疾病之后依然坚持创作?",
    Option = {
      A = "眼疾",
      B = "耳聋",
      C = "帕金森",
      D = "艾滋"
    },
    Answer = "B"
  },
  [10145] = {
    ID = 10145,
    Question = "“夕阳无限好”下一句是什么? ",
    Option = {
      A = "天色已黄昏",
      B = "可是近黄昏",
      C = "可惜近黄昏",
      D = "只是近黄昏"
    },
    Answer = "D"
  },
  [10146] = {
    ID = 10146,
    Question = "“一座弯大桥,造在青天里,七色呈异彩,都夸好手艺”（打一自然现象）",
    Option = {
      A = "瀑布",
      B = "雷电",
      C = "云朵",
      D = "彩虹"
    },
    Answer = "D"
  },
  [10147] = {
    ID = 10147,
    Question = "“鞠躬尽瘁,死而后已”这句话是谁说的? ",
    Option = {
      A = "赵子龙",
      B = "文天祥",
      C = "岳飞",
      D = "诸葛亮"
    },
    Answer = "D"
  },
  [10148] = {
    ID = 10148,
    Question = "三国时有个技师马钧,用纸包火药的方法作出了娱乐用的什么,开创了火药应用的先河?",
    Option = {
      A = "炮竹",
      B = "烟花",
      C = "炸弹",
      D = "地雷"
    },
    Answer = "A"
  },
  [10149] = {
    ID = 10149,
    Question = "世界上除了火车,什么车最长?",
    Option = {
      A = "单车",
      B = "塞车",
      C = "火车",
      D = "货车"
    },
    Answer = "B"
  },
  [10150] = {
    ID = 10150,
    Question = "“明月几时有”下一句是什么? ",
    Option = {
      A = "天色已黄昏",
      B = "恨别鸟惊心",
      C = "把酒问青天",
      D = "路有冻死骨"
    },
    Answer = "C"
  },
  [10151] = {
    ID = 10151,
    Question = "黄帝和谁并称中华的始祖? ",
    Option = {
      A = "赤帝",
      B = "玉帝",
      C = "炎帝",
      D = "火帝"
    },
    Answer = "C"
  },
  [10152] = {
    ID = 10152,
    Question = "世界上最高的山是? ",
    Option = {
      A = "火焰山",
      B = "喜马拉雅山",
      C = "泰山",
      D = "华山"
    },
    Answer = "B"
  },
  [10153] = {
    ID = 10153,
    Question = "杜甫的《石壕吏》《新安吏》《潼关吏》合称什么? ",
    Option = {
      A = "合吏",
      B = "三吏",
      C = "总吏",
      D = "集吏"
    },
    Answer = "B"
  },
  [10154] = {
    ID = 10154,
    Question = "诗歌在唐代发展到了一个高峰,唐朝诗人李白被尊为? ",
    Option = {
      A = "诗神",
      B = "诗圣",
      C = "诗仙",
      D = "诗王"
    },
    Answer = "C"
  },
  [10155] = {
    ID = 10155,
    Question = "植物可以通过光合作用在有光的照射下将水和什么转化为有机物,并释放出?",
    Option = {
      A = "石墨化碳",
      B = "二氧化碳",
      C = "四氯化碳",
      D = "四氟化碳"
    },
    Answer = "B"
  },
  [10156] = {
    ID = 10156,
    Question = "英国博物学家生物学家进化论的奠基人达尔文撰写了轰动了生物学界的著作是? ",
    Option = {
      A = "植物的运动力",
      B = "人类和动物的表情",
      C = "物种起源",
      D = "人类的由来及性选择"
    },
    Answer = "C"
  },
  [10157] = {
    ID = 10157,
    Question = "什么动物天天熬夜? ",
    Option = {
      A = "蝙蝠",
      B = "蚊子",
      C = "狗",
      D = "熊猫 "
    },
    Answer = "D"
  },
  [10158] = {
    ID = 10158,
    Question = "什么字世界通用? ",
    Option = {
      A = "中文",
      B = "英文",
      C = "日文",
      D = "阿拉伯数字"
    },
    Answer = "D"
  },
  [10159] = {
    ID = 10159,
    Question = "世界上最大的影子是什么? ",
    Option = {
      A = "大象的影子",
      B = "大厦的影子",
      C = "恐龙的影子",
      D = "黑夜"
    },
    Answer = "D"
  },
  [10160] = {
    ID = 10160,
    Question = "唐僧取的经现在在什么楼? ",
    Option = {
      A = "大雁塔",
      B = "大象塔",
      C = "大鸟塔",
      D = "大神塔"
    },
    Answer = "A"
  },
  [10161] = {
    ID = 10161,
    Question = "新华字典有几个字? ",
    Option = {
      A = "4",
      B = "8",
      C = "200000",
      D = "300000"
    },
    Answer = "A"
  },
  [10162] = {
    ID = 10162,
    Question = "李德裕长期与李宗闵及牛僧儒为首的朋党斗争,后人称为? ",
    Option = {
      A = "新旧党争",
      B = "牛李党争",
      C = "明朝党争",
      D = "李牛党争"
    },
    Answer = "B"
  },
  [10163] = {
    ID = 10163,
    Question = "唐玄奘历经4年到达古印度哪座寺庙取得真经? ",
    Option = {
      A = "莲花寺",
      B = "伽马清真寺",
      C = "那烂陀寺",
      D = "贾玛清真寺"
    },
    Answer = "C"
  },
  [10164] = {
    ID = 10164,
    Question = "奠定曹操统一北方阵地的战役? ",
    Option = {
      A = "赤壁之战",
      B = "夷陵之战",
      C = "汉巴之战",
      D = "官渡之战"
    },
    Answer = "D"
  },
  [10165] = {
    ID = 10165,
    Question = "“同是天涯沦落人,相逢何必曾相识”出自哪首诗?",
    Option = {
      A = "琵琶行",
      B = "长恨歌",
      C = "卖炭翁",
      D = "暮江吟"
    },
    Answer = "A"
  },
  [10166] = {
    ID = 10166,
    Question = "阳光照射到半空中的雨点,光线被折射及什么,在天空上形成拱形的七彩的光谱就是彩虹?",
    Option = {
      A = "反射",
      B = "直射",
      C = "散射",
      D = "谢谢"
    },
    Answer = "A"
  },
  [10167] = {
    ID = 10167,
    Question = "在极不稳定天气下,由雷暴云底伸展至地面的漏斗状云产生的强烈的旋风叫什么?",
    Option = {
      A = "台风",
      B = "龙卷风",
      C = "西北风",
      D = "东风"
    },
    Answer = "B"
  },
  [10168] = {
    ID = 10168,
    Question = "电影《大话西游》中“至尊宝向紫霞仙子”说了哪三个字? ",
    Option = {
      A = "来一杯",
      B = "我爱你",
      C = "饿了吗",
      D = "别骗我"
    },
    Answer = "B"
  },
  [10169] = {
    ID = 10169,
    Question = "灵鹤的原形是什么动物? ",
    Option = {
      A = "黑颈鹤",
      B = "赤颈鹤",
      C = "丹顶鹤",
      D = "守鹤"
    },
    Answer = "C"
  },
  [10170] = {
    ID = 10170,
    Question = "唐僧的名字叫什么? ",
    Option = {
      A = "陈伟",
      B = "陈韦",
      C = "陈祎",
      D = "陈炜"
    },
    Answer = "C"
  },
  [10171] = {
    ID = 10171,
    Question = "中国四大节日端午,春节,中秋还有? ",
    Option = {
      A = "国庆节",
      B = "儿童节",
      C = "腊八节",
      D = "清明节"
    },
    Answer = "D"
  },
  [10172] = {
    ID = 10172,
    Question = "自然界中任何两个物体都是相互吸引的,引力的大小与两种物体的质量的乘积成正比,与两物体间距离的平方成反比,是什么物理定律? ",
    Option = {
      A = "墨菲定律",
      B = "不值得定律",
      C = "250定律",
      D = "万有引力定律"
    },
    Answer = "D"
  },
  [10173] = {
    ID = 10173,
    Question = "秦始皇是首位完成中国统一的秦王朝的开国皇帝,后人称为? ",
    Option = {
      A = "千古一帝",
      B = "秦始皇",
      C = "嬴政王",
      D = "黄帝"
    },
    Answer = "A"
  },
  [10174] = {
    ID = 10174,
    Question = "长城上作为传递军情的设施是什么?",
    Option = {
      A = "祝英台",
      B = "烽火台",
      C = "断头台",
      D = "检查台"
    },
    Answer = "B"
  },
  [10175] = {
    ID = 10175,
    Question = "中国最具特色的四大民间故事分别是《孟姜女哭长城》,《梁山伯与祝英台》,《牛郎织女》和什么?",
    Option = {
      A = "西游记",
      B = "白蛇传",
      C = "水浒传",
      D = "三国演义"
    },
    Answer = "B"
  },
  [10176] = {
    ID = 10176,
    Question = "战国末年秦国丞相吕不韦组织属下门客们集体编撰的杂家著作是什么?",
    Option = {
      A = "离骚",
      B = "九歌",
      C = "吕氏春秋",
      D = "尚书"
    },
    Answer = "C"
  },
  [10177] = {
    ID = 10177,
    Question = "毛主席亲笔题了什么词赠给“革命小英雄”陈永康?",
    Option = {
      A = "为人民服务",
      B = "生的伟大死的光荣",
      C = "好好学习天天向上",
      D = "向雷锋同志学习"
    },
    Answer = "C"
  },
  [10178] = {
    ID = 10178,
    Question = "“朱门酒肉臭”下一句是什么?",
    Option = {
      A = "恨别鸟惊心",
      B = "今人多不弹",
      C = "能饮一杯无",
      D = "路有冻死骨"
    },
    Answer = "D"
  },
  [10179] = {
    ID = 10179,
    Question = "晋文公推崇介之推什么? ",
    Option = {
      A = "凿壁偷光",
      B = "悬梁刺股",
      C = "卧薪尝胆",
      D = "隐不违亲"
    },
    Answer = "D"
  },
  [10180] = {
    ID = 10180,
    Question = "你参加了赛跑比赛,追过了第二名.现在是第几名? ",
    Option = {
      A = "2",
      B = "3",
      C = "4",
      D = "1"
    },
    Answer = "A"
  },
  [10181] = {
    ID = 10181,
    Question = "人一生说的最多的三个字是什么? ",
    Option = {
      A = "别烦我",
      B = "不知道",
      C = "吃了没",
      D = "哦买噶"
    },
    Answer = "B"
  },
  [10182] = {
    ID = 10182,
    Question = "太平洋中间是什么?",
    Option = {
      A = "洋",
      B = "平",
      C = "岛屿",
      D = "基地"
    },
    Answer = "B"
  },
  [10183] = {
    ID = 10183,
    Question = "世界七大奇迹有属于巴比伦的什么?",
    Option = {
      A = "金字塔",
      B = "空中花园",
      C = "宙斯神像",
      D = "亚历山大灯塔"
    },
    Answer = "B"
  },
  [10184] = {
    ID = 10184,
    Question = "卧薪尝胆说的是越王谁的故事?",
    Option = {
      A = "夫谭",
      B = "勾践",
      C = "允常",
      D = "朱勾"
    },
    Answer = "B"
  },
  [10185] = {
    ID = 10185,
    Question = "土豆捅了包子致命一刀,打一食物?",
    Option = {
      A = "豆沙包",
      B = "叉烧包",
      C = "小笼包",
      D = "鲜肉包"
    },
    Answer = "A"
  },
  [10186] = {
    ID = 10186,
    Question = "中国南方最大的河系是什么?",
    Option = {
      A = "长江",
      B = "黄河",
      C = "辽河",
      D = "珠江"
    },
    Answer = "D"
  },
  [10187] = {
    ID = 10187,
    Question = "岳飞的母亲在岳飞身后刺了哪4个字?",
    Option = {
      A = "精忠报国",
      B = "准时吃饭",
      C = "玩物丧志",
      D = "我勒个擦"
    },
    Answer = "A"
  },
  [10188] = {
    ID = 10188,
    Question = "电影《大话西游》中,如果上天再给一次机会,至尊宝对紫霞仙子的愛的期限是多久? ",
    Option = {
      A = "一百年",
      B = "一万年",
      C = "一亿年",
      D = "一千年"
    },
    Answer = "B"
  },
  [10189] = {
    ID = 10189,
    Question = "一头猪说 “加油啊”（打一种食物材料）",
    Option = {
      A = "猪油膏",
      B = "猪饲料",
      C = "朱古力",
      D = "猪腩肉"
    },
    Answer = "C"
  },
  [10190] = {
    ID = 10190,
    Question = "有些火山在人类历史之前喷发过,但现在已经不喷发了,称为什么?",
    Option = {
      A = "死火山",
      B = "活火山",
      C = "休眠火山",
      D = "冬眠火山"
    },
    Answer = "A"
  },
  [10191] = {
    ID = 10191,
    Question = "埃及的国王叫什么?",
    Option = {
      A = "法老",
      B = "皇帝",
      C = "国王",
      D = "发老"
    },
    Answer = "A"
  },
  [10192] = {
    ID = 10192,
    Question = "北京周口店发现的猿人,又叫什么?",
    Option = {
      A = "北京人",
      B = "南京人",
      C = "上海人",
      D = "广东人"
    },
    Answer = "A"
  },
  [10193] = {
    ID = 10193,
    Question = "孔融是被谁杀的? ",
    Option = {
      A = "刘备",
      B = "曹操",
      C = "关羽",
      D = "司马懿"
    },
    Answer = "B"
  },
  [10194] = {
    ID = 10194,
    Question = "第一次鸦片战争后,中国被逼割让了哪个地方给英国? ",
    Option = {
      A = "青岛",
      B = "西沙群岛",
      C = "海南岛",
      D = "香港岛"
    },
    Answer = "D"
  },
  [10195] = {
    ID = 10195,
    Question = "哪四种植物被合称为花中四君子?",
    Option = {
      A = "梅兰荷菊",
      B = "梅兰竹荷",
      C = "梅兰竹桃",
      D = "梅兰竹菊"
    },
    Answer = "D"
  },
  [10196] = {
    ID = 10196,
    Question = "传说中在月亮上砍桂树的是谁? ",
    Option = {
      A = "吴刚",
      B = "吴用",
      C = "悟能",
      D = "吴知"
    },
    Answer = "A"
  },
  [10197] = {
    ID = 10197,
    Question = "五岳之中的北岳是什么山?",
    Option = {
      A = "泰山",
      B = "恒山",
      C = "嵩山",
      D = "华山"
    },
    Answer = "B"
  },
  [10198] = {
    ID = 10198,
    Question = "世界最大的沙漠是什么沙漠?",
    Option = {
      A = "撒哈拉沙漠",
      B = "蓝湖沙漠",
      C = "纳米比沙漠",
      D = "戈壁沙漠"
    },
    Answer = "A"
  },
  [10199] = {
    ID = 10199,
    Question = "牛顿第一运动定律又称为什么定律?",
    Option = {
      A = "墨菲定律",
      B = "惯性定律",
      C = "不值得定律",
      D = "彼得定律"
    },
    Answer = "B"
  },
  [10200] = {
    ID = 10200,
    Question = "夏商周三代最具文化代表的乐器是什么? ",
    Option = {
      A = "青铜乐器",
      B = "金银乐器",
      C = "石头乐器",
      D = "丝竹乐器"
    },
    Answer = "A"
  },
  [10201] = {
    ID = 10201,
    Question = "端午节相传是为了纪念哪位名人? ",
    Option = {
      A = "项羽",
      B = "屈原",
      C = "刘备",
      D = "刘邦"
    },
    Answer = "B"
  },
  [10202] = {
    ID = 10202,
    Question = "鲁迅先生原名周樟寿,后改名为什么? ",
    Option = {
      A = "周作人",
      B = "周围人",
      C = "周树人",
      D = "周某人"
    },
    Answer = "C"
  },
  [10203] = {
    ID = 10203,
    Question = "光年是什么在真空中行走的距离?",
    Option = {
      A = "空气",
      B = "粒子",
      C = "风",
      D = "光"
    },
    Answer = "D"
  },
  [10204] = {
    ID = 10204,
    Question = "广东省的省花是什么?",
    Option = {
      A = "玫瑰",
      B = "荷花",
      C = "菊花",
      D = "木棉花"
    },
    Answer = "D"
  },
  [10205] = {
    ID = 10205,
    Question = "王羲之的什么字帖被称为天下第一行书?",
    Option = {
      A = "九成宫",
      B = "颜勤礼碑",
      C = "石门颂",
      D = "兰亭序"
    },
    Answer = "D"
  },
  [10206] = {
    ID = 10206,
    Question = "圆的面积计算公式是圆周率乘以什么的平方?",
    Option = {
      A = "直径",
      B = "半径",
      C = "直角",
      D = "周长"
    },
    Answer = "B"
  },
  [10207] = {
    ID = 10207,
    Question = "中国的国鸟是什么?",
    Option = {
      A = "丹顶鹤",
      B = "喜鹊",
      C = "孔雀",
      D = "神雕"
    },
    Answer = "A"
  },
  [10208] = {
    ID = 10208,
    Question = "勾三股四玄五说明的是什么定理?",
    Option = {
      A = "手表定理",
      B = "勾股定理",
      C = "韦奇定理",
      D = "格瑞斯特定理"
    },
    Answer = "B"
  },
  [10209] = {
    ID = 10209,
    Question = "明朝的开国皇帝是?",
    Option = {
      A = "朱允文",
      B = "朱元璋",
      C = "朱棣",
      D = "朱高炽"
    },
    Answer = "B"
  },
  [10210] = {
    ID = 10210,
    Question = "我国特有的一种鳄鱼——扬子鳄鱼主要分布在哪里? ",
    Option = {
      A = "珠江中下游",
      B = "辽江中下游",
      C = "长江中下游",
      D = "黄河中下游"
    },
    Answer = "C"
  },
  [10211] = {
    ID = 10211,
    Question = "两个完全一样的三角形被称为?",
    Option = {
      A = "锐角三角形",
      B = "全等三角形",
      C = "等腰三角形",
      D = "直角三角形"
    },
    Answer = "B"
  },
  [10212] = {
    ID = 10212,
    Question = "三国时期跑步最快的人是? ",
    Option = {
      A = "曹操",
      B = "刘备",
      C = "吕布",
      D = "张飞"
    },
    Answer = "A"
  },
  [10213] = {
    ID = 10213,
    Question = "上官婉儿被后人称作什么宰相? ",
    Option = {
      A = "巾帼宰相",
      B = "棉花宰相",
      C = "青词宰相",
      D = "伴食宰相"
    },
    Answer = "A"
  },
  [10214] = {
    ID = 10214,
    Question = "浮力是由液体对物体的上,下什么差而产生的? ",
    Option = {
      A = "动力",
      B = "法力",
      C = "压力",
      D = "用力"
    },
    Answer = "C"
  },
  [10215] = {
    ID = 10215,
    Question = "色光三原色分别是红色,绿色和什么?",
    Option = {
      A = "黑色",
      B = "白色",
      C = "蓝色",
      D = "紫色"
    },
    Answer = "C"
  },
  [10216] = {
    ID = 10216,
    Question = "成年人身体一共有多少块骨头?",
    Option = {
      A = "204",
      B = "205",
      C = "206",
      D = "207"
    },
    Answer = "C"
  },
  [10217] = {
    ID = 10217,
    Question = "小明的妈妈有3个儿子,老大叫李大,老二叫李二,老三叫什么?",
    Option = {
      A = "李三",
      B = "李四",
      C = "李五",
      D = "李小明"
    },
    Answer = "D"
  },
  [10218] = {
    ID = 10218,
    Question = "经过二次鸦片战争后,清政府的统冶阶级对如何解决一系列的内忧外患分裂称为顽固派和什么?",
    Option = {
      A = "蛋黄派",
      B = "特务派",
      C = "劳务派",
      D = "洋务派"
    },
    Answer = "D"
  },
  [10219] = {
    ID = 10219,
    Question = "徐悲鸿擅长画什么? ",
    Option = {
      A = "龙",
      B = "马",
      C = "虎",
      D = "猫"
    },
    Answer = "B"
  },
  [10220] = {
    ID = 10220,
    Question = "中国四大节日,分别有春节,中秋节,端午节,和什么? ",
    Option = {
      A = "元旦节",
      B = "腊八节",
      C = "鬼节",
      D = "清明节"
    },
    Answer = "D"
  },
  [10221] = {
    ID = 10221,
    Question = "大熊猫最爱吃什么食物? ",
    Option = {
      A = "苹果",
      B = "香蕉",
      C = "雪梨",
      D = "竹子"
    },
    Answer = "D"
  },
  [10222] = {
    ID = 10222,
    Question = "“何事秋风悲画扇”上一句是什么?",
    Option = {
      A = "人生若只如初见",
      B = "春城无处不飞花",
      C = "黄河远上白云间",
      D = "应怜屐齿印苍苔"
    },
    Answer = "A"
  },
  [10223] = {
    ID = 10223,
    Question = "我国古代利用日影测得时刻的一种计时仪器叫做什么?",
    Option = {
      A = "日晷",
      B = "司南",
      C = "日冕",
      D = "沙漏"
    },
    Answer = "A"
  },
  [10224] = {
    ID = 10224,
    Question = "围绕行星轨道上运行的天然体或人造天体叫什么?",
    Option = {
      A = "恒星",
      B = "卫星",
      C = "行星",
      D = "流星"
    },
    Answer = "B"
  },
  [10225] = {
    ID = 10225,
    Question = "一物体沿着直线运动,且在运动的过程中加速度保持不变,则称这一物体在做什么运动?",
    Option = {
      A = "匀变速曲线运动",
      B = "匀加速直线运动",
      C = "不匀变速直线运动",
      D = "骤变速直线运动"
    },
    Answer = "B"
  },
  [10226] = {
    ID = 10226,
    Question = "大气层中哪一层吸收了太阳光中的短波紫外线,保护着地球上的人类和动植物免受伤害?",
    Option = {
      A = "对流层",
      B = "平流层",
      C = "臭氧层",
      D = "中间层"
    },
    Answer = "C"
  },
  [10227] = {
    ID = 10227,
    Question = "“两情若是久长时”下一句是什么?",
    Option = {
      A = "又岂在暮暮朝朝",
      B = "自在娇莺恰恰啼",
      C = "上有黄鹂深树鸣",
      D = "又岂在朝朝暮暮"
    },
    Answer = "D"
  },
  [10228] = {
    ID = 10228,
    Question = "隋炀帝杨广即位后下令建造了什么大运河?",
    Option = {
      A = "隋唐大运河",
      B = "京杭大运河",
      C = "浙东大运河",
      D = "大唐大运河"
    },
    Answer = "A"
  },
  [10229] = {
    ID = 10229,
    Question = "中国的国宝是什么?",
    Option = {
      A = "城管",
      B = "大熊猫",
      C = "丹顶鹤",
      D = "汗血马"
    },
    Answer = "B"
  },
  [10230] = {
    ID = 10230,
    Question = "丝绸之路上运送的商品最著名的是什么?",
    Option = {
      A = "古董",
      B = "丝绸",
      C = "青铜",
      D = "大米"
    },
    Answer = "B"
  },
  [10231] = {
    ID = 10231,
    Question = "山海经中记载追逐太阳的人是谁?",
    Option = {
      A = "后羿",
      B = "黄帝",
      C = "夸父",
      D = "蚩尤"
    },
    Answer = "C"
  },
  [10232] = {
    ID = 10232,
    Question = "兵马俑是哪个皇帝的陪葬坑?",
    Option = {
      A = "唐太宗",
      B = "汉高祖",
      C = "西楚霸王",
      D = "秦始皇"
    },
    Answer = "D"
  },
  [10233] = {
    ID = 10233,
    Question = "中国古代传说中,为帮百姓治病而尝百草的人是谁?",
    Option = {
      A = "神农",
      B = "华佗",
      C = "扁鹊",
      D = "李时珍"
    },
    Answer = "A"
  },
  [10234] = {
    ID = 10234,
    Question = "望闻问切,四诊法是哪位神医发明的?",
    Option = {
      A = "扁鹊",
      B = "神农",
      C = "华佗",
      D = "李时珍"
    },
    Answer = "A"
  },
  [10235] = {
    ID = 10235,
    Question = "传说中嫦娥是偷吃了谁的不死药飞向月宫的?",
    Option = {
      A = "太上老君",
      B = "后羿",
      C = "太白金星",
      D = "玉皇大帝"
    },
    Answer = "B"
  },
  [10236] = {
    ID = 10236,
    Question = "灵鹤的原形是什么动物?",
    Option = {
      A = "赤颈鹤",
      B = "黑颈鹤",
      C = "丹顶鹤",
      D = "守鹤"
    },
    Answer = "C"
  },
  [10237] = {
    ID = 10237,
    Question = "中国故宫称为什么?",
    Option = {
      A = "长城",
      B = "皇城",
      C = "紫禁城",
      D = "王城"
    },
    Answer = "C"
  },
  [10238] = {
    ID = 10238,
    Question = "四大文明古国分别是中国,古埃及,古印度和什么?",
    Option = {
      A = "古罗马",
      B = "雅典",
      C = "底比斯",
      D = "古巴比伦"
    },
    Answer = "D"
  },
  [10239] = {
    ID = 10239,
    Question = "建筑工匠把谁奉为祖先?",
    Option = {
      A = "老子",
      B = "鲁迅",
      C = "廉颇",
      D = "鲁班"
    },
    Answer = "D"
  },
  [10240] = {
    ID = 10240,
    Question = "帝尧时期,为治洪水三过家门而不入的人是谁?",
    Option = {
      A = "大帝",
      B = "大尧",
      C = "大雄",
      D = "大禹"
    },
    Answer = "D"
  },
  [10241] = {
    ID = 10241,
    Question = "物理学上垂直压在物体表面上的力叫做什么?",
    Option = {
      A = "压力",
      B = "动力",
      C = "引力",
      D = "浮力"
    },
    Answer = "A"
  },
  [10242] = {
    ID = 10242,
    Question = "后羿的妻子是谁?",
    Option = {
      A = "貂蝉",
      B = "嫦娥",
      C = "昭君",
      D = "西施"
    },
    Answer = "B"
  },
  [10243] = {
    ID = 10243,
    Question = "《山海经》中记载的希望用树枝石块填平东海的是谁?",
    Option = {
      A = "刑天",
      B = "精卫",
      C = "祝融",
      D = "王母"
    },
    Answer = "B"
  },
  [10244] = {
    ID = 10244,
    Question = "“知己知彼,百战不殆”出自哪里?",
    Option = {
      A = "太公兵法",
      B = "水战兵法",
      C = "孙子兵法",
      D = "孙膑兵法"
    },
    Answer = "C"
  },
  [10245] = {
    ID = 10245,
    Question = "中国古代神话中熔炼五色神石来补天的古神是谁? ",
    Option = {
      A = "炎帝",
      B = "黄帝",
      C = "女娲",
      D = "夸父"
    },
    Answer = "C"
  },
  [10246] = {
    ID = 10246,
    Question = "“东风不与周郎便”下一句是什么?",
    Option = {
      A = "万里长征人未还",
      B = "铜雀春深锁二乔",
      C = "闻郎江上唱歌声",
      D = "一片冰心在玉壶"
    },
    Answer = "B"
  },
  [10247] = {
    ID = 10247,
    Question = "“故人具鸡黍”下一句是什么?",
    Option = {
      A = "邀我至田家",
      B = "凫雁满回塘",
      C = "弹琴复长啸",
      D = "问言谁与餐"
    },
    Answer = "A"
  },
  [10248] = {
    ID = 10248,
    Question = "“春眠不觉晓”下一句是什么?",
    Option = {
      A = "处处闻啼鸟",
      B = "凫雁满回塘",
      C = "弹琴复长啸",
      D = "问言谁与餐"
    },
    Answer = "A"
  },
  [10249] = {
    ID = 10249,
    Question = "“花有清香月有阴”上一句是什么? ",
    Option = {
      A = "湖光秋月两相和",
      B = "春宵一刻值千金",
      C = "水光潋滟晴方好",
      D = "泉眼无声惜细流"
    },
    Answer = "B"
  },
  [10250] = {
    ID = 10250,
    Question = "“野火烧不尽”下一句是什么?",
    Option = {
      A = "春风花草香",
      B = "润物细无声",
      C = "春风吹又生",
      D = "鱼戏莲叶东"
    },
    Answer = "C"
  },
  [10251] = {
    ID = 10251,
    Question = "“秦时明月汉时关”下一句是什么?",
    Option = {
      A = "万里长征人未还",
      B = "不破楼兰终不还",
      C = "子规声里雨如烟",
      D = "南望王师又一年"
    },
    Answer = "A"
  },
  [10252] = {
    ID = 10252,
    Question = "“海内存知己”下一句是什么?",
    Option = {
      A = "歌声振林樾",
      B = "天涯若比邻",
      C = "江清月近人",
      D = "桂树作团团"
    },
    Answer = "B"
  },
  [10253] = {
    ID = 10253,
    Question = "中国古代神话中射下了九个太阳的是谁?",
    Option = {
      A = "炎帝",
      B = "后羿",
      C = "夸父",
      D = "女娲"
    },
    Answer = "B"
  },
  [10254] = {
    ID = 10254,
    Question = "“国破山河在”下一句是什么?",
    Option = {
      A = "春风花草香",
      B = "大雪满弓刀",
      C = "城春草木深",
      D = "凤歌笑孔丘"
    },
    Answer = "C"
  },
  [10255] = {
    ID = 10255,
    Question = "专诸刺王僚时,置之鱼腹中而得名的名剑叫什么?",
    Option = {
      A = "金蛇剑",
      B = "赤霄剑",
      C = "鱼肠剑",
      D = "莫邪剑"
    },
    Answer = "C"
  },
  [10256] = {
    ID = 10256,
    Question = "“东施效颦”一词中说的是东施意欲模仿哪位美人的姿态?",
    Option = {
      A = "昭君",
      B = "貂蝉",
      C = "杨玉环",
      D = "西施"
    },
    Answer = "D"
  },
  [10257] = {
    ID = 10257,
    Question = "送子天王图是哪个画家的作品?",
    Option = {
      A = "吴道子",
      B = "李公麟",
      C = "齐白石",
      D = "顾恺之"
    },
    Answer = "A"
  },
  [10258] = {
    ID = 10258,
    Question = "《黄鹤楼》的作者是谁? ",
    Option = {
      A = "祖咏",
      B = "崔颢",
      C = "孟郊",
      D = "王翰"
    },
    Answer = "B"
  },
  [10259] = {
    ID = 10259,
    Question = "《西游记》的作者是谁?",
    Option = {
      A = "罗贯中",
      B = "吴承恩",
      C = "施耐庵",
      D = "曹雪芹"
    },
    Answer = "B"
  },
  [10260] = {
    ID = 10260,
    Question = "三国演义何人所著?",
    Option = {
      A = "吴承恩",
      B = "曹雪芹",
      C = "施耐庵",
      D = "罗贯中"
    },
    Answer = "D"
  },
  [10261] = {
    ID = 10261,
    Question = "“洛神赋图”是哪位画家所画?",
    Option = {
      A = "吴道子",
      B = "李公麟",
      C = "齐白石",
      D = "顾恺之"
    },
    Answer = "D"
  },
  [10262] = {
    ID = 10262,
    Question = "孙悟空的法号是什么?",
    Option = {
      A = "悟能",
      B = "悟净",
      C = "悟空",
      D = "悟饭"
    },
    Answer = "C"
  },
  [10263] = {
    ID = 10263,
    Question = "猪八戒法号什么?",
    Option = {
      A = "悟空",
      B = "悟净",
      C = "悟能",
      D = "悟饭"
    },
    Answer = "C"
  },
  [10264] = {
    ID = 10264,
    Question = "“老骥伏枥,志在千里”出自什么诗?",
    Option = {
      A = "出塞",
      B = "渭城曲",
      C = "游子吟",
      D = "龟虽寿"
    },
    Answer = "D"
  },
  [10265] = {
    ID = 10265,
    Question = "“力拔山兮气盖世,时不利兮骓不逝”此歌是哪位霸主所唱?",
    Option = {
      A = "项羽",
      B = "嬴政",
      C = "刘邦",
      D = "曹操"
    },
    Answer = "A"
  },
  [10266] = {
    ID = 10266,
    Question = "“一夫当关,万夫莫开”出自哪首诗词?",
    Option = {
      A = "蜀道难",
      B = "关山月",
      C = "凉州词",
      D = "渭城曲"
    },
    Answer = "A"
  },
  [10267] = {
    ID = 10267,
    Question = "孙权字什么?",
    Option = {
      A = "伯符",
      B = "仲谋",
      C = "仲达",
      D = "仲业"
    },
    Answer = "B"
  },
  [10268] = {
    ID = 10268,
    Question = "传说中斩白蛇显帝相的枭雄是谁? ",
    Option = {
      A = "曹操",
      B = "刘邦",
      C = "项羽",
      D = "嬴政"
    },
    Answer = "B"
  },
  [10269] = {
    ID = 10269,
    Question = "“铜雀春深锁二乔”中的二乔是哪国人?",
    Option = {
      A = "蜀国",
      B = "魏国",
      C = "吴国 ",
      D = "秦国"
    },
    Answer = "C"
  },
  [10270] = {
    ID = 10270,
    Question = "西楚霸王项羽被刘邦军追至哪里横剑自刎?",
    Option = {
      A = "珠江",
      B = "辽江",
      C = "乌江",
      D = "松花江"
    },
    Answer = "C"
  },
  [10271] = {
    ID = 10271,
    Question = "沙僧法号什么?",
    Option = {
      A = "悟净",
      B = "悟空",
      C = "悟能",
      D = "悟饭"
    },
    Answer = "A"
  },
  [10272] = {
    ID = 10272,
    Question = "刘备三顾茅庐请谁出山相助? ",
    Option = {
      A = "庞宠",
      B = "诸葛亮",
      C = "周瑜",
      D = "司马懿"
    },
    Answer = "B"
  },
  [10273] = {
    ID = 10273,
    Question = "“谁言寸草心”下一句是什么?",
    Option = {
      A = "谈笑无还期",
      B = "报得三春晖",
      C = "风烟望五津",
      D = "还寝梦佳期"
    },
    Answer = "B"
  },
  [10274] = {
    ID = 10274,
    Question = "“抽刀断水水更流”下一句是什么? ",
    Option = {
      A = "愁云惨淡万里凝",
      B = "惟见长江天际流",
      C = "举杯销愁愁更愁",
      D = "白云千载空悠悠"
    },
    Answer = "C"
  },
  [10275] = {
    ID = 10275,
    Question = "关羽字什么?",
    Option = {
      A = "孟德",
      B = "玄德",
      C = "云长",
      D = "子龙"
    },
    Answer = "C"
  },
  [10276] = {
    ID = 10276,
    Question = "张飞字什么?",
    Option = {
      A = "玄德",
      B = "仲达",
      C = "翼德",
      D = "仲谋"
    },
    Answer = "C"
  },
  [10277] = {
    ID = 10277,
    Question = "地球的自转方向是自西向什么? ",
    Option = {
      A = "东",
      B = "南",
      C = "西",
      D = "北"
    },
    Answer = "A"
  },
  [10278] = {
    ID = 10278,
    Question = "害死民族英雄岳飞的奸相是谁? ",
    Option = {
      A = "和珅",
      B = "秦桧",
      C = "赵高",
      D = "曹丕"
    },
    Answer = "B"
  },
  [10279] = {
    ID = 10279,
    Question = "“欲穷千里目”下一句是什么?",
    Option = {
      A = "双泪落君前",
      B = "更上一层楼",
      C = "何处得秋霜",
      D = "众鸟高飞尽"
    },
    Answer = "B"
  },
  [10280] = {
    ID = 10280,
    Question = "“人生得意须尽欢”下一句是什么? ",
    Option = {
      A = "烟花三月下扬州",
      B = "莫使金樽空对月",
      C = "烟波江上使人愁",
      D = "人面桃花相映红"
    },
    Answer = "B"
  },
  [10281] = {
    ID = 10281,
    Question = "“鬼狐有性格,笑骂成文章”是形容蒲松龄的哪部作品?",
    Option = {
      A = "山海经",
      B = "西游记",
      C = "聊斋志异",
      D = "三国志"
    },
    Answer = "C"
  },
  [10282] = {
    ID = 10282,
    Question = "赵云字什么? ",
    Option = {
      A = "子健",
      B = "子翼",
      C = "子龙",
      D = "子阳"
    },
    Answer = "C"
  },
  [10283] = {
    ID = 10283,
    Question = "《红楼梦》的作者是谁?",
    Option = {
      A = "曹雪芹",
      B = "蒲松龄",
      C = "吴承恩",
      D = "施耐庵"
    },
    Answer = "A"
  },
  [10284] = {
    ID = 10284,
    Question = "“烽火连三月”下一句是什么? ",
    Option = {
      A = "家书抵万金",
      B = "空山不见人",
      C = "孤舟蓑笠翁",
      D = "白发三千丈"
    },
    Answer = "A"
  },
  [10285] = {
    ID = 10285,
    Question = "刘备字什么?",
    Option = {
      A = "翼德",
      B = "玄德",
      C = "孟德",
      D = "子德"
    },
    Answer = "B"
  },
  [10286] = {
    ID = 10286,
    Question = "从地球上看太阳是从哪个方向下山的? ",
    Option = {
      A = "东方",
      B = "北方",
      C = "西方",
      D = "南方"
    },
    Answer = "C"
  },
  [10287] = {
    ID = 10287,
    Question = "“伫灵匹于星期,眷神姿于月夕”描写的是哪个节日?",
    Option = {
      A = "清明",
      B = "重阳",
      C = "七夕",
      D = "元旦"
    },
    Answer = "C"
  },
  [10288] = {
    ID = 10288,
    Question = "“不知天上宫阙”下一句是什么?",
    Option = {
      A = "万户捣衣声",
      B = "胡窥青海湾",
      C = "苍茫云海间",
      D = "今夕是何年"
    },
    Answer = "D"
  },
  [10289] = {
    ID = 10289,
    Question = "“醉翁之意不在酒”下一句是什么? ",
    Option = {
      A = "在乎山水之间也",
      B = "千里黄云白日曛",
      C = "春风又绿江南岸",
      D = "云想衣裳花想容"
    },
    Answer = "A"
  },
  [10290] = {
    ID = 10290,
    Question = "“蝴蝶在热带轻轻扇动一下翅膀,遥远的国家就可以造成一场飓风”这是什么效应的通俗解释?",
    Option = {
      A = "蝴蝶效应",
      B = "青蛙效应",
      C = "鲶鱼效应",
      D = "开放效应"
    },
    Answer = "A"
  },
  [10291] = {
    ID = 10291,
    Question = "人体内脏里最大的器官是什么? ",
    Option = {
      A = "心脏",
      B = "肺部",
      C = "肝脏",
      D = "肾脏"
    },
    Answer = "C"
  },
  [10292] = {
    ID = 10292,
    Question = "“起舞弄清影”下一句是什么?",
    Option = {
      A = "何处得秋霜",
      B = "众鸟高飞尽",
      C = "大雪满弓刀",
      D = "何似在人间"
    },
    Answer = "D"
  },
  [10293] = {
    ID = 10293,
    Question = "“我欲乘风归去”下一句是什么? ",
    Option = {
      A = "又恐琼楼玉宇",
      B = "不知何处天边",
      C = "北上云阁飞除",
      D = "渡头月色沉沉"
    },
    Answer = "A"
  },
  [10294] = {
    ID = 10294,
    Question = "一个动力系统中初始条件下微小的变化能带动整个系统的长期的巨大的连锁反应称为什么效应? ",
    Option = {
      A = "蝴蝶效应",
      B = "青蛙效应",
      C = "鲶鱼效应",
      D = "开放效应"
    },
    Answer = "A"
  },
  [10295] = {
    ID = 10295,
    Question = "从地球上看,太阳是从哪个方向升起的?",
    Option = {
      A = "南方",
      B = "东方",
      C = "西方",
      D = "北方"
    },
    Answer = "B"
  },
  [10296] = {
    ID = 10296,
    Question = "“明月几时有”下一句是什么? ",
    Option = {
      A = "何处得秋霜",
      B = "把酒问青天",
      C = "还来就菊花",
      D = "春草年年绿"
    },
    Answer = "B"
  },
  [10297] = {
    ID = 10297,
    Question = "气温开始下降天气转凉早晨草木上有了露水形容了我国二十四节气之一的什么?",
    Option = {
      A = "小雪",
      B = "小暑",
      C = "雨水",
      D = "白露"
    },
    Answer = "D"
  },
  [10298] = {
    ID = 10298,
    Question = "脾的主要功能是过滤和储存什么?",
    Option = {
      A = "水分",
      B = "尿液",
      C = "胃酸",
      D = "血液"
    },
    Answer = "D"
  },
  [10299] = {
    ID = 10299,
    Question = "人吃东西能品尝出酸甜苦辣等味道是因为舌头上有什么?",
    Option = {
      A = "舌苔",
      B = "神经",
      C = "血液",
      D = "味蕾"
    },
    Answer = "D"
  },
  [10300] = {
    ID = 10300,
    Question = "梅雨亦称什么?",
    Option = {
      A = "谷雨",
      B = "美雨",
      C = "霉雨",
      D = "眉雨"
    },
    Answer = "C"
  },
  [10301] = {
    ID = 10301,
    Question = "春节时正月初七的人日也称为什么?",
    Option = {
      A = "羊节",
      B = "牛节",
      C = "人胜节",
      D = "狗节"
    },
    Answer = "C"
  },
  [10302] = {
    ID = 10302,
    Question = "二十四节气中的二分分别是春分和什么?",
    Option = {
      A = "秋分",
      B = "冬至",
      C = "芒种",
      D = "雨水"
    },
    Answer = "A"
  },
  [10303] = {
    ID = 10303,
    Question = "立春立夏立秋立冬合称为什么?",
    Option = {
      A = "四立",
      B = "时立",
      C = "节立",
      D = "季立"
    },
    Answer = "A"
  },
  [10304] = {
    ID = 10304,
    Question = "春节时正月初三是女娲造羊的日子,故称为什么?",
    Option = {
      A = "羊日",
      B = "羊节",
      C = "羊时",
      D = "羊诞"
    },
    Answer = "A"
  },
  [10305] = {
    ID = 10305,
    Question = "液态氧气是什么颜色的?",
    Option = {
      A = "浅啡色",
      B = "淡蓝色",
      C = "中褐色",
      D = "粉红色"
    },
    Answer = "B"
  },
  [10306] = {
    ID = 10306,
    Question = "中国最早的诗歌总集是什么?",
    Option = {
      A = "山海经",
      B = "佛经",
      C = "诗经",
      D = "菩提经"
    },
    Answer = "C"
  },
  [10307] = {
    ID = 10307,
    Question = "发育良好的石英单晶为六方锥体,通常为块状或粒状集合体,纯净透明的石英晶称为什么? ",
    Option = {
      A = "钻石",
      B = "宝石",
      C = "水晶",
      D = "人造石"
    },
    Answer = "C"
  },
  [10308] = {
    ID = 10308,
    Question = "“燕草如碧丝,秦桑低绿支”两句诗中哪个字是错别字? ",
    Option = {
      A = "如",
      B = "桑",
      C = "支",
      D = "草"
    },
    Answer = "C"
  },
  [10309] = {
    ID = 10309,
    Question = "“故国三千里”下一句什么?",
    Option = {
      A = "应知故乡事",
      B = "何似在人间",
      C = "妇啼一何苦",
      D = "深宫二十年"
    },
    Answer = "D"
  },
  [10310] = {
    ID = 10310,
    Question = "“十年一觉扬州梦,赢得青楼簿幸名”中哪个字是错别字? ",
    Option = {
      A = "觉",
      B = "得",
      C = "名",
      D = "簿"
    },
    Answer = "D"
  },
  [10311] = {
    ID = 10311,
    Question = "古代儿童将头发分作左右两边,在头顶各扎成一个结,形如两个羊角,称为什么?",
    Option = {
      A = "总角",
      B = "喜寿",
      C = "古稀",
      D = "弱冠"
    },
    Answer = "A"
  },
  [10312] = {
    ID = 10312,
    Question = "“君子好逑”上一句是什么?",
    Option = {
      A = "窈窕淑女",
      B = "对酒当歌",
      C = "月明星稀",
      D = "明明如月"
    },
    Answer = "A"
  },
  [10313] = {
    ID = 10313,
    Question = "“别有幽愁暗恨生,此时无声盛有声”这2句诗中那个字是错别字? ",
    Option = {
      A = "此",
      B = "无",
      C = "盛",
      D = "愁"
    },
    Answer = "C"
  },
  [10314] = {
    ID = 10314,
    Question = "“东风不与周郎便,铜雀春深锁二桥”这2句诗中那个字是错别字? ",
    Option = {
      A = "郎",
      B = "雀",
      C = "桥",
      D = "不"
    },
    Answer = "C"
  },
  [10315] = {
    ID = 10315,
    Question = "“关关雎鸠”下一句是什么? ",
    Option = {
      A = "窈窕淑女",
      B = "对酒当歌",
      C = "明明如月",
      D = "在河之洲"
    },
    Answer = "D"
  },
  [10316] = {
    ID = 10316,
    Question = "“万国尽征戎,峰火被冈峦”这2句诗中那个字是错别字?",
    Option = {
      A = "峰",
      B = "冈",
      C = "征",
      D = "万"
    },
    Answer = "A"
  },
  [10317] = {
    ID = 10317,
    Question = "“蜡烛有心还惜别”下一句是什么?",
    Option = {
      A = "烟波江上使人愁",
      B = "替人垂泪到天明",
      C = "芳草萋萋鹦鹉洲",
      D = "客舍青青柳色新"
    },
    Answer = "B"
  },
  [10318] = {
    ID = 10318,
    Question = "“孤帆远影碧空尽,唯见长江天际流”两句诗中哪个字是错误字?",
    Option = {
      A = "孤",
      B = "唯",
      C = "远",
      D = "碧"
    },
    Answer = "B"
  },
  [10319] = {
    ID = 10319,
    Question = "“松下问童子”下一句是什么?",
    Option = {
      A = "深宫二十年",
      B = "言师采药去",
      C = "秦桑低绿枝",
      D = "大雪满弓刀"
    },
    Answer = "B"
  },
  [10320] = {
    ID = 10320,
    Question = "二十四节气中的二至分别是夏至和什么? ",
    Option = {
      A = "霜降",
      B = "寒露",
      C = "冬至",
      D = "小雪"
    },
    Answer = "C"
  },
  [10321] = {
    ID = 10321,
    Question = "“黄鹤一去不复返”下一句是什么? ",
    Option = {
      A = "替人垂泪到天明",
      B = "芳草萋萋鹦鹉洲",
      C = "客舍青青柳色新",
      D = "白云千载空悠悠"
    },
    Answer = "D"
  },
  [10322] = {
    ID = 10322,
    Question = "“此情可待成追忆”下一句是什么? ",
    Option = {
      A = "青春作伴好还乡",
      B = "芳草萋萋鹦鹉洲",
      C = "只是当时已惘然",
      D = "一片孤城万仞山"
    },
    Answer = "C"
  },
  [10323] = {
    ID = 10323,
    Question = "俱怀逸兴壮思飞,欲上青天览明月中通假字“览”通那个字? ",
    Option = {
      A = "篮",
      B = "蓝",
      C = "揽",
      D = "拦"
    },
    Answer = "C"
  },
  [10324] = {
    ID = 10324,
    Question = "历史上第一个获得两次诺贝尔奖的人是谁? ",
    Option = {
      A = "张伯伦",
      B = "朗道",
      C = "居里夫人",
      D = "爱恩斯坦"
    },
    Answer = "C"
  },
  [10325] = {
    ID = 10325,
    Question = "中国四大名菜分别是西施舌,貂蝉豆腐,昭君鸭和什么?",
    Option = {
      A = "贵妃牛",
      B = "贵妃猪",
      C = "贵妃羊",
      D = "贵妃鸡"
    },
    Answer = "D"
  },
  [10326] = {
    ID = 10326,
    Question = "“出淤泥而不染,濯清涟而不妖”出自? ",
    Option = {
      A = "爱莲说",
      B = "静夜诗",
      C = "春望",
      D = "春晓"
    },
    Answer = "A"
  },
  [10327] = {
    ID = 10327,
    Question = "乌龙茶又称什么? ",
    Option = {
      A = "青茶",
      B = "黄茶",
      C = "红茶",
      D = "黑茶"
    },
    Answer = "A"
  },
  [10328] = {
    ID = 10328,
    Question = "迈克尔乔丹一共获得过多少次NBA总冠军? ",
    Option = {
      A = "6",
      B = "5",
      C = "3",
      D = "4"
    },
    Answer = "A"
  },
  [10329] = {
    ID = 10329,
    Question = "北豆腐《卤水豆腐》是用什么作为凝固剂? ",
    Option = {
      A = "盐卤",
      B = "豆浆",
      C = "生粉",
      D = "猪油"
    },
    Answer = "A"
  },
  [10330] = {
    ID = 10330,
    Question = "东坡肉是哪个地方的名菜? ",
    Option = {
      A = "杭州",
      B = "苏州",
      C = "梧州",
      D = "广州"
    },
    Answer = "A"
  },
  [10331] = {
    ID = 10331,
    Question = "过桥米线是我国哪个省份的名菜? ",
    Option = {
      A = "云南",
      B = "贵州",
      C = "河南",
      D = "广东"
    },
    Answer = "A"
  },
  [10332] = {
    ID = 10332,
    Question = "麻婆豆腐是我国哪个省份的名菜?",
    Option = {
      A = "广东",
      B = "四川",
      C = "广西",
      D = "东北"
    },
    Answer = "B"
  },
  [10333] = {
    ID = 10333,
    Question = "南豆腐是用什么作为凝固剂?",
    Option = {
      A = "盐卤",
      B = "石膏",
      C = "豆浆",
      D = "生粉"
    },
    Answer = "B"
  },
  [10334] = {
    ID = 10334,
    Question = "“昨夜星辰昨夜风”下一句是什么? ",
    Option = {
      A = "房租每月交房东",
      B = "春风不度玉门关",
      C = "画楼西畔桂堂东",
      D = "乌衣巷口夕阳斜"
    },
    Answer = "C"
  },
  [10335] = {
    ID = 10335,
    Question = "烹调东坡肉最好选用什么猪肉?",
    Option = {
      A = "猪颈肉",
      B = "槽头肉",
      C = "五花肉",
      D = "前腿肉"
    },
    Answer = "C"
  },
  [10336] = {
    ID = 10336,
    Question = "孙中山先生的原名叫什么?",
    Option = {
      A = "孙坚",
      B = "孙权",
      C = "孙文",
      D = "孙策"
    },
    Answer = "C"
  },
  [10337] = {
    ID = 10337,
    Question = "现代物理学的开创者和奠基人,相对论,质能关系的提出者是谁?",
    Option = {
      A = "居里夫人",
      B = "牛顿",
      C = "霍金",
      D = "爱因斯坦"
    },
    Answer = "D"
  },
  [10338] = {
    ID = 10338,
    Question = "因为乌龙茶的品尝比较讲究,冲泡也颇费工夫,因而人们称它为什么? ",
    Option = {
      A = "普洱茶",
      B = "菊花茶",
      C = "冰绿茶",
      D = "功夫茶"
    },
    Answer = "D"
  },
  [10339] = {
    ID = 10339,
    Question = "广州文昌鸡属于我国哪个菜系? ",
    Option = {
      A = "粤菜",
      B = "闽菜",
      C = "黔菜",
      D = "浙菜"
    },
    Answer = "A"
  },
  [10340] = {
    ID = 10340,
    Question = "在中秋节的传统食品是什么? ",
    Option = {
      A = "柚子",
      B = "菠萝",
      C = "月饼",
      D = "煎饼"
    },
    Answer = "C"
  },
  [10341] = {
    ID = 10341,
    Question = "滇式月饼主要特点是馅料采用了什么食材? ",
    Option = {
      A = "白莲蓉",
      B = "黑莲蓉",
      C = "滇式火腿",
      D = "咸蛋黄"
    },
    Answer = "C"
  },
  [10342] = {
    ID = 10342,
    Question = "拉肠是一种使用什么作成的广东小吃? ",
    Option = {
      A = "蛋白",
      B = "葛粉",
      C = "花生酱",
      D = "米浆"
    },
    Answer = "D"
  },
  [10343] = {
    ID = 10343,
    Question = "世界三大古酒分别是啤酒,葡萄酒和什么? ",
    Option = {
      A = "中国黄酒",
      B = "香槟酒",
      C = "糯米酒",
      D = "药材酒"
    },
    Answer = "A"
  },
  [10344] = {
    ID = 10344,
    Question = "茅台的原产地是我国的那个省? ",
    Option = {
      A = "贵州",
      B = "安徽",
      C = "湖南",
      D = "四川"
    },
    Answer = "A"
  },
  [10345] = {
    ID = 10345,
    Question = "中国国酒是什么酒? ",
    Option = {
      A = "糯米酒",
      B = "茅台",
      C = "药材酒",
      D = "红酒"
    },
    Answer = "B"
  },
  [10346] = {
    ID = 10346,
    Question = "世界三大古酒分别是葡萄酒,中国黄酒和什么?",
    Option = {
      A = "糯米酒",
      B = "香槟酒",
      C = "啤酒",
      D = "米酒"
    },
    Answer = "C"
  },
  [10347] = {
    ID = 10347,
    Question = "我国三大名酒,汾酒,泸州老窖和什么?",
    Option = {
      A = "糯米酒",
      B = "香槟酒",
      C = "啤酒",
      D = "茅台"
    },
    Answer = "D"
  },
  [10348] = {
    ID = 10348,
    Question = "广东把馄饨叫什么? ",
    Option = {
      A = "抄手",
      B = "水饺",
      C = "包袱",
      D = "云吞"
    },
    Answer = "D"
  },
  [10349] = {
    ID = 10349,
    Question = "四川把馄饨叫什么? ",
    Option = {
      A = "抄手",
      B = "水饺",
      C = "扁食",
      D = "云吞"
    },
    Answer = "A"
  },
  [10350] = {
    ID = 10350,
    Question = "“糯米鸡”是我国哪个省份的著名小吃?",
    Option = {
      A = "广东",
      B = "广西",
      C = "湖南",
      D = "四川"
    },
    Answer = "A"
  },
  [10351] = {
    ID = 10351,
    Question = "荔枝主要产于我国的那个省份?",
    Option = {
      A = "广西",
      B = "广东",
      C = "四川",
      D = "安徽"
    },
    Answer = "B"
  },
  [10352] = {
    ID = 10352,
    Question = "“及第粥”是我国哪个省份的著名小吃?",
    Option = {
      A = "陕西",
      B = "广东",
      C = "安徽",
      D = "东北"
    },
    Answer = "B"
  },
  [10353] = {
    ID = 10353,
    Question = "孔融是被何人所杀?",
    Option = {
      A = "吕布",
      B = "魏延",
      C = "曹操",
      D = "曹丕"
    },
    Answer = "C"
  },
  [10354] = {
    ID = 10354,
    Question = "白猫和黑猫一起过马路,白猫不小心被车撞了,那么白猫对黑猫说的第一句话是什么?",
    Option = {
      A = "嗷",
      B = "喵",
      C = "呜",
      D = "噢"
    },
    Answer = "B"
  },
  [10355] = {
    ID = 10355,
    Question = "花的孩子叫什么?",
    Option = {
      A = "蕊",
      B = "瓣",
      C = "心",
      D = "米"
    },
    Answer = "D"
  },
  [10356] = {
    ID = 10356,
    Question = "花的老公叫什么?",
    Option = {
      A = "蝶",
      B = "鸟",
      C = "蜂",
      D = "蚁"
    },
    Answer = "A"
  },
  [10357] = {
    ID = 10357,
    Question = "什么花最没力? ",
    Option = {
      A = "茉莉花",
      B = "太阳花",
      C = "玫瑰花",
      D = "玉兰花"
    },
    Answer = "A"
  },
  [10358] = {
    ID = 10358,
    Question = "什么动物被打死后流自己的血? ",
    Option = {
      A = "蜘蛛",
      B = "蟑螂",
      C = "蚊子",
      D = "蚂蚁"
    },
    Answer = "C"
  },
  [10359] = {
    ID = 10359,
    Question = "数字“3”在路上走呀走……翻了一个跟头,又接着翻了一个,猜一成语",
    Option = {
      A = "三班六房",
      B = "三言两语",
      C = "三榜定案",
      D = "三番两次"
    },
    Answer = "D"
  },
  [10360] = {
    ID = 10360,
    Question = "谁天天去看病? ",
    Option = {
      A = "医生",
      B = "病人",
      C = "老师",
      D = "官员"
    },
    Answer = "A"
  },
  [10361] = {
    ID = 10361,
    Question = "王老太整天喋喋不休,可她有一个月说话最少,是哪个月? ",
    Option = {
      A = "2",
      B = "4",
      C = "6",
      D = "8"
    },
    Answer = "A"
  },
  [10362] = {
    ID = 10362,
    Question = "蜗牛爬墙,墙高10米,白天上爬3米,晚上溜下2米,需要几天爬到墙头? ",
    Option = {
      A = "8",
      B = "6",
      C = "11",
      D = "9"
    },
    Answer = "A"
  },
  [10363] = {
    ID = 10363,
    Question = "在大海上讲笑话会造成什么后果? ",
    Option = {
      A = "坐牢",
      B = "被打",
      C = "海啸",
      D = "被骂"
    },
    Answer = "C"
  },
  [10364] = {
    ID = 10364,
    Question = "下列哪种喝水方式不宜采用?",
    Option = {
      A = "饭后大量喝水",
      B = "渴了再喝水",
      C = "睡前喝水",
      D = "醒后喝水"
    },
    Answer = "A"
  },
  [10365] = {
    ID = 10365,
    Question = "乒乓球瘪了用什么办法能使它鼓起来?",
    Option = {
      A = "放到冰柜里",
      B = "向里面吹气",
      C = "泡在开水里",
      D = "哄它"
    },
    Answer = "C"
  },
  [10366] = {
    ID = 10366,
    Question = "狗为什么总伸着舌头喘气?",
    Option = {
      A = "散热",
      B = "跑得太快",
      C = "帮助呼吸",
      D = "饥饿"
    },
    Answer = "A"
  },
  [10367] = {
    ID = 10367,
    Question = "家庭照明电路的电压是多少伏?",
    Option = {
      A = "110伏",
      B = "220伏",
      C = "380伏",
      D = "450伏"
    },
    Answer = "B"
  },
  [10368] = {
    ID = 10368,
    Question = "向日葵为什么跟着太阳转是因为?",
    Option = {
      A = "因为地球自转",
      B = "向光性",
      C = "因为太阳欠向日葵钱",
      D = "向日葵爱太阳"
    },
    Answer = "B"
  },
  [10369] = {
    ID = 10369,
    Question = "UFO的具体含义是?",
    Option = {
      A = "不明飞行物",
      B = "联合国安理会",
      C = "美国中央情报局",
      D = "有关部门"
    },
    Answer = "A"
  },
  [10370] = {
    ID = 10370,
    Question = "放大镜的设计原理是采用了?",
    Option = {
      A = "凸透镜",
      B = "凹透镜",
      C = "凹镜",
      D = "凸镜"
    },
    Answer = "A"
  },
  [10371] = {
    ID = 10371,
    Question = "在汽车前面供驾驶员看左右和后面车辆的是?",
    Option = {
      A = "凹镜",
      B = "凸镜",
      C = "凹透镜",
      D = "凸透镜"
    },
    Answer = "B"
  },
  [10372] = {
    ID = 10372,
    Question = "中国已经成功举办哪年奥运会?",
    Option = {
      A = "2002",
      B = "2004",
      C = "2008",
      D = "2012"
    },
    Answer = "C"
  },
  [10373] = {
    ID = 10373,
    Question = "哪一种米最有黏性?",
    Option = {
      A = "大米",
      B = "糯米",
      C = "小米",
      D = "纳米"
    },
    Answer = "B"
  },
  [10374] = {
    ID = 10374,
    Question = "中国的四大发明不包括?",
    Option = {
      A = "火药",
      B = "地动仪",
      C = "造纸术",
      D = "指南针"
    },
    Answer = "B"
  },
  [10375] = {
    ID = 10375,
    Question = "“娃娃鱼”是指?",
    Option = {
      A = "壁虎 ",
      B = "大鲵",
      C = "鲶鱼",
      D = "鳄鱼"
    },
    Answer = "B"
  },
  [10376] = {
    ID = 10376,
    Question = "小时候用鳃呼吸,长大后用肺呼吸的动物是?",
    Option = {
      A = "鱼",
      B = "青蛙",
      C = "海豚",
      D = "鸭子"
    },
    Answer = "B"
  },
  [10377] = {
    ID = 10377,
    Question = "鸢的俗称是什么?",
    Option = {
      A = "乌鸦 ",
      B = "老鹰",
      C = "雕",
      D = "麻雀"
    },
    Answer = "B"
  },
  [10378] = {
    ID = 10378,
    Question = "仙人掌原产?",
    Option = {
      A = "平原",
      B = "沙漠",
      C = "沼泽",
      D = "湿地"
    },
    Answer = "B"
  },
  [10379] = {
    ID = 10379,
    Question = "在0摄氏度时,水会?",
    Option = {
      A = "沸腾",
      B = "结冰",
      C = "没变化",
      D = "蒸发"
    },
    Answer = "B"
  },
  [10380] = {
    ID = 10380,
    Question = "在生物学上以下的：水稻→蝗虫→青蛙→蛇→猫头鹰的关系称什么?",
    Option = {
      A = "营养级",
      B = "食物链",
      C = "生态系统",
      D = "局部区域 "
    },
    Answer = "B"
  },
  [10381] = {
    ID = 10381,
    Question = "从营养角度考虑,下列方法正确的是?",
    Option = {
      A = "反复淘米",
      B = "蔬菜先洗后切",
      C = "煮粥加碱",
      D = "多盐多油"
    },
    Answer = "B"
  },
  [10382] = {
    ID = 10382,
    Question = "天生的“捕鼠能手”的鸟和享有“森林医生”美称的鸟是?",
    Option = {
      A = "猫头鹰、啄木鸟",
      B = "猫头鹰、喜鹊",
      C = "老鹰、啄木鸟",
      D = "老鹰、喜鹊"
    },
    Answer = "A"
  },
  [10383] = {
    ID = 10383,
    Question = "海洋中最大的动物是?",
    Option = {
      A = "鲨鱼",
      B = "海象",
      C = "章鱼",
      D = "蓝鲸"
    },
    Answer = "D"
  },
  [10384] = {
    ID = 10384,
    Question = "在雷雨天气里,人在下列哪所房子里最安全?",
    Option = {
      A = "铁屋",
      B = "木屋",
      C = "一般楼房",
      D = "泥屋"
    },
    Answer = "C"
  },
  [10385] = {
    ID = 10385,
    Question = "“神舟7号”是?",
    Option = {
      A = "人造卫星",
      B = "航天飞机",
      C = "国际空间站",
      D = "载人飞船"
    },
    Answer = "D"
  },
  [10386] = {
    ID = 10386,
    Question = "下列哪个是全球气候变暖的原因?",
    Option = {
      A = "人的感觉",
      B = "温室效应",
      C = "人口的增加",
      D = "下雪的减少"
    },
    Answer = "B"
  },
  [10387] = {
    ID = 10387,
    Question = "一个充满气的氢气球,把它放了,它将?",
    Option = {
      A = "一直向上升",
      B = "不会上升",
      C = "一直升,最后爆炸",
      D = "一直下降"
    },
    Answer = "C"
  },
  [10388] = {
    ID = 10388,
    Question = "首次成功克隆哺乳动物——“多莉”的国家是?",
    Option = {
      A = "英国",
      B = "美国",
      C = "德国",
      D = "日本"
    },
    Answer = "A"
  },
  [10389] = {
    ID = 10389,
    Question = "我国著名科学家袁隆平被称为?",
    Option = {
      A = "杂交水稻之父",
      B = "中国水稻之父",
      C = "亚洲水稻之父",
      D = "世界水稻之父"
    },
    Answer = "A"
  },
  [10390] = {
    ID = 10390,
    Question = "夏天穿什么衣服比较凉爽?",
    Option = {
      A = "黑色",
      B = "白色",
      C = "褐色",
      D = "金色"
    },
    Answer = "B"
  },
  [10391] = {
    ID = 10391,
    Question = "世界上第一台计算机ENIAC是哪一年研制成功的?",
    Option = {
      A = "1944",
      B = "1945",
      C = "1946",
      D = "1947"
    },
    Answer = "C"
  },
  [10392] = {
    ID = 10392,
    Question = "桑巴舞是哪个国家人民最喜欢的舞蹈?",
    Option = {
      A = "美国",
      B = "巴西",
      C = "中国",
      D = "古巴"
    },
    Answer = "B"
  },
  [10393] = {
    ID = 10393,
    Question = "每年九月钱塘江潮波澜壮阔,吸引了无数游人观看,请问钱塘江在我国哪个省?",
    Option = {
      A = "山东省",
      B = "浙江省",
      C = "江苏省",
      D = "福建省"
    },
    Answer = "B"
  },
  [10394] = {
    ID = 10394,
    Question = "天生的“捕鼠能手”的鸟是?",
    Option = {
      A = "猫头鹰",
      B = "老鹰",
      C = "啄木鸟",
      D = "麻雀"
    },
    Answer = "A"
  },
  [10395] = {
    ID = 10395,
    Question = "航天员能在太空可以享用很多种饮料,但是目前还无法提供给航天员的是?",
    Option = {
      A = "苹果汁",
      B = "咖啡",
      C = "冰红茶",
      D = "啤酒"
    },
    Answer = "D"
  },
  [10396] = {
    ID = 10396,
    Question = "为防止我们居住环境的空气污染,净化空气最好的方法是?",
    Option = {
      A = "治理环境污染",
      B = "喷洒药物",
      C = "喷洒空气清新剂",
      D = "植树种草"
    },
    Answer = "D"
  },
  [10397] = {
    ID = 10397,
    Question = "如果工作场所潮湿,为避免触电,使用手持电动工具的人应该?",
    Option = {
      A = "站在铁板上操作",
      B = "站在绝缘胶板上操作",
      C = "穿防静电鞋操作",
      D = "穿钢制的鞋"
    },
    Answer = "B"
  },
  [10398] = {
    ID = 10398,
    Question = "发生火灾时?",
    Option = {
      A = "不能随便开启门窗",
      B = "只能开门",
      C = "只能开窗",
      D = "尽量开门开窗"
    },
    Answer = "A"
  },
  [10399] = {
    ID = 10399,
    Question = "“打蛇打七寸”的七寸是指?",
    Option = {
      A = "咽喉",
      B = "心脏",
      C = "头部 ",
      D = "尾巴"
    },
    Answer = "B"
  },
  [10400] = {
    ID = 10400,
    Question = "在床下寻找物品时,应该使用什么照明?",
    Option = {
      A = "手电筒",
      B = "蜡烛",
      C = "火机",
      D = "火把"
    },
    Answer = "A"
  },
  [10401] = {
    ID = 10401,
    Question = "什么动物最没有方向感?",
    Option = {
      A = "麋鹿",
      B = "犀牛",
      C = "骆驼",
      D = "鸵鸟"
    },
    Answer = "A"
  },
  [10402] = {
    ID = 10402,
    Question = "哪种贼被抓住后可以马上处死刑?",
    Option = {
      A = "偷车贼",
      B = "海贼",
      C = "山贼",
      D = "乌贼"
    },
    Answer = "D"
  },
  [10403] = {
    ID = 10403,
    Question = "公主嫁给谁以后就用不挂蚊帐了?",
    Option = {
      A = "白马王子",
      B = "外星人",
      C = "青蛙王子",
      D = "奥特曼"
    },
    Answer = "C"
  },
  [10404] = {
    ID = 10404,
    Question = "我国农历中有多少个节气?",
    Option = {
      A = "24",
      B = "26",
      C = "20",
      D = "14"
    },
    Answer = "A"
  },
  [10405] = {
    ID = 10405,
    Question = "我国历史上“代父从军”这个故事的主人公是谁?",
    Option = {
      A = "祝英台",
      B = "花木兰",
      C = "郭襄",
      D = "赵敏"
    },
    Answer = "B"
  },
  [10406] = {
    ID = 10406,
    Question = "蚕是以什么树的叶子作为食物的?",
    Option = {
      A = "桃树",
      B = "梨树",
      C = "李树",
      D = "桑树"
    },
    Answer = "D"
  },
  [10407] = {
    ID = 10407,
    Question = "寓言“坐井观天”中坐在井中的是什么动物?",
    Option = {
      A = "青蛙",
      B = "蟋蟀",
      C = "蚱蜢",
      D = "娃娃鱼"
    },
    Answer = "A"
  },
  [10408] = {
    ID = 10408,
    Question = "文房四宝指的是哪四件东西?",
    Option = {
      A = "刀枪剑棍",
      B = "笔墨纸砚",
      C = "笔墨剑棍",
      D = "刀枪纸砚"
    },
    Answer = "B"
  },
  [10409] = {
    ID = 10409,
    Question = "传统的冰糖葫芦是以什么水果作为原料的?",
    Option = {
      A = "苹果",
      B = "红枣",
      C = "李子",
      D = "山楂"
    },
    Answer = "D"
  },
  [10410] = {
    ID = 10410,
    Question = "现食物中毒症状或者误食化学品时,最先采取的急救措施是?",
    Option = {
      A = "催吐",
      B = "吃止泻药物",
      C = "进行人工呼吸",
      D = "向卫生防疫部门报告"
    },
    Answer = "A"
  },
  [10411] = {
    ID = 10411,
    Question = "居室中什么地方污染最重?",
    Option = {
      A = "卧室",
      B = "洗手间",
      C = "厨房",
      D = "客厅"
    },
    Answer = "C"
  },
  [10412] = {
    ID = 10412,
    Question = "下列城市垃圾中哪些分类回收可成为再生资源?",
    Option = {
      A = "废金属",
      B = "剩饭、残渣",
      C = "废电池",
      D = "废话"
    },
    Answer = "A"
  },
  [10413] = {
    ID = 10413,
    Question = "短时间不用电脑时,启用___模式,能耗可下降到50%以下。",
    Option = {
      A = "睡眠模式",
      B = "开机模式",
      C = "屏幕保护",
      D = "关闭显示器"
    },
    Answer = "D"
  },
  [10414] = {
    ID = 10414,
    Question = "优质食用油不应有的特征是?",
    Option = {
      A = "无悬浮物",
      B = "没有沉淀物",
      C = "清晰透明",
      D = "油色发暗"
    },
    Answer = "D"
  },
  [10415] = {
    ID = 10415,
    Question = "钙的最好食物来源是?",
    Option = {
      A = "乳和乳制品",
      B = "蔬菜",
      C = "豆类和豆制品",
      D = "水"
    },
    Answer = "A"
  },
  [10416] = {
    ID = 10416,
    Question = "狗热时用什么散热?",
    Option = {
      A = "皮肤",
      B = "舌头",
      C = "尾巴",
      D = "耳朵"
    },
    Answer = "B"
  },
  [10417] = {
    ID = 10417,
    Question = "树干为什么经常刷成白色?",
    Option = {
      A = "防火",
      B = "灭菌",
      C = "防牲口啃食",
      D = "区分树木"
    },
    Answer = "B"
  },
  [10418] = {
    ID = 10418,
    Question = "“隐形飞机”是指什么样的飞机?",
    Option = {
      A = "肉眼看不见",
      B = "飞行太高看不见",
      C = " 体积太小",
      D = "雷达测不到"
    },
    Answer = "D"
  },
  [10419] = {
    ID = 10419,
    Question = "我国古代“三十六计”中第36计是?",
    Option = {
      A = "美人计",
      B = "空城计",
      C = "走为上计",
      D = "反间计"
    },
    Answer = "C"
  },
  [10420] = {
    ID = 10420,
    Question = "下列哪个尊称是对古代太子的尊称?     ",
    Option = {
      A = "陛下",
      B = "阁下",
      C = "殿下",
      D = "私下"
    },
    Answer = "C"
  },
  [10421] = {
    ID = 10421,
    Question = "世界上使用人数最多的语言是?",
    Option = {
      A = "英语",
      B = "汉语",
      C = "西班牙语",
      D = "世界语"
    },
    Answer = "B"
  },
  [10422] = {
    ID = 10422,
    Question = "我国婚姻法规定女性结婚年龄不得早于多少周岁? ",
    Option = {
      A = "26周岁",
      B = "24周岁",
      C = "20周岁",
      D = "22周岁"
    },
    Answer = "C"
  },
  [10423] = {
    ID = 10423,
    Question = "早晨起来第一件事该做什么?",
    Option = {
      A = "睁开眼",
      B = "看手机",
      C = "下床",
      D = "掀被子"
    },
    Answer = "A"
  },
  [10424] = {
    ID = 10424,
    Question = "一个人喝醉了,扶着一棵树（打一动物）",
    Option = {
      A = "兔",
      B = "猫",
      C = "狗",
      D = "猪"
    },
    Answer = "A"
  },
  [10425] = {
    ID = 10425,
    Question = "又一个人喝醉了,扶着一棵树（打一动物）",
    Option = {
      A = "野兔",
      B = "野猫",
      C = "野狗",
      D = "野猪"
    },
    Answer = "A"
  },
  [10426] = {
    ID = 10426,
    Question = "要考试了,不能看什么书?",
    Option = {
      A = "百科全书",
      B = "语文书",
      C = "数学书",
      D = "英语书"
    },
    Answer = "A"
  },
  [10427] = {
    ID = 10427,
    Question = "电脑键盘里哪个按键最帅?",
    Option = {
      A = "F3",
      B = "F4",
      C = "F5",
      D = "F6"
    },
    Answer = "B"
  },
  [10428] = {
    ID = 10428,
    Question = "恭喜发财（猜一国家名）",
    Option = {
      A = "菲律宾",
      B = "比利时",
      C = "泰国",
      D = "阿富汗"
    },
    Answer = "B"
  },
  [10429] = {
    ID = 10429,
    Question = "USA的弟弟是谁?",
    Option = {
      A = "USD",
      B = "USB",
      C = "USC",
      D = "USE"
    },
    Answer = "B"
  },
  [10430] = {
    ID = 10430,
    Question = "英文字母A到Z,E和T都走了,那么还剩下多少个字母?",
    Option = {
      A = "20",
      B = "21",
      C = "22",
      D = "23"
    },
    Answer = "B"
  },
  [10431] = {
    ID = 10431,
    Question = "什么玩具不能在船上玩?",
    Option = {
      A = "毛公仔",
      B = "弹弹球",
      C = "陀螺",
      D = "玩具车"
    },
    Answer = "C"
  },
  [10432] = {
    ID = 10432,
    Question = "鲨鱼吃了红豆会变成什么?",
    Option = {
      A = "钵仔糕",
      B = "豆沙包",
      C = "红豆沙",
      D = "红豆糕"
    },
    Answer = "C"
  },
  [10433] = {
    ID = 10433,
    Question = "完成天庭任务后可以获得丰富的？",
    Option = {
      A = "银币",
      B = "铜币",
      C = "经验",
      D = "金柳露"
    },
    Answer = "C"
  },
  [10434] = {
    ID = 10434,
    Question = "哆啦A梦里谁长大后会成为医生?",
    Option = {
      A = "大雄",
      B = "胖虎",
      C = "小夫",
      D = "静香"
    },
    Answer = "C"
  },
  [10435] = {
    ID = 10435,
    Question = "“忘情水”是谁给的?",
    Option = {
      A = "啊哈",
      B = "女友",
      C = "情人",
      D = "老婆"
    },
    Answer = "A"
  },
  [10436] = {
    ID = 10436,
    Question = "什么动物最容易被贴在墙壁上?",
    Option = {
      A = "海豹",
      B = "海狮",
      C = "海象",
      D = "海马"
    },
    Answer = "A"
  },
  [10437] = {
    ID = 10437,
    Question = "麒麟飞到北极会变成什么?",
    Option = {
      A = "冰淇淋",
      B = "冰箱",
      C = "冰柜",
      D = "冰球"
    },
    Answer = "A"
  },
  [10438] = {
    ID = 10438,
    Question = "中国、日本、非洲、美国哪个国家的士兵的步伐最齐?",
    Option = {
      A = "日本",
      B = "中国",
      C = "美国",
      D = "非洲"
    },
    Answer = "A"
  },
  [10439] = {
    ID = 10439,
    Question = "什么花最美丽?",
    Option = {
      A = "菊花",
      B = "康乃馨",
      C = "牡丹",
      D = "茉莉花"
    },
    Answer = "D"
  },
  [10440] = {
    ID = 10440,
    Question = "橡皮、老虎皮、狮子皮、牛皮哪一个最不好?",
    Option = {
      A = "老虎皮",
      B = "牛皮",
      C = "狮子皮",
      D = "橡皮"
    },
    Answer = "D"
  },
  [10441] = {
    ID = 10441,
    Question = "什么蛋打不烂,煮不熟,更不能吃?",
    Option = {
      A = "鸡蛋",
      B = "鸭蛋",
      C = "皮蛋",
      D = "零蛋"
    },
    Answer = "D"
  },
  [10442] = {
    ID = 10442,
    Question = "一年四季都盛开的花是什么花?",
    Option = {
      A = "塑料花",
      B = "玫瑰花",
      C = "太阳花",
      D = "有钱花"
    },
    Answer = "A"
  },
  [10443] = {
    ID = 10443,
    Question = "什么英文字母最多人喜欢听?",
    Option = {
      A = "CD",
      B = "ET",
      C = "BT",
      D = "SB"
    },
    Answer = "A"
  },
  [10444] = {
    ID = 10444,
    Question = "身份证掉了怎么办?",
    Option = {
      A = "捡起来",
      B = "报失",
      C = "到处找",
      D = "不管了"
    },
    Answer = "A"
  },
  [10445] = {
    ID = 10445,
    Question = "什么人一年中只工作一天?",
    Option = {
      A = "圣诞老人",
      B = "工人",
      C = "有钱人",
      D = "穷人"
    },
    Answer = "A"
  },
  [10446] = {
    ID = 10446,
    Question = "什么事睁一只眼闭一只眼比较好?  ",
    Option = {
      A = "射球",
      B = "射击",
      C = "看电影",
      D = "看风景"
    },
    Answer = "B"
  },
  [10447] = {
    ID = 10447,
    Question = "什么东西没吃的时候是绿的,吃的时候是红的,吐出来的是黑的?",
    Option = {
      A = "苦瓜",
      B = "西瓜",
      C = "冬瓜",
      D = "南瓜"
    },
    Answer = "B"
  },
  [10448] = {
    ID = 10448,
    Question = "在哪里可以参加科举考试?",
    Option = {
      A = "酒馆",
      B = "国子监",
      C = "相府",
      D = "衙门"
    },
    Answer = "B"
  },
  [10449] = {
    ID = 10449,
    Question = "必须在乡试中答对多少题试题才能参加省试?",
    Option = {
      A = "10",
      B = "20",
      C = "12",
      D = "8"
    },
    Answer = "C"
  },
  [10450] = {
    ID = 10450,
    Question = "大雁塔总共有多少层?",
    Option = {
      A = "5",
      B = "6",
      C = "8",
      D = "9"
    },
    Answer = "D"
  },
  [10451] = {
    ID = 10451,
    Question = "每天可以使用除妖奖章兑换人物经验多少次?",
    Option = {
      A = "5",
      B = "7",
      C = "4",
      D = "8"
    },
    Answer = "C"
  },
  [10452] = {
    ID = 10452,
    Question = "根骨影响什么?",
    Option = {
      A = "气血",
      B = "法力",
      C = "速度",
      D = "攻击力"
    },
    Answer = "A"
  },
  [10453] = {
    ID = 10453,
    Question = "灵性影响什么?",
    Option = {
      A = "气血",
      B = "法力",
      C = "速度",
      D = "攻击力"
    },
    Answer = "B"
  },
  [10454] = {
    ID = 10454,
    Question = "力量影响什么?",
    Option = {
      A = "气血",
      B = "法力",
      C = "速度",
      D = "攻击力"
    },
    Answer = "D"
  },
  [10455] = {
    ID = 10455,
    Question = "敏捷影响什么?",
    Option = {
      A = "气血",
      B = "法力",
      C = "速度",
      D = "攻击力"
    },
    Answer = "C"
  },
  [10456] = {
    ID = 10456,
    Question = "使用什么道具可以重置人物加点?",
    Option = {
      A = "宠物洗点丹",
      B = "角色洗点石",
      C = "金柳露",
      D = "仙梦石"
    },
    Answer = "B"
  },
  [10457] = {
    ID = 10457,
    Question = "使用什么道具可以重置宠物加点?",
    Option = {
      A = "宠物洗点丹",
      B = "角色洗点石",
      C = "金柳露",
      D = "仙梦石"
    },
    Answer = "A"
  },
  [10458] = {
    ID = 10458,
    Question = "使用什么道具可以增加宠物经验?",
    Option = {
      A = "亲密丹",
      B = "神兽丹",
      C = "金柳露",
      D = "炼妖石"
    },
    Answer = "B"
  },
  [10459] = {
    ID = 10459,
    Question = "使用什么道具可以增加主角经验?",
    Option = {
      A = "人参果",
      B = "神兽丹",
      C = "金柳露",
      D = "炼妖石"
    },
    Answer = "A"
  },
  [10460] = {
    ID = 10460,
    Question = "使用什么道具可以重置宠物资质?",
    Option = {
      A = "人参果",
      B = "神兽丹",
      C = "金柳露",
      D = "炼妖石"
    },
    Answer = "C"
  },
  [10461] = {
    ID = 10461,
    Question = "使用什么道具可以增加宠物的抗性?",
    Option = {
      A = "炼妖石",
      B = "神兽丹",
      C = "金柳露",
      D = "人参果"
    },
    Answer = "A"
  },
  [10462] = {
    ID = 10462,
    Question = "使用什么道具可以增加宠物的初值和成长率?",
    Option = {
      A = "炼妖石",
      B = "神兽丹",
      C = "金柳露",
      D = "成长丹"
    },
    Answer = "D"
  },
  [10463] = {
    ID = 10463,
    Question = "每个宠物最多只能使用几个成长丹?",
    Option = {
      A = "6",
      B = "3",
      C = "5",
      D = "8"
    },
    Answer = "B"
  },
  [10464] = {
    ID = 10464,
    Question = "使用什么道具可以增加宠物的亲密度?",
    Option = {
      A = "炼妖石",
      B = "亲密丹",
      C = "金柳露",
      D = "人参果"
    },
    Answer = "B"
  },
  [10465] = {
    ID = 10465,
    Question = "每天可以完成多少次师门任务?",
    Option = {
      A = "20",
      B = "25",
      C = "30",
      D = "40"
    },
    Answer = "A"
  },
  [10466] = {
    ID = 10466,
    Question = "通过什么可以改变装备属性?",
    Option = {
      A = "强化装备",
      B = "装备炼化",
      C = "升级装备",
      D = "重铸装备"
    },
    Answer = "D"
  },
  [10467] = {
    ID = 10467,
    Question = "孙悟空的第一个师傅是?",
    Option = {
      A = "唐僧",
      B = "如来",
      C = "菩提老祖",
      D = "龟丞相"
    },
    Answer = "C"
  },
  [10468] = {
    ID = 10468,
    Question = "西游记里唐僧和猪八戒喝了女儿国什么河的水怀孕的?",
    Option = {
      A = "子母河",
      B = "母子河",
      C = "西凉河",
      D = "流沙河"
    },
    Answer = "A"
  },
  [10469] = {
    ID = 10469,
    Question = "唐僧在哪收了猪八戒?",
    Option = {
      A = "高老庄",
      B = "流沙河",
      C = "五指山",
      D = "蓬莱岛"
    },
    Answer = "A"
  },
  [10470] = {
    ID = 10470,
    Question = "师徒四人一共度过多少难?",
    Option = {
      A = "八十一",
      B = "八十",
      C = "七十九",
      D = "六十"
    },
    Answer = "A"
  },
  [10471] = {
    ID = 10471,
    Question = "唐僧的前世是?",
    Option = {
      A = "金蝉子",
      B = "唐玄奘",
      C = "乌巢禅师",
      D = "虚空禅师"
    },
    Answer = "A"
  },
  [10472] = {
    ID = 10472,
    Question = "被评为杂交水稻之父的我国科学家是?",
    Option = {
      A = "袁泉",
      B = "袁隆平",
      C = "袁绍",
      D = "袁世凯"
    },
    Answer = "B"
  },
  [10473] = {
    ID = 10473,
    Question = "广东省的简称是?",
    Option = {
      A = "渝",
      B = "津",
      C = "粤",
      D = "沪"
    },
    Answer = "C"
  },
  [10474] = {
    ID = 10474,
    Question = "广西省的简称是?",
    Option = {
      A = "鲁",
      B = "豫",
      C = "粤",
      D = "桂"
    },
    Answer = "D"
  },
  [10475] = {
    ID = 10475,
    Question = "湖南省的简称是?",
    Option = {
      A = "湘",
      B = "赣",
      C = "粤",
      D = "沪"
    },
    Answer = "A"
  },
  [10476] = {
    ID = 10476,
    Question = "一般比赛是往前进才取得胜利,而这个比赛是往后退才算胜利,这是什么比赛?",
    Option = {
      A = "拔河比赛",
      B = "拳击比赛",
      C = "跨栏比赛",
      D = "跳远比赛"
    },
    Answer = "A"
  },
  [10477] = {
    ID = 10477,
    Question = "有一个人,他是你父母生的,但他却不是你的兄弟姐妹,他是谁?",
    Option = {
      A = "姐姐",
      B = "自己",
      C = "哥哥",
      D = "妹妹"
    },
    Answer = "B"
  },
  [10478] = {
    ID = 10478,
    Question = "冰变成水最快的方法是什么?",
    Option = {
      A = "加热",
      B = "放进温水中",
      C = "去掉两点水",
      D = "烧烤"
    },
    Answer = "C"
  },
  [10479] = {
    ID = 10479,
    Question = "有什么东西人们都不喜欢吃?",
    Option = {
      A = "吃辣",
      B = "吃饭",
      C = "吃面",
      D = "吃亏"
    },
    Answer = "D"
  },
  [10480] = {
    ID = 10480,
    Question = "什么比赛,赢的得不到奖品,输的却有奖品?",
    Option = {
      A = "划拳喝酒",
      B = "问答比赛",
      C = "赛车比赛",
      D = "田径比赛"
    },
    Answer = "A"
  },
  [10481] = {
    ID = 10481,
    Question = "什么竹不长在土里?",
    Option = {
      A = "富贵竹",
      B = "爆竹",
      C = "凤尾竹",
      D = "冷箭竹"
    },
    Answer = "B"
  },
  [10482] = {
    ID = 10482,
    Question = "一公斤铁和一公斤棉花哪一个轻?",
    Option = {
      A = "铁轻",
      B = "棉花轻",
      C = "一样重",
      D = "不知道"
    },
    Answer = "C"
  },
  [10483] = {
    ID = 10483,
    Question = "发生\"日食\"是由于?",
    Option = {
      A = "地球挡在月亮与太阳之间",
      B = "太阳挡在月亮与地球之间",
      C = "地球挡在太阳与月亮之间",
      D = "月亮挡在地球与太阳之间"
    },
    Answer = "D"
  },
  [10484] = {
    ID = 10484,
    Question = "许多人都喜欢到低于海平面410公尺的死海去做日光浴是因为?",
    Option = {
      A = "紫外线最弱",
      B = "紫外线最强",
      C = "那里的风景美",
      D = "无解"
    },
    Answer = "A"
  },
  [10485] = {
    ID = 10485,
    Question = "成都的市花是?",
    Option = {
      A = "木棉花",
      B = "芙蓉红",
      C = "杜鹃花",
      D = "西兰花"
    },
    Answer = "B"
  },
  [10486] = {
    ID = 10486,
    Question = "维纳斯是罗马神话中的?",
    Option = {
      A = "死神和战神",
      B = "风神和火神",
      C = "爱神与美神",
      D = "女神与爱神"
    },
    Answer = "C"
  },
  [10487] = {
    ID = 10487,
    Question = "大汶口文化遗址在我国的?",
    Option = {
      A = "山西",
      B = "天津",
      C = "北京",
      D = "山东"
    },
    Answer = "D"
  },
  [10488] = {
    ID = 10488,
    Question = "涮羊肉起源于?",
    Option = {
      A = "元朝",
      B = "明朝",
      C = "唐朝",
      D = "清朝"
    },
    Answer = "A"
  },
  [10489] = {
    ID = 10489,
    Question = "花茶的种类是根据什么命名的?",
    Option = {
      A = "茶叶带有花香",
      B = "加入鲜花",
      C = "历史人物",
      D = "茶叶的名字"
    },
    Answer = "B"
  },
  [10490] = {
    ID = 10490,
    Question = "\"七月流火\"指天气?",
    Option = {
      A = "入夏",
      B = "恶劣",
      C = "转凉",
      D = "晴朗"
    },
    Answer = "C"
  },
  [10491] = {
    ID = 10491,
    Question = "《本草纲目》的作者是?",
    Option = {
      A = "华佗",
      B = "扁鹊",
      C = "神农",
      D = "李时珍"
    },
    Answer = "D"
  },
  [10492] = {
    ID = 10492,
    Question = "游戏中有五行相克的说法,其中克木的是?",
    Option = {
      A = "金",
      B = "水",
      C = "火",
      D = "土"
    },
    Answer = "A"
  },
  [10493] = {
    ID = 10493,
    Question = "游戏中有五行相克的说法,其中克金的是?",
    Option = {
      A = "木",
      B = "火",
      C = "土",
      D = "水"
    },
    Answer = "B"
  },
  [10494] = {
    ID = 10494,
    Question = "游戏中有五行相克的说法,其中克水的是?",
    Option = {
      A = "木",
      B = "火",
      C = "土",
      D = "金"
    },
    Answer = "C"
  },
  [10495] = {
    ID = 10495,
    Question = "游戏中有五行相克的说法,其中克土的是?",
    Option = {
      A = "水",
      B = "火",
      C = "土",
      D = "木"
    },
    Answer = "D"
  },
  [10496] = {
    ID = 10496,
    Question = "游戏中有五行相克的说法,其中克火的是?",
    Option = {
      A = "水",
      B = "土",
      C = "金",
      D = "木"
    },
    Answer = "A"
  },
  [10497] = {
    ID = 10497,
    Question = "游戏中哪种召唤兽可以进行化境?",
    Option = {
      A = "普通召唤兽",
      B = "神兽",
      C = "灵兽",
      D = "高级守护召唤兽"
    },
    Answer = "B"
  },
  [10498] = {
    ID = 10498,
    Question = "使用什么道具可以使神兽进行化境?",
    Option = {
      A = "神兽丹",
      B = "金柳露",
      C = "化境丹",
      D = "灵珠"
    },
    Answer = "C"
  },
  [10499] = {
    ID = 10499,
    Question = "神兽使用化境丹后可提高?",
    Option = {
      A = "亲密度",
      B = "经验",
      C = "等级",
      D = "资质"
    },
    Answer = "D"
  },
  [10500] = {
    ID = 10500,
    Question = "神兽最多可以进行多少次化境?",
    Option = {
      A = "3",
      B = "2",
      C = "1",
      D = "4"
    },
    Answer = "A"
  },
  [10501] = {
    ID = 10501,
    Question = "使用以下哪种道具可以清除召唤兽身上的成长丹效果?",
    Option = {
      A = "神兽丹",
      B = "成长重置丹",
      C = "宠物洗点丹",
      D = "炼妖重置丹"
    },
    Answer = "B"
  },
  [10502] = {
    ID = 10502,
    Question = "召唤兽学习哪个技能能够提高气血上限?",
    Option = {
      A = "自医",
      B = "倍道兼行",
      C = "帐饮东都",
      D = "忠诚"
    },
    Answer = "C"
  },
  [10503] = {
    ID = 10503,
    Question = "游戏中的\"扶伤\"技能效果是?",
    Option = {
      A = "恢复存活单位50%气血",
      B = "抵御一次致死的伤害",
      C = "每回合恢复气血",
      D = "恢复死亡单位50%气血"
    },
    Answer = "D"
  },
  [10504] = {
    ID = 10504,
    Question = "游戏中的\"幸运\"技能效果是?",
    Option = {
      A = "抵御一次致死的伤害",
      B = "恢复存活单位50%气血",
      C = "每回合恢复气血",
      D = "恢复死亡单位50%气血"
    },
    Answer = "A"
  },
  [10505] = {
    ID = 10505,
    Question = "以下哪个技能是在敌方第一个单位施法前对其造成气血伤害的?",
    Option = {
      A = "朗月清风",
      B = "悬刃",
      C = "遗患",
      D = "慈乌反哺"
    },
    Answer = "B"
  },
  [10506] = {
    ID = 10506,
    Question = "以下哪个技能是在敌方第一个单位施法前对其造成法力伤害的?",
    Option = {
      A = "朗月清风",
      B = "悬刃",
      C = "遗患",
      D = "慈乌反哺"
    },
    Answer = "C"
  },
  [10507] = {
    ID = 10507,
    Question = "使用以下哪个道具能够提高灵兽的成长率?",
    Option = {
      A = "化灵丸",
      B = "化境丹",
      C = "金柳露",
      D = "神兽丹"
    },
    Answer = "A"
  },
  [10508] = {
    ID = 10508,
    Question = "能够使参战召唤兽的经验转移到另外一个召唤兽身上的道具是什么?",
    Option = {
      A = "化灵丸",
      B = "传功丹",
      C = "金柳露",
      D = "神兽丹"
    },
    Answer = "B"
  },
  [10509] = {
    ID = 10509,
    Question = "游戏中哪个npc有能够使主角转换种族的功能?",
    Option = {
      A = "地府——钟馗",
      B = "长安城——灵兽仙",
      C = "天宫——黄大仙",
      D = "长安城——染色师"
    },
    Answer = "C"
  },
  [10510] = {
    ID = 10510,
    Question = "每天完成宝图任务最多可以获得多少张藏宝图?",
    Option = {
      A = "25",
      B = "5",
      C = "15",
      D = "10"
    },
    Answer = "D"
  },
  [10511] = {
    ID = 10511,
    Question = "主角等级到达60级后可以找谁申请结婚?",
    Option = {
      A = "长安城——红娘",
      B = "长安城——染色师",
      C = "天宫——黄大仙",
      D = "地府——孟婆"
    },
    Answer = "A"
  },
  [10512] = {
    ID = 10512,
    Question = "主角等级到达60级后可以找谁申请结契?",
    Option = {
      A = "长安城——染色师",
      B = "长安城——红娘",
      C = "地府——孟婆",
      D = "天宫——黄大仙"
    },
    Answer = "B"
  },
  [10513] = {
    ID = 10513,
    Question = "如果想把仙器转换成其它部位的仙器,可以找谁进行仙器转换操作?",
    Option = {
      A = "天宫——黄大仙",
      B = "长安城——染色师",
      C = "长安城——铁匠",
      D = "地府——钟馗"
    },
    Answer = "C"
  },
  [10514] = {
    ID = 10514,
    Question = "使当前主角不可穿着的装备变更为当前主角可穿着的装备,可以找长安城——铁匠进行以下哪个操作?",
    Option = {
      A = "仙器转换",
      B = "种族转换",
      C = "转生任务",
      D = "装备回炉"
    },
    Answer = "D"
  },
  [10515] = {
    ID = 10515,
    Question = "赠送好友永恒玫瑰可以互相增加多少点友好度?",
    Option = {
      A = "600",
      B = "800",
      C = "700",
      D = "500"
    },
    Answer = "A"
  },
  [10516] = {
    ID = 10516,
    Question = "帮助玩家完成个别任务可以获得侠义值,哪么侠义值可以兑换什么?",
    Option = {
      A = "元宝",
      B = "常用道具",
      C = "银币",
      D = "召唤兽"
    },
    Answer = "B"
  },
  [10517] = {
    ID = 10517,
    Question = "吃人参果王可以获得大量的人物经验,哪么每天最多可以吃多少个人参果王?",
    Option = {
      A = "20",
      B = "25",
      C = "10",
      D = "35"
    },
    Answer = "C"
  },
  [10518] = {
    ID = 10518,
    Question = "在比武场与玩家进行竞技可获得大量的荣誉,哪么使用荣誉在荣誉商店里可以兑换什么?",
    Option = {
      A = "元宝",
      B = "召唤兽",
      C = "银币",
      D = "常用道具和魂石"
    },
    Answer = "D"
  },
  [10519] = {
    ID = 10519,
    Question = "加入帮派设置守护图腾可以增加?",
    Option = {
      A = "主角抗性",
      B = "召唤兽抗性",
      C = "伙伴抗性",
      D = "人物经验"
    },
    Answer = "A"
  },
  [10520] = {
    ID = 10520,
    Question = "一个人花8块钱买了一只鸡,9块钱卖掉了,然后他觉得不划算,花10块钱又买回来了,11块卖给另外一个人.问他赚了多少?",
    Option = {
      A = "6",
      B = "2",
      C = "3",
      D = "4"
    },
    Answer = "B"
  },
  [10521] = {
    ID = 10521,
    Question = "一栋住宅楼,爷爷从一楼走到三楼要6分钟,现在要到6楼,要走多少分钟？",
    Option = {
      A = "20分钟",
      B = "35分钟",
      C = "15分钟",
      D = "18分钟"
    },
    Answer = "C"
  },
  [10522] = {
    ID = 10522,
    Question = "如果有5只猫,同时吃5条鱼,需要5分钟时间才吃完。按同样的速度,100只猫同时吃掉100条鱼,需要多少分钟时间。",
    Option = {
      A = "10分钟",
      B = "100分钟",
      C = "20分钟",
      D = "5分钟"
    },
    Answer = "D"
  },
  [10523] = {
    ID = 10523,
    Question = "用活性炭去除房间里面的异味是产生了哪种物理反应？",
    Option = {
      A = "吸除法",
      B = "吸附法",
      C = "去除法",
      D = "依附法"
    },
    Answer = "B"
  },
  [10524] = {
    ID = 10524,
    Question = "医学上用来浸泡尸体的溶液是什么？",
    Option = {
      A = "福尔马林",
      B = "氢氯酸",
      C = "乙醚溶液",
      D = "甲醇溶液"
    },
    Answer = "A"
  },
  [10525] = {
    ID = 10525,
    Question = "“低盐饮食”有可能引起什么病症？",
    Option = {
      A = "低血糖",
      B = "高血压",
      C = "低钠血",
      D = "白血病"
    },
    Answer = "C"
  },
  [10526] = {
    ID = 10526,
    Question = "把空气中的氮气转化为可被植物吸收的氮的化合物的过程称为什么？",
    Option = {
      A = "氮的转化",
      B = "氮的生成",
      C = "氮的固定",
      D = "氮的化学反应"
    },
    Answer = "C"
  },
  [10527] = {
    ID = 10527,
    Question = "克隆技术在现代生物学中被称为什么？",
    Option = {
      A = "生物放大技术",
      B = "生物重复技术",
      C = "动物遗传技术",
      D = "植物复制技术"
    },
    Answer = "A"
  },
  [10528] = {
    ID = 10528,
    Question = "人体冷冻技术要把人体放在摄氏多少度以下进行冷藏保存？",
    Option = {
      A = "摄氏零下5度",
      B = "摄氏零下20度",
      C = "摄氏零下30度",
      D = "摄氏零下196度"
    },
    Answer = "D"
  },
  [10529] = {
    ID = 10529,
    Question = "物种起源是十几世纪的著作？",
    Option = {
      A = "18世纪",
      B = "19世纪",
      C = "20世纪",
      D = "21世纪"
    },
    Answer = "B"
  },
  [10530] = {
    ID = 10530,
    Question = "点燃两支高低不同的蜡烛,用一个烧杯罩住,哪只蜡烛先熄灭？",
    Option = {
      A = "高的",
      B = "低的",
      C = "同时熄灭",
      D = "不会熄灭"
    },
    Answer = "A"
  },
  [10531] = {
    ID = 10531,
    Question = "煤气中毒是由什么引起的？",
    Option = {
      A = "一氧化氮",
      B = "二氧化氮",
      C = "一氧化氢",
      D = "二氧化氢"
    },
    Answer = "A"
  },
  [10532] = {
    ID = 10532,
    Question = "石灰干燥剂的主要成分有哪些？",
    Option = {
      A = "石灰石",
      B = "熟石灰",
      C = "生石灰",
      D = "烧碱"
    },
    Answer = "C"
  },
  [10533] = {
    ID = 10533,
    Question = "作为著名的化学实验之一的“大象牙膏”是什么颜色的呢？",
    Option = {
      A = "黄红两色",
      B = "黄色",
      C = "绿色",
      D = "红色"
    },
    Answer = "B"
  },
  [10534] = {
    ID = 10534,
    Question = "“法老之蛇”是著名的什么化学反应？",
    Option = {
      A = "膨胀反应",
      B = "松弛反应",
      C = "光合作用",
      D = "变色反应"
    },
    Answer = "A"
  },
  [10535] = {
    ID = 10535,
    Question = "用什么可以去除皮蛋的涩味？",
    Option = {
      A = "食盐",
      B = "食醋",
      C = "酒精",
      D = "白糖"
    },
    Answer = "B "
  },
  [10536] = {
    ID = 10536,
    Question = "减少酸雨的措施有？",
    Option = {
      A = "植树造林",
      B = "减少捕杀动物",
      C = "进行人工降雨",
      D = "少用煤作燃料"
    },
    Answer = "D"
  },
  [10537] = {
    ID = 10537,
    Question = "什么食物不能解酒？",
    Option = {
      A = "酸梅汤",
      B = "食醋",
      C = "酸果子",
      D = "糖水"
    },
    Answer = "D"
  },
  [10538] = {
    ID = 10538,
    Question = "鸡蛋加热之后,蛋白质变性,会丧失什么？",
    Option = {
      A = "生理动力",
      B = "物理活性",
      C = "生理活性",
      D = "生物活性"
    },
    Answer = "C"
  },
  [10539] = {
    ID = 10539,
    Question = "冬天,人们一般使用什么方法进行融雪？",
    Option = {
      A = "白糖",
      B = "食醋",
      C = "酒精",
      D = "食盐"
    },
    Answer = "D"
  },
  [10540] = {
    ID = 10540,
    Question = "通常用来制作白炽灯灯丝的金属是？",
    Option = {
      A = "铝",
      B = "钨",
      C = "铜",
      D = "铁"
    },
    Answer = "B"
  },
  [10541] = {
    ID = 10541,
    Question = "医用消毒酒精的浓度是？",
    Option = {
      A = "50%",
      B = "65%",
      C = "75%",
      D = "80%"
    },
    Answer = "C"
  },
  [10542] = {
    ID = 10542,
    Question = "儿童容易患软骨病是由于缺少了什么？",
    Option = {
      A = "维他命",
      B = "钠元素",
      C = "钙元素",
      D = "铁元素"
    },
    Answer = "C"
  },
  [10543] = {
    ID = 10543,
    Question = "粗脖子病要多吃海带,是为了补充什么？",
    Option = {
      A = "钙",
      B = "碘",
      C = "铁",
      D = "镁"
    },
    Answer = "B"
  },
  [10544] = {
    ID = 10544,
    Question = "柠檬汁遇酸变红色,遇碘会变成什么色？",
    Option = {
      A = "蓝色",
      B = "红色",
      C = "紫色",
      D = "消失"
    },
    Answer = "D"
  },
  [10545] = {
    ID = 10545,
    Question = "玻璃棒蘸取什么后,去接触酒精灯的灯芯,酒精灯立刻就被点着？",
    Option = {
      A = "高锰酸",
      B = "硫酸盐",
      C = "一氧化氮",
      D = "硝酸盐"
    },
    Answer = "A"
  },
  [10546] = {
    ID = 10546,
    Question = "在鸡蛋壳上滴一滴什么会让它起泡泡？",
    Option = {
      A = "醋",
      B = "白开水",
      C = "盐酸",
      D = "牛奶"
    },
    Answer = "A"
  },
  [10547] = {
    ID = 10547,
    Question = "潜水艇在深海潜行,能给船员供给所需氧气的最好物质是？",
    Option = {
      A = "过氧化氢",
      B = "过氧化钠",
      C = "一氧化碳",
      D = "硫化物"
    },
    Answer = "B"
  },
  [10548] = {
    ID = 10548,
    Question = "为什么古人总是“三天打鱼,两天晒网”呢？",
    Option = {
      A = "渔网是麻纤维",
      B = "渔网是塑料品",
      C = "禁渔期",
      D = "够吃了"
    },
    Answer = "A"
  },
  [10549] = {
    ID = 10549,
    Question = "经常吃火锅的同时大量饮酒容易导致什么病？",
    Option = {
      A = "胃寒",
      B = "痛风",
      C = "抽筋",
      D = "中风"
    },
    Answer = "B"
  },
  [10550] = {
    ID = 10550,
    Question = "当自来水管在邻近的水龙头放水时,偶尔发生阵阵的响声,是因为引起了？",
    Option = {
      A = "水管共鸣",
      B = "水管阻力",
      C = "水管共振",
      D = "水动力"
    },
    Answer = "C"
  },
  [10551] = {
    ID = 10551,
    Question = "电炉“燃烧”是电能转化为？",
    Option = {
      A = "热能",
      B = "电阻力",
      C = "动能",
      D = "内能"
    },
    Answer = "D"
  },
  [10552] = {
    ID = 10552,
    Question = "太阳光有多少种颜色？",
    Option = {
      A = "五种",
      B = "六种",
      C = "七种",
      D = "无数种"
    },
    Answer = "C"
  },
  [10553] = {
    ID = 10553,
    Question = "核电站的心脏是？",
    Option = {
      A = "核岛",
      B = "核反应堆",
      C = "常规岛",
      D = "核聚变"
    },
    Answer = "B "
  },
  [10554] = {
    ID = 10554,
    Question = "被苹果砸到的伟大物理学家是？",
    Option = {
      A = "伽利略",
      B = "牛顿",
      C = "爱因斯坦",
      D = "霍金"
    },
    Answer = "B"
  }
}
return data_CountryQuestionLib
