data_GiftOfIdentify = {
  [4001] = {
    num = 4000,
    open = 0,
    lid = 11,
    des = "启程礼包",
    reward = {
      {1, 5000000},
      {2, 0},
      {7, 0},
      {30030, 1},
      {76001, 10}
    }
  },
  [4002] = {
    num = 3000,
    open = 0,
    lid = 12,
    des = "萌宠礼包",
    reward = {
      {1, 0},
      {2, 0},
      {7, 0},
      {75004, 40},
      {90001, 20},
      {81005, 8}
    }
  },
  [4003] = {
    num = 2000,
    open = 0,
    lid = 13,
    des = "进阶礼包",
    reward = {
      {1, 0},
      {2, 0},
      {7, 10000},
      {30031, 1},
      {71005, 50}
    }
  },
  [4004] = {
    num = 1000,
    open = 0,
    lid = 14,
    des = "个性染色礼包",
    reward = {
      {1, 0},
      {2, 0},
      {7, 0},
      {76524, 20}
    }
  },
  [4005] = {
    num = 300,
    open = 0,
    lid = 15,
    des = "驯兽达人礼包",
    reward = {
      {1, 0},
      {2, 0},
      {7, 0},
      {75005, 40},
      {90003, 3}
    }
  },
  [4006] = {
    num = 100,
    open = 0,
    lid = 16,
    des = "梦想礼包",
    reward = {
      {1, 0},
      {2, 200},
      {7, 0}
    }
  }
}
return data_GiftOfIdentify
