data_TaskRunRing_QuestionLib = {
  [1] = {
    Question = "三个同学下跳棋,共下了45分钟,问每个同学下了多少时间？ ",
    A = "135分钟",
    B = "45分钟",
    C = "15分钟",
    D = "90分钟",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [2] = {
    Question = "在情人的脸上发表的处女作是什么？",
    A = "大师作品",
    B = "处女座",
    C = "打耳光",
    D = "初吻",
    Answer = "D",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [3] = {
    Question = "不会讲外语的大明和不会讲中文的外国人有说有笑,他是怎么办到的？",
    A = "肢体语言",
    B = "眼神交流",
    C = "发癫",
    D = "哑语",
    Answer = "D",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [4] = {
    Question = "哪项比赛是比谁往后跑得快的?",
    A = "拔河",
    B = "篮球",
    C = "百米短跑",
    D = "标枪",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [5] = {
    Question = "你曾借了什么东西至今都没还过？",
    A = "借笔",
    B = "借刀",
    C = "借过",
    D = "借钱",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [6] = {
    Question = "米奇吃下了药,但忘了把药摇匀,达不到最佳效果,他该如何补救？",
    A = "把药吐出来",
    B = "重新吃药",
    C = "多喝水",
    D = "不停地翻跟头",
    Answer = "D",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [7] = {
    Question = "饺子是男人还是女人？",
    A = "男人",
    B = "女人",
    C = "人妖",
    D = "谁知道",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [8] = {
    Question = "“Kiss”是动词,形容词还是名词？",
    A = "名词",
    B = "形容词",
    C = "动词",
    D = "连词",
    Answer = "D",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [9] = {
    Question = "男人在一起喝酒,为什么非划拳不可？",
    A = "比输赢",
    B = "有气氛",
    C = "敬酒不吃吃罚酒",
    D = "打架",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [10] = {
    Question = "有个刚生下的婴儿,有两个小孩和他是同年同月同日生的,而且是同一对父母生的,但他们不是双胞胎,这可能吗？",
    A = "三胞胎",
    B = "有可能",
    C = "不可能",
    D = "妖孽",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [11] = {
    Question = "人的长寿秘诀是什么？",
    A = "保持运动,多喝水",
    B = "保持呼吸",
    C = "寻找长生药",
    D = "忌烟酒",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [12] = {
    Question = "什么地方的路最窄？",
    A = "羊肠小道",
    B = "奈何桥",
    C = "朝云暮雨",
    D = "阳光大道",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [13] = {
    Question = "世界上最小的岛是什么？",
    A = "珊瑚岛",
    B = "马路上的安全岛",
    C = "冲击岛",
    D = "冲绳岛",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [14] = {
    Question = "一个小孩和一个大人在漆黑的夜晚走路,小孩是大人的儿子,大人却不是小孩的父亲,请问为什么？",
    A = "母子关系",
    B = "猜不到",
    C = "叔侄关系",
    D = "爷孙关系",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [15] = {
    Question = "有一位女士离婚数次打一四字成语？",
    A = "前功尽弃",
    B = "四大皆空",
    C = "不可理喻",
    D = "重三叠四",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [16] = {
    Question = "家人问医生病人的情况,医生只举起5个手指, 家人就哭了,是什么原因呢？",
    A = "只剩5天寿命",
    B = "三长两短",
    C = "PASS",
    D = "无能为力",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [17] = {
    Question = "把一只鸡和一只鹅同时放在冰山上,为什么鸡死了鹅没死？",
    A = "鹅获救了",
    B = "不知道",
    C = "鹅把鸡吃了",
    D = "企鹅",
    Answer = "D",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [18] = {
    Question = "为什么孔雀向东南飞而不向西北飞？",
    A = "西北比较冷",
    B = "分不清楚方向",
    C = "西北尘土大",
    D = "西北有高墙",
    Answer = "D",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [19] = {
    Question = "你只要叫它的名字就会把它破坏,它是什么？",
    A = "空气",
    B = "沉默",
    C = "破坏",
    D = "谁知道呢",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [20] = {
    Question = "汽车在右转弯时,哪一条轮胎不转？",
    A = "左右轮",
    B = "备用轮胎",
    C = "左前轮",
    D = "左后轮",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [21] = {
    Question = "狐狸精最擅长迷惑男人,那么什么“精”男女一起迷？",
    A = "酒精",
    B = "狐狸精",
    C = "香精",
    D = "人精",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [22] = {
    Question = "林先生大手术后换了一个人工心脏。病好了后,她的女友却马上提出分手,为什么会这样？",
    A = "女人心海底针",
    B = "花光了积蓄",
    C = "缘分已尽",
    D = "没有真心爱她",
    Answer = "D",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [23] = {
    Question = "“新郎官”最早用来指?",
    A = "新科状元",
    B = "新科进士",
    C = "新科秀才",
    D = "新婚男士",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [24] = {
    Question = "黑头发有什么好处？",
    A = "黑色显年轻",
    B = "不知道",
    C = "好打理",
    D = "不怕晒黑",
    Answer = "D",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [25] = {
    Question = "打什么东西,不必花力气？",
    A = "打针",
    B = "打瞌睡",
    C = "打哈欠",
    D = "打架",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [26] = {
    Question = "有一种东西,买的人知道,卖的人也知道,只有用的人不知道,是什么东西？",
    A = "礼物",
    B = "手表",
    C = "棺材",
    D = "买钟",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [27] = {
    Question = "老王一天要刮四五十次脸,脸上却仍有胡子。这是什么原因？",
    A = "理发师",
    B = "长得快",
    C = "刮胡刀坏了",
    D = "猜不到",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [28] = {
    Question = "什么车子寸步难行？",
    A = "火车",
    B = "风车",
    C = "汽车",
    D = "自行车",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [29] = {
    Question = "哪一个月有二十八天？",
    A = "二月",
    B = "闰月",
    C = "每个月都有28天",
    D = "十一月",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [30] = {
    Question = "死前放屁又叫什么？",
    A = "遗言",
    B = "念念不舍",
    C = "绝响",
    D = "死后不是饿死鬼",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [31] = {
    Question = "大象的左耳朵像什么？",
    A = "扇子",
    B = "右耳朵",
    C = "芭蕉叶",
    D = "被子",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [32] = {
    Question = "什么英文字母让人们喜欢听而且听的人最多？",
    A = "RP",
    B = "TT",
    C = "CD",
    D = "GDP",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [33] = {
    Question = "什么事天不知地知,你不知我知？",
    A = "别人的秘密",
    B = "鞋底破了",
    C = "衣服破了",
    D = "掉钱了",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [34] = {
    Question = "放大镜不能放大的东西是什么？",
    A = "角度",
    B = "蚂蚁",
    C = "细菌",
    D = "毛毛虫",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [35] = {
    Question = "什么东西倒立后会增加一半？",
    A = "沙漏",
    B = "6",
    C = "不知道",
    D = "9",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [36] = {
    Question = "为什么两只老虎打架,非要拼个你死我活才罢休？",
    A = "没有人敢劝架",
    B = "一山难容二虎",
    C = "2只都是公的",
    D = "抢地盘",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [37] = {
    Question = "有人说,女人象一本书,那么胖女人象什么书？",
    A = "小人书",
    B = "山海经",
    C = "新华字典",
    D = "合订本",
    Answer = "D",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [38] = {
    Question = "青蛙为什么能跳得比树高？",
    A = "青蛙王子",
    B = "弹跳力好",
    C = "因为是树蛙",
    D = "树不会跳",
    Answer = "D",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [39] = {
    Question = "你知道现代的科学家一般都出生在哪吗？",
    A = "医院",
    B = "容器里",
    C = "试管里",
    D = "不知道",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [40] = {
    Question = "一个盒子有几个边？",
    A = "里边和外边",
    B = "四个边",
    C = "六个边",
    D = "八个边",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [41] = {
    Question = " 一艘船最多能承受50个人,现在已经坐了49个人了,又来了一个人,那艘 船却沉了,为什么？",
    A = "那个人体重超标",
    B = "来人是孕妇",
    C = "潜水艇",
    D = "多了只宠物",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [42] = {
    Question = "桌子上有一个蜡烛和一个煤油灯,请问先点哪一个？",
    A = "开灯",
    B = "蜡烛",
    C = "煤油灯",
    D = "火柴",
    Answer = "D",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [43] = {
    Question = " 为什么现在的猴子越来越少了？",
    A = "都变成人了",
    B = "藏起来了",
    C = "猩球崛起",
    D = "SARS",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [44] = {
    Question = "什么人从来不洗头发？",
    A = "病人",
    B = "和尚",
    C = "懒人",
    D = "疯子",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [45] = {
    Question = " 一个挖好的长6米、宽7米、高8米的坑里有多少土？",
    A = "三斤土",
    B = "五斤土",
    C = "猜不到",
    D = "没有土",
    Answer = "D",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [46] = {
    Question = "什么样的钉子最可怕？",
    A = "眼中钉",
    B = "钉子户",
    C = "长钉",
    D = "螺纹钉",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [47] = {
    Question = "哪座桥不能开车也不能走人？",
    A = "长江桥",
    B = "郑板桥",
    C = "天桥",
    D = "奈何桥",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [48] = {
    Question = "动物园里有一只可爱的熊猫,为什么人们都不敢接近它？",
    A = "油漆未干",
    B = "喜欢咬人",
    C = "动物园不允许",
    D = "熊猫怀宝宝了",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [49] = {
    Question = "天最顶上是什么？",
    A = "一",
    B = "小鸟",
    C = "云朵",
    D = "星星",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [50] = {
    Question = "两个口是吕,三个口是品,那五个口是什么字？",
    A = "怪兽",
    B = "嘔",
    C = "田",
    D = "不知道",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [51] = {
    Question = "一位卡车司机撞倒一个骑摩托车的人,卡车司机受重伤,摩托车骑士却没事,为什么？",
    A = "卡车司机没开车 ",
    B = "卡车质量差",
    C = "从挡风玻璃撞入",
    D = "猜不到",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [52] = {
    Question = "有个人走独木桥,前面来了一只老虎,后面来了只熊,这个人是怎么过去的？",
    A = "熊叼过去的",
    B = "趁乱跑过去的",
    C = "晕过去了",
    D = "老虎叼过去的",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [53] = {
    Question = "什么人一年中只工作一天？ ",
    A = "圣诞老人 ",
    B = "商人",
    C = "教师",
    D = "厨师",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [54] = {
    Question = "为什么太阳天天都比人起的早？ ",
    A = "人比太阳睡的晚",
    B = "太阳比人勤快",
    C = "不知道",
    D = "因为月亮下班了",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [55] = {
    Question = "山坡上有一群羊,来了一群羊,一共有几群羊？",
    A = "两群羊",
    B = "数不清",
    C = "百来只吧",
    D = "还是一群",
    Answer = "D",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [56] = {
    Question = "想把梦变成现实,第一步应该干什么？ ",
    A = "起床",
    B = "做计划",
    C = "继续做梦",
    D = "行动",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [57] = {
    Question = "大熊猫一生中的最大遗憾是什么？",
    A = "回归森林",
    B = "没肉吃",
    C = "没有彩色照片",
    D = "变成神兽",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [58] = {
    Question = "有一只公鸡在屋顶上下蛋,你说鸡蛋会从左边掉下还是右边？",
    A = "左边",
    B = "公鸡不会下蛋",
    C = "右边",
    D = "中间",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [59] = {
    Question = "小王是个司机,有一天开车出了车祸,当警察赶到时,发现车上有一个死人,小王确说不关他的事,为什么？",
    A = "被人陷害",
    B = "杀手另有他人",
    C = "猜不到",
    D = "小王开的是灵车",
    Answer = "D",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [60] = {
    Question = "用什么拖地最干净?",
    A = "威猛先生",
    B = "用力",
    C = "拖把",
    D = "吸尘器",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [61] = {
    Question = "一根生锈的绣花针,在7月7日7时7分7秒,浩月当空之时,扔到云南饵海中将会发生什么反应？ ",
    A = "掉到海底 ",
    B = "变成神针",
    C = "变成金箍棒",
    D = "没反应",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [62] = {
    Question = "森林中有十只鸟,小明开枪打死了一只,其它九只却都没有飞走,为什么？",
    A = "它们要围观",
    B = "假鸟",
    C = "鸵鸟",
    D = "都是聋子",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [63] = {
    Question = "熊为什么冬眠时会睡这么久？",
    A = "冬天时间长",
    B = "没人敢叫它起床",
    C = "做美梦中",
    D = "不知道",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [64] = {
    Question = "为什么金鱼看上去老是傻乎乎的？",
    A = "脑袋里灌水了",
    B = "天生傻乎乎",
    C = "因为要欺骗你",
    D = "不知道",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [65] = {
    Question = "你怎样才能把你的左手全部放入你身上右边的裤袋内,而同时又把你的右 手全部放入左边的裤袋内？",
    A = "双手交差",
    B = "放入别人口袋",
    C = "想不到",
    D = "前后反着穿 ",
    Answer = "D",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [66] = {
    Question = "为什么人要拿头撞豆腐？",
    A = "想不开",
    B = "豆腐不会撞头",
    C = "头疼",
    D = "赌输了",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [67] = {
    Question = "小明每天都吃一个师傅,他是怪兽吗？",
    A = "他是怪兽",
    B = "他是食人族",
    C = "汉拨尼",
    D = "吃康师傅嘛",
    Answer = "D",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [68] = {
    Question = "一双鞋卖16元,一只鞋卖多少钱？",
    A = "8元",
    B = "9元",
    C = "15元",
    D = "不卖",
    Answer = "D",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [69] = {
    Question = "小华的爷爷有7个儿子,每一个儿子又各有一个妹妹,请问：小华的 爷爷有多少个儿女？",
    A = "7个",
    B = "8个",
    C = "9个",
    D = "10个",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [70] = {
    Question = "从1到9,哪个数字最懒惰？",
    A = "1",
    B = "3",
    C = "9",
    D = "6",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [71] = {
    Question = "没有尾巴的熊是尾熊,没有鸡鸡的熊是什么熊？ ",
    A = "鸡熊",
    B = "熊中太监",
    C = "母熊",
    D = "大地之熊",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [72] = {
    Question = "9月28是孔子诞辰,那么10月28日是什么日子？",
    A = "普通日子",
    B = "孔子满月",
    C = "黄道吉日",
    D = "生日？",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [73] = {
    Question = "狼来了（猜水果）？",
    A = "猕猴桃",
    B = "水蜜桃",
    C = "苹果",
    D = "杨桃",
    Answer = "D",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [74] = {
    Question = "一个人有一个,全国12亿人只有12个,这东西是? ",
    A = "财富",
    B = "生肖",
    C = "不知道",
    D = "车",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [75] = {
    Question = "世界上什么人一下子变老? ",
    A = "心死的人",
    B = "将头发染白",
    C = "新娘",
    D = "中毒之人",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [76] = {
    Question = "在哪里绝对不能说笑话? ",
    A = "海边",
    B = "会议室",
    C = "公司",
    D = "雪山",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [77] = {
    Question = "麒麟到了北极会变成什么？",
    A = "神兽",
    B = "冰雕",
    C = "冰淇凌",
    D = "雪糕",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [78] = {
    Question = "小伟的书包里藏着一个鸭蛋,他为什么不肯拿出来交给妈妈做菜？",
    A = "考卷上的大鸭蛋",
    B = "别人家的鸭蛋",
    C = "自己的零食",
    D = "猜不到",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [79] = {
    Question = "读一年级的东东没有学过外文,为什么也会写外国字？",
    A = "东东是外国人",
    B = "东东是天才",
    C = "阿拉伯数字",
    D = "家庭教师教的",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [80] = {
    Question = "有一只毛毛虫要过河,前面没有桥,问它是怎么过去的？",
    A = "找片树叶做船",
    B = "跳过去",
    C = "游过去",
    D = "变成蝴蝶飞过去 ",
    Answer = "D",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [81] = {
    Question = "有只毛毛虫（八只脚）走上一堆牛粪,下地以后却发现只有六只脚印,为 什么？",
    A = "两只脚捏住鼻子",
    B = "残疾毛毛虫",
    C = "猜不到",
    D = "其实是触角",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [82] = {
    Question = "什么人最喜欢别人叫他滚？",
    A = "恶人",
    B = "监狱里的人 ",
    C = "发脾气的人",
    D = "司令",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [83] = {
    Question = "大象的长鼻子是怎么长成的？ ",
    A = "用绳子拉长的",
    B = "慢慢长长的",
    C = "出生时就有",
    D = "猜不到",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [84] = {
    Question = "什么东西掉进水里不会湿？ ",
    A = "鲨鱼",
    B = "玻璃",
    C = "塑料",
    D = "影子",
    Answer = "D",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [85] = {
    Question = "80厘米长的红螃蟹和30厘米长的黑螃蟹比赛跑步,谁会赢？",
    A = "红螃蟹",
    B = "天知道",
    C = "黑螃蟹",
    D = "平局",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [86] = {
    Question = "小明考了100分,为什麽哭了？",
    A = "猜不到",
    B = "乐哭的",
    C = "想家了",
    D = "想哭就哭",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [87] = {
    Question = "一个病人到医院去做健康检查,为什么医生说：“你离我远一点”请问这 病人得了什么病？ ",
    A = "口臭",
    B = "不知道",
    C = "癌症",
    D = "斗鸡眼",
    Answer = "D",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [88] = {
    Question = "铁放在屋外露天会生锈,那么金子呢？ ",
    A = "氧化",
    B = "会被偷走",
    C = "老化",
    D = "变色",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [89] = {
    Question = "什么事睁一只眼闭一只眼比较好？ ",
    A = "看书",
    B = "观察",
    C = "射击 ",
    D = "作弊",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [90] = {
    Question = "针掉到大海怎么办？ ",
    A = "仔细找一找",
    B = "再买一颗 ",
    C = "不要了",
    D = "捡起来",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [91] = {
    Question = "谁说话的声音传得最远？ ",
    A = "打电话的人",
    B = "大嗓门的人",
    C = "会千里传音的人",
    D = "哼哈二将",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [92] = {
    Question = "什么人生病从来不看医生? ",
    A = "病危的人",
    B = "不知道",
    C = "医生",
    D = "盲人",
    Answer = "D",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [93] = {
    Question = "人不在其位,猜一个字",
    A = "立",
    B = "离",
    C = "历",
    D = "厉",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [94] = {
    Question = "一只黑狗,不叫不吼,打一字？",
    A = "墨",
    B = "犽",
    C = "犲",
    D = "默",
    Answer = "D",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [95] = {
    Question = "自小在一起,目前少联,打一字？",
    A = "省",
    B = "少",
    C = "秒",
    D = "劣",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [96] = {
    Question = "四面都是山,山山都相连,打一字？",
    A = "乢",
    B = "田",
    C = "凷",
    D = "屾",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [97] = {
    Question = "皇帝新衣,打一字？",
    A = "玌",
    B = "丞",
    C = "袭",
    D = "龚",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [98] = {
    Question = "一字十三点,难在如何点,猜一个字？",
    A = "汁",
    B = "辻",
    C = "汀",
    D = "呔",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [99] = {
    Question = "一夜又一夜,猜一字？",
    A = "多",
    B = "比",
    C = "羽",
    D = "晚",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [100] = {
    Question = "一边是红,一边是绿,一边怕风,一边怕雨,猜一个字？",
    A = "春",
    B = "夏",
    C = "秋",
    D = "东",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [101] = {
    Question = "一只牛,猜一个字？",
    A = "生",
    B = "午",
    C = "犄",
    D = "用",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [102] = {
    Question = "八十八 ,猜一个字？",
    A = "分",
    B = "米",
    C = "弅",
    D = "木",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [103] = {
    Question = "三口重叠,莫把品字猜,猜一个字？",
    A = "目",
    B = "品",
    C = "區",
    D = "喦",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [104] = {
    Question = "五十对耳朵,猜一个字？",
    A = "伯",
    B = "癿",
    C = "苩",
    D = "陌",
    Answer = "D",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [105] = {
    Question = "心如刀刺,猜一字？",
    A = "必",
    B = "忉",
    C = "吢",
    D = "忍",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [106] = {
    Question = "左有十八,右有十八,二四得八,一八得八,猜一个字？",
    A = "彬",
    B = "树",
    C = "樊",
    D = "琳",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [107] = {
    Question = "如箭在弦,猜一字？",
    A = "弖",
    B = "躬",
    C = "引 ",
    D = "射",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [108] = {
    Question = "有心得志,猜一个字？",
    A = "写",
    B = "士",
    C = "土",
    D = "去",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [109] = {
    Question = "有两个动物,一个在水里,一个在山上,猜一个字？",
    A = "鲜",
    B = "犲",
    C = "劷",
    D = "魓",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [110] = {
    Question = "六十不足,八十有余,猜一字？",
    A = "夹",
    B = "平",
    C = "申",
    D = "来",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [111] = {
    Question = "孙悟空的第一个师傅是谁？",
    A = "唐僧",
    B = "如来",
    C = "菩提祖师",
    D = "李小龙",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [112] = {
    Question = "玄奘西行取经途经多少个国家？",
    A = "90个",
    B = "100个",
    C = "110个",
    D = "120个",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [113] = {
    Question = "孙悟空在五庄观摘仙果,一共打掉了几个？",
    A = "1",
    B = "2",
    C = "3",
    D = "4",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [114] = {
    Question = "南海龙王的真实姓名叫什么？",
    A = "敖顺",
    B = "敖钦",
    C = "敖闰",
    D = "鳌拜",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [115] = {
    Question = "观音菩萨给师徒四人一共制造了多少难？",
    A = "八十难",
    B = "八十一难",
    C = "七十九难",
    D = "八十二难",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [116] = {
    Question = "在西游记中,唐玄奘一共赶走孙悟空多少次？",
    A = "2次",
    B = "3次",
    C = "4次",
    D = "5次",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [117] = {
    Question = "西游记里唐僧和猪八戒喝了女儿国什么河的水怀孕的？",
    A = "子母河",
    B = "母子河",
    C = "西凉河",
    D = "流沙河",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [118] = {
    Question = "车迟国里,师徒四人与三妖斗法,三妖中的哪个妖怪是被烫死的？",
    A = "虎力大仙",
    B = "羊力大仙",
    C = "鹿力大仙",
    D = "没有这事",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [119] = {
    Question = "西游记《三打白骨精》中,白骨精最后一个变的是什么人？",
    A = "老婆婆",
    B = "老公公",
    C = "村姑",
    D = "超人",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [120] = {
    Question = "盘丝洞里面一共有多少只蜘蛛精？",
    A = "9只",
    B = "5只",
    C = "7只",
    D = "8只",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [121] = {
    Question = "《西游记》中西行取经的师徒一共有多少人？",
    A = "4",
    B = "5",
    C = "3",
    D = "6",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [122] = {
    Question = "唐僧在哪收的猪八戒？",
    A = "高老庄",
    B = "流沙河",
    C = "五指山",
    D = "长安",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [123] = {
    Question = "西游记中孙悟空一共有几位师父？",
    A = "3",
    B = "1",
    C = "2",
    D = "4",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [124] = {
    Question = "火焰山是怎样形成的？",
    A = "牛魔王放的火",
    B = "孙悟空打翻炼丹炉",
    C = "天然形成的",
    D = "不知道",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [125] = {
    Question = "请问女儿国的女子一般到了多少岁就会喝那条子母河里的水？",
    A = "18岁",
    B = "20岁",
    C = "22岁",
    D = "16岁",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [126] = {
    Question = "请问天竺国的假公主是由什么精变的？",
    A = "蜘蛛精",
    B = "玉兔精",
    C = "蝎子精",
    D = "老鼠精",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [127] = {
    Question = "四大天王中,使用青锋宝剑的是哪位天王？",
    A = "广目天王",
    B = "增长天王",
    C = "多闻天王",
    D = "持国天王",
    Answer = "D",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [128] = {
    Question = "在阎罗王的生死簿上,孙悟空只能活多少岁？",
    A = "二百五十一岁",
    B = "三百四十二岁",
    C = "四百八十三岁",
    D = "五百七十四岁",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [129] = {
    Question = "孙悟空大闹龙宫,强索披挂,四海龙王中送给孙悟空 “凤翅紫金冠”的是 ？",
    A = "东海龙王敖广",
    B = "西海龙王敖闰",
    C = "南海龙王敖钦",
    D = "北海龙王敖顺",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [130] = {
    Question = "在《三打白骨精》中,第二次孙悟空打死白骨精变得老妇,唐僧以为孙悟空残害无辜赶孙悟空走,当时孙悟空有一的心愿未,这里的心愿未了是指什么？",
    A = "分行李",
    B = "去金箍圈",
    C = "索要盘缠",
    D = "不知道",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [131] = {
    Question = "在《西游记》第一集《惊天地美猴王中》孙悟空是从哪里出生的？",
    A = "仙石",
    B = "花果山",
    C = "炼丹炉",
    D = "水帘洞",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [132] = {
    Question = "在《三打白骨精》中,第一次孙悟空打死的是谁？",
    A = "老翁",
    B = "老妇",
    C = "村姑",
    D = "年轻人",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [133] = {
    Question = "上古至宝紫金铃的第三铃有什么用？",
    A = "喷火",
    B = "冒烟",
    C = "流沙",
    D = "吞噬",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [134] = {
    Question = "红孩儿被南海观音封为了什么？",
    A = "净坛使者",
    B = "善财童子",
    C = "金身罗汉",
    D = "惠岸贤者",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [135] = {
    Question = "青牛精拿了太上老君什么法宝？",
    A = "晃金绳",
    B = "紫金铃",
    C = "金刚圈",
    D = "炼丹炉",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [136] = {
    Question = "车迟国的三个妖怪分别是什么？",
    A = "虎、鹿、羊",
    B = "狮、虎、鹿",
    C = "鸡、羊、鹿",
    D = "豹、羊、猪",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [137] = {
    Question = "在西游记六十五回中,对付黄眉老妖的时候是谁帮助了孙悟空并收服了黄眉老妖？",
    A = "天兵天将",
    B = "王菩萨",
    C = "弥勒佛",
    D = "如来佛祖",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [138] = {
    Question = "《盘丝洞棒打蜘蛛精》故事中,毗蓝菩萨帮孙悟空制服了蜈蚣精,请问那毗蓝菩萨的儿子是谁？ ",
    A = "火德星君",
    B = "水德星官",
    C = "昴日星官 ",
    D = "旭日星官",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [139] = {
    Question = "阿傩、伽叶第一次传给唐僧师徒是无字真经,是被谁发现并派白雄尊者抢回来的？",
    A = "弥勒笑佛",
    B = "燃灯古佛",
    C = "如来佛祖",
    D = "观音菩萨",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [140] = {
    Question = "三打白骨精中的“三”表示“三次”意思,请问下列词中哪个词中的“三”的意思与“三打白骨精”中“三”的意思一样？",
    A = "三番五次",
    B = "三顾茅庐",
    C = "三思而行",
    D = "三心二意",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [141] = {
    Question = "孙悟空向铁扇公主借芭蕉扇,怎知那铁扇公主还记仇,无奈孙悟空变成了什么哄骗了铁扇公主,借来了宝扇？",
    A = "女童",
    B = "红孩儿",
    C = "牛魔王",
    D = "避水兽",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [142] = {
    Question = "召唤兽的需要多少级才能在灵兽仙处进行1转？",
    A = "100",
    B = "102",
    C = "120",
    D = "140",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [143] = {
    Question = "召唤兽的需要多少级才能在灵兽仙处进行2转？",
    A = "100",
    B = "102",
    C = "120",
    D = "140",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [144] = {
    Question = "召唤兽的需要多少级才能在灵兽仙处进行3转？",
    A = "100",
    B = "102",
    C = "120",
    D = "140",
    Answer = "D",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [145] = {
    Question = "转生不需要击败什么怪？",
    A = "金鬼",
    B = "银鬼",
    C = "铜鬼",
    D = "魔鬼",
    Answer = "D",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [146] = {
    Question = "冲级礼包每几级可以领取一次？",
    A = "5",
    B = "10",
    C = "15",
    D = "20",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [147] = {
    Question = "侠义商店每逢周几早上5：00自动刷新？",
    A = "一",
    B = "二",
    C = "三",
    D = "四",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [148] = {
    Question = "除了铜钱之外,使用什么也可以回复饱食度？",
    A = "食物",
    B = "符文",
    C = "酒水",
    D = "药品",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [149] = {
    Question = "使用什么物品可以提高人物的移动速度？",
    A = "叫花鸡",
    B = "神行符",
    C = "变身符",
    D = "断续丸",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [150] = {
    Question = "三界历练每逢周几早上5：00自动重置？",
    A = "一",
    B = "二",
    C = "三",
    D = "四",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [151] = {
    Question = "侠义值能通过帮助其他玩家完成什么任务获得？",
    A = "主线任务",
    B = "支线任务",
    C = "历练任务",
    D = "试炼任务",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [152] = {
    Question = "游戏中有五行相克的说法,其中克木的是?",
    A = "金",
    B = "水",
    C = "火",
    D = "土",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [153] = {
    Question = "游戏中有五行相克的说法,其中克金的是?",
    A = "木",
    B = "火",
    C = "土",
    D = "水",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [154] = {
    Question = "游戏中有五行相克的说法,其中克水的是?",
    A = "木",
    B = "火",
    C = "土",
    D = "金",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [155] = {
    Question = "游戏中有五行相克的说法,其中克土的是?",
    A = "水",
    B = "火",
    C = "土",
    D = "木",
    Answer = "D",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [156] = {
    Question = "游戏中有五行相克的说法,其中克火的是?",
    A = "水",
    B = "土",
    C = "金",
    D = "木",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [157] = {
    Question = "以下哪个活动有机会获得灵兽之源？",
    A = "大雁塔镇妖",
    B = "天庭除妖",
    C = "通天幻境",
    D = "天兵神将",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [158] = {
    Question = "以下哪个活动有机会获得仙器卷轴？",
    A = "大雁塔镇妖",
    B = "天庭除妖",
    C = "通天幻境",
    D = "天兵神将",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [159] = {
    Question = "以下哪个活动有机会获得召唤兽技能书？",
    A = "大雁塔镇妖",
    B = "天庭除妖",
    C = "通天幻境",
    D = "天兵神将",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [160] = {
    Question = "以下哪个活动有机会获得红色强化符？",
    A = "大雁塔镇妖",
    B = "天庭除妖",
    C = "通天幻境",
    D = "天兵神将",
    Answer = "D",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [161] = {
    Question = "捕捉普通召唤兽需要学习什么生活技能？",
    A = "制符",
    B = "制药",
    C = "烹饪",
    D = "不需要",
    Answer = "D",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [162] = {
    Question = "捕捉高级守护需要学习什么生活技能？",
    A = "捉宠",
    B = "制药",
    C = "烹饪",
    D = "制符",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [163] = {
    Question = "铜币货摊每隔多久可以免费刷新一次？",
    A = "5分钟",
    B = "10分钟",
    C = "15分钟",
    D = "20分钟",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [164] = {
    Question = "召唤兽最多可以使用多少个成长丹？",
    A = "2",
    B = "3",
    C = "4",
    D = "5",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [165] = {
    Question = "重铸仙器需要什么道具？",
    A = "灵珠",
    B = "九天玄玉",
    C = "仙梦石",
    D = "仙玉",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [166] = {
    Question = "重铸高级装备需要什么道具？",
    A = "灵珠",
    B = "九天玄玉",
    C = "仙梦石",
    D = "仙玉",
    Answer = "B",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [167] = {
    Question = "炼化仙器需要什么道具？",
    A = "灵珠",
    B = "九天玄玉",
    C = "仙梦石",
    D = "仙玉",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [168] = {
    Question = "炼化一件装备最多可以同时出现多少种属性？",
    A = "1",
    B = "3",
    C = "5",
    D = "7",
    Answer = "C",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  },
  [169] = {
    Question = "主角、伙伴和召唤兽每次转生后会增加额外的什么东西？",
    A = "属性",
    B = "铜钱",
    C = "荣誉值",
    D = "侠义值",
    Answer = "A",
    NpcList = {
      91002,
      90909,
      90928,
      90922,
      95028
    }
  }
}
