data_FuncEquipCtrl = {
  [102] = {
    des = "普通装备炼化",
    items = {
      [72005] = 1
    },
    money = 6000
  },
  [211] = {
    des = "1级高级装备（不包括装饰物品）合成",
    items = {
      [71005] = 15
    },
    money = 200000
  },
  [212] = {
    des = "1级高级装备（不包括装饰物品）炼化",
    items = {
      [72005] = 1
    },
    money = 30000
  },
  [213] = {
    des = "1级高级装备（不包括装饰物品）重铸",
    items = {
      [75010] = 1
    },
    money = 5000
  },
  [221] = {
    des = "2级高级装备（不包括装饰物品）合成",
    items = {
      [71005] = 20,
      [71006] = 10
    },
    money = 3000000
  },
  [222] = {
    des = "2级高级装备（不包括装饰物品）炼化",
    items = {
      [72005] = 1
    },
    money = 30000
  },
  [223] = {
    des = "2级高级装备（不包括装饰物品）重铸",
    items = {
      [75010] = 1
    },
    money = 5000
  },
  [231] = {
    des = "3级高级装备（不包括装饰物品）合成",
    items = {
      [71005] = 20,
      [71006] = 50
    },
    money = 5000000
  },
  [232] = {
    des = "3级高级装备（不包括装饰物品）炼化",
    items = {
      [72005] = 1
    },
    money = 30000
  },
  [233] = {
    des = "3级高级装备（不包括装饰物品）重铸",
    items = {
      [75010] = 1
    },
    money = 5000
  },
  [311] = {
    des = "1级仙器合成",
    items = {
      [71007] = 40,
      [71006] = 10
    },
    money = 400000
  },
  [312] = {
    des = "1级仙器炼化",
    items = {
      [72005] = 3
    },
    money = 300000
  },
  [313] = {
    des = "1级仙器重铸",
    items = {
      [73001] = 1
    },
    money = 10000
  },
  [321] = {
    des = "2级仙器合成",
    items = {
      [71007] = 50,
      [71006] = 10
    },
    money = 6000000
  },
  [322] = {
    des = "2级仙器炼化",
    items = {
      [72005] = 3
    },
    money = 300000
  },
  [323] = {
    des = "2级仙器重铸",
    items = {
      [73001] = 1
    },
    money = 10000
  },
  [331] = {
    des = "3级仙器合成",
    items = {
      [71007] = 80,
      [71006] = 10
    },
    money = 8000000
  },
  [332] = {
    des = "3级仙器炼化",
    items = {
      [72005] = 3
    },
    money = 300000
  },
  [333] = {
    des = "3级仙器重铸",
    items = {
      [73001] = 1
    },
    money = 10000
  },
  [341] = {
    des = "4级仙器合成",
    items = {
      [71007] = 200,
      [71006] = 40
    },
    money = 15000000
  },
  [342] = {
    des = "4级仙器炼化",
    items = {
      [72005] = 3
    },
    money = 300000
  },
  [343] = {
    des = "4级仙器重铸",
    items = {
      [73001] = 1
    },
    money = 10000
  },
  [351] = {
    des = "5级仙器合成",
    items = {
      [71007] = 400,
      [71006] = 80
    },
    money = 30000000
  },
  [352] = {
    des = "5级仙器炼化",
    items = {
      [72005] = 3
    },
    money = 50000
  },
  [353] = {
    des = "5级仙器重铸",
    items = {
      [73001] = 1
    },
    money = 10000
  },
  [361] = {
    des = "6级仙器合成",
    items = {
      [71007] = 800,
      [71006] = 160
    },
    money = 60000000
  },
  [362] = {
    des = "6级仙器炼化",
    items = {
      [72005] = 3
    },
    money = 50000
  },
  [363] = {
    des = "6级仙器重铸",
    items = {
      [73001] = 1
    },
    money = 10000
  },
  [371] = {
    des = "7级仙器合成",
    items = {
      [71007] = 1600,
      [71006] = 320
    },
    money = 120000000
  },
  [372] = {
    des = "7级仙器炼化",
    items = {
      [72005] = 3
    },
    money = 50000
  },
  [373] = {
    des = "7级仙器重铸",
    items = {
      [73001] = 1
    },
    money = 10000
  },
  [381] = {
    des = "8级仙器合成",
    items = {
      [71007] = 3200,
      [71006] = 640
    },
    money = 240000000
  },
  [382] = {
    des = "8级仙器炼化",
    items = {
      [72005] = 3
    },
    money = 50000
  },
  [383] = {
    des = "8级仙器重铸",
    items = {
      [73001] = 1
    },
    money = 10000
  },
  [411] = {
    des = "1级高级装饰装备合成",
    items = {
      [71005] = 15,
      [76525] = 1
    },
    money = 2000000
  },
  [412] = {
    des = "1级高级装饰装备炼化",
    items = {
      [72005] = 1
    },
    money = 180000
  },
  [413] = {
    des = "1级高级装饰装备重铸",
    items = {
      [75010] = 1
    },
    money = 5000
  },
  [421] = {
    des = "2级高级装饰装备合成",
    items = {
      [71005] = 20,
      [71006] = 10,
      [76525] = 2
    },
    money = 5000000
  },
  [422] = {
    des = "2级高级装饰装备炼化",
    items = {
      [72005] = 1
    },
    money = 180000
  },
  [423] = {
    des = "2级高级装饰装备重铸",
    items = {
      [75010] = 1
    },
    money = 5000
  },
  [431] = {
    des = "3级高级装饰装备合成",
    items = {
      [71005] = 20,
      [71006] = 50,
      [76525] = 4
    },
    money = 5000000
  },
  [432] = {
    des = "3级高级装饰装备炼化",
    items = {
      [72005] = 1
    },
    money = 180000
  },
  [433] = {
    des = "3级高级装饰装备重铸",
    items = {
      [75010] = 1
    },
    money = 5000
  },
  [442] = {
    des = "4级高级装饰装备炼化(只有翅膀）",
    items = {
      [72005] = 1
    },
    money = 180000
  },
  [452] = {
    des = "5级高级装饰装备炼化(只有翅膀）",
    items = {
      [72005] = 1
    },
    money = 180000
  },
  [602] = {
    des = "伙伴装备炼化",
    items = {
      [72005] = 1
    },
    money = 30000
  },
  [603] = {
    des = "伙伴装备重铸",
    items = {
      [75010] = 1
    },
    money = 5000
  },
  [701] = {
    des = "高级装备回炉",
    items = {
      [75010] = 20
    },
    money = 1000000
  },
  [702] = {
    des = "仙器回炉",
    items = {
      [73001] = 20
    },
    money = 5000000
  },
  [703] = {
    des = "仙器转换",
    items = {
      [73001] = 30
    },
    money = 5000000
  },
  [1331] = {
    des = "3级仙器合成（武器）",
    items = {
      [71007] = 10,
      [71006] = 50,
      [76542] = 6
    },
    money = 8000000
  },
  [2331] = {
    des = "3级仙器合成（头盔）",
    items = {
      [71007] = 10,
      [71006] = 50,
      [76543] = 6
    },
    money = 8000000
  },
  [3331] = {
    des = "3级仙器合成（盔甲）",
    items = {
      [71007] = 10,
      [71006] = 50,
      [76544] = 6
    },
    money = 8000000
  },
  [4331] = {
    des = "3级仙器合成（鞋子）",
    items = {
      [71007] = 10,
      [71006] = 50,
      [76545] = 6
    },
    money = 8000000
  },
  [5331] = {
    des = "3级仙器合成（项链）",
    items = {
      [71007] = 10,
      [71006] = 50,
      [76546] = 6
    },
    money = 8000000
  }
}
