data_RbAdden = {
  [1] = {
    preskill = "中毒",
    name = "抗中毒",
    rb1 = 0.1025,
    rb2 = 0.15375,
    rb3 = 0.205,
    rb4 = 0.25625
  },
  [2] = {
    preskill = "昏睡",
    name = "抗昏睡",
    rb1 = 0.1025,
    rb2 = 0.15375,
    rb3 = 0.205,
    rb4 = 0.25625
  },
  [3] = {
    preskill = "混乱",
    name = "抗混乱",
    rb1 = 0.1025,
    rb2 = 0.15375,
    rb3 = 0.205,
    rb4 = 0.25625
  },
  [4] = {
    preskill = "封印",
    name = "抗封印",
    rb1 = 0.1025,
    rb2 = 0.15375,
    rb3 = 0.205,
    rb4 = 0.25625
  },
  [5] = {
    preskill = "火系",
    name = "抗火系",
    rb1 = 0.138375,
    rb2 = 0.2075625,
    rb3 = 0.27675,
    rb4 = 0.3459375
  },
  [6] = {
    preskill = "风系",
    name = "抗风系",
    rb1 = 0.138375,
    rb2 = 0.2075625,
    rb3 = 0.27675,
    rb4 = 0.3459375
  },
  [7] = {
    preskill = "雷系",
    name = "抗雷系",
    rb1 = 0.138375,
    rb2 = 0.2075625,
    rb3 = 0.27675,
    rb4 = 0.3459375
  },
  [8] = {
    preskill = "水系",
    name = "抗水系",
    rb1 = 0.138375,
    rb2 = 0.2075625,
    rb3 = 0.27675,
    rb4 = 0.3459375
  },
  [9] = {
    preskill = "加防",
    name = "物理吸收",
    rb1 = 0.1537,
    rb2 = 0.2305,
    rb3 = 0.3074,
    rb4 = 0.384233333333
  },
  [10] = {
    preskill = "加攻",
    name = "转生生命修正",
    rb1 = 0.082,
    rb2 = 0.123,
    rb3 = 0.164,
    rb4 = 0.205
  },
  [11] = {
    preskill = "加速",
    name = "转生速度修正",
    rb1 = 0.0615,
    rb2 = 0.09225,
    rb3 = 0.123,
    rb4 = 0.15375
  },
  [12] = {
    preskill = "虹吸",
    name = "转生法力修正",
    rb1 = 0.082,
    rb2 = 0.123,
    rb3 = 0.164,
    rb4 = 0.205
  },
  [13] = {
    preskill = "加防",
    name = "抗虹吸",
    rb1 = 0.0921,
    rb2 = 0.1382,
    rb3 = 0.1842,
    rb4 = 0.230266666667
  },
  [14] = {
    preskill = "遗忘",
    name = "抗遗忘",
    rb1 = 0.1025,
    rb2 = 0.1538,
    rb3 = 0.205,
    rb4 = 0.256266666667
  },
  [15] = {
    preskill = "哀嚎",
    name = "抗哀嚎",
    rb1 = 0.1384,
    rb2 = 0.2076,
    rb3 = 0.2768,
    rb4 = 0.346
  },
  [16] = {
    preskill = "吸血",
    name = "抗吸血",
    rb1 = 2044,
    rb2 = 3066,
    rb3 = 4088,
    rb4 = 5110
  },
  [17] = {
    preskill = "吸血",
    name = "转生速度负修正",
    rb1 = -0.1025,
    rb2 = -0.1538,
    rb3 = -0.205,
    rb4 = -0.256266666667
  },
  [18] = {
    preskill = "衰弱",
    name = "反震率",
    rb1 = 0.0513,
    rb2 = 0.0769,
    rb3 = 0.1025,
    rb4 = 0.1281
  },
  [19] = {
    preskill = "衰弱",
    name = "反震程度",
    rb1 = 0.1025,
    rb2 = 0.1538,
    rb3 = 0.205,
    rb4 = 0.256266666667
  },
  [20] = {
    preskill = "衰弱",
    name = "抗内丹",
    rb1 = 511,
    rb2 = 766,
    rb3 = 1022,
    rb4 = 1277.33333333
  }
}
