data_MarryQuestion = {
  [1] = {
    Question = "你认为跟你一同答题的这个人在你心里是世间最？",
    A = "无聊的",
    B = "美（帅）的",
    C = "丑的",
    D = "傻的",
    Answer = "B"
  },
  [2] = {
    Question = "婚前任务答题过程中,只有一人答对会怎样？",
    A = "答题成功",
    B = "答题失败",
    C = "奖励铜钱",
    D = "没影响",
    Answer = "B"
  },
  [3] = {
    Question = "婚前任务答题,默认答题时间有多少秒？",
    A = "10秒",
    B = "15秒",
    C = "30秒",
    D = "60秒",
    Answer = "C"
  },
  [4] = {
    Question = "有结契关系的玩家如何申请结婚？",
    A = "直接在红娘处申请",
    B = "不可以结婚",
    C = "直接在擂台申请",
    D = "直接在师门申请",
    Answer = "B"
  },
  [5] = {
    Question = "在游戏中,同性如何结婚？",
    A = "直接在红娘处申请",
    B = "不可以结婚",
    C = "收买GM",
    D = "直接在擂台申请",
    Answer = "B"
  },
  [6] = {
    Question = "在游戏中,种族不同如何结婚？",
    A = "直接在红娘处申请",
    B = "不可以结婚",
    C = "转生成同样的种族",
    D = "必须换号来结婚",
    Answer = "A"
  },
  [7] = {
    Question = "在游戏中,女性角色如何才能向男性角色求婚？",
    A = "直接在红娘处申请",
    B = "不可以求婚",
    C = "刷喇叭求婚",
    D = "发世界",
    Answer = "B"
  },
  [8] = {
    Question = "在游戏中,男性角色如何才能向女性角色求婚？",
    A = "直接在红娘处申请",
    B = "不可以求婚",
    C = "刷喇叭求婚",
    D = "发世界",
    Answer = "A"
  },
  [9] = {
    Question = "以下那组数字代表“我爱你”？",
    A = "540",
    B = "523",
    C = "590",
    D = "520",
    Answer = "D"
  },
  [10] = {
    Question = "数字1392010的意思是？",
    A = "一生之中爱过你",
    B = "一生只要喜欢你",
    C = "一生就要在一起",
    D = "一生就爱你一人",
    Answer = "D"
  },
  [11] = {
    Question = "数字520的意思是？",
    A = "我想你",
    B = "我爱你",
    C = "我饿了",
    D = "我困了",
    Answer = "B"
  },
  [12] = {
    Question = "数字1314的意思是？",
    A = "生生世世",
    B = "三生三世",
    C = "一生一世",
    D = "二生二世",
    Answer = "C"
  },
  [13] = {
    Question = "数字3344的意思是？",
    A = "生生世世",
    B = "三生三世",
    C = "一生一世",
    D = "二生二世",
    Answer = "A"
  },
  [14] = {
    Question = "“问世间情是何物”的下一句是？",
    A = "问世间情是何物",
    B = "荒烟依旧平楚",
    C = "老翅几回寒暑",
    D = "直教人生死相许",
    Answer = "D"
  },
  [15] = {
    Question = "电影《大话西游》中“至尊宝向紫霞仙子”说了哪三个字? ",
    A = "来一杯",
    B = "我爱你",
    C = "别骗我",
    D = "饿了吗",
    Answer = "B"
  },
  [16] = {
    Question = "“陌上花开,可缓缓归矣”是吴越王钱镠写给谁的？",
    A = "越王勾践",
    B = "楚庄王芈旅",
    C = "他的妻子",
    D = "齐桓公姜小白",
    Answer = "C"
  },
  [17] = {
    Question = "“只愿君心似我心”下一句是什么？",
    A = "曾经沧海难为水",
    B = "定不负相思意",
    C = "衣带渐宽终不悔",
    D = "疑是银河落九天",
    Answer = "B"
  },
  [18] = {
    Question = "“与子成悦”上一句是什么？",
    A = "生死契阔",
    B = "执子之手",
    C = "与子偕老",
    D = "于嗟阔兮",
    Answer = "A"
  },
  [19] = {
    Question = "“十年生死两茫茫,不思量,自难忘。”是苏轼写给谁的？",
    A = "他的妻子",
    B = "李白",
    C = "杜甫",
    D = "他妹妹",
    Answer = "A"
  },
  [20] = {
    Question = "“衣带渐宽终不悔,为伊消得人憔悴。”表达了诗人的什么之情？",
    A = "兴高采烈",
    B = "思乡之情",
    C = "忧国忧民",
    D = "思念爱慕",
    Answer = "D"
  },
  [21] = {
    Question = "“两情若是久长时,又岂在朝朝暮暮。”出自哪首诗？",
    A = "鹊桥仙",
    B = "春晓",
    C = "静夜思",
    D = "绝句",
    Answer = "A"
  },
  [22] = {
    Question = "“思君令人老,岁月忽已晚。”这首情诗作者身处在？",
    A = "太平盛世",
    B = "兵荒马乱",
    C = "世外桃源",
    D = "天下太平",
    Answer = "B"
  },
  [23] = {
    Question = "“问世间情是何物,直教生死相许。”出自哪首诗？",
    A = "赠汪伦",
    B = "春晓",
    C = "雁邱词",
    D = "回乡偶书",
    Answer = "C"
  },
  [24] = {
    Question = "“君生我未生”下一句是？",
    A = "我生君已老",
    B = "可缓缓归矣",
    C = "望庐山瀑布",
    D = "衣带渐宽终不悔",
    Answer = "A"
  },
  [25] = {
    Question = "“取次花丛懒回顾,半缘修道半缘君。”是元稹为爱妻而写,他的爱妻是？",
    A = "周芷若",
    B = "小龙女",
    C = "韦丛",
    D = "嫦娥",
    Answer = "C"
  },
  [26] = {
    Question = "七夕是农历哪一天？",
    A = "一月初一",
    B = "七月初七",
    C = "八月十五",
    D = "十月一日",
    Answer = "B"
  },
  [27] = {
    Question = "农历七月初七是什么节？",
    A = "中秋",
    B = "七夕",
    C = "端午",
    D = "重阳",
    Answer = "B"
  },
  [28] = {
    Question = "下列哪一种花代表我爱你？",
    A = "油菜花",
    B = "牡丹花",
    C = "牵牛花",
    D = "玫瑰花",
    Answer = "D"
  },
  [29] = {
    Question = "结婚多少周年叫做金婚？",
    A = "五十周年",
    B = "七周年",
    C = "十五周年",
    D = "二周年",
    Answer = "A"
  },
  [30] = {
    Question = "结婚五十周年叫做什么婚？",
    A = "纸婚",
    B = "水晶婚",
    C = "碧玉婚",
    D = "金婚",
    Answer = "D"
  },
  [31] = {
    Question = "结婚多少周年叫做银婚？",
    A = "一周年",
    B = "五周年",
    C = "二十五周年",
    D = "七十周年",
    Answer = "C"
  },
  [32] = {
    Question = "结婚二十五周年叫做什么婚？",
    A = "布婚",
    B = "木婚",
    C = "钻石婚",
    D = "银婚",
    Answer = "D"
  },
  [33] = {
    Question = "2月14是什么节？",
    A = "中秋节",
    B = "端午节",
    C = "白色情人节",
    D = "劳动节",
    Answer = "C"
  },
  [34] = {
    Question = "玫瑰花的话语是？",
    A = "祝福你",
    B = "我爱你",
    C = "我恨你",
    D = "讨厌你",
    Answer = "B"
  },
  [35] = {
    Question = "“曾经沧海难为水”下一句是什么？",
    A = "定不负相思意",
    B = "直教生死相许",
    C = "除却巫山不是云",
    D = "可缓缓归矣",
    Answer = "C"
  },
  [36] = {
    Question = "“为伊消得人憔悴”上一句是什么？",
    A = "衣带渐宽终不悔",
    B = "定不负相思意",
    C = "曾经沧海难为水",
    D = "思君令人老",
    Answer = "A"
  },
  [37] = {
    Question = "“两情若是长久时”下一句是什么？",
    A = "为伊消得人憔悴",
    B = "半缘修道半缘君",
    C = "荒烟依旧平楚",
    D = "又岂在朝朝暮暮",
    Answer = "D"
  },
  [38] = {
    Question = "“问世间情是何物”下一句是什么？",
    A = "君住长江尾",
    B = "直教生死相许",
    C = "半缘修道半缘君",
    D = "老翅几回寒暑",
    Answer = "B"
  },
  [39] = {
    Question = "“十年生死两茫茫”的作者是谁？",
    A = "苏轼",
    B = "李清照",
    C = "李商隐",
    D = "苏洵",
    Answer = "A"
  },
  [40] = {
    Question = "白色情人节是哪一天？",
    A = "2月14",
    B = "3月3",
    C = "8月15",
    D = "10月1",
    Answer = "A"
  },
  [41] = {
    Question = "牛郎织女只有在每年的几月几日才能相会？",
    A = "十月一",
    B = "七月七",
    C = "九月九",
    D = "三月三",
    Answer = "B"
  },
  [42] = {
    Question = "牛郎织女每年七月七在哪里相会？",
    A = "人间",
    B = "井边",
    C = "鹊桥",
    D = "湖边",
    Answer = "C"
  },
  [43] = {
    Question = "中国古代爱情故事中,梁山伯祝英台最终变为了什么？",
    A = "花",
    B = "蝴蝶",
    C = "小草",
    D = "大树",
    Answer = "B"
  },
  [44] = {
    Question = "中国古代爱情故事中,相传谁哭倒了长城？",
    A = "聂小倩",
    B = "茱丽叶",
    C = "祝英台",
    D = "孟姜女",
    Answer = "D"
  },
  [45] = {
    Question = "中国古代爱情故事中,嫦娥偷吃了谁的不死药,奔月成仙？",
    A = "后羿",
    B = "梁山伯",
    C = "罗密欧",
    D = "猪八戒",
    Answer = "A"
  },
  [46] = {
    Question = "中国古代爱情故事中,七仙女为了谁私自下凡？",
    A = "梁山伯",
    B = "罗密欧",
    C = "董永",
    D = "吴刚",
    Answer = "C"
  },
  [47] = {
    Question = "在广寒宫砍桂花树的是谁？",
    A = "猪八戒",
    B = "吴刚",
    C = "孙悟空",
    D = "罗密欧",
    Answer = "B"
  },
  [48] = {
    Question = "吴刚在广寒宫砍得是什么树？",
    A = "桂花树",
    B = "松树",
    C = "梧桐树",
    D = "白杨树",
    Answer = "A"
  },
  [49] = {
    Question = "嫦娥在广寒宫养的什么小动物？",
    A = "小鸟",
    B = "小猫",
    C = "小狗",
    D = "玉兔",
    Answer = "D"
  },
  [50] = {
    Question = "舜帝的妻子是谁？",
    A = "娥皇",
    B = "女英",
    C = "以上2个都不是",
    D = "以上2个都是",
    Answer = "D"
  },
  [51] = {
    Question = "白素贞为了许仙做了什么事？",
    A = "什么也没做",
    B = "水漫金山寺",
    C = "飞天成仙",
    D = "大闹天宫",
    Answer = "B"
  },
  [52] = {
    Question = "白素贞跟许仙生下的儿子叫？",
    A = "许嵩",
    B = "许巍",
    C = "许仕林",
    D = "许茹芸",
    Answer = "C"
  },
  [53] = {
    Question = "《天仙配》是安庆黄梅戏,它描述了董永和谁的故事？",
    A = "七仙女",
    B = "嫦娥",
    C = "祝英台",
    D = "林黛玉",
    Answer = "A"
  },
  [54] = {
    Question = "四大名著之一的《红楼梦》,林黛玉喜欢的人是？",
    A = "董永",
    B = "后羿",
    C = "梁山伯",
    D = "贾宝玉",
    Answer = "D"
  },
  [55] = {
    Question = "四大名著之一的《红楼梦》,与贾宝玉有爱恨纠葛的包括以下哪位？",
    A = "七仙女",
    B = "茱丽叶",
    C = "小龙女",
    D = "林黛玉",
    Answer = "D"
  },
  [56] = {
    Question = "古今第一长诗《孔雀东南飞》,描述了焦仲卿和谁的故事？",
    A = "七仙女",
    B = "刘兰芝",
    C = "朱丽叶",
    D = "嫦娥",
    Answer = "B"
  },
  [57] = {
    Question = "古今第一长诗《孔雀东南飞》,描述了刘兰芝和谁的故事？",
    A = "焦仲卿",
    B = "宁采臣",
    C = "罗密欧",
    D = "后羿",
    Answer = "A"
  },
  [58] = {
    Question = "“在天愿作比翼鸟,在地愿为连理枝”,叙述了杨贵妃和谁的故事？",
    A = "范蠡",
    B = "宁采臣",
    C = "唐玄宗",
    D = "吴刚",
    Answer = "C"
  },
  [59] = {
    Question = "“在天愿作比翼鸟,在地愿为连理枝”,叙述了唐玄宗和谁的故事？",
    A = "嫦娥",
    B = "小龙女",
    C = "杨贵妃",
    D = "茱丽叶",
    Answer = "C"
  },
  [60] = {
    Question = "古代爱情故事中,谁“冲冠一怒为红颜”？",
    A = "吴三桂",
    B = "孙悟空",
    C = "罗密欧",
    D = "董永",
    Answer = "A"
  },
  [61] = {
    Question = "明朝将领吴三桂“冲冠一怒为红颜”,红颜指的是谁？",
    A = "聂小倩",
    B = "祝英台",
    C = "茱丽叶",
    D = "陈圆圆",
    Answer = "D"
  },
  [62] = {
    Question = "电影《倩女幽魂》讲的是聂小倩和谁的故事？",
    A = "范蠡",
    B = "宁采臣",
    C = "董永",
    D = "吴刚",
    Answer = "B"
  },
  [63] = {
    Question = "虞姬忍泪唱到“大王意气尽,贱妾何聊生”,其中的大王指的是？",
    A = "吴三桂",
    B = "宁采臣",
    C = "项羽",
    D = "梁山伯",
    Answer = "C"
  },
  [64] = {
    Question = "曾唱出“骓不逝兮可奈何,虞兮虞兮奈若何！”的霸王是谁？",
    A = "项羽",
    B = "吴三桂",
    C = "诸葛亮",
    D = "张飞",
    Answer = "A"
  },
  [65] = {
    Question = "虞姬是谁的宠姬？",
    A = "刘邦",
    B = "诸葛亮",
    C = "张飞",
    D = "项羽",
    Answer = "D"
  },
  [66] = {
    Question = "“金屋藏娇”的皇帝是谁？",
    A = "隋炀帝",
    B = "汉武帝",
    C = "康熙",
    D = "乾隆",
    Answer = "B"
  },
  [67] = {
    Question = "汉武帝“金屋藏娇”,其中娇是指谁？",
    A = "卫子夫",
    B = "李玉凤",
    C = "林黛玉",
    D = "陈阿娇",
    Answer = "D"
  },
  [68] = {
    Question = "电影《倩女幽魂》讲的是宁采臣和谁的故事？",
    A = "祝英台",
    B = "林黛玉",
    C = "聂小倩",
    D = "小龙女",
    Answer = "C"
  },
  [69] = {
    Question = "后羿的妻子是谁？",
    A = "小龙女",
    B = "嫦娥",
    C = "七仙女",
    D = "聂小倩",
    Answer = "B"
  },
  [70] = {
    Question = "古代,用什么物品来代表相思之意呢？",
    A = "红豆",
    B = "茱萸",
    C = "柳枝",
    D = "云",
    Answer = "A"
  },
  [71] = {
    Question = "古代,什么动物代表相爱的两个人？",
    A = "白鸟",
    B = "鸾鸟",
    C = "鸳鸯",
    D = "锦鳞",
    Answer = "C"
  },
  [72] = {
    Question = "结婚时,女子多穿什么颜色的婚纱成婚,代表纯洁的爱？",
    A = "蓝色",
    B = "白色",
    C = "米色",
    D = "红色",
    Answer = "B"
  },
  [73] = {
    Question = "古代新婚之夜,夫妻共饮一杯合欢酒,这合欢酒又称？",
    A = "合卺",
    B = "女儿红",
    C = "葡萄酒",
    D = "桑落酒",
    Answer = "A"
  },
  [74] = {
    Question = "现代婚礼的主持人叫做什么？",
    A = "媒婆",
    B = "高堂",
    C = "司仪",
    D = "牧师",
    Answer = "C"
  },
  [75] = {
    Question = "唐伯虎点秋香中,唐伯虎最后娶了谁?",
    A = "秋香",
    B = "石榴 ",
    C = "华夫人 ",
    D = "祝枝山",
    Answer = "A"
  },
  [76] = {
    Question = "唐伯虎点秋香中,秋香最后嫁给了谁？",
    A = "祝枝山",
    B = "华文",
    C = "华武",
    D = "唐伯虎",
    Answer = "D "
  },
  [77] = {
    Question = "俗话说：男追女,隔座山。女追男呢？",
    A = "隔块布",
    B = "没间隔",
    C = "不可以",
    D = "隔层纱",
    Answer = "D"
  },
  [78] = {
    Question = "俗话说,婚姻是爱情的坟墓。但是如果没有婚姻的话？",
    A = "就没有爱情",
    B = "爱情就死无葬身之地",
    C = "爱情就等于友情",
    D = "就一辈子单身",
    Answer = "B"
  },
  [79] = {
    Question = "《爱情公寓》里面胡一菲喜欢的人是谁？",
    A = "曾小贤",
    B = "金轮法王",
    C = "无心法师",
    D = "慕容止",
    Answer = "A"
  },
  [80] = {
    Question = "“世界上最遥远的距离,不是生与死,而是我站在你面前”下一句是什么？",
    A = "你却不爱我",
    B = "想你像我一样爱着你",
    C = "你却不知道我爱你",
    D = "对你说我爱你",
    Answer = "C"
  },
  [81] = {
    Question = "李商隐的诗词中“身无彩凤双飞翼,心有灵犀一点通”中“灵犀”是指什么？",
    A = "犀牛角",
    B = "心中的牵挂",
    C = "红线",
    D = "两人之间的爱意",
    Answer = "A"
  },
  [82] = {
    Question = "“七夕节”又名？",
    A = "元宵节",
    B = "乞巧节",
    C = "圣诞节",
    D = "鬼节",
    Answer = "B"
  }
}
