data_CapticalQuestionLib = {
  [30001] = {
    ID = 30001,
    Question = "标志着北宋诗文革新运动最高成就的作家是谁?",
    Option = {
      A = "王安石",
      B = "苏轼",
      C = "范仲淹",
      D = "欧阳修"
    },
    Answer = "B"
  },
  [30002] = {
    ID = 30002,
    Question = "下列鱼种,对水中氧气要求最高的是?",
    Option = {
      A = "海水热带鱼",
      B = "运河段鱼类",
      C = "湖泊定居性鱼类",
      D = "山溪性江河鱼类"
    },
    Answer = "A"
  },
  [30003] = {
    ID = 30003,
    Question = "饮酒时不宜多吃凉粉,是因为凉粉中含有?",
    Option = {
      A = "绿矾",
      B = "黑矾",
      C = "白矾",
      D = "明矾"
    },
    Answer = "C"
  },
  [30004] = {
    ID = 30004,
    Question = "海明威的小说《丧钟为谁而鸣》是以哪次战争为背景的?",
    Option = {
      A = "葡萄牙内战",
      B = "西班牙内战",
      C = "美国内战",
      D = "英国内战"
    },
    Answer = "B"
  },
  [30005] = {
    ID = 30005,
    Question = "罗丹是伟大的什么?",
    Option = {
      A = "漫画家",
      B = "雕塑家",
      C = "革命家",
      D = "文学家"
    },
    Answer = "B"
  },
  [30006] = {
    ID = 30006,
    Question = "“推敲”一词是因为唐朝哪位诗人仔细得来的? ",
    Option = {
      A = "刘禹锡",
      B = "杨炯",
      C = "贾岛",
      D = "王勃"
    },
    Answer = "C"
  },
  [30007] = {
    ID = 30007,
    Question = "“力拔南山三壮士,齐相杀之费二桃”齐相是谁?",
    Option = {
      A = "公子虔",
      B = "刘更生",
      C = "晏婴",
      D = "王诩"
    },
    Answer = "C"
  },
  [30008] = {
    ID = 30008,
    Question = "第一位给风力定级的唐代天文学家,数学家是谁? ",
    Option = {
      A = "张遂",
      B = "王孝通",
      C = "李淳风",
      D = "李治"
    },
    Answer = "C"
  },
  [30009] = {
    ID = 30009,
    Question = "“林中失偶子来伴,怕若无心何来惧”猜一诗人名?",
    Option = {
      A = "韩愈",
      B = "骆宾王",
      C = "白居易",
      D = "李白"
    },
    Answer = "D"
  },
  [30010] = {
    ID = 30010,
    Question = "北宋欧阳修等人编著的历史书叫什么? ",
    Option = {
      A = "集古录",
      B = "五代史",
      C = "风俗记",
      D = "新唐书"
    },
    Answer = "D"
  },
  [30011] = {
    ID = 30011,
    Question = "世界上已知最早的雕版印刷书籍是唐朝时期的哪部名著? ",
    Option = {
      A = "金刚经",
      B = "楞严经",
      C = "法华经",
      D = "华严经"
    },
    Answer = "A"
  },
  [30012] = {
    ID = 30012,
    Question = "“大弦嘈嘈如急雨”下一句是什么? ",
    Option = {
      A = "山寺桃花始盛开",
      B = "半江瑟瑟半江红",
      C = "小弦切切如私语",
      D = "独上危楼凭曲阑"
    },
    Answer = "C"
  },
  [30013] = {
    ID = 30013,
    Question = "下列哪个国家内,“猫”是受到严格保护的？",
    Option = {
      A = "古希腊",
      B = "古印度",
      C = "古埃及",
      D = "中国"
    },
    Answer = "C"
  },
  [30014] = {
    ID = 30014,
    Question = "初唐的都城长安是现在的? ",
    Option = {
      A = "登封",
      B = "西安",
      C = "商丘",
      D = "洛阳"
    },
    Answer = "B"
  },
  [30015] = {
    ID = 30015,
    Question = "在唐代以下哪个是真正的寺庙?",
    Option = {
      A = "白马寺",
      B = "鸿胪寺",
      C = "大理寺",
      D = "雷音寺"
    },
    Answer = "A"
  },
  [30016] = {
    ID = 30016,
    Question = "什么卡通人物最黑暗? ",
    Option = {
      A = "赤瞳",
      B = "小新",
      C = "哆啦A梦",
      D = "樱木花道"
    },
    Answer = "C"
  },
  [30017] = {
    ID = 30017,
    Question = "世界最长的河流是哪条？",
    Option = {
      A = "尼罗河",
      B = "长江",
      C = "亚马逊河",
      D = "珠江"
    },
    Answer = "A"
  },
  [30018] = {
    ID = 30018,
    Question = "竹林七贤之一阮籍官至? ",
    Option = {
      A = "步兵校尉",
      B = "督军校尉",
      C = "奋威校尉",
      D = "奋武校尉"
    },
    Answer = "A"
  },
  [30019] = {
    ID = 30019,
    Question = "镇元大仙的诨号是? ",
    Option = {
      A = "与君同世",
      B = "与天同君",
      C = "与君同行",
      D = "与世同在"
    },
    Answer = "B"
  },
  [30020] = {
    ID = 30020,
    Question = "“忽如一夜春风来,千树万树梨花开”是哪位诗人的名句 ",
    Option = {
      A = "李白",
      B = "杜甫",
      C = "王维",
      D = "岑参"
    },
    Answer = "D"
  },
  [30021] = {
    ID = 30021,
    Question = " “遥遥万里辉,荡荡空中景”是谁说的?",
    Option = {
      A = "白居易",
      B = "李白",
      C = "陶渊明",
      D = "岑参"
    },
    Answer = "C"
  },
  [30022] = {
    ID = 30022,
    Question = "“中药人言即信”是指? ",
    Option = {
      A = "人参",
      B = "田七",
      C = "当归",
      D = "砒霜"
    },
    Answer = "D"
  },
  [30023] = {
    ID = 30023,
    Question = "“甘露之变”要诛杀的宦官头领是谁? ",
    Option = {
      A = "赵高",
      B = "张让",
      C = "高力士",
      D = "仇士良"
    },
    Answer = "D"
  },
  [30024] = {
    ID = 30024,
    Question = "“牛李党争”分别以牛僧孺和谁为首?",
    Option = {
      A = "李德裕",
      B = "李宗闵",
      C = "郑覃",
      D = "李吉甫"
    },
    Answer = "A"
  },
  [30025] = {
    ID = 30025,
    Question = "汗血宝马起源的朝代? ",
    Option = {
      A = "新朝",
      B = "西楚",
      C = "西汉",
      D = "东汉"
    },
    Answer = "C"
  },
  [30026] = {
    ID = 30026,
    Question = "围棋棋盘纵横的线共构成多少个交叉点?",
    Option = {
      A = "360",
      B = "361",
      C = "362",
      D = "363"
    },
    Answer = "B"
  },
  [30027] = {
    ID = 30027,
    Question = "“太一贡兮天马下,沾赤汗兮末流诸。骋容与兮万里,今安匹兮龙为友”的作者是谁? ",
    Option = {
      A = "武则天",
      B = "唐太宗",
      C = "汉武帝",
      D = "汉高祖"
    },
    Answer = "C"
  },
  [30028] = {
    ID = 30028,
    Question = "《山海经》中的《南山经》东起浙江舟山群岛,西抵达哪里?",
    Option = {
      A = "湖南西部",
      B = "湖南东部",
      C = "湖南北部",
      D = "湖南南部"
    },
    Answer = "A"
  },
  [30029] = {
    ID = 30029,
    Question = "“竹杖芒鞋轻胜马,谁怕?”下一句是什么? ",
    Option = {
      A = "二月春风似剪刀",
      B = "一蓑烟雨任平生",
      C = "一枝红杏出墙来",
      D = "孤帆远影碧空尽"
    },
    Answer = "B"
  },
  [30030] = {
    ID = 30030,
    Question = "纵横派中连横派的代表都有谁?",
    Option = {
      A = "张横",
      B = "张仪",
      C = "张力",
      D = "张文"
    },
    Answer = "B"
  },
  [30031] = {
    ID = 30031,
    Question = "纵横家中合纵派的主要代表是谁?",
    Option = {
      A = "张秦",
      B = "李秦",
      C = "苏秦",
      D = "黄秦"
    },
    Answer = "C"
  },
  [30032] = {
    ID = 30032,
    Question = "“衰兰送客咸阳道”下一句是什么?",
    Option = {
      A = "也傍桑阴学种瓜",
      B = "天若有情天亦老",
      C = "明月何时照我还",
      D = "孤帆一片日边来"
    },
    Answer = "B"
  },
  [30033] = {
    ID = 30033,
    Question = "数学证明难题“每个不小于6的偶数都是两个奇素数之和以及每个不小于9的奇数都是三个奇素数之和”被称为什么? ",
    Option = {
      A = "霍奇猜想",
      B = "哥德巴赫猜想",
      C = "黎曼猜想",
      D = "周氏猜想"
    },
    Answer = "B"
  },
  [30034] = {
    ID = 30034,
    Question = "“六军不发无奈何,宛转蛾眉马前死.花钿委地无人收,翠翘金雀玉搔头”诗中描绘的景象发生在什么事件中? ",
    Option = {
      A = "八王之乱",
      B = "黄巾之乱",
      C = "安史之乱",
      D = "永嘉之乱"
    },
    Answer = "C"
  },
  [30035] = {
    ID = 30035,
    Question = "赤壁之战发生在公元多少年? ",
    Option = {
      A = "208",
      B = "209",
      C = "207",
      D = "206"
    },
    Answer = "A"
  },
  [30036] = {
    ID = 30036,
    Question = "左衽是指什么? ",
    Option = {
      A = "汉族的服饰",
      B = "少数民族的服饰",
      C = "骏马",
      D = "耕牛"
    },
    Answer = "B"
  },
  [30037] = {
    ID = 30037,
    Question = "“对潇潇暮雨洒江天,一番洗清秋,”的作者是?",
    Option = {
      A = "苏轼",
      B = "岳飞",
      C = "柳永",
      D = "陈亮"
    },
    Answer = "C"
  },
  [30038] = {
    ID = 30038,
    Question = "哪位哲学家与柏拉图,亚里士多德被并称谓“希腊三贤”? ",
    Option = {
      A = "苏格拉底",
      B = "泰勒士",
      C = "毕达哥拉斯",
      D = "赫拉克利特"
    },
    Answer = "A"
  },
  [30039] = {
    ID = 30039,
    Question = "汉字“卅”的意思是?",
    Option = {
      A = "三十",
      B = "二十",
      C = "十",
      D = "五十"
    },
    Answer = "A"
  },
  [30040] = {
    ID = 30040,
    Question = "“抱关击拆”是指? ",
    Option = {
      A = "职位中等",
      B = "职位低下",
      C = "职位很高",
      D = "位极人臣"
    },
    Answer = "B"
  },
  [30041] = {
    ID = 30041,
    Question = "宋词名句“天不老,情难绝,心似双丝网,中有千千结”的作者是?",
    Option = {
      A = "张三",
      B = "张飞",
      C = "张先",
      D = "张生"
    },
    Answer = "C"
  },
  [30042] = {
    ID = 30042,
    Question = "中国古代科举制度的起源于何时?",
    Option = {
      A = "秦朝",
      B = "隋朝",
      C = "清朝",
      D = "明朝"
    },
    Answer = "B"
  },
  [30043] = {
    ID = 30043,
    Question = "《几何原理》是世界上流传下来最早的几何学著作,由希腊科学家谁所编著?",
    Option = {
      A = "欧几里德",
      B = "亚里士多德",
      C = "阿基米德",
      D = "阿里斯塔克"
    },
    Answer = "A"
  },
  [30044] = {
    ID = 30044,
    Question = "具有溶蚀能力的水对可溶性岩石进行溶蚀等作用所形成的地表和地下形态的总称叫做什么?",
    Option = {
      A = "喀斯特地貌",
      B = "黄土地貌",
      C = "海岸地貌",
      D = "红树林地貌"
    },
    Answer = "A"
  },
  [30045] = {
    ID = 30045,
    Question = "大气层分为对流层,平流层,中间层,暖层和什么?",
    Option = {
      A = "均质层",
      B = "散逸层",
      C = "非均质层",
      D = "臭氧层"
    },
    Answer = "B"
  },
  [30046] = {
    ID = 30046,
    Question = "表示一句话中间的停顿要用什么标点符号?",
    Option = {
      A = "句号",
      B = "分号",
      C = "逗号",
      D = "省略号"
    },
    Answer = "C"
  },
  [30047] = {
    ID = 30047,
    Question = "唐朝的“古文运动”提倡散文,反对什么? ",
    Option = {
      A = "诗歌",
      B = "小说",
      C = "骈文",
      D = "戏剧"
    },
    Answer = "C"
  },
  [30048] = {
    ID = 30048,
    Question = "唐朝中央官制中的“三公”分别是司徒,司空和什么? ",
    Option = {
      A = "司马",
      B = "太傅",
      C = "司公",
      D = "太尉 "
    },
    Answer = "D"
  },
  [30049] = {
    ID = 30049,
    Question = "化学元素周期表上第三个元素是什么?",
    Option = {
      A = "氢",
      B = "锂",
      C = "铝",
      D = "氧"
    },
    Answer = "B"
  },
  [30050] = {
    ID = 30050,
    Question = "世界上最深的海沟是什么?",
    Option = {
      A = "克马德克海沟",
      B = "千岛海沟",
      C = "马里亚纳海沟",
      D = "波多黎各海沟"
    },
    Answer = "C"
  },
  [30051] = {
    ID = 30051,
    Question = "唐朝历史上诛杀宦官的时间称作什么? ",
    Option = {
      A = "河阴之变",
      B = "沙苑之变",
      C = "靖康之变",
      D = "甘露之变"
    },
    Answer = "D"
  },
  [30052] = {
    ID = 30052,
    Question = "中国历来封建王朝的经济特征? ",
    Option = {
      A = "重农抑商",
      B = "重商抑农",
      C = "重畜抑商",
      D = "重商抑畜"
    },
    Answer = "A"
  },
  [30053] = {
    ID = 30053,
    Question = "被人们赞美为“沙漠的脊梁”,能忍受荒漠中干旱,多变的恶劣气候的植物是什么?",
    Option = {
      A = "仙人掌",
      B = "胡杨",
      C = "芦荟",
      D = "光棍树"
    },
    Answer = "B"
  },
  [30054] = {
    ID = 30054,
    Question = "杰出的波兰天文学家哥白尼在《天体运行论》中提大胆地提出太阳是太阳系的中心,即是什么学说? ",
    Option = {
      A = "阳心说",
      B = "日心说",
      C = "天心说",
      D = "月心说"
    },
    Answer = "B"
  },
  [30055] = {
    ID = 30055,
    Question = "质量小于什么的恒星是无法形成黑洞的? ",
    Option = {
      A = "海弗里克极限",
      B = "洛希极限",
      C = "暴露极限",
      D = "钱德拉塞卡极限"
    },
    Answer = "D"
  },
  [30056] = {
    ID = 30056,
    Question = "狗咬吕洞宾（猜一歇后语）",
    Option = {
      A = "各显神通",
      B = "有苦说不清",
      C = "没安好心",
      D = "不识好人心"
    },
    Answer = "D"
  },
  [30057] = {
    ID = 30057,
    Question = "唐朝初年,玄奘一共取回了多少经书? ",
    Option = {
      A = "657",
      B = "656",
      C = "655",
      D = "654"
    },
    Answer = "A"
  },
  [30058] = {
    ID = 30058,
    Question = "唐末农民战争从公元多少年开始? ",
    Option = {
      A = "858",
      B = "859",
      C = "857",
      D = "856"
    },
    Answer = "B"
  },
  [30059] = {
    ID = 30059,
    Question = "玄武门之变发生于唐高祖武德哪一年? ",
    Option = {
      A = "8年",
      B = "9年",
      C = "7年",
      D = "6年"
    },
    Answer = "B"
  },
  [30060] = {
    ID = 30060,
    Question = "地核是地球的核心部分,主要由铁和什么元素组成?",
    Option = {
      A = "锂",
      B = "铝",
      C = "氮",
      D = "镍"
    },
    Answer = "D"
  },
  [30061] = {
    ID = 30061,
    Question = "真空中的光速是一个物理常数,等于多少米每秒?",
    Option = {
      A = "299792458",
      B = "29979247",
      C = "29979246",
      D = "29979245"
    },
    Answer = "A"
  },
  [30062] = {
    ID = 30062,
    Question = "黄巾起义在公元哪一年爆发? ",
    Option = {
      A = "184",
      B = "183",
      C = "182",
      D = "181"
    },
    Answer = "A"
  },
  [30063] = {
    ID = 30063,
    Question = "唐朝末年朱温发动的一次诛杀朝官的事件被称为什么? ",
    Option = {
      A = "黑马之祸",
      B = "白马之祸",
      C = "赤马之祸",
      D = "灰马之祸"
    },
    Answer = "B"
  },
  [30064] = {
    ID = 30064,
    Question = "唐朝哪位天文学家在世界上首先测量了子午线的长度? ",
    Option = {
      A = "僧二行",
      B = "僧三行",
      C = "僧一行",
      D = "僧四行"
    },
    Answer = "C"
  },
  [30065] = {
    ID = 30065,
    Question = "唐朝中央官制中的“三省”分别是中书省,尚书省和什么? ",
    Option = {
      A = "门上省",
      B = "门中省",
      C = "门下省",
      D = "门里省"
    },
    Answer = "C"
  },
  [30066] = {
    ID = 30066,
    Question = "空气中的音速,在标准大气压条件下约为多少米每秒?",
    Option = {
      A = "300",
      B = "250",
      C = "400",
      D = "340"
    },
    Answer = "D"
  },
  [30067] = {
    ID = 30067,
    Question = "从寒武纪开始出现大量较高级动物以后至今的地史阶段地质年代的名称是什么?",
    Option = {
      A = "冥古宙",
      B = "显生宙",
      C = "太古宙",
      D = "元古宙"
    },
    Answer = "B"
  },
  [30068] = {
    ID = 30068,
    Question = "与清明节相关的,古代一个非常有名的,现在已经失传的节日是什么? ",
    Option = {
      A = "腊八节",
      B = "建党节",
      C = "儿童节",
      D = "寒食节"
    },
    Answer = "D"
  },
  [30069] = {
    ID = 30069,
    Question = "二十四节气是根据太阳在什么上的位置来划分的? ",
    Option = {
      A = "赤道",
      B = "方位角",
      C = "黄道",
      D = "银纬"
    },
    Answer = "C"
  },
  [30070] = {
    ID = 30070,
    Question = "子曰：“敏而好学,不耻下问”这句文言文中的“下问”是指？",
    Option = {
      A = "以请教别人为耻",
      B = "不应该请教",
      C = "不敢问下去",
      D = "向不如自己的人请教"
    },
    Answer = "D"
  },
  [30071] = {
    ID = 30071,
    Question = "玄奘的梵文名字叫什么? ",
    Option = {
      A = "摩诃耶那提婆奴",
      B = "摩诃耶那老婆奴",
      C = "摩诃爷乸提婆奴",
      D = "摩诃耶那提佛奴"
    },
    Answer = "A"
  },
  [30072] = {
    ID = 30072,
    Question = "成语“凿壁偷光”是出自哪位古代人物的苦学故事? ",
    Option = {
      A = "匡衡",
      B = "司马光",
      C = "李白",
      D = "周瑜"
    },
    Answer = "A"
  },
  [30073] = {
    ID = 30073,
    Question = "诰命发放的对象不同,叫法也不同,封给生者的叫什么? ",
    Option = {
      A = "册封",
      B = "追封",
      C = "解封",
      D = "诰封"
    },
    Answer = "D"
  },
  [30074] = {
    ID = 30074,
    Question = "诰作为王命文书开始于? ",
    Option = {
      A = "西周",
      B = "西汉",
      C = "三国",
      D = "春秋"
    },
    Answer = "A"
  },
  [30075] = {
    ID = 30075,
    Question = "唐朝时皇宫妃嫔在额头贴的梅花等形状的花纹叫什么? ",
    Option = {
      A = "花贴",
      B = "花钿",
      C = "花图",
      D = "花额"
    },
    Answer = "B"
  },
  [30076] = {
    ID = 30076,
    Question = "以下那一曲是唐玄宗亲自谱曲的?",
    Option = {
      A = "霓裳雨衣曲",
      B = "霓裳羽衣曲",
      C = "霓裳羽倚曲",
      D = "霓裳玉衣曲"
    },
    Answer = "B"
  },
  [30077] = {
    ID = 30077,
    Question = "“骊岫飞泉泛暖香,九龙呵护玉莲房,平明每幸长生殿,不从金舆惟寿王”中的寿王是谁? ",
    Option = {
      A = "李亨",
      B = "李瑶",
      C = "李环",
      D = "李瑁"
    },
    Answer = "D"
  },
  [30078] = {
    ID = 30078,
    Question = "“骊岫飞泉泛暖香,九龙呵护玉莲房,平明每幸长生殿,不从金舆惟寿王”中的寿王是谁的儿子? ",
    Option = {
      A = "唐玄宗",
      B = "唐太宗",
      C = "唐高祖",
      D = "唐高宗"
    },
    Answer = "A"
  },
  [30079] = {
    ID = 30079,
    Question = "“骊岫飞泉泛暖香,九龙呵护玉莲房,平明每幸长生殿,不从金舆惟寿王”中的寿王是谁的前夫? ",
    Option = {
      A = "杨玉环",
      B = "西施",
      C = "昭君",
      D = "貂蝉"
    },
    Answer = "A"
  },
  [30080] = {
    ID = 30080,
    Question = "《荷马史诗》分为《奥德赛》和什么两部分?",
    Option = {
      A = "希腊波斯战争史",
      B = "远征记",
      C = "伊利亚特",
      D = "阿格西拉于斯"
    },
    Answer = "C"
  },
  [30081] = {
    ID = 30081,
    Question = "八王之乱中的齐王是谁? ",
    Option = {
      A = "司马冏",
      B = "司马玮",
      C = "司马伦",
      D = "司马越"
    },
    Answer = "A"
  },
  [30082] = {
    ID = 30082,
    Question = "八王之乱中的汝南王是谁? ",
    Option = {
      A = "司马颖",
      B = "司马冏",
      C = "司马伦",
      D = "司马亮"
    },
    Answer = "D"
  },
  [30083] = {
    ID = 30083,
    Question = "八王之乱中的司马颙是什么王? ",
    Option = {
      A = "楚王",
      B = "赵王",
      C = "河间王",
      D = "东海王"
    },
    Answer = "C"
  },
  [30084] = {
    ID = 30084,
    Question = "武则天一生一共谋杀了多少人? ",
    Option = {
      A = "93",
      B = "92",
      C = "91",
      D = "90"
    },
    Answer = "A"
  },
  [30085] = {
    ID = 30085,
    Question = "西晋时期,皇族为了争夺政权发动的动乱被称作? ",
    Option = {
      A = "安史之乱",
      B = "八王之乱",
      C = "七国之乱",
      D = "永嘉之乱"
    },
    Answer = "B"
  },
  [30086] = {
    ID = 30086,
    Question = "“我以天地为栋宇,屋室为裤衣,诸君何为入我裤中?”是谁说的? ",
    Option = {
      A = "刘备",
      B = "刘邦",
      C = "刘伶",
      D = "刘表"
    },
    Answer = "C"
  },
  [30087] = {
    ID = 30087,
    Question = "铁元素的原子序数是多少?",
    Option = {
      A = "46",
      B = "56",
      C = "26",
      D = "36"
    },
    Answer = "C"
  },
  [30088] = {
    ID = 30088,
    Question = "《马可·波罗游记》,是欧洲人撰写的第一部详尽描绘哪个国家的历史,文化和艺术的游记?",
    Option = {
      A = "美国",
      B = "日本",
      C = "中国",
      D = "法国"
    },
    Answer = "C"
  },
  [30089] = {
    ID = 30089,
    Question = "八王之乱中的楚王是谁? ",
    Option = {
      A = "司马玮",
      B = "司马伦",
      C = "司马越",
      D = "司马亮"
    },
    Answer = "A"
  },
  [30090] = {
    ID = 30090,
    Question = "武则天在庭州设置什么来巩固西北边防,打通了一度中断的通向中亚地区的“丝绸之路”? ",
    Option = {
      A = "东庭都护府",
      B = "西庭都护府",
      C = "北庭都护府",
      D = "南庭都护府"
    },
    Answer = "C"
  },
  [30091] = {
    ID = 30091,
    Question = "杜甫的三吏分别是潼安吏,石壕吏,和什么? ",
    Option = {
      A = "信安吏",
      B = "新安吏",
      C = "辛安吏",
      D = "薪安吏"
    },
    Answer = "B"
  },
  [30092] = {
    ID = 30092,
    Question = "释迦牟尼的父亲叫什么? ",
    Option = {
      A = "白饭王",
      B = "悟饭",
      C = "净饭王",
      D = "剩饭王"
    },
    Answer = "C"
  },
  [30093] = {
    ID = 30093,
    Question = "竹林七贤之一的嵇康厌恶官场仕途,当他的朋友山涛向朝廷推荐他做官时,他毅然与之绝交并写了什么以明心智?",
    Option = {
      A = "与山巨源绝交书",
      B = "与山巨原绝交书",
      C = "与山巨渊绝交书",
      D = "与山巨远绝交书"
    },
    Answer = "A"
  },
  [30094] = {
    ID = 30094,
    Question = "火星是太阳系由内往外数的第几颗行星?",
    Option = {
      A = "4",
      B = "5",
      C = "6",
      D = "7"
    },
    Answer = "A"
  },
  [30095] = {
    ID = 30095,
    Question = "编钟最早什么时候出现? ",
    Option = {
      A = "战国",
      B = "春秋",
      C = "三国",
      D = "西周"
    },
    Answer = "D"
  },
  [30096] = {
    ID = 30096,
    Question = "被称为“六朝四大家”的四位画家分别是顾恺之,陆探微,张僧繇和谁? ",
    Option = {
      A = "诸葛瑾",
      B = "陆逊",
      C = "曹不兴",
      D = "周泰"
    },
    Answer = "C"
  },
  [30097] = {
    ID = 30097,
    Question = "铜在化学元素周期表上的原子序数是多少?",
    Option = {
      A = "9",
      B = "19",
      C = "39",
      D = "29"
    },
    Answer = "D"
  },
  [30098] = {
    ID = 30098,
    Question = "唐朝建立于公元多少年?",
    Option = {
      A = "618",
      B = "608",
      C = "628",
      D = "638"
    },
    Answer = "A"
  },
  [30099] = {
    ID = 30099,
    Question = "阿基米德系统并严格的证明了什么定律,为静力学奠定了基础?",
    Option = {
      A = "柯美雅定律",
      B = "杠杆定律",
      C = "达维多夫定律",
      D = "廷克定律"
    },
    Answer = "B"
  },
  [30100] = {
    ID = 30100,
    Question = "古代小说常用“沉鱼落雁,闭月羞花”形容女性之美,其中“闭月”和以下哪位人物有关",
    Option = {
      A = "貂蝉",
      B = "杨玉环",
      C = "西施",
      D = "昭君"
    },
    Answer = "A"
  },
  [30101] = {
    ID = 30101,
    Question = "元素周期表第82个是什么?",
    Option = {
      A = "汞",
      B = "铅",
      C = "镉",
      D = "锌"
    },
    Answer = "B"
  },
  [30102] = {
    ID = 30102,
    Question = "李清照号什么?",
    Option = {
      A = "香山居士",
      B = "朝安居士",
      C = "易安居士",
      D = "清安居士"
    },
    Answer = "C"
  },
  [30103] = {
    ID = 30103,
    Question = "苏门四学士分别指黄庭坚,晁补之,张耒和谁? ",
    Option = {
      A = "陈观",
      B = "李观",
      C = "秦观",
      D = "白观"
    },
    Answer = "C"
  },
  [30104] = {
    ID = 30104,
    Question = "南宋建立于公元多少年?",
    Option = {
      A = "1127",
      B = "1107",
      C = "1137",
      D = "1117"
    },
    Answer = "A"
  },
  [30105] = {
    ID = 30105,
    Question = "戊戌变法是从多少年开始的?",
    Option = {
      A = "1898",
      B = "1890",
      C = "1888",
      D = "1886"
    },
    Answer = "A"
  },
  [30106] = {
    ID = 30106,
    Question = "著名翻译家严复翻译了英国生物学家赫胥黎的什么?",
    Option = {
      A = "美丽新世界",
      B = "天演论",
      C = "天才与女神",
      D = "时间须静止"
    },
    Answer = "B"
  },
  [30107] = {
    ID = 30107,
    Question = "朱元璋为整治贪官而制定的整肃贪污的纲领叫什么?",
    Option = {
      A = "大制",
      B = "大诰",
      C = "大封",
      D = "大压"
    },
    Answer = "B"
  },
  [30108] = {
    ID = 30108,
    Question = "北宋建立于公元多少年? ",
    Option = {
      A = "950",
      B = "960",
      C = "970",
      D = "980"
    },
    Answer = "B"
  },
  [30109] = {
    ID = 30109,
    Question = "八王之乱中的赵王是谁? ",
    Option = {
      A = "司马越",
      B = "司马颖",
      C = "司马伦",
      D = "司马亮"
    },
    Answer = "C"
  },
  [30110] = {
    ID = 30110,
    Question = "诰命发放的对象不同,叫法也不同,封给死者的叫什么? ",
    Option = {
      A = "诰封",
      B = "诰追",
      C = "诰给",
      D = "诰赠"
    },
    Answer = "D"
  },
  [30111] = {
    ID = 30111,
    Question = "古代帝王封禅,郊祀的玉简文书叫什么? ",
    Option = {
      A = "玉蝶",
      B = "玉碟",
      C = "玉谍",
      D = "玉牒"
    },
    Answer = "D"
  },
  [30112] = {
    ID = 30112,
    Question = "李清照是什么词派的代表? ",
    Option = {
      A = "云间派",
      B = "西冷派",
      C = "豪放派",
      D = "婉约派"
    },
    Answer = "D"
  },
  [30113] = {
    ID = 30113,
    Question = "苏轼是什么词派的代表? ",
    Option = {
      A = "豪放派",
      B = "婉约派",
      C = "云间派",
      D = "西冷派"
    },
    Answer = "A"
  },
  [30114] = {
    ID = 30114,
    Question = "中秋一词最早见于我国那部古籍? ",
    Option = {
      A = "春秋",
      B = "周礼",
      C = "论语",
      D = "大学"
    },
    Answer = "B"
  },
  [30115] = {
    ID = 30115,
    Question = "我国北方的长城,开始于战国时期秦国.赵国和什么国?",
    Option = {
      A = "齐国",
      B = "楚国",
      C = "魏国",
      D = "燕国"
    },
    Answer = "D"
  },
  [30116] = {
    ID = 30116,
    Question = "彗星的轨道有三种,分别是椭圆,抛物线和什么?",
    Option = {
      A = "双曲线",
      B = "直线",
      C = "射线",
      D = "单曲线"
    },
    Answer = "A"
  },
  [30117] = {
    ID = 30117,
    Question = "史记,是中国第一部什么体通史? ",
    Option = {
      A = "纪传体",
      B = "编年体",
      C = "国别体",
      D = "纪事本末体"
    },
    Answer = "A"
  },
  [30118] = {
    ID = 30118,
    Question = "资治通鉴,是中国第一部什么体通史? ",
    Option = {
      A = "纪传体",
      B = "编年体",
      C = "国别体",
      D = "纪事本末体"
    },
    Answer = "B"
  },
  [30119] = {
    ID = 30119,
    Question = "由炽热气体组成的,能自己发光的球状或类球状天体叫什么?",
    Option = {
      A = "流星",
      B = "行星",
      C = "卫星",
      D = "恒星"
    },
    Answer = "D"
  },
  [30120] = {
    ID = 30120,
    Question = "太阳最外围的大气叫做什么?",
    Option = {
      A = "日冕",
      B = "光球",
      C = "色球",
      D = "日晷"
    },
    Answer = "A"
  },
  [30121] = {
    ID = 30121,
    Question = "纳兰性德是哪个朝代的著名词人?",
    Option = {
      A = "明朝",
      B = "唐朝",
      C = "清朝",
      D = "秦朝"
    },
    Answer = "C"
  },
  [30122] = {
    ID = 30122,
    Question = "作家茅盾的农村三部曲分别是《春蚕》,《秋收》和什么?",
    Option = {
      A = "残雪",
      B = "残花",
      C = "残冬",
      D = "残菊"
    },
    Answer = "C"
  },
  [30123] = {
    ID = 30123,
    Question = "作家沈德鸿,字雁冰笔名是什么? ",
    Option = {
      A = "老舍",
      B = "鲁迅",
      C = "冰心",
      D = "茅盾"
    },
    Answer = "D"
  },
  [30124] = {
    ID = 30124,
    Question = "化学元素周期表上氧的原子序数是多少?",
    Option = {
      A = "7",
      B = "8",
      C = "9",
      D = "10"
    },
    Answer = "B"
  },
  [30125] = {
    ID = 30125,
    Question = "化学元素周期表上原子序数为20的元素是什么?",
    Option = {
      A = "铁",
      B = "钙",
      C = "铅",
      D = "铬"
    },
    Answer = "B"
  },
  [30126] = {
    ID = 30126,
    Question = "中国现代文坛的巨将李尧棠是“五四”新文化运动以来最有影响的作家之一,笔名是什么?",
    Option = {
      A = "冰心",
      B = "巴金",
      C = "老舍",
      D = "鲁迅"
    },
    Answer = "B"
  },
  [30127] = {
    ID = 30127,
    Question = "陈桥兵变发生在哪一年?",
    Option = {
      A = "940",
      B = "950",
      C = "960",
      D = "970"
    },
    Answer = "C"
  },
  [30128] = {
    ID = 30128,
    Question = "安史之乱发生于多少年?",
    Option = {
      A = "755",
      B = "655",
      C = "555",
      D = "455"
    },
    Answer = "A"
  },
  [30129] = {
    ID = 30129,
    Question = "中华传统医学的鼻祖是谁?",
    Option = {
      A = "华佗",
      B = "李时珍",
      C = "神农",
      D = "扁鹊"
    },
    Answer = "D"
  },
  [30130] = {
    ID = 30130,
    Question = "骆宾王字什么?",
    Option = {
      A = "观光",
      B = "遗山",
      C = "仲弘",
      D = "刚中"
    },
    Answer = "A"
  },
  [30131] = {
    ID = 30131,
    Question = "贺知章晚年号什么?",
    Option = {
      A = "四明狂客",
      B = "五明狂客",
      C = "六明狂客",
      D = "七明狂客"
    },
    Answer = "A"
  },
  [30132] = {
    ID = 30132,
    Question = "诗家夫子王江宁指的是谁?",
    Option = {
      A = "王昌龄",
      B = "王之涣",
      C = "李白",
      D = "杜甫"
    },
    Answer = "A"
  },
  [30133] = {
    ID = 30133,
    Question = "“功盖分三国”下一句是?",
    Option = {
      A = "含笑盈盈自看",
      B = "名成八阵图",
      C = "北上云阁飞除",
      D = "不觉心随断弦"
    },
    Answer = "B"
  },
  [30134] = {
    ID = 30134,
    Question = "“停杯投箸不能食”下一句是什么?",
    Option = {
      A = "无边光景一时新",
      B = "拔剑四顾心茫然",
      C = "轻罗小扇扑流萤",
      D = "夜半钟声到客船"
    },
    Answer = "B"
  },
  [30135] = {
    ID = 30135,
    Question = "“孤舟蓑笠翁”下一句是什么?",
    Option = {
      A = "饮酒那得留残",
      B = "汉月何时更圆",
      C = "独钓寒江雪",
      D = "相思相忆空吟"
    },
    Answer = "C"
  },
  [30136] = {
    ID = 30136,
    Question = "王昌龄字什么? ",
    Option = {
      A = "观光",
      B = "遗山",
      C = "少伯",
      D = "仲弘"
    },
    Answer = "C"
  },
  [30137] = {
    ID = 30137,
    Question = "陈子昂字什么?",
    Option = {
      A = "观光",
      B = "遗山",
      C = "伯玉",
      D = "仲弘"
    },
    Answer = "C"
  },
  [30138] = {
    ID = 30138,
    Question = "张九龄字什么?",
    Option = {
      A = "观光",
      B = "遗山",
      C = "伯玉",
      D = "子寿"
    },
    Answer = "D"
  },
  [30139] = {
    ID = 30139,
    Question = "柳宗元字什么?",
    Option = {
      A = "观光",
      B = "遗山",
      C = "伯玉",
      D = "子厚"
    },
    Answer = "D"
  },
  [30140] = {
    ID = 30140,
    Question = "“主人有酒欢今夕,请奏鸣琴广陵客”中的广陵客本意是指谁? ",
    Option = {
      A = "西施",
      B = "王之涣",
      C = "王昌龄",
      D = "嵇康"
    },
    Answer = "D"
  },
  [30141] = {
    ID = 30141,
    Question = "“春风拂槛露华浓”上一句是什么?",
    Option = {
      A = "茅檐长扫净无苔",
      B = "千里黄云白日曛",
      C = "春风又绿江南岸",
      D = "云想衣裳花想容"
    },
    Answer = "D"
  },
  [30142] = {
    ID = 30142,
    Question = "“我本楚狂人”下一句是什么?",
    Option = {
      A = "花重锦官城",
      B = "大雪满弓刀",
      C = "风雪夜归人",
      D = "凤歌笑孔丘"
    },
    Answer = "D"
  },
  [30143] = {
    ID = 30143,
    Question = "“吴中四士”分别是贺知章,包融,张若虚和谁?",
    Option = {
      A = "张旭",
      B = "张九龄",
      C = "张籍",
      D = "张养浩"
    },
    Answer = "A"
  },
  [30144] = {
    ID = 30144,
    Question = "号称青莲居士的唐朝著名诗人叫什么名字?",
    Option = {
      A = "张籍",
      B = "李白",
      C = "王之涣",
      D = "王昌龄"
    },
    Answer = "B"
  },
  [30145] = {
    ID = 30145,
    Question = "“岱宗夫如何”下一句是什么?",
    Option = {
      A = "花重锦官城",
      B = "弹琴复长啸",
      C = "齐鲁青未了",
      D = "问言谁与餐"
    },
    Answer = "C"
  },
  [30146] = {
    ID = 30146,
    Question = "“初出茅庐”中的“茅庐”本意是指谁的住处? ",
    Option = {
      A = "黄盖",
      B = "司马懿",
      C = "凤雏",
      D = "诸葛亮"
    },
    Answer = "D"
  },
  [30147] = {
    ID = 30147,
    Question = "化学元素周期表第15号元素是什么?",
    Option = {
      A = "碳",
      B = "硼",
      C = "磷",
      D = "硫"
    },
    Answer = "C"
  },
  [30148] = {
    ID = 30148,
    Question = "《齐民要术》的作者是谁?",
    Option = {
      A = "孙武",
      B = "吴起",
      C = "田和",
      D = "贾思勰"
    },
    Answer = "D"
  },
  [30149] = {
    ID = 30149,
    Question = "希波战争是古代波斯帝国为了扩张版图而入侵哪个国家的战争? ",
    Option = {
      A = "罗马",
      B = "雅典",
      C = "古巴",
      D = "希腊"
    },
    Answer = "D"
  },
  [30150] = {
    ID = 30150,
    Question = "世界上最早的一部成文法典叫什么?",
    Option = {
      A = "汉谟拉比法典",
      B = "乌尔纳姆法典",
      C = "成吉思汗法典",
      D = "天盛律令"
    },
    Answer = "B"
  },
  [30151] = {
    ID = 30151,
    Question = "铁木真在公元多少年为大汗,尊称成吉思汗,建立蒙古政权?",
    Option = {
      A = "1215",
      B = "1206",
      C = "1203",
      D = "1223"
    },
    Answer = "B"
  },
  [30152] = {
    ID = 30152,
    Question = "郑成功在公元多少年收复台湾?",
    Option = {
      A = "1654",
      B = "1662",
      C = "1670",
      D = "1645"
    },
    Answer = "B"
  },
  [30153] = {
    ID = 30153,
    Question = "“欲将轻骑逐”下一句是什么?",
    Option = {
      A = "何处得秋霜",
      B = "众鸟高飞尽",
      C = "大雪满弓刀",
      D = "双泪落君前"
    },
    Answer = "C"
  },
  [30154] = {
    ID = 30154,
    Question = "“瀚海阑干百丈冰”下一句是什么?",
    Option = {
      A = "愁云惨淡万里凝",
      B = "惟见长江天际流",
      C = "白云千载空悠悠",
      D = "牧童遥指杏花村"
    },
    Answer = "A"
  },
  [30155] = {
    ID = 30155,
    Question = "“风萧萧兮易水寒,壮士一去兮不复还”是哪位刺客的送别歌?",
    Option = {
      A = "荆轲",
      B = "廉颇",
      C = "赵奢",
      D = "干将"
    },
    Answer = "A"
  },
  [30156] = {
    ID = 30156,
    Question = "围绕太阳运行的第八颗行星是什么?",
    Option = {
      A = "冥王星",
      B = "海王星",
      C = "天狼星",
      D = "猎户星"
    },
    Answer = "B"
  },
  [30157] = {
    ID = 30157,
    Question = "从太阳向外的第7颗行星是什么?",
    Option = {
      A = "冥王星",
      B = "天王星",
      C = "天狼星",
      D = "猎户星"
    },
    Answer = "B"
  },
  [30158] = {
    ID = 30158,
    Question = "《梁甫吟》的作者是谁?",
    Option = {
      A = "王翰",
      B = "杜甫",
      C = "李白",
      D = "王维"
    },
    Answer = "C"
  },
  [30159] = {
    ID = 30159,
    Question = "鲁肃字什么? ",
    Option = {
      A = "之敬",
      B = "知敬",
      C = "至敬",
      D = "子敬"
    },
    Answer = "D"
  },
  [30160] = {
    ID = 30160,
    Question = "“周公吐哺”下一句是什么?",
    Option = {
      A = "悠悠我心",
      B = "忧从中来",
      C = "久住相知",
      D = "天下归心"
    },
    Answer = "D"
  },
  [30161] = {
    ID = 30161,
    Question = "“十年树木,百年树人”是出自谁的名言？",
    Option = {
      A = "孔子",
      B = "老子",
      C = "周恩来",
      D = "管仲"
    },
    Answer = "D"
  },
  [30162] = {
    ID = 30162,
    Question = "春秋时期吴国刺客专诸奉公子光之命要刺杀谁?",
    Option = {
      A = "王僚",
      B = "嬴政",
      C = "赵高",
      D = "蒙恬"
    },
    Answer = "A"
  },
  [30163] = {
    ID = 30163,
    Question = "在曹操父子的推动下形成了以三曹为代表的建安文学,史称什么?",
    Option = {
      A = "建安风骨",
      B = "建安瘦骨",
      C = "建安干骨",
      D = "建安金骨"
    },
    Answer = "A"
  },
  [30164] = {
    ID = 30164,
    Question = "八大行星中最靠近太阳的行星是什么?",
    Option = {
      A = "水星",
      B = "火星",
      C = "木星",
      D = "金星"
    },
    Answer = "A"
  },
  [30165] = {
    ID = 30165,
    Question = "“长安一片月”下一句是什么?",
    Option = {
      A = "披衣觉露滋",
      B = "万户捣衣声",
      C = "胡窥青海湾",
      D = "苍茫云海间"
    },
    Answer = "B"
  },
  [30166] = {
    ID = 30166,
    Question = "“郎骑竹马来”下一句是什么? ",
    Option = {
      A = "风烟望五津",
      B = "还寝梦佳期",
      C = "绕床弄青梅",
      D = "谈笑无还期"
    },
    Answer = "C"
  },
  [30167] = {
    ID = 30167,
    Question = "“壮志饥餐胡虏肉”下一句是什么? ",
    Option = {
      A = "一片孤城万仞山",
      B = "不破楼兰终不还",
      C = "子规声里雨如烟",
      D = "笑谈渴饮匈奴血"
    },
    Answer = "D"
  },
  [30168] = {
    ID = 30168,
    Question = "“愿君多采撷”下一句是什么? ",
    Option = {
      A = "风烟望五津",
      B = "还寝梦佳期",
      C = "绕床弄青梅",
      D = "此物最相思"
    },
    Answer = "D"
  },
  [30169] = {
    ID = 30169,
    Question = "“呼儿将出换美酒”下一句是什么? ",
    Option = {
      A = "霜叶红于二月花",
      B = "二月春风似剪刀",
      C = "一片孤城万仞山",
      D = "与尔同销万古愁"
    },
    Answer = "D"
  },
  [30170] = {
    ID = 30170,
    Question = "八大行星中最靠近地球的行星是什么? ",
    Option = {
      A = "金星",
      B = "木星",
      C = "火星",
      D = "水星"
    },
    Answer = "A"
  },
  [30171] = {
    ID = 30171,
    Question = "“人生无家别,何以为蒸黎！”出自哪首诗? ",
    Option = {
      A = "新婚别",
      B = "垂老别",
      C = "无家别",
      D = "人家别"
    },
    Answer = "C"
  },
  [30172] = {
    ID = 30172,
    Question = "肺部在人体脏腑中位置最高故背称为什么?",
    Option = {
      A = "高盖",
      B = "华盖",
      C = "显盖",
      D = "突盖"
    },
    Answer = "B"
  },
  [30173] = {
    ID = 30173,
    Question = "“仰视百鸟飞,大小必双翔”出自哪首诗?",
    Option = {
      A = "无家别",
      B = "新婚别",
      C = "垂老别",
      D = "庆婚别"
    },
    Answer = "B"
  },
  [30174] = {
    ID = 30174,
    Question = "“老翁逾墙走,老妇出门看”出自那首诗?",
    Option = {
      A = "新安吏",
      B = "石壕吏",
      C = "潼安吏",
      D = "学识吏"
    },
    Answer = "B"
  },
  [30175] = {
    ID = 30175,
    Question = "“翩若惊鸿,婉若游龙婉若游龙”出自哪里? ",
    Option = {
      A = "送应史",
      B = "白马篇",
      C = "洛神赋",
      D = "增白马王彪"
    },
    Answer = "C"
  },
  [30176] = {
    ID = 30176,
    Question = "“吏呼一何怒”下一句是什么? ",
    Option = {
      A = "万户捣衣声",
      B = "胡窥青海湾",
      C = "妇啼一何苦",
      D = "今夕是何年"
    },
    Answer = "C"
  },
  [30177] = {
    ID = 30177,
    Question = "“大城铁不如小城万丈余”出自哪首诗? ",
    Option = {
      A = "新安吏",
      B = "石壕吏",
      C = "学识吏",
      D = "潼关吏"
    },
    Answer = "D"
  },
  [30178] = {
    ID = 30178,
    Question = "“万国尽征戍,烽火被冈峦”出自那首诗?",
    Option = {
      A = "无家别",
      B = "新婚别",
      C = "庆婚别",
      D = "垂老别"
    },
    Answer = "D"
  },
  [30179] = {
    ID = 30179,
    Question = "“似花还似非花”下一句是什么? ",
    Option = {
      A = "在乎山水之间也",
      B = "也无人惜从教坠",
      C = "春风又绿江南岸",
      D = "云想衣裳花想容"
    },
    Answer = "B"
  },
  [30180] = {
    ID = 30180,
    Question = "“丹青不知老将至”下一句是什么? ",
    Option = {
      A = "霜叶红于二月花",
      B = "富贵于我如浮云",
      C = "烟波江上使人愁",
      D = "客舍青青柳色新"
    },
    Answer = "B"
  },
  [30181] = {
    ID = 30181,
    Question = "“夜久语声绝”下一句是什么?",
    Option = {
      A = "大雪满弓刀",
      B = "何似在人间",
      C = "如闻泣幽咽",
      D = "何处得秋霜"
    },
    Answer = "C"
  },
  [30182] = {
    ID = 30182,
    Question = "“君自故乡来”下一句是什么?",
    Option = {
      A = "何处得秋霜",
      B = "何似在人间",
      C = "应知故乡事",
      D = "万户捣衣声"
    },
    Answer = "C"
  },
  [30183] = {
    ID = 30183,
    Question = "最早的压岁钱出现在什么时候?",
    Option = {
      A = "汉代",
      B = "唐代",
      C = "清代",
      D = "明代"
    },
    Answer = "A"
  },
  [30184] = {
    ID = 30184,
    Question = "“百十钱穿彩线长,分来再枕自收藏。商量爆竹谈箫价,添得娇儿一夜忙”的诗名是什么?",
    Option = {
      A = "压岁钱",
      B = "厌胜钱",
      C = "铜钱",
      D = "春钱"
    },
    Answer = "A"
  },
  [30185] = {
    ID = 30185,
    Question = "“燕草如碧丝”下一句是什么?",
    Option = {
      A = "退咏汉女湘娥",
      B = "复道春风不还",
      C = "秦桑低绿枝",
      D = "妇啼一何苦"
    },
    Answer = "C"
  },
  [30186] = {
    ID = 30186,
    Question = "世界上最早发现氧气的是我国唐朝的炼丹家谁?",
    Option = {
      A = "葛洪",
      B = "孙思邈",
      C = "刘安",
      D = "马和"
    },
    Answer = "D"
  },
  [30187] = {
    ID = 30187,
    Question = "“同居长干里”下一句是什么?",
    Option = {
      A = "秦桑低绿枝",
      B = "应知故乡事",
      C = "何似在人间",
      D = "两小无嫌猜"
    },
    Answer = "D"
  },
  [30188] = {
    ID = 30188,
    Question = "古代男子一百岁称为什么? ",
    Option = {
      A = "耄耋",
      B = "期颐",
      C = "弱冠",
      D = "古稀"
    },
    Answer = "B"
  },
  [30189] = {
    ID = 30189,
    Question = "“日暮东风怨啼鸟,落花犹似坠楼人”中的堕楼人是谁? ",
    Option = {
      A = "白珠",
      B = "绿珠",
      C = "黑珠",
      D = "金珠"
    },
    Answer = "B"
  },
  [30190] = {
    ID = 30190,
    Question = "温庭筠字什么? ",
    Option = {
      A = "子瞻",
      B = "幼安",
      C = "子美",
      D = "飞卿"
    },
    Answer = "D"
  },
  [30191] = {
    ID = 30191,
    Question = "刘禹锡字什么?",
    Option = {
      A = "子安",
      B = "子厚",
      C = "梦得",
      D = "乐天"
    },
    Answer = "C"
  },
  [30192] = {
    ID = 30192,
    Question = "谁曾用李白本人的诗句“清水出芙蓉,天然去雕饰”去形容李白的诗? ",
    Option = {
      A = "李调元",
      B = "柳宗元",
      C = "黄庭坚",
      D = "李清照"
    },
    Answer = "A"
  },
  [30193] = {
    ID = 30193,
    Question = "“一把紫竹伞,一场清明的雨,引出西湖边一段爱情”这段话描述的应该是以下哪个民间故事?",
    Option = {
      A = "白蛇传",
      B = "梁山伯与祝英台",
      C = "西厢记",
      D = "红楼梦"
    },
    Answer = "A"
  },
  [30194] = {
    ID = 30194,
    Question = "“且”是文言文里的常用字,“被山愚公者,年且九十”这句话里的“且”的意思是?",
    Option = {
      A = "并且",
      B = "将近",
      C = "超过",
      D = "已经"
    },
    Answer = "B"
  },
  [30195] = {
    ID = 30195,
    Question = "中国“七君子”分别是邹韬奋,李公朴,章乃器,王造时,沈钧儒,沙千里和谁? ",
    Option = {
      A = "徐致靖",
      B = "林旭",
      C = "杨深秀",
      D = "史良"
    },
    Answer = "D"
  },
  [30196] = {
    ID = 30196,
    Question = "中国“七君子”分别是邹韬奋,李公朴,章乃器,王造时,史良, 沙千里和谁?",
    Option = {
      A = "沈钧儒",
      B = "徐致靖",
      C = "林旭",
      D = "杨深秀"
    },
    Answer = "A"
  },
  [30197] = {
    ID = 30197,
    Question = "中国“七君子”分别是邹韬奋,李公朴, 史良,王造时,沈钧儒,沙千里和谁? ",
    Option = {
      A = "章乃器",
      B = "徐致靖",
      C = "林旭",
      D = "杨深秀"
    },
    Answer = "A"
  },
  [30198] = {
    ID = 30198,
    Question = "中国“七君子”分别是邹韬奋,章乃器,史良,王造时,李公朴,沈钧儒和谁? ",
    Option = {
      A = "沙千里",
      B = "林旭",
      C = "徐致靖",
      D = "杨深秀"
    },
    Answer = "A"
  },
  [30199] = {
    ID = 30199,
    Question = "“何时倚虚幌”下一句是什么?",
    Option = {
      A = "死亦为鬼雄",
      B = "双照泪痕干",
      C = "今上岳阳楼",
      D = "还寝梦佳期"
    },
    Answer = "B"
  },
  [30200] = {
    ID = 30200,
    Question = "中国“七君子”分别是邹韬奋,章乃器, 史良,王造时,沈钧儒,沙千里和谁?",
    Option = {
      A = "李公朴",
      B = "徐致靖",
      C = "林旭",
      D = "杨深秀"
    },
    Answer = "A"
  },
  [30201] = {
    ID = 30201,
    Question = "“过春风十里”下一句是什么? ",
    Option = {
      A = "凭轩涕泗流",
      B = "尽荞麦青青",
      C = "今上岳阳楼",
      D = "还寝梦佳期"
    },
    Answer = "B"
  },
  [30202] = {
    ID = 30202,
    Question = "汤圆起源于什么朝代? ",
    Option = {
      A = "唐朝",
      B = "秦朝",
      C = "明朝",
      D = "宋朝"
    },
    Answer = "D"
  },
  [30203] = {
    ID = 30203,
    Question = "相传金华火腿起源于什么朝代?",
    Option = {
      A = "南宋",
      B = "北宋",
      C = "晚唐",
      D = "晚明"
    },
    Answer = "B"
  },
  [30204] = {
    ID = 30204,
    Question = "“停车坐爱枫林晚,霜叶红于二月花”这两句诗的作者是?",
    Option = {
      A = "杜牧",
      B = "李白",
      C = "杜甫",
      D = "白居易"
    },
    Answer = "A"
  },
  [30205] = {
    ID = 30205,
    Question = "竹林七贤之一的嵇康最擅长弹奏的曲子是什么? ",
    Option = {
      A = "十面埋伏",
      B = "梅花三弄",
      C = "汉宫秋月",
      D = "广陵散"
    },
    Answer = "D"
  },
  [30206] = {
    ID = 30206,
    Question = "噪声对人体哪个系统有害?",
    Option = {
      A = "心血管系统",
      B = "消化系统",
      C = "呼吸系统",
      D = "泌尿系统"
    },
    Answer = "A"
  },
  [30207] = {
    ID = 30207,
    Question = "水是生命之源,人体各部位无一不含有水,水占人体重量的?",
    Option = {
      A = "50％以上",
      B = "60％-70％",
      C = "80％以上",
      D = "90％以上"
    },
    Answer = "B"
  },
  [30208] = {
    ID = 30208,
    Question = "能使淀粉变成蓝黑色的是?",
    Option = {
      A = "碘酒",
      B = "酚酞",
      C = "水银",
      D = "松节水"
    },
    Answer = "A"
  },
  [30209] = {
    ID = 30209,
    Question = "奥林匹克运动会的口号是?",
    Option = {
      A = "更快、更高、更强",
      B = "团结、友爱、奋斗",
      C = "努力、加油、夺冠",
      D = "坚强、奋斗、团结"
    },
    Answer = "A"
  },
  [30210] = {
    ID = 30210,
    Question = "以下哪种动物不是软体动物?",
    Option = {
      A = "蜗牛",
      B = "蚬",
      C = "蚯蚓",
      D = "乌贼"
    },
    Answer = "C"
  },
  [30211] = {
    ID = 30211,
    Question = "油菜属于什么科?",
    Option = {
      A = "豆科",
      B = "菊科",
      C = "十字花科",
      D = "蔷薇科"
    },
    Answer = "C"
  },
  [30212] = {
    ID = 30212,
    Question = "植物的根部为什么总是向下生长,主要是由以下那一个主要的因素的影响?",
    Option = {
      A = "光照",
      B = "生长激素",
      C = "重力",
      D = "植物种类"
    },
    Answer = "C"
  },
  [30213] = {
    ID = 30213,
    Question = "为什么我们吃白饭咀嚼的时间久了会产生甜味?请问是由于咀嚼白饭久了产生了何种物质?",
    Option = {
      A = "麦芽糖",
      B = "淀粉",
      C = "蔗糖 ",
      D = "葡萄糖"
    },
    Answer = "A"
  },
  [30214] = {
    ID = 30214,
    Question = "少穿化纤,多穿天然纤维材料的衣服有益于人体健康。下面不属于天然纤维的有?",
    Option = {
      A = "棉麻",
      B = "真丝",
      C = "冰丝",
      D = "天然彩棉 "
    },
    Answer = "C"
  },
  [30215] = {
    ID = 30215,
    Question = "防腐剂过量属于食品污染的哪一种?",
    Option = {
      A = "原料污染",
      B = "保鲜产生的污染",
      C = "制作过程中的污染",
      D = "生物性污染"
    },
    Answer = "B"
  },
  [30216] = {
    ID = 30216,
    Question = "世界上最古老的石拱桥是我国古代的李春建造的什么桥吗?",
    Option = {
      A = "卢沟桥",
      B = "赵州桥",
      C = "猎德大桥",
      D = "喜鹊桥"
    },
    Answer = "B"
  },
  [30217] = {
    ID = 30217,
    Question = "傍晚一阵雨后,出现了美丽的彩虹,彩虹出现在哪边的空中?",
    Option = {
      A = "西边",
      B = "东边",
      C = "南边",
      D = "北边"
    },
    Answer = "B"
  },
  [30218] = {
    ID = 30218,
    Question = "放风筝的线为什么拉不直?",
    Option = {
      A = "风筝线太细",
      B = "风太大",
      C = "风筝线受地球吸引",
      D = "风筝线太粗"
    },
    Answer = "C"
  },
  [30219] = {
    ID = 30219,
    Question = "非洲象的耳朵有什么用途?",
    Option = {
      A = "可扇走身上热气",
      B = "适应在非洲生活",
      C = "可扇走身边昆虫",
      D = "没用途"
    },
    Answer = "A"
  },
  [30220] = {
    ID = 30220,
    Question = "一纳米是一米的?",
    Option = {
      A = "一万分之一",
      B = "十万分之一",
      C = "百万分之一",
      D = "十亿分之一"
    },
    Answer = "D"
  },
  [30221] = {
    ID = 30221,
    Question = "“出师未捷身先死,长使英雄泪满襟”是杜甫的著名诗句,这首诗所怀念的是哪位古人?",
    Option = {
      A = "吕布",
      B = "曹操",
      C = "诸葛亮",
      D = "周瑜"
    },
    Answer = "C"
  },
  [30222] = {
    ID = 30222,
    Question = "在一个温度恒定的室内,你赤脚站在瓷砖上觉得比站在棉花上冷,是因为?",
    Option = {
      A = "棉花温度较高",
      B = "瓷砖导热较快",
      C = "身体的错觉",
      D = "人体温度比瓷砖高"
    },
    Answer = "B"
  },
  [30223] = {
    ID = 30223,
    Question = "为了减轻眼睛疲劳,看电视要保持适当距离,如14寸彩电应保持距离为?",
    Option = {
      A = "1米",
      B = "1.5米",
      C = "2米",
      D = "0.5米"
    },
    Answer = "C"
  },
  [30224] = {
    ID = 30224,
    Question = "白炽灯用久了会发黑是因为?",
    Option = {
      A = "玻璃老化",
      B = "玻璃遇热变色",
      C = "钨丝蒸发 ",
      D = "沾上灰尘"
    },
    Answer = "C"
  },
  [30225] = {
    ID = 30225,
    Question = "世界十大环境污染之首是?",
    Option = {
      A = "垃圾污染",
      B = "大气污染",
      C = "土地荒漠污染",
      D = "废话污染"
    },
    Answer = "B"
  },
  [30226] = {
    ID = 30226,
    Question = "补充哪种维生素有利于儿童骨骼生长?",
    Option = {
      A = "维A",
      B = "维D",
      C = "维E",
      D = "维B"
    },
    Answer = "B"
  },
  [30227] = {
    ID = 30227,
    Question = "“余幼好书,家贫难致”摘自清代学者袁枚的《黄生借书说》,这句话里的\"好书\" 意思是?",
    Option = {
      A = "完整无缺的书",
      B = "完美的书",
      C = "喜欢读书",
      D = "上等的书"
    },
    Answer = "C"
  },
  [30228] = {
    ID = 30228,
    Question = "清洁的空气中含有多少氧?",
    Option = {
      A = "百分之21",
      B = "百分之31",
      C = "百分之41",
      D = "百分之51"
    },
    Answer = "A"
  },
  [30229] = {
    ID = 30229,
    Question = "奥运会上的马拉松比赛的起源与什么有关?",
    Option = {
      A = "游戏",
      B = "战争",
      C = "打赌",
      D = "开玩笑"
    },
    Answer = "B"
  },
  [30230] = {
    ID = 30230,
    Question = "人体血液中的红细胞可存活多少天?",
    Option = {
      A = "800天",
      B = "120天",
      C = "250天",
      D = "520天"
    },
    Answer = "B"
  },
  [30231] = {
    ID = 30231,
    Question = "人类的主要造血器官是?",
    Option = {
      A = "心脏",
      B = "骨髓",
      C = "脊髓",
      D = "大脑"
    },
    Answer = "B"
  },
  [30232] = {
    ID = 30232,
    Question = "不能用闪光灯为婴儿拍照是为了保护婴儿的哪里?",
    Option = {
      A = "视网膜",
      B = "神经系统",
      C = "发根",
      D = "皮肤"
    },
    Answer = "A"
  },
  [30233] = {
    ID = 30233,
    Question = "第一个踏上月球的人是?",
    Option = {
      A = "加加林",
      B = "大卫-布郎",
      C = "阿姆斯特朗",
      D = "麦克尔-安德森"
    },
    Answer = "C"
  },
  [30234] = {
    ID = 30234,
    Question = "我们常说的噪声污染是指?",
    Option = {
      A = "90dB以上",
      B = "80dB以上",
      C = "50dB以上",
      D = "40db以上"
    },
    Answer = "B"
  },
  [30235] = {
    ID = 30235,
    Question = "人们日常通称的“白色污染”是固体废弃物的一种,它是指?",
    Option = {
      A = "废纸",
      B = "废塑料",
      C = "废电池",
      D = "废家电"
    },
    Answer = "B"
  },
  [30236] = {
    ID = 30236,
    Question = "少数民族最多的省份是?",
    Option = {
      A = "宁夏",
      B = "山东",
      C = "云南",
      D = "河南"
    },
    Answer = "C"
  },
  [30237] = {
    ID = 30237,
    Question = "造成地球温暖化的气体中,影响最大的是?",
    Option = {
      A = "二氧化碳",
      B = "一氧化碳",
      C = "氧化亚氮",
      D = "臭氧"
    },
    Answer = "A"
  },
  [30238] = {
    ID = 30238,
    Question = "造成“城市热岛效应”的主要原因是?",
    Option = {
      A = "大气污染",
      B = "水源污染",
      C = "土壤污染",
      D = "废话污染"
    },
    Answer = "A"
  },
  [30239] = {
    ID = 30239,
    Question = "世界上第一条地铁在1863年建于?",
    Option = {
      A = "东京",
      B = "纽约",
      C = "柏林",
      D = "伦敦 "
    },
    Answer = "D"
  },
  [30240] = {
    ID = 30240,
    Question = "“胡人大入塞,丁壮者引弦而战。近塞之人,死者十九”这句话里的“死者十九”意思是?",
    Option = {
      A = "死了十九人",
      B = "死者十九岁",
      C = "每十人就有九人战死",
      D = "死者名叫十九"
    },
    Answer = "C"
  },
  [30241] = {
    ID = 30241,
    Question = "1970年第一次在亚洲哪里举办了世博会?",
    Option = {
      A = "云南",
      B = "冲绳",
      C = "大阪",
      D = "大田"
    },
    Answer = "C"
  },
  [30242] = {
    ID = 30242,
    Question = "火车连续发出两声长鸣,这表示?",
    Option = {
      A = "前进",
      B = "停留",
      C = "倒退",
      D = "故障"
    },
    Answer = "C"
  },
  [30243] = {
    ID = 30243,
    Question = "“新郎官”最早用来指?",
    Option = {
      A = "新科状元",
      B = "新科进士",
      C = "新科秀才",
      D = "新婚男士"
    },
    Answer = "B"
  },
  [30244] = {
    ID = 30244,
    Question = "黄金分割以严格的比例性、艺术性、和谐性,蕴藏着丰富的美学价值,你知道它的比值是多少?",
    Option = {
      A = "0.518",
      B = "0.618",
      C = "0.178",
      D = "0.818"
    },
    Answer = "B"
  },
  [30245] = {
    ID = 30245,
    Question = "酒中含有酒精,饮酒过多或经常饮酒,会造成酒精中毒,使身体受损,那么,饮酒对人体的哪些器官最为有害?   ",
    Option = {
      A = "眼睛",
      B = "皮肤",
      C = "心脏",
      D = "肺"
    },
    Answer = "D"
  },
  [30246] = {
    ID = 30246,
    Question = "苹果中含有增强记忆力的微量元素是?  ",
    Option = {
      A = "铁",
      B = "锌",
      C = "钙",
      D = "碘 "
    },
    Answer = "B"
  },
  [30247] = {
    ID = 30247,
    Question = "吃太多手摇爆米花机爆出的米花会导致?",
    Option = {
      A = "锡中毒",
      B = "铅中毒",
      C = "铬中毒",
      D = "碘中毒 "
    },
    Answer = "B"
  },
  [30248] = {
    ID = 30248,
    Question = "在人的一生中,脑发育的最关键时期是?",
    Option = {
      A = "胎儿期和婴儿期",
      B = "婴儿期和儿童期",
      C = "儿童期和青春期",
      D = "青春期和每星期"
    },
    Answer = "A"
  },
  [30249] = {
    ID = 30249,
    Question = "自然界中,有“智慧元素”之称的是?",
    Option = {
      A = "铁",
      B = "碘",
      C = "钙",
      D = "锌"
    },
    Answer = "B"
  },
  [30250] = {
    ID = 30250,
    Question = "铜器与___不宜长久接触,否则会产生铜绿。用生有铜绿的铜器盛放食品或烹炒菜肴易中毒?",
    Option = {
      A = "酱油",
      B = "花椒面",
      C = "味精",
      D = "醋"
    },
    Answer = "D"
  },
  [30251] = {
    ID = 30251,
    Question = "下列食品中,最易霉变产生黄曲霉素的是?",
    Option = {
      A = "苹果",
      B = "花生",
      C = "猪肉",
      D = "土豆"
    },
    Answer = "B"
  },
  [30252] = {
    ID = 30252,
    Question = "能够做电视机荧光材料的物质是?",
    Option = {
      A = "BaS",
      B = "CuS",
      C = "ZnS",
      D = "CaS"
    },
    Answer = "C"
  },
  [30253] = {
    ID = 30253,
    Question = "以下哪个选项中的糖按比例混合后甜度最高?",
    Option = {
      A = "蔗糖、葡萄糖",
      B = "果糖、葡萄糖",
      C = "果糖、蔗糖",
      D = "果糖、乳糖"
    },
    Answer = "B"
  },
  [30254] = {
    ID = 30254,
    Question = "钢是由什么组成的?",
    Option = {
      A = "铁、铝",
      B = "铁、碳",
      C = "铁、锡",
      D = "铁、铜"
    },
    Answer = "B"
  },
  [30255] = {
    ID = 30255,
    Question = "长期使用铝制品作为食品容器会引发下列哪种疾病?",
    Option = {
      A = "老年痴呆症",
      B = "甲状腺肿大",
      C = "肠胃疾病",
      D = "癌症"
    },
    Answer = "A"
  },
  [30256] = {
    ID = 30256,
    Question = "在“1,3,5,7,9”这几个数字里,质数有几个?",
    Option = {
      A = "三个",
      B = "八个",
      C = "十个",
      D = "一个"
    },
    Answer = "A"
  },
  [30257] = {
    ID = 30257,
    Question = "节能灯是一种绿色照明光源,它与白炽灯相比可节电?",
    Option = {
      A = "10%～20%",
      B = "30%～40%",
      C = "40%～50%",
      D = "70%～80"
    },
    Answer = "D"
  },
  [30258] = {
    ID = 30258,
    Question = "海产鱼类食物中含有较为丰富的无机盐是?",
    Option = {
      A = "钙、镁",
      B = "钙、碘",
      C = "钙、铁",
      D = "铁、碘"
    },
    Answer = "B"
  },
  [30259] = {
    ID = 30259,
    Question = "中华人民共和国国旗五星红旗的设计者是",
    Option = {
      A = "毛泽东",
      B = "周恩来",
      C = "曾联松",
      D = "梁思成"
    },
    Answer = "C"
  },
  [30260] = {
    ID = 30260,
    Question = "在省试里排名多少名之内才有资格参加殿试?",
    Option = {
      A = "30",
      B = "40",
      C = "20",
      D = "35"
    },
    Answer = "D"
  },
  [30261] = {
    ID = 30261,
    Question = "“琴棋书画”中的“棋”指",
    Option = {
      A = "围棋",
      B = "飞行棋",
      C = "斗兽棋",
      D = "象棋"
    },
    Answer = "A"
  },
  [30262] = {
    ID = 30262,
    Question = "已知A+15*B=1,则(16-45*B)-A*3的结果是多少?",
    Option = {
      A = "23",
      B = "33",
      C = "13",
      D = "43"
    },
    Answer = "C"
  },
  [30263] = {
    ID = 30263,
    Question = "假设神天兵的火系法术伤害是1000,对方的火系抗性是30%,那么对方受到多少伤害?",
    Option = {
      A = "700",
      B = "800",
      C = "1000",
      D = "男仙是没有火系法术的"
    },
    Answer = "D"
  },
  [30264] = {
    ID = 30264,
    Question = "假设神天兵的风系法术伤害是1000,对方的火系抗性是30%,那么对方受到多少伤害?",
    Option = {
      A = "700",
      B = "800",
      C = "1000",
      D = "600"
    },
    Answer = "C"
  },
  [30265] = {
    ID = 30265,
    Question = "假美猴王是?",
    Option = {
      A = "通臂猿猴",
      B = "六耳猕猴",
      C = "灵明石猴",
      D = "火爆猴"
    },
    Answer = "B"
  },
  [30266] = {
    ID = 30266,
    Question = "鲤鱼怪是被谁收服的?",
    Option = {
      A = "观音",
      B = "如来",
      C = "弥勒",
      D = "李靖"
    },
    Answer = "A"
  },
  [30267] = {
    ID = 30267,
    Question = "今年小明8岁,小亮14岁,若干年后,当两人年龄加起来是48岁时,小明会是几岁?",
    Option = {
      A = "21",
      B = "11",
      C = "31",
      D = "41"
    },
    Answer = "A"
  },
  [30268] = {
    ID = 30268,
    Question = "南海龙王的姓名是?",
    Option = {
      A = "敖顺",
      B = "敖钦",
      C = "敖润",
      D = "鳌拜"
    },
    Answer = "B"
  },
  [30269] = {
    ID = 30269,
    Question = "唐僧师徒取西经共经历了多少难？?",
    Option = {
      A = "八十难",
      B = "八十一难",
      C = "七十九难",
      D = "六十一难"
    },
    Answer = "B"
  },
  [30270] = {
    ID = 30270,
    Question = "唐玄奘赶走孙悟空几次?",
    Option = {
      A = "2",
      B = "3",
      C = "4",
      D = "5"
    },
    Answer = "B"
  },
  [30271] = {
    ID = 30271,
    Question = "狮驼岭神僧战魔王中有几个魔王?",
    Option = {
      A = "1",
      B = "2",
      C = "3",
      D = "4"
    },
    Answer = "C"
  },
  [30272] = {
    ID = 30272,
    Question = "车迟国的哪个妖怪是被烫死的?",
    Option = {
      A = "虎力大仙",
      B = "羊力大仙",
      C = "鹿力大仙",
      D = "牛力大仙"
    },
    Answer = "B"
  },
  [30273] = {
    ID = 30273,
    Question = "孙悟空三打白骨精的顺序是什么?",
    Option = {
      A = "女孩,老太太,老爷爷",
      B = "老太太,老爷爷,女孩",
      C = "老爷爷,女孩,老太太",
      D = "女孩,老爷爷,老太太"
    },
    Answer = "A"
  },
  [30274] = {
    ID = 30274,
    Question = "《三打白骨精》中,白骨精最后一个变的是什么人?",
    Option = {
      A = "老婆婆",
      B = "老公公",
      C = "村姑",
      D = "白富美"
    },
    Answer = "B"
  },
  [30275] = {
    ID = 30275,
    Question = "盘丝洞里面有多少只蜘蛛精?",
    Option = {
      A = "9",
      B = "5",
      C = "7",
      D = "8"
    },
    Answer = "C"
  },
  [30276] = {
    ID = 30276,
    Question = "孙悟空有几位师傅?",
    Option = {
      A = "3",
      B = "1",
      C = "2",
      D = "4"
    },
    Answer = "C"
  },
  [30277] = {
    ID = 30277,
    Question = "火焰山是怎样形成的?",
    Option = {
      A = "牛魔王夫妇放的火",
      B = "孙悟空打翻炼丹炉造成的",
      C = "天然形成的",
      D = "红孩儿喷火造成的"
    },
    Answer = "B"
  },
  [30278] = {
    ID = 30278,
    Question = "女儿国的女子一般到了多少岁就会喝那条子母河里的水?",
    Option = {
      A = "18",
      B = "20",
      C = "17",
      D = "15"
    },
    Answer = "B"
  },
  [30279] = {
    ID = 30279,
    Question = "天竺国的假公主是由什么精变的?",
    Option = {
      A = "蜘蛛精",
      B = "玉兔精",
      C = "蝎子精",
      D = "狐狸精"
    },
    Answer = "B"
  },
  [30280] = {
    ID = 30280,
    Question = "四大天王使用青锋宝剑的是?",
    Option = {
      A = "广目天王",
      B = "增长天王",
      C = "多闻天王",
      D = "持国天王"
    },
    Answer = "B"
  },
  [30281] = {
    ID = 30281,
    Question = "在阎罗王的生死簿上,孙悟空只能活多少岁?",
    Option = {
      A = "二百五十一岁",
      B = "三百四十二岁",
      C = "四百八十三岁",
      D = "五百七十四岁"
    },
    Answer = "B"
  },
  [30282] = {
    ID = 30282,
    Question = "在《三打白骨精》中,第一次孙悟空打死的是谁?",
    Option = {
      A = "老翁",
      B = "老妇",
      C = "女孩",
      D = "少年"
    },
    Answer = "C"
  },
  [30283] = {
    ID = 30283,
    Question = "紫金铃的第三铃有什么用?",
    Option = {
      A = "喷火",
      B = "冒烟",
      C = "流沙",
      D = "降雨"
    },
    Answer = "C"
  },
  [30284] = {
    ID = 30284,
    Question = "在对付黄眉老妖的时候是谁帮助了孙悟空并收服了黄眉老妖?",
    Option = {
      A = "天兵天将",
      B = "王菩萨",
      C = "弥勒佛",
      D = "二郎神"
    },
    Answer = "C"
  },
  [30285] = {
    ID = 30285,
    Question = "谁的金钹困住了孙悟空?",
    Option = {
      A = "蟒蛇精",
      B = "黄眉怪",
      C = "白骨精",
      D = "青牛精"
    },
    Answer = "B"
  },
  [30286] = {
    ID = 30286,
    Question = "如来佛有真经多少部?",
    Option = {
      A = "三十五部",
      B = "三十六部",
      C = "三十部",
      D = "三十二部"
    },
    Answer = "A"
  },
  [30287] = {
    ID = 30287,
    Question = "黄酒名品\"加饭酒\"的产地在哪?",
    Option = {
      A = "浙江",
      B = "广东",
      C = "广西",
      D = "北京"
    },
    Answer = "A"
  },
  [30288] = {
    ID = 30288,
    Question = "世界最重要的IT高科技产业基地硅谷位于美国的哪个州?",
    Option = {
      A = "明尼苏达州",
      B = "加利弗尼亚州",
      C = "纽约",
      D = "华盛顿州"
    },
    Answer = "B"
  },
  [30289] = {
    ID = 30289,
    Question = "哈雷慧星的最早记录是哪国人留下的?",
    Option = {
      A = "美国人",
      B = "日本人",
      C = "中国人",
      D = "德国人"
    },
    Answer = "C"
  },
  [30290] = {
    ID = 30290,
    Question = "钢是由什么组成的?",
    Option = {
      A = "铁、铝",
      B = "铁、镉",
      C = "铁、锡",
      D = "铁、碳"
    },
    Answer = "D"
  },
  [30291] = {
    ID = 30291,
    Question = "目前人类已知的最软的石头是?",
    Option = {
      A = "滑石",
      B = "花岗岩",
      C = "和田玉",
      D = "金刚石"
    },
    Answer = "A"
  },
  [30292] = {
    ID = 30292,
    Question = "\"芭蕾舞\"是从哪国传进的外来语?",
    Option = {
      A = "美国",
      B = "法国",
      C = "英国",
      D = "德国"
    },
    Answer = "B"
  },
  [30293] = {
    ID = 30293,
    Question = "\"建元\"是我国哪一个皇帝使用的年号?",
    Option = {
      A = "秦始皇",
      B = "光武帝",
      C = "汉武帝",
      D = "高武帝"
    },
    Answer = "C"
  },
  [30294] = {
    ID = 30294,
    Question = "人体中最先衰老的器官是?",
    Option = {
      A = "眼球",
      B = "肾",
      C = "肝",
      D = "胸腺"
    },
    Answer = "D"
  },
  [30295] = {
    ID = 30295,
    Question = "\"冬天到了,春天还会远吗\"语出?",
    Option = {
      A = "雪莱",
      B = "鲁迅",
      C = "老舍",
      D = "李清照"
    },
    Answer = "A"
  },
  [30296] = {
    ID = 30296,
    Question = "下面干果中脂肪含量最高的是?",
    Option = {
      A = "花生仁",
      B = "核桃仁",
      C = "开心果",
      D = "瓜子"
    },
    Answer = "B"
  },
  [30297] = {
    ID = 30297,
    Question = "《史记》中的\"世家\"是给什么人作的传?",
    Option = {
      A = "富商",
      B = "农民",
      C = "诸侯王",
      D = "诗人"
    },
    Answer = "C"
  },
  [30298] = {
    ID = 30298,
    Question = "最早的血压计用于测量谁的血压?",
    Option = {
      A = "人",
      B = "牛",
      C = "羊",
      D = "马"
    },
    Answer = "D"
  },
  [30299] = {
    ID = 30299,
    Question = "美国历史上第一所高等学府是?",
    Option = {
      A = "哈弗大学",
      B = "耶鲁大学",
      C = "剑桥大学",
      D = "北周大学"
    },
    Answer = "A"
  },
  [30300] = {
    ID = 30300,
    Question = "法国作家儒勒？凡尔纳被称为?",
    Option = {
      A = "浪漫小说之父",
      B = "科幻小说之父",
      C = "修真小说之父",
      D = "惊栗小说之父"
    },
    Answer = "B"
  },
  [30301] = {
    ID = 30301,
    Question = "最早的校园歌曲出现在?",
    Option = {
      A = "中国",
      B = "韩国",
      C = "日本",
      D = "法国"
    },
    Answer = "C"
  },
  [30302] = {
    ID = 30302,
    Question = "锅铲、汤勺等炊具的柄用木料制成,是因为木料是热的什么导体？",
    Option = {
      A = "不良导体",
      B = "抗性导体",
      C = "不传感导体",
      D = "冷性导体"
    },
    Answer = "A"
  },
  [30303] = {
    ID = 30303,
    Question = "有麝自然香,何须迎风扬。这是气体的什么现象？",
    Option = {
      A = "分散现象",
      B = "离散现象",
      C = "扩散现象",
      D = "散发现象"
    },
    Answer = "C"
  },
  [30304] = {
    ID = 30304,
    Question = "冬天窗户上结冰花,这是水蒸气的？",
    Option = {
      A = "凝华",
      B = "升华",
      C = "凝结",
      D = "凝固"
    },
    Answer = "A"
  },
  [30305] = {
    ID = 30305,
    Question = "当太阳光经过什么后,会发生色散现象？",
    Option = {
      A = "三棱镜",
      B = "四棱镜",
      C = "五棱镜",
      D = "六棱镜"
    },
    Answer = "A "
  },
  [30306] = {
    ID = 30306,
    Question = "《黄金大劫案》片尾,小东北拉着一车的什么液体去撞银行,溶了黄金？",
    Option = {
      A = "硝酸",
      B = "盐酸",
      C = "碳酸",
      D = "王水"
    },
    Answer = "D"
  },
  [30307] = {
    ID = 30307,
    Question = "闪耀金黄色的黄铁矿又被称为？",
    Option = {
      A = "真黄金",
      B = "琉璃黄金",
      C = "愚人金",
      D = "仿金"
    },
    Answer = "C"
  },
  [30308] = {
    ID = 30308,
    Question = "凸透镜能成像是因为？",
    Option = {
      A = "光的反射",
      B = "光的折射",
      C = "光的散射",
      D = "光的直射"
    },
    Answer = "B"
  },
  [30309] = {
    ID = 30309,
    Question = "在物理学中,振幅属于？",
    Option = {
      A = "矢量",
      B = "标量",
      C = "向量",
      D = "质量"
    },
    Answer = "B"
  },
  [30310] = {
    ID = 30310,
    Question = "欧洲东南部与小亚半岛之间的内陆海是？",
    Option = {
      A = "红海",
      B = "黑海",
      C = "白海",
      D = "地中海"
    },
    Answer = "B"
  },
  [30311] = {
    ID = 30311,
    Question = "如何简单快捷地去掉衣服上的血渍？",
    Option = {
      A = "胡萝卜与盐",
      B = "青瓜与醋",
      C = "小米与盐",
      D = "醋与盐"
    },
    Answer = "A"
  },
  [30312] = {
    ID = 30312,
    Question = "绿豆在铁锅中煮熟后会变成什么颜色",
    Option = {
      A = "深绿色",
      B = "浅绿色",
      C = "白色",
      D = "黑色"
    },
    Answer = "D"
  },
  [30313] = {
    ID = 30313,
    Question = "喝豆浆时,忌不能与什么一起饮用？",
    Option = {
      A = "红糖",
      B = "白糖",
      C = "黄糖",
      D = "冰糖"
    },
    Answer = "A"
  },
  [30314] = {
    ID = 30314,
    Question = "葵花朵朵向太阳,是因为？",
    Option = {
      A = "向水性",
      B = "应激性",
      C = "适应性",
      D = "趋化性"
    },
    Answer = "B"
  },
  [30315] = {
    ID = 30315,
    Question = "鳄鱼的眼泪,是为了排泄体内过多的？",
    Option = {
      A = "水分",
      B = "盐分",
      C = "血液",
      D = "尿液"
    },
    Answer = "B"
  },
  [30316] = {
    ID = 30316,
    Question = "橘生淮南则为橘,生于淮北则为枳,这是什么对生物的影响？",
    Option = {
      A = "地势",
      B = "气候",
      C = "土壤",
      D = "人类活动"
    },
    Answer = "B"
  },
  [30317] = {
    ID = 30317,
    Question = "血液和血管的清洁剂指的是？",
    Option = {
      A = "碱性食物",
      B = "酸性食物",
      C = "中性食物",
      D = "偏糖食物"
    },
    Answer = "A"
  },
  [30318] = {
    ID = 30318,
    Question = "男子剃须时,可用什么代替肥皂？",
    Option = {
      A = "沐浴露",
      B = "洗头水",
      C = "牙膏",
      D = "发胶"
    },
    Answer = "C"
  },
  [30319] = {
    ID = 30319,
    Question = "什么食物是碱性食物？",
    Option = {
      A = "鱼类",
      B = "鸡蛋",
      C = "面粉",
      D = "土豆"
    },
    Answer = "D"
  },
  [30320] = {
    ID = 30320,
    Question = "生态系统简称？",
    Option = {
      A = "CEO",
      B = "ECO",
      C = "OCE ",
      D = "OBE "
    },
    Answer = "B"
  },
  [30321] = {
    ID = 30321,
    Question = "热带雨林没有分布的生物地理界是？",
    Option = {
      A = "北美界",
      B = "澳洲界",
      C = "热带界",
      D = "印度马来亚界"
    },
    Answer = "A"
  },
  [30322] = {
    ID = 30322,
    Question = "无脊椎动物占动物总种类数的百分之多少？",
    Option = {
      A = "80%",
      B = "85%",
      C = "90%",
      D = "95%"
    },
    Answer = "D"
  },
  [30323] = {
    ID = 30323,
    Question = "脊椎动物学包括了？",
    Option = {
      A = "鱼类学",
      B = "原生动物学",
      C = "昆虫学",
      D = "软体动物学"
    },
    Answer = "A"
  },
  [30324] = {
    ID = 30324,
    Question = "社会医学主要研究的人群是？",
    Option = {
      A = "患者人群",
      B = "全体居民",
      C = "社区中疾病群体",
      D = "潜在患者人群"
    },
    Answer = "B"
  },
  [30325] = {
    ID = 30325,
    Question = "一个数字,去掉前面一个数字后,是13。去掉最后一个数字后,是40。这个数字是什么？",
    Option = {
      A = "43",
      B = "134",
      C = "143",
      D = "1340"
    },
    Answer = "A "
  },
  [30326] = {
    ID = 30326,
    Question = "鸡狗四十九,一百条腿地上走,请问有多少条狗？",
    Option = {
      A = "48",
      B = "20",
      C = "15",
      D = "1"
    },
    Answer = "D"
  },
  [30327] = {
    ID = 30327,
    Question = "蝴蝶, 蚂蚁, 蜘蛛, 蜈蚣,他们一起工作,最后哪一个没有领到酬劳?",
    Option = {
      A = "蝴蝶",
      B = "蚂蚁",
      C = "蜘蛛",
      D = "蜈蚣"
    },
    Answer = "D"
  },
  [30328] = {
    ID = 30328,
    Question = "金木水火土,谁的腿长？",
    Option = {
      A = "金",
      B = "木",
      C = "水",
      D = "火"
    },
    Answer = "D"
  }
}
return data_CapticalQuestionLib
