local data_taozhuang_taozhuang = {
[1] ={
     id = 1,
     name = "腾蛟套装",
     member = {1403,1404,1402,1401} ,
     nature1 = {23,24} ,
     num1 = {100,100} ,
     nature2 = {21,22} ,
     num2 = {300,100} ,
     nature3 = {21,22,23,24} ,
     num3 = {750,150,100,100} 
},
[2] ={
     id = 2,
     name = "流火套装",
     member = {1407,1408,1406,1405} ,
     nature1 = {23,24} ,
     num1 = {150,150} ,
     nature2 = {21,22} ,
     num2 = {500,150} ,
     nature3 = {21,22,23,24} ,
     num3 = {1000,200,150,150} 
},
[3] ={
     id = 3,
     name = "寂灭套装",
     member = {1411,1412,1410,1409} ,
     nature1 = {23,24} ,
     num1 = {180,180} ,
     nature2 = {21,22} ,
     num2 = {600,180} ,
     nature3 = {21,22,23,24} ,
     num3 = {1200,240,180,180} 
},
[4] ={
     id = 4,
     name = "天道套装",
     member = {1415,1416,1414,1413} ,
     nature1 = {23,24} ,
     num1 = {300,300} ,
     nature2 = {21,22} ,
     num2 = {1000,300} ,
     nature3 = {21,22,23,24} ,
     num3 = {2000,400,300,300} 
},
[5] ={
     id = 5,
     name = "神月套装",
     member = {1419,1420,1418,1417} ,
     nature1 = {23,24} ,
     num1 = {360,360} ,
     nature2 = {21,22} ,
     num2 = {1200,360} ,
     nature3 = {21,22,23,24} ,
     num3 = {2400,480,360,360} 
}
}
return data_taozhuang_taozhuang
