local data_ui_ui = {
[1] ={
     id = 1,
     cehuabeizhu = "世界BOSS排行榜内容",
     content = "伤害排名前三的玩家会获得高额奖励哟~\n最后击杀烛龙的玩家会额外获得一份\n个人击杀奖励！"
},
[2] ={
     id = 2,
     cehuabeizhu = "充值界面的月卡描述",
     content = "30日每日都可领取60元宝和豪华奖励"
},
[3] ={
     id = 3,
     cehuabeizhu = "夺宝界面的武学碎片描述内容",
     content = "集齐所有碎片可合成武学"
},
[4] ={
     id = 4,
     cehuabeizhu = "帮主禅让提示",
     content = "禅让后帮主之位会自动被副帮主接替，你将成为帮派普通成员"
},
[5] ={
     id = 5,
     cehuabeizhu = "自荐帮主提示",
     content = "帮主离开7天未上线，副帮主和长老可自荐为帮主，等待48小时后帮主依然未上线，则职位最高的自荐者成为帮主，若职位相同，则个人总贡献最高者胜出。是否自荐帮主？"
},
[6] ={
     id = 6,
     cehuabeizhu = "成功开启自荐提示",
     content = "已开启自荐倒计时，48小时内帮主未上线，则成功成为帮主。若有其他成员自荐帮主，则职位最高的自荐者成为帮主，若职位相同，则个人总贡献最高者胜出"
},
[7] ={
     id = 7,
     cehuabeizhu = "退出帮派提示",
     content = "退出帮派后24小时内无法加入帮派和创建帮派，帮派贡献将会保留"
},
[8] ={
     id = 8,
     cehuabeizhu = "青龙堂排行榜内容",
     content = "伤害排名前三的玩家会获得高额奖励哟~\n最后击杀青龙的玩家会额外获得一份\n个人击杀奖励！"
},
[9] ={
     id = 9,
     cehuabeizhu = "押镖说明",
     content = "每天12:00-13:00、19:00-20:00期间押镖，奖励额外增加50%\n每次劫镖成功可获得镖车部分奖励\n每次镖车被劫会损失部分奖励"
},
[10] ={
     id = 10,
     cehuabeizhu = "帮派副本说明",
     content = "1.帮派副本等级越高，开启副本数量越多\n2.通关当前副本，可领取通关奖励并且解锁下一关副本\n3.每天可免费攻击3次已解锁副本，需要大家合力通关\n4.每次战斗结束会获得奖励，伤害越高，奖励越高\n5.每周日24点自动重置副本\n6.副本可战斗时间为周一00:30到周日23:30\n7.伤害排行会统计本周攻击次数和伤害血量，每周日24点清空，重新统计。\n8.20级以上侠客可以参加挑战，每位侠客每天只可挑战一次。主角不受影响"
},
[11] ={
     id = 11,
     cehuabeizhu = "帮派副本伤害排名说明",
     content = "记录本帮成员副本伤害总值,每周清空数据并重新记录\n进入伤害排名记录的玩家可以领取通关奖励"
},
[12] ={
     id = 12,
     cehuabeizhu = "帮派副本参战侠客选择说明",
     content = "20级以上侠客才能参战\n每位侠客每日只能参与1次战斗"
},
[13] ={
     id = 13,
     cehuabeizhu = "青龙堂说明",
     content = "1.升级青龙堂可以提升青龙等级上限\n2.战胜青龙可获得大量银币、贡献和声望\n3.青龙等级越高获得奖励越多\n4.召唤青龙需要消耗500帮派资金"
},
[14] ={
     id = 14,
     cehuabeizhu = "论剑参战侠客选择说哦名",
     content = "20级以上侠客才能参加论剑"
}
}
return data_ui_ui
