local data_message_message = {
[1] ={
     id = 1,
     text = "侠客数量不足",
     remarks = "卡牌强化时，背包中没有可被强化的侠客，点自动添加弹出的提示"
},
[2] ={
     id = 2,
     text = "您的侠客背包已满",
     remarks = "侠客残魂合成时，侠客背包已满，点击合成弹出的提示"
},
[3] ={
     id = 3,
     text = "您的装备背包已满",
},
[4] ={
     id = 4,
     text = "您当前挑战次数已用完",
},
[5] ={
     id = 5,
     text = "您今日购买次数已用完，无法购买",
},
[6] ={
     id = 6,
     text = "您当前挑战次数未用完，无法购买",
},
[7] ={
     id = 7,
     text = "元宝不足",
},
[8] ={
     id = 8,
     text = "银币不足",
},
[9] ={
     id = 9,
     text = "侠客需要达到",
},
[10] ={
     id = 10,
     text = "级才能进阶",
},
[11] ={
     id = 11,
     text = "1、炼化后，所炼化物品将会永久消失。\n2、炼化侠客：可炼化4星、5星未进阶侠客，炼化后返还所有强化花费并获得魂玉。\n3、炼化装备：可炼化2星、3星、4星装备，炼化后返还所有强化花费，并根据洗炼属性返还洗炼石。",
     remarks = "炼化炉说明"
},
[12] ={
     id = 12,
     text = "1、每次重生，需要花费一定元宝，所重生的物品不会消失。\n2、重生侠客：可重生4星、5星，强化等级大于1级的侠客，且重生后返还所有强化、进阶花费，重生后的侠客将恢复进阶等级为0阶，等级为1级。\n3、重生装备：可重生4星、5星，强化等级大于0级的装备，且重生后返还所有强化花费，并根据洗炼属性返还洗炼石，重生后的装备将恢复等级为0级，洗炼属性为0。",
     remarks = "玩家没有放入重生物品、侠客时，点击重生"
},
[13] ={
     id = 13,
     text = "该侠客已加锁，不会出现在炼化列表中",
     remarks = "侠客加锁"
},
[14] ={
     id = 14,
     text = "该侠客已解锁，可以进行炼化",
     remarks = "侠客解锁"
},
[15] ={
     id = 15,
     text = "您没有可更换的装备",
},
[16] ={
     id = 16,
     text = "您没有可替换的真气",
},
[17] ={
     id = 17,
     text = "1.每次抽取都将获得10点活动积分，活动结束后会根据积分排名发放奖励。\n\n2.每次抽取若没有抽到本次限时侠客，有概率获得幸运值，幸运越高，抽取本次限时侠客的概率越高，当幸运大于等于100时，下次招募必得本次限时侠客。\n\n3.每获得150点活动积分将额外获得高额幸运值。\n\n4.每次抽取时若抽到了本次限时侠客，幸运值将清空为0。\n\n5.活动时间内获得积分超过60，可在活动结束发奖时获得奖励经验妹妹*10、银币*200000、进阶丹*500",
     remarks = "限时豪杰说明"
},
[18] ={
     id = 18,
     text = "时间未到，您不能免费抽取",
     remarks = "限时豪杰免费抽取时间未到"
},
[19] ={
     id = 19,
     text = "大侠鸿星高照，下次招募必得",
     remarks = "限时豪杰幸运值100"
},
[20] ={
     id = 20,
     text = "免费抽取次数用完，下次招募需要消耗元宝",
     remarks = "限时豪杰免费抽取用完"
},
[21] ={
     id = 21,
     text = "1.皇宫之中藏有秘宝，玩家每次探宝，随机获得一种奖励物品。每次可以探宝一次或探宝十次。\n2.今日免费次数若当日未使用完，次日不予保留。\n3.活动期间内，每天可获得免费探宝次数。使用探宝十次时，优先扣除免费次数。\n4.每次探宝可获得1积分，每天的积分累积相加。达到活动积分档位可以领取对应的宝箱奖励，每档奖励只能领取1次。\n5.活动结束后活动入口关闭，请及时领取积分奖励。",
     remarks = "皇宫探宝活动说明"
},
[22] ={
     id = 22,
     text = "活动期间内，玩家可用指定兑换材料兑换物品。\n每次刷新时，会刷新指定兑换材料与兑换物品。\n活动结束后，未消耗的兑换材料不会消失。",
     remarks = "限时兑换活动说明"
},
[23] ={
     id = 23,
     text = "1.迷宫中有神秘宝藏，玩家可选择“挖一次”或“全部挖取”来获得宝藏。\n2.系统每日赠送给玩家3次免费挖宝机会。\n3.使用“全部挖取”可获得宝库中所有的宝藏，花费的元宝价格更划算。\n4.当宝库中的所有的宝物都已领取后，可刷新宝库重置宝库中的奖励。",
     remarks = "迷宫挖宝活动说明"
},
[24] ={
     id = 24,
     text = "免费刷新次数用完，下次刷新需要消耗元宝",
     remarks = "限时兑换免费刷新用完"
}
}
return data_message_message
