local data_viplimit_viplimit = {
[1] ={
     id = 1,
     vip = 0,
     limit = {"每日可购买5个1万银币","每日可购买5个经验妹妹","每日可购买5个黄金宝箱","每日可购买5个白银宝箱","每日可购买5个龙凤琉璃樽","每日可购买1个体力丹","每日可购买4个耐力丹","每日神秘商店可元宝刷新10次","神秘商店免费刷新上限为2次","装备强化可提升1-3级","每日可购买精英副本1次","每日可购买行侠仗义1次","每日可购买劫富济贫1次"} 
},
[2] ={
     id = 2,
     vip = 1,
     limit = {"可低折扣购买Vip1大礼包","每日登陆可获得：银币*10000","每日可购买10个1万银币","每日可购买10个经验妹妹","每日可购买10个黄金宝箱","每日可购买10个白银宝箱","每日可购买10个龙凤琉璃樽","每日可购买2个体力丹","每日可购买6个耐力丹","每日神秘商店可元宝刷新15次","神秘商店免费刷新上限为3次","装备强化可提升1-3级","每日可购买精英副本1次","每日可购买行侠仗义1次","每日可购买劫富济贫1次"} 
},
[3] ={
     id = 3,
     vip = 2,
     limit = {"可低折扣购买Vip2大礼包","每日登陆可获得：银币*30000","每日可购买15个1万银币","每日可购买15个经验妹妹","每日可购买15个黄金宝箱","每日可购买15个白银宝箱","每日可购买10个龙凤琉璃樽","每日可购买3个体力丹","每日可购买8个耐力丹","每日神秘商店可元宝刷新20次","神秘商店免费刷新上限为3次","装备强化可提升2-4级","每日可购买精英副本2次","每日可购买行侠仗义1次","每日可购买劫富济贫1次"} 
},
[4] ={
     id = 4,
     vip = 3,
     limit = {"可低折扣购买Vip3大礼包","每日登陆可获得：银币*50000，经验妹妹*1","每日可购买20个1万银币","每日可购买20个经验妹妹","每日可购买20个黄金宝箱","每日可购买20个白银宝箱","每日可购买15个龙凤琉璃樽","每日可购买4个体力丹","每日可购买10个耐力丹","每日神秘商店可元宝刷新25次","神秘商店免费刷新上限为3次","装备强化可提升2-4级","每日可购买精英副本2次","每日可购买行侠仗义2次","每日可购买劫富济贫1次"} 
},
[5] ={
     id = 5,
     vip = 4,
     limit = {"可低折扣购买Vip4大礼包","每日登陆可获得：银币*80000，经验妹妹*1","每日可购买25个1万银币","每日可购买25个经验妹妹","每日可购买25个黄金宝箱","每日可购买25个白银宝箱","每日可购买15个龙凤琉璃樽","每日可购买5个体力丹","每日可购买12个耐力丹","每日神秘商店可元宝刷新30次","神秘商店免费刷新上限为3次","装备强化可提升2-4级","每日可购买精英副本2次","每日可购买行侠仗义2次","每日可购买劫富济贫1次","每日可用元宝重置论剑1次"} 
},
[6] ={
     id = 6,
     vip = 5,
     limit = {"可低折扣购买Vip5大礼包","每日登陆可获得：银币*100000，经验妹妹*2，神秘刷新令*1","每日可购买30个1万银币","每日可购买30个经验妹妹","每日可购买30个黄金宝箱","每日可购买30个白银宝箱","每日可购买20个龙凤琉璃樽","每日可购买6个体力丹","每日可购买14个耐力丹","每日神秘商店可元宝刷新35次","神秘商店免费刷新上限为4次","装备强化可提升2-5级","每日可购买精英副本3次","每日可购买行侠仗义2次","每日可购买劫富济贫1次","每日可用元宝重置论剑1次"} 
},
[7] ={
     id = 7,
     vip = 6,
     limit = {"可低折扣购买Vip6大礼包","每日登陆可获得：银币*120000，经验妹妹*2，神秘刷新令*1","每日可购买40个1万银币","每日可购买35个经验妹妹","每日可购买35个黄金宝箱","每日可购买35个白银宝箱","每日可购买35个龙凤琉璃樽","每日可购买8个体力丹","每日可购买16个耐力丹","每日神秘商店可元宝刷新40次","神秘商店免费刷新上限为4次","装备强化可提升2-5级","每日可购买精英副本3次","每日可购买行侠仗义2次","每日可购买劫富济贫1次","每日可用元宝重置论剑1次"} 
},
[8] ={
     id = 8,
     vip = 7,
     limit = {"可低折扣购买Vip7大礼包","每日登陆可获得：银币*150000，经验妹妹*3，神秘刷新令*1，练气丹*1","每日可购买50个1万银币","每日可购买40个经验妹妹","每日可购买40个黄金宝箱","每日可购买40个白银宝箱","每日可购买25个龙凤琉璃樽","每日可购买10个体力丹","每日可购买18个耐力丹","每日神秘商店可元宝刷新45次","神秘商店免费刷新上限为4次","装备强化可提升2-5级","每日可购买精英副本3次","每日可购买行侠仗义3次","每日可购买劫富济贫1次","每日可用元宝重置论剑1次"} 
},
[9] ={
     id = 9,
     vip = 8,
     limit = {"可低折扣购买Vip8大礼包","每日登陆可获得：银币*200000，经验妹妹*3，神秘刷新令*2，练气丹*1","每日可购买60个1万银币","每日可购买50个经验妹妹","每日可购买45个黄金宝箱","每日可购买45个白银宝箱","每日可购买25个龙凤琉璃樽","每日可购买12个体力丹","每日可购买20个耐力丹","每日神秘商店可元宝刷新50次","神秘商店免费刷新上限为4次","装备强化可提升2-5级","每日可购买精英副本4次","每日可购买行侠仗义3次","每日可购买劫富济贫2次","烛龙殿可自动战斗","每日可用元宝重置论剑1次"} 
},
[10] ={
     id = 10,
     vip = 9,
     limit = {"可低折扣购买Vip9大礼包","每日登陆可获得：银币*250000，经验妹妹*3，神秘刷新令*2，练气丹*1，劫富令*1","每日可购买80个1万银币","每日可购买60个经验妹妹","每日可购买50个黄金宝箱","每日可购买50个白银宝箱","每日可购买30个龙凤琉璃樽","每日可购买14个体力丹","每日可购买22个耐力丹","每日神秘商店可元宝刷新55次","神秘商店免费刷新上限为4次","装备强化可提升3-5级","每日可购买精英副本4次","每日可购买行侠仗义3次","每日可购买劫富济贫2次","烛龙殿可自动战斗","每日可用元宝重置论剑1次","达到40级时未通关的副本可直接跳过战斗"} 
},
[11] ={
     id = 11,
     vip = 10,
     limit = {"可低折扣购买Vip10大礼包","每日登陆可获得：银币*300000，经验妹妹*4，神秘刷新令*2，练气丹*2，劫富令*1","每日可购买100个1万银币","每日可购买80个经验妹妹","每日可购买55个黄金宝箱","每日可购买55个白银宝箱","每日可购买30个龙凤琉璃樽","每日可购买16个体力丹","每日可购买24个耐力丹","每日神秘商店可元宝刷新60次","神秘商店免费刷新上限为4次","装备强化可提升3-5级","每日可购买精英副本4次","每日可购买行侠仗义3次","每日可购买劫富济贫2次","烛龙殿可自动战斗","每日可用元宝重置论剑2次","达到40级时未通关的副本可直接跳过战斗"} 
},
[12] ={
     id = 12,
     vip = 11,
     limit = {"可低折扣购买Vip11大礼包","每日登陆可获得：银币*350000，经验妹妹*4，神秘刷新令*2，练气丹*2，劫富令*1","每日可购买120个1万银币","每日可购买100个经验妹妹","每日可购买60个黄金宝箱","每日可购买60个白银宝箱","每日可购买35个龙凤琉璃樽","每日可购买18个体力丹","每日可购买27个耐力丹","每日神秘商店可元宝刷新65次","神秘商店免费刷新上限为4次","装备强化可提升3-5级","每日可购买精英副本5次","每日可购买行侠仗义4次","每日可购买劫富济贫2次","烛龙殿可自动战斗","每日可用元宝重置论剑2次","达到40级时未通关的副本可直接跳过战斗"} 
},
[13] ={
     id = 13,
     vip = 12,
     limit = {"可低折扣购买Vip12大礼包","每日登陆可获得：银币*400000，经验妹妹*4，神秘刷新令*2，练气丹*2，劫富令*1","每日可购买140个1万银币","每日可购买120个经验妹妹","每日可购买65个黄金宝箱","每日可购买65个白银宝箱","每日可购买40个龙凤琉璃樽","每日可购买20个体力丹","每日可购买30个耐力丹","每日神秘商店可元宝刷新70次","神秘商店免费刷新上限为4次","装备强化可提升3-5级","每日可购买精英副本5次","每日可购买行侠仗义4次","每日可购买劫富济贫2次","烛龙殿可自动战斗","每日可用元宝重置论剑2次","达到40级时未通关的副本可直接跳过战斗"} 
}
}
return data_viplimit_viplimit
