data_error_error = {
[10000] ={
     id = 10000,
     name = "基础数据",
     prompt = "数据库读取失败"
},
[10001] ={
     id = 10001,
     prompt = "数据库没有此记录"
},
[-1] ={
     id = -1,
     name = "system",
     prompt = "系统异常，请重新登录"
},
[1] ={
     id = 1,
     prompt = "参数异常，请重新登录"
},
[-2] ={
     id = -2,
     prompt = "参数错误"
},
[-3] ={
     id = -3,
     prompt = "重复消息"
},
[100000] ={
     id = 100000,
     name = "角色",
     prompt = "此账号已存在"
},
[100001] ={
     id = 100001,
     prompt = "此昵称已存在"
},
[100002] ={
     id = 100002,
     prompt = "创建角色错误"
},
[100003] ={
     id = 100003,
     prompt = "角色不存在"
},
[100004] ={
     id = 100004,
     prompt = "您当前元宝不足"
},
[100005] ={
     id = 100005,
     prompt = "您当前银币不足"
},
[100006] ={
     id = 100006,
     prompt = "耐力不足"
},
[100007] ={
     id = 100007,
     prompt = "体力不足"
},
[100008] ={
     id = 100008,
     prompt = "侠魂不足"
},
[100009] ={
     id = 100009,
     prompt = "声望不足"
},
[100010] ={
     id = 100010,
     prompt = "魂玉不足"
},
[100011] ={
     id = 100011,
     prompt = "重复登录"
},
[100012] ={
     id = 100012,
     prompt = "请重新登录"
},
[100013] ={
     id = 100013,
     prompt = "名字不能使用表情"
},
[100014] ={
     id = 100014,
     prompt = "游戏版本错误，请下载新版本"
},
[100015] ={
     id = 100015,
     prompt = "灵石不足"
},
[100016] ={
     id = 100016,
     prompt = "魅力不足"
},
[110000] ={
     id = 110000,
     prompt = "账户被锁定"
},
[110001] ={
     id = 110001,
     prompt = "账户被禁言"
},
[200000] ={
     id = 200000,
     name = "武将",
     prompt = "侠客不存在"
},
[200001] ={
     id = 200001,
     prompt = "侠客不存在"
},
[200002] ={
     id = 200002,
     prompt = "您没有此侠客"
},
[200003] ={
     id = 200003,
     prompt = "不允许使用上阵的侠客"
},
[200004] ={
     id = 200004,
     prompt = "不允许使用自己的侠客"
},
[200005] ={
     id = 200005,
     prompt = "不允许使用主卡"
},
[200006] ={
     id = 200006,
     prompt = "您当前不可进阶"
},
[200007] ={
     id = 200007,
     prompt = "此侠客进阶数已达上限"
},
[200008] ={
     id = 200008,
     prompt = "进阶所需进阶丹不足"
},
[200009] ={
     id = 200009,
     prompt = "进阶所需武学不足"
},
[200010] ={
     id = 200010,
     prompt = "进阶所需侠客不足"
},
[200011] ={
     id = 200011,
     prompt = "此神通已提升到最大等级"
},
[200012] ={
     id = 200012,
     prompt = "进阶数不足"
},
[200013] ={
     id = 200013,
     prompt = "神通点数不足"
},
[200014] ={
     id = 200014,
     prompt = "传递等级错误"
},
[200015] ={
     id = 200015,
     prompt = "超过最大等级"
},
[200016] ={
     id = 200016,
     prompt = "超过任务等级"
},
[200017] ={
     id = 200017,
     prompt = "侠客背包已满"
},
[200018] ={
     id = 200018,
     prompt = "进阶材料不足"
},
[200019] ={
     id = 200019,
     prompt = "已达到进阶上限"
},
[200020] ={
     id = 200020,
     prompt = "侠客等级不能超过主角等级"
},
[200021] ={
     id = 200021,
     prompt = "请选择强化所需要的侠客"
},
[200022] ={
     id = 200022,
     prompt = "侠魂不足"
},
[200023] ={
     id = 200023,
     prompt = "您还没有选择要出售的侠客"
},
[200024] ={
     id = 200024,
     prompt = "侠客背包空间已达上限"
},
[200025] ={
     id = 200025,
     prompt = "恭喜您已开启5个侠客背包位置"
},
[200027] ={
     id = 200027,
     prompt = "侠客已锁"
},
[200028] ={
     id = 200028,
     prompt = "进阶数不为0不能炼化"
},
[200029] ={
     id = 200029,
     prompt = "等级为1不能重生"
},
[300000] ={
     id = 300000,
     name = "背包",
     prompt = "道具类型错误"
},
[300001] ={
     id = 300001,
     prompt = "您当前道具不足"
},
[300002] ={
     id = 300002,
     prompt = "您当前侠客不足"
},
[300003] ={
     id = 300003,
     prompt = "您当前精元不足"
},
[300004] ={
     id = 300004,
     prompt = "您当前装备不足"
},
[300005] ={
     id = 300005,
     prompt = "您当前武学不足"
},
[300006] ={
     id = 300006,
     prompt = "背包已扩充至最大数，无法扩充"
},
[300007] ={
     id = 300007,
     prompt = "此道具无法出售"
},
[300008] ={
     id = 300008,
     prompt = "道具背包已满"
},
[300009] ={
     id = 300009,
     prompt = "道具背包已满"
},
[300010] ={
     id = 300010,
     prompt = "需要一个黄金宝箱"
},
[300011] ={
     id = 300011,
     prompt = "需要一个黄金钥匙"
},
[300012] ={
     id = 300012,
     prompt = "需要一个白银宝箱"
},
[300013] ={
     id = 300013,
     prompt = "需要一个白银钥匙"
},
[300014] ={
     id = 300014,
     prompt = "需要一个青铜宝箱"
},
[300015] ={
     id = 300015,
     prompt = "需要一个青铜钥匙"
},
[300016] ={
     id = 300016,
     prompt = "精炼所需材料不足"
},
[300017] ={
     id = 300017,
     prompt = "武学背包已满"
},
[300018] ={
     id = 300018,
     prompt = "道具背包空间已达上限"
},
[300019] ={
     id = 300019,
     prompt = "武学背包空间已达上限"
},
[300020] ={
     id = 300020,
     prompt = "恭喜您已开启5个道具背包位置"
},
[300021] ={
     id = 300021,
     prompt = "恭喜您已开启5个武学背包位置"
},
[300022] ={
     id = 300022,
     prompt = "装备背包已满"
},
[300023] ={
     id = 300023,
     prompt = "武学背包已满"
},
[300024] ={
     id = 300024,
     prompt = "真气背包已满"
},
[300025] ={
     id = 300025,
     prompt = "道具背包已满"
},
[300026] ={
     id = 300026,
     prompt = "侠客背包已满"
},
[400000] ={
     id = 400000,
     name = "商城",
     prompt = "购买异常，请重试"
},
[400001] ={
     id = 400001,
     prompt = "今日购买次数已达到上限"
},
[400002] ={
     id = 400002,
     prompt = "购买异常，请重试"
},
[400003] ={
     id = 400003,
     prompt = "此物品不存在"
},
[400004] ={
     id = 400004,
     prompt = "元宝不足"
},
[400005] ={
     id = 400005,
     prompt = "已经达到最大兑换数量"
},
[400006] ={
     id = 400006,
     prompt = "招募令不足"
},
[400007] ={
     id = 400007,
     prompt = "今日购买次数已达到上限"
},
[500000] ={
     id = 500000,
     name = "装备",
     prompt = "此装备不可洗炼"
},
[500001] ={
     id = 500001,
     prompt = "此装备洗炼属性已达最大"
},
[500002] ={
     id = 500002,
     prompt = "装备洗炼次数异常"
},
[500003] ={
     id = 500003,
     prompt = "装备洗炼类型异常"
},
[500004] ={
     id = 500004,
     prompt = "您当前没有可出售的物品"
},
[500005] ={
     id = 500005,
     prompt = "强化等级已达上限"
},
[500006] ={
     id = 500006,
     prompt = "您没有此装备"
},
[500007] ={
     id = 500007,
     prompt = "此装备您当前已使用"
},
[500008] ={
     id = 500008,
     prompt = "装备背包已满"
},
[500009] ={
     id = 500009,
     prompt = "强化等级已达上限"
},
[500010] ={
     id = 500010,
     prompt = "您当前洗炼石不足"
},
[500011] ={
     id = 500011,
     prompt = "您还没有选择要出售的装备"
},
[500012] ={
     id = 500012,
     prompt = "装备背包空间已达上限"
},
[500013] ={
     id = 500013,
     prompt = "洗炼属性已达最大值，不需要再洗炼"
},
[500014] ={
     id = 500014,
     prompt = "恭喜您已开启5个装备背包位置"
},
[500015] ={
     id = 500015,
     prompt = "等级为0不能重生"
},
[600001] ={
     id = 600001,
     name = "阵容",
     prompt = "位置错误"
},
[600002] ={
     id = 600002,
     prompt = "位置错误，主角不可替换"
},
[600003] ={
     id = 600003,
     prompt = "超出可上阵侠客位置"
},
[600004] ={
     id = 600004,
     prompt = "侠客不可卸下"
},
[600005] ={
     id = 600005,
     prompt = "相同侠客不可同时上阵"
},
[600006] ={
     id = 600006,
     prompt = "更换侠客错误"
},
[600007] ={
     id = 600007,
     prompt = "已装备同类型真气"
},
[600008] ={
     id = 600008,
     prompt = "当前没有可更换的装备"
},
[600009] ={
     id = 600009,
     prompt = "当前没有可更换的真气"
},
[700001] ={
     id = 700001,
     name = "副本",
     prompt = "江湖副本未开启"
},
[700002] ={
     id = 700002,
     prompt = "关卡未开启"
},
[700003] ={
     id = 700003,
     prompt = "难度未开启"
},
[700004] ={
     id = 700004,
     prompt = "江湖副本难度错误"
},
[700005] ={
     id = 700005,
     prompt = "剧情值错误"
},
[700006] ={
     id = 700006,
     prompt = "宝箱奖励类型错误"
},
[700007] ={
     id = 700007,
     prompt = "宝箱星数不足"
},
[700008] ={
     id = 700008,
     prompt = "您已领取奖励"
},
[700009] ={
     id = 700009,
     prompt = "连战时间冷却中"
},
[700010] ={
     id = 700010,
     prompt = "连战次数错误"
},
[700011] ={
     id = 700011,
     prompt = "此关卡拥有挑战次数，无需购买"
},
[700012] ={
     id = 700012,
     prompt = "挑战次数异常，请刷新"
},
[800001] ={
     id = 800001,
     name = "精英副本&活动副本",
     prompt = "精英副本进度错误"
},
[800002] ={
     id = 800002,
     prompt = "精英副本不存在"
},
[800003] ={
     id = 800003,
     prompt = "精英副本战斗批次错误"
},
[800004] ={
     id = 800004,
     prompt = "今日挑战次数已用完，请明日再战"
},
[800005] ={
     id = 800005,
     prompt = "活动副本记录不存在"
},
[800006] ={
     id = 800006,
     prompt = "活动副本战斗批次错误"
},
[800007] ={
     id = 800007,
     prompt = "今日挑战次数已用完，请明日再战"
},
[800008] ={
     id = 800008,
     prompt = "今日购买次数已用完，无法再次购买"
},
[800009] ={
     id = 800009,
     prompt = "今日购买次数已用完，无法再次购买"
},
[800010] ={
     id = 800010,
     prompt = "今日攻打行侠仗义次数已用完"
},
[800011] ={
     id = 800011,
     prompt = "今日攻打劫富济贫次数已用完"
},
[800012] ={
     id = 800012,
     prompt = "您当前的挑战次数未用完，无法购买"
},
[800013] ={
     id = 800013,
     prompt = "当前关卡未开启，请通关前置关卡"
},
[900001] ={
     id = 900001,
     name = "竞技场",
     prompt = "不可挑战自己"
},
[900002] ={
     id = 900002,
     prompt = "该物品需要主角达到限制等级才可兑换"
},
[900003] ={
     id = 900003,
     prompt = "该物品兑换数量已用完"
},
[1000001] ={
     id = 1000001,
     name = "夺宝",
     prompt = "材料错误"
},
[1000002] ={
     id = 1000002,
     prompt = "武学已达到最大等级"
},
[1000003] ={
     id = 1000003,
     prompt = "此物品不存在"
},
[1000004] ={
     id = 1000004,
     prompt = "此武学不可出售"
},
[1000005] ={
     id = 1000005,
     prompt = "您没有此武学"
},
[1000006] ={
     id = 1000006,
     prompt = "当前不能夺宝"
},
[1500001] ={
     id = 1500001,
     name = "精彩活动",
     prompt = "活动已结束"
},
[1500002] ={
     id = 1500002,
     prompt = "活动不存在"
},
[1500101] ={
     id = 1500101,
     name = "客栈",
     prompt = "未到免费休息时间"
},
[1500102] ={
     id = 1500102,
     prompt = "您当前已在客栈休息过"
},
[1500201] ={
     id = 1500201,
     name = "猜拳",
     prompt = "当前不能猜拳"
},
[1500202] ={
     id = 1500202,
     prompt = "不可选择位置"
},
[1500203] ={
     id = 1500203,
     prompt = "您当前不可购买"
},
[1500204] ={
     id = 1500204,
     prompt = "配置错误"
},
[1500205] ={
     id = 1500205,
     prompt = "胜利次数超出上限"
},
[1500301] ={
     id = 1500301,
     name = "累积登录",
     prompt = "已经领取过此奖励"
},
[1500302] ={
     id = 1500302,
     prompt = "累积天数未达到"
},
[1500303] ={
     id = 1500303,
     prompt = "可领取的天数没有可领取礼包"
},
[1500401] ={
     id = 1500401,
     name = "月签",
     prompt = "已经领取过此奖励"
},
[1500402] ={
     id = 1500402,
     prompt = "登录天数未累积到可领取的天数"
},
[1500403] ={
     id = 1500403,
     prompt = "可领取天数没有奖励"
},
[1500404] ={
     id = 1500404,
     prompt = "此月份奖励当前不可领取，请刷新界面"
},
[1500501] ={
     id = 1500501,
     name = "热血基金",
     prompt = "已购买热血基金"
},
[1500502] ={
     id = 1500502,
     prompt = "还未购买热血基金"
},
[1500503] ={
     id = 1500503,
     prompt = "等级不足，不能领取"
},
[1500504] ={
     id = 1500504,
     prompt = "已经领取过，不可重复领取"
},
[1500505] ={
     id = 1500505,
     prompt = "您已成功购买热血基金"
},
[1600001] ={
     id = 1600001,
     name = "论剑",
     prompt = "需30级开启，挑战论剑可获得珍稀道具和灵石"
},
[1600002] ={
     id = 1600002,
     prompt = "当前已是最新玩家"
},
[1600003] ={
     id = 1600003,
     prompt = "您当前还有免费重置次数"
},
[1600004] ={
     id = 1600004,
     prompt = "您当前元宝次数已用完"
},
[1600005] ={
     id = 1600005,
     prompt = "元宝数错误"
},
[1600006] ={
     id = 1600006,
     prompt = "您当前元宝不足"
},
[1600007] ={
     id = 1600007,
     prompt = "宝箱奖励顺序错误"
},
[1600008] ={
     id = 1600008,
     prompt = "您当前已领取过奖励"
},
[1600009] ={
     id = 1600009,
     prompt = "请按顺序依次挑战"
},
[1600010] ={
     id = 1600010,
     prompt = "您当前已没有可上阵侠客"
},
[1700001] ={
     id = 1700001,
     name = "聊天",
     prompt = "类型错误"
},
[1200] ={
     id = 1200,
     type = 13,
     prompt = "输入内容不能为空"
},
[1201] ={
     id = 1201,
     type = 13,
     prompt = "输入内容含有非法字符"
},
[1202] ={
     id = 1202,
     prompt = "等级不足，请大侠15级后再来发言"
},
[1800001] ={
     id = 1800001,
     name = "领奖中心",
     prompt = "等级不足"
},
[1800002] ={
     id = 1800002,
     prompt = "领取等级错误"
},
[1800003] ={
     id = 1800003,
     prompt = "此礼包已经领取"
},
[1800004] ={
     id = 1800004,
     prompt = "已经到达领取上限"
},
[1800005] ={
     id = 1800005,
     prompt = "领取奖时间不足"
},
[1800006] ={
     id = 1800006,
     prompt = "领取奖励天数错误"
},
[1900001] ={
     id = 1900001,
     name = "充值",
     prompt = "vip礼包已经领取"
},
[1900002] ={
     id = 1900002,
     prompt = "您未达到可领取的VIP等级，不可领取"
},
[1900003] ={
     id = 1900003,
     prompt = "VIP等级不足"
},
[1900004] ={
     id = 1900004,
     prompt = "重复的请求"
},
[2000001] ={
     id = 2000001,
     name = "月卡",
     prompt = "vip礼包已经领取"
},
[2000002] ={
     id = 2000002,
     prompt = "您尚未购买月卡，请先购买月卡"
},
[1800] ={
     id = 1800,
     type = 19,
     prompt = "月卡剩余天数小于等于3天时，才可以续购"
},
[1801] ={
     id = 1801,
     type = 19,
     prompt = "您当前未购买月卡，购买月卡后可领取当前奖励"
},
[2100001] ={
     id = 2100001,
     name = "名将之路",
     prompt = "侠客id错误"
},
[2100002] ={
     id = 2100002,
     prompt = "此侠客已达到最大好感等级，不可送礼"
},
[2100003] ={
     id = 2100003,
     prompt = "您没有礼物可赠送"
},
[2100004] ={
     id = 2100004,
     prompt = "侠客好感度已满，不再接受礼物"
},
[2200001] ={
     id = 2200001,
     name = "经脉",
     prompt = "类型不存在"
},
[2200002] ={
     id = 2200002,
     prompt = "类型错误"
},
[2200003] ={
     id = 2200003,
     prompt = "等级已达到上限"
},
[2200004] ={
     id = 2200004,
     prompt = "数据异常"
},
[2200005] ={
     id = 2200005,
     prompt = "江湖副本星数不足，通关新关卡可获得更多江湖副本星数"
},
[2200006] ={
     id = 2200006,
     prompt = "经脉不存在 "
},
[2300001] ={
     id = 2300001,
     name = "精元",
     prompt = "此真气当前已是最大等级"
},
[2300002] ={
     id = 2300002,
     prompt = "已经达到当前最大等级"
},
[2300003] ={
     id = 2300003,
     prompt = "id错误"
},
[2300004] ={
     id = 2300004,
     prompt = "练气达到最高级"
},
[2300005] ={
     id = 2300005,
     prompt = "真气角色id错误"
},
[2300006] ={
     id = 2300006,
     prompt = "银币不足"
},
[2300007] ={
     id = 2300007,
     prompt = "元宝不足"
},
[2300008] ={
     id = 2300008,
     prompt = "真气背包空间不足"
},
[2300009] ={
     id = 2300009,
     prompt = "真气已经达到满级，无法升级"
},
[2300010] ={
     id = 2300010,
     prompt = "已经处于三花聚顶阶段"
},
[2300011] ={
     id = 2300011,
     prompt = "真气背包空间不满足练十次"
},
[2400001] ={
     id = 2400001,
     name = "神秘商店",
     prompt = "需30级开启，"
},
[2400002] ={
     id = 2400002,
     prompt = "兑换的物品不存在"
},
[2400003] ={
     id = 2400003,
     prompt = "兑换次数已达上限"
},
[2400004] ={
     id = 2400004,
     prompt = "概率错误"
},
[1500] ={
     id = 1500,
     type = 16,
     prompt = "魂玉不足"
},
[2400005] ={
     id = 2400005,
     type = 17,
     prompt = "元宝刷新次数不足"
},
[2400006] ={
     id = 2400006,
     prompt = "需17级开启，可使用魂玉兑换珍稀物品"
},
[2400007] ={
     id = 2400007,
     prompt = "魂玉数量不足，无法兑换"
},
[2400008] ={
     id = 2400008,
     prompt = "今日刷新次数不足，提高VIP等级可以增加刷新次数"
},
[2400009] ={
     id = 2400009,
     prompt = "元宝不足"
},
[2400010] ={
     id = 2400010,
     prompt = "刷新令数量不足，再次刷新将消耗元宝了哦~"
},
[1301] ={
     id = 1301,
     name = "cdk",
     type = 14,
     prompt = "您输入的礼包码错误"
},
[1302] ={
     id = 1302,
     type = 14,
     prompt = "您输入的礼包码已使用"
},
[1303] ={
     id = 1303,
     type = 14,
     prompt = "请输入礼包兑换码"
},
[1304] ={
     id = 1304,
     prompt = "您已使用过同批次礼包码"
},
[1305] ={
     id = 1305,
     prompt = "礼包码格式有误"
},
[1306] ={
     id = 1306,
     prompt = "礼包码无效"
},
[1307] ={
     id = 1307,
     prompt = "礼包码已使用"
},
[1308] ={
     id = 1308,
     prompt = "礼包码不在有效期内"
},
[1309] ={
     id = 1309,
     prompt = "您已使用过同批次礼包码"
},
[1310] ={
     id = 1310,
     prompt = "服务器忙，请重试"
},
[1311] ={
     id = 1311,
     prompt = "未找到礼包信息"
},
[1400] ={
     id = 1400,
     name = "世界BOSS",
     type = 15,
     prompt = "尚未复活……"
},
[1401] ={
     id = 1401,
     type = 15,
     prompt = "鼓舞成功，伤害加成增加5%"
},
[1402] ={
     id = 1402,
     type = 15,
     prompt = "鼓舞失败"
},
[1403] ={
     id = 1403,
     type = 15,
     prompt = "鼓舞已经达到上限，无法继续鼓舞"
},
[1404] ={
     id = 1404,
     type = 15,
     prompt = "鼓舞倒计时中……"
},
[1405] ={
     id = 1405,
     type = 15,
     prompt = "已经复活，请继续战斗吧"
},
[1406] ={
     id = 1406,
     type = 15,
     prompt = "自动战斗功能VIP8可开启"
},
[1407] ={
     id = 1407,
     type = 15,
     prompt = "您的银币不足"
},
[1600] ={
     id = 1600,
     name = "竞技场兑换",
     type = 17,
     prompt = "该物品需要人物等级达到50级才可以兑换"
},
[1601] ={
     id = 1601,
     type = 17,
     prompt = "声望不足"
},
[1602] ={
     id = 1602,
     type = 17,
     prompt = "元宝不足"
},
[2500001] ={
     id = 2500001,
     prompt = "需14级开启，通过竞技场可获排名"
},
[2500002] ={
     id = 2500002,
     prompt = "声望不足，无法兑换"
},
[2500003] ={
     id = 2500003,
     prompt = "该物品需要人物达到XX级才可兑换"
},
[2500004] ={
     id = 2500004,
     prompt = "已经达到最大兑换数量"
},
[1700] ={
     id = 1700,
     name = "挑战",
     type = 18,
     prompt = "VIP5玩家或等级达到50级可跳过战斗"
},
[2600001] ={
     id = 2600001,
     name = "邮件",
     prompt = "没有更多邮件了"
},
[2600002] ={
     id = 2600002,
     prompt = "等级不足，需10级开启邮件功能"
},
[2700001] ={
     id = 2700001,
     name = "商城礼包",
     prompt = "恭喜您购买成功"
},
[2800001] ={
     id = 2800001,
     name = "真气、宠物、帮派",
     prompt = "暂未开放"
},
[2900001] ={
     id = 2900001,
     name = "帮派",
     prompt = "帮派成员已满，无法申请加入"
},
[2900002] ={
     id = 2900002,
     prompt = "同时最多可向3个帮派发出申请"
},
[2900003] ={
     id = 2900003,
     prompt = "未输入帮派名称！"
},
[2900004] ={
     id = 2900004,
     prompt = "您当前元宝不足！"
},
[2900005] ={
     id = 2900005,
     prompt = "帮派名已存在！"
},
[2900006] ={
     id = 2900006,
     prompt = "帮派名存在非法字符！"
},
[2900007] ={
     id = 2900007,
     prompt = "恭喜您成功创建帮派！"
},
[2900008] ={
     id = 2900008,
     prompt = "你搜索的帮派不存在！"
},
[2900009] ={
     id = 2900009,
     prompt = "请输入要搜索的帮派名称"
},
[2900010] ={
     id = 2900010,
     prompt = "帮不可一日无主，禅让前请先指定一名副帮主"
},
[2900011] ={
     id = 2900011,
     prompt = "帮主没有失踪，无法自荐为帮主"
},
[2900012] ={
     id = 2900012,
     prompt = "等级尚未达到30级，无法领取福利"
},
[2900013] ={
     id = 2900013,
     prompt = "加入帮派尚未达到5天，无法领取福利"
},
[2900014] ={
     id = 2900014,
     prompt = "帮派贡献不足，无法领取福利"
},
[2900015] ={
     id = 2900015,
     prompt = "帮派资金不足，无法开启烧烤大会"
},
[2900016] ={
     id = 2900016,
     prompt = "您需要等待24小时后才可创建帮派或申请加入帮派"
},
[2900017] ={
     id = 2900017,
     prompt = "请求已发送，请等待对方通过！"
},
[2900018] ={
     id = 2900018,
     prompt = "您已向该好友发出过请求，请耐心等待！"
},
[2900019] ={
     id = 2900019,
     prompt = "此成员的好友已满！"
},
[2900020] ={
     id = 2900020,
     prompt = "当前帮派人数已满！"
},
[2900021] ={
     id = 2900021,
     prompt = "此建筑等级已达到上限，无法继续升级"
},
[2900022] ={
     id = 2900022,
     prompt = "银币不足，无法捐献"
},
[2900023] ={
     id = 2900023,
     prompt = "元宝不足，无法捐献"
},
[2900024] ={
     id = 2900024,
     prompt = "加入帮派不足24小时，无法捐献"
},
[2900025] ={
     id = 2900025,
     prompt = "飞贼四处逃窜，正在追捕中……"
},
[2900026] ={
     id = 2900026,
     prompt = "此建筑等级已达到上限，请先提升帮派大殿等级"
},
[2900027] ={
     id = 2900027,
     prompt = "今日可生产次数不足，无法继续生产了"
},
[2900028] ={
     id = 2900028,
     prompt = "帮派资金不足，无法升级帮派商店"
},
[2900029] ={
     id = 2900029,
     prompt = "该商品每人每天只可兑换1次"
},
[2900030] ={
     id = 2900030,
     prompt = "帮派贡献不足"
},
[2900031] ={
     id = 2900031,
     prompt = "帮派商店等级不足，无法兑换"
},
[2900032] ={
     id = 2900032,
     prompt = "帮派资金不足，无法升级帮派作坊"
},
[2900033] ={
     id = 2900033,
     prompt = "帮派资金不足，无法升级帮派大殿"
},
[2900034] ={
     id = 2900034,
     prompt = "帮派资金不足，无法升级青龙堂"
},
[2900035] ={
     id = 2900035,
     prompt = "帮派资金不足，无法开启挑战"
},
[2900036] ={
     id = 2900036,
     prompt = "申请成功，请等待审核"
},
[2900037] ={
     id = 2900037,
     prompt = "该玩家已加入其它帮派"
},
[2900038] ={
     id = 2900038,
     prompt = "没有更多帮派了"
},
[2900039] ={
     id = 2900039,
     prompt = "帮派名不能超过六个字！"
},
[2900040] ={
     id = 2900040,
     prompt = "未输入文字"
},
[2900041] ={
     id = 2900041,
     prompt = "内容存在非法字符"
},
[2900042] ={
     id = 2900042,
     prompt = "文字内容超过最大长度"
},
[2900043] ={
     id = 2900043,
     prompt = "修改成功！"
},
[2900044] ={
     id = 2900044,
     prompt = "此帮派申请人数已满，请试试其他帮派"
},
[2900045] ={
     id = 2900045,
     prompt = "工坊等级不足，无法生产侠魂"
},
[2900046] ={
     id = 2900046,
     prompt = "工坊等级不足，无法生产银币"
},
[2900047] ={
     id = 2900047,
     prompt = "元宝不足，无法加班生产"
},
[2900048] ={
     id = 2900048,
     prompt = "生产尚未结束"
},
[2900049] ={
     id = 2900049,
     prompt = "生产时间未结束"
},
[2900050] ={
     id = 2900050,
     prompt = "元宝不足，无法购买生产次数"
},
[2900051] ={
     id = 2900051,
     prompt = "元宝不足，无法立即结束"
},
[2900052] ={
     id = 2900052,
     prompt = "帮派商店信息错误"
},
[2900053] ={
     id = 2900053,
     prompt = "等级不足，无法加入帮派"
},
[2900054] ={
     id = 2900054,
     prompt = "此玩家已在帮派中"
},
[2900055] ={
     id = 2900055,
     prompt = "已申请过该帮派"
},
[2900056] ={
     id = 2900056,
     prompt = "无此权限"
},
[2900057] ={
     id = 2900057,
     prompt = "此帮派不存在"
},
[2900058] ={
     id = 2900058,
     prompt = "福利已经领取过，无法重复领取"
},
[2900059] ={
     id = 2900059,
     prompt = "职位重复"
},
[2900060] ={
     id = 2900060,
     prompt = "烧烤大会已开启"
},
[2900061] ={
     id = 2900061,
     prompt = "烧烤大会未开启"
},
[2900062] ={
     id = 2900062,
     prompt = "被挑战者不存在"
},
[2900063] ={
     id = 2900063,
     prompt = "此玩家不在帮派中"
},
[2900064] ={
     id = 2900064,
     prompt = "职务重复"
},
[2900065] ={
     id = 2900065,
     prompt = "副帮主已存在"
},
[2900066] ={
     id = 2900066,
     prompt = "长老人数已达上限"
},
[2900067] ={
     id = 2900067,
     prompt = "挑战次数已用完"
},
[2900068] ={
     id = 2900068,
     prompt = "被挑战次数已用完"
},
[2900069] ={
     id = 2900069,
     prompt = "玩家未申请该帮派"
},
[2900070] ={
     id = 2900070,
     prompt = "帮派大殿二级时开启"
},
[2900071] ={
     id = 2900071,
     prompt = "玩家不存在"
},
[2900072] ={
     id = 2900072,
     prompt = "玩家未申请该帮派"
},
[2900073] ={
     id = 2900073,
     prompt = "玩家帮派贡献值错误"
},
[2900074] ={
     id = 2900074,
     prompt = "今日已捐献"
},
[2900075] ={
     id = 2900075,
     prompt = "已取消申请加入该帮派"
},
[2900076] ={
     id = 2900076,
     prompt = "帮派资金不足，无法开启挑战"
},
[2900077] ={
     id = 2900077,
     prompt = "青龙堂等级不足1级，不可开启挑战"
},
[2900078] ={
     id = 2900078,
     prompt = "生产已结束"
},
[2900079] ={
     id = 2900079,
     prompt = "当前可兑换次数不足"
},
[2900080] ={
     id = 2900080,
     prompt = "需要VIP2级"
},
[2900081] ={
     id = 2900081,
     prompt = "帮派今日捐献数量已达上限"
},
[2900082] ={
     id = 2900082,
     prompt = "今日已兑换"
},
[2900083] ={
     id = 2900083,
     prompt = "建筑升级成功！"
},
[2900084] ={
     id = 2900084,
     prompt = "捐献成功！"
},
[2900085] ={
     id = 2900085,
     prompt = "当前可兑换数量不足"
},
[2900086] ={
     id = 2900086,
     prompt = "所兑换的商品不存在"
},
[2900087] ={
     id = 2900087,
     prompt = "此类侠客今日已参战过，不可再次参战"
},
[2900088] ={
     id = 2900088,
     prompt = "侠客必须由主角带领才能进行挑战"
},
[2900089] ={
     id = 2900089,
     prompt = "挑战次数不足，无法挑战"
},
[2900090] ={
     id = 2900090,
     prompt = "奖励领取成功"
},
[2900091] ={
     id = 2900091,
     prompt = "帮派副本未通关，不可领取奖励"
},
[2900092] ={
     id = 2900092,
     prompt = "通关奖励已领取"
},
[2900093] ={
     id = 2900093,
     prompt = "副本暂未开启"
},
[2900094] ={
     id = 2900094,
     prompt = "当前时间不可进入副本"
},
[2900095] ={
     id = 2900095,
     prompt = "已经达到最大上阵人数"
},
[2900096] ={
     id = 2900096,
     prompt = "此侠客已经上阵"
},
[2900097] ={
     id = 2900097,
     prompt = "请选择上阵侠客"
},
[2900098] ={
     id = 2900098,
     prompt = "大侠下手慢了，BOSS已经被别人击杀了"
},
[3000001] ={
     id = 3000001,
     name = "限时豪杰",
     prompt = "时间未到，您不能免费抽取"
},
[3200001] ={
     id = 3200001,
     name = "好友",
     prompt = "不能领取"
},
[3200002] ={
     id = 3200002,
     prompt = "耐力已满，不可领取"
},
[3200003] ={
     id = 3200003,
     prompt = "超出每日领取耐力次数上限"
},
[3200004] ={
     id = 3200004,
     prompt = "自己好友数量已达上限"
},
[3200005] ={
     id = 3200005,
     prompt = "对方好友数量已达上限"
},
[3200006] ={
     id = 3200006,
     prompt = "已经赠送过此好友耐力"
},
[3200007] ={
     id = 3200007,
     prompt = "搜索的玩家现在与您已经是好友了"
},
[3200008] ={
     id = 3200008,
     prompt = "此玩家与您已解除好友关系"
},
[3200009] ={
     id = 3200009,
     prompt = "不能申请自己为好友"
},
[3200010] ={
     id = 3200010,
     prompt = "此玩家好友申请已满，请稍后添加"
},
[3200011] ={
     id = 3200011,
     prompt = "没有可领取的耐力"
},
[3200012] ={
     id = 3200012,
     prompt = "不可赠送，对方还不是您的好友"
},
[3200100] ={
     id = 3200100,
     prompt = "成功赠送对方1点耐力"
},
[3200101] ={
     id = 3200101,
     prompt = "搜索玩家id只能输入数字，请重新输入"
},
[3200102] ={
     id = 3200102,
     prompt = "搜索内容不能少于2个字！"
},
[3200103] ={
     id = 3200103,
     prompt = "输入内容超过30个字，请重新编辑"
},
[3200104] ={
     id = 3200104,
     prompt = "删除好友成功"
},
[3200105] ={
     id = 3200105,
     prompt = "您搜索的玩家不存在！"
},
[3200106] ={
     id = 3200106,
     prompt = "领取耐力成功"
},
[3200107] ={
     id = 3200107,
     prompt = "全部同意添加好友成功"
},
[3200108] ={
     id = 3200108,
     prompt = "全部拒绝添加好友成功"
},
[3200109] ={
     id = 3200109,
     prompt = "申请列表没有玩家"
},
[3200110] ={
     id = 3200110,
     prompt = "添加好友成功"
},
[3200111] ={
     id = 3200111,
     prompt = "拒绝好友成功"
},
[3200112] ={
     id = 3200112,
     prompt = "成功赠送对方1点耐力"
},
[3200113] ={
     id = 3200113,
     prompt = "成功领取所有耐力并回赠"
},
[3200114] ={
     id = 3200114,
     prompt = "成功接受好友申请"
},
[3200115] ={
     id = 3200115,
     prompt = "申请好友成功"
},
[3200116] ={
     id = 3200116,
     prompt = "搜索内容不能超过七个字"
},
[1200001] ={
     id = 1200001,
     name = "任务",
     prompt = "任务定义不存在"
},
[1200002] ={
     id = 1200002,
     prompt = "任务还没有完成"
},
[1200003] ={
     id = 1200003,
     prompt = "奖励已领取"
},
[1200004] ={
     id = 1200004,
     prompt = "添加任务需要等级不足"
},
[1200005] ={
     id = 1200005,
     prompt = "没有对应id积分奖励"
},
[1200006] ={
     id = 1200006,
     prompt = "您当前还没有加入帮派"
},
[3300001] ={
     id = 3300001,
     name = "比武",
     prompt = "等级不足，需30级开放比武功能"
},
[3300002] ={
     id = 3300002,
     prompt = "还有免费次数，无需购买"
},
[3300003] ={
     id = 3300003,
     prompt = "购买次数已经用完"
},
[3300004] ={
     id = 3300004,
     prompt = "不在比武时间内"
},
[3300005] ={
     id = 3300005,
     prompt = "下次刷新时间未到，不能刷新对手"
},
[3300006] ={
     id = 3300006,
     prompt = "没有匹配的玩家"
},
[3300007] ={
     id = 3300007,
     prompt = "挑战次数已经用完"
},
[3300008] ={
     id = 3300008,
     prompt = "超出购买次数"
},
[3300009] ={
     id = 3300009,
     prompt = "你的排名发生变化，请重新挑战"
},
[3300010] ={
     id = 3300010,
     prompt = "等级不足，不能兑换"
},
[3300011] ={
     id = 3300011,
     prompt = "此玩家不是你的对手了"
},
[3300012] ={
     id = 3300012,
     prompt = "此玩家不是你的仇人"
},
[3300013] ={
     id = 3300013,
     prompt = "不能挑战比自己排名低的"
},
[3300014] ={
     id = 3300014,
     prompt = "不能挑战自己"
},
[3300015] ={
     id = 3300015,
     prompt = "仇人分数过低，已受衙门保护，不可复仇"
},
[3400001] ={
     id = 3400001,
     name = "押镖",
     prompt = "刷新时间未到"
},
[3400002] ={
     id = 3400002,
     prompt = "没有压镖中，不能加速押镖"
},
[3400003] ={
     id = 3400003,
     prompt = "压镖进行中"
},
[3400004] ={
     id = 3400004,
     prompt = "今日劫镖数不足"
},
[3400005] ={
     id = 3400005,
     prompt = "这辆被劫镖数达上限，请换一辆镖车"
},
[3400006] ={
     id = 3400006,
     prompt = "今日押镖数达上限"
},
[3400007] ={
     id = 3400007,
     prompt = "来晚啦，此镖车已经押送完毕"
},
[3400008] ={
     id = 3400008,
     prompt = "镖车未押送完毕，不能领奖"
},
[3400009] ={
     id = 3400009,
     prompt = "等级不足，尚未开启押镖系统"
},
[3400010] ={
     id = 3400010,
     prompt = "已经是金色品质镖车了，请开始运镖吧"
},
[1500601] ={
     id = 1500601,
     name = "限时兑换 ",
     prompt = "不可刷新"
},
[1500602] ={
     id = 1500602,
     prompt = "没有兑换数量"
},
[1500701] ={
     id = 1500701,
     name = "皇宫探宝",
     prompt = "需25级开启"
},
[1500702] ={
     id = 1500702,
     prompt = "活动已结束"
},
[1500703] ={
     id = 1500703,
     prompt = "奖励不存在"
},
[1500704] ={
     id = 1500704,
     prompt = "积分不足"
},
[1500705] ={
     id = 1500705,
     prompt = "奖励已领取"
},
[1500706] ={
     id = 1500706,
     prompt = "剩余次数不足"
},
[1500707] ={
     id = 1500707,
     prompt = "参数错误"
},
[1500708] ={
     id = 1500708,
     prompt = "元宝不足"
},
[1500801] ={
     id = 1500801,
     name = "迷宫寻宝",
     prompt = "等级不足"
},
[1500802] ={
     id = 1500802,
     prompt = "剩余挖宝不足"
},
[1500803] ={
     id = 1500803,
     prompt = "宝库中已没有宝物，请刷新宝库"
}
}
