local data_pingbi_pingbi = {
[1] ={
     id = 1,
     words = "屙"
},
[2] ={
     id = 2,
     words = "屄"
},
[3] ={
     id = 3,
     words = "逼"
},
[4] ={
     id = 4,
     words = "屌"
},
[5] ={
     id = 5,
     words = "奸"
},
[6] ={
     id = 6,
     words = "茎"
},
[7] ={
     id = 7,
     words = "尻"
},
[8] ={
     id = 8,
     words = "淫"
},
[9] ={
     id = 9,
     words = "肏"
},
[10] ={
     id = 10,
     words = "插"
},
[11] ={
     id = 11,
     words = "滚"
},
[12] ={
     id = 12,
     words = "屎"
},
[13] ={
     id = 13,
     words = "操"
},
[14] ={
     id = 14,
     words = "鸨"
},
[15] ={
     id = 15,
     words = "婊"
},
[16] ={
     id = 16,
     words = "肛"
},
[17] ={
     id = 17,
     words = "睾"
},
[18] ={
     id = 18,
     words = "妓"
},
[19] ={
     id = 19,
     words = "贱"
},
[20] ={
     id = 20,
     words = "乳"
},
[21] ={
     id = 21,
     words = "骚"
},
[22] ={
     id = 22,
     words = "阿宾"
},
[23] ={
     id = 23,
     words = "阿賓"
},
[24] ={
     id = 24,
     words = "办怔"
},
[25] ={
     id = 25,
     words = "办证"
},
[26] ={
     id = 26,
     words = "辦證"
},
[27] ={
     id = 27,
     words = "冰毒"
},
[28] ={
     id = 28,
     words = "藏獨"
},
[29] ={
     id = 29,
     words = "挫仑"
},
[30] ={
     id = 30,
     words = "代辦"
},
[31] ={
     id = 31,
     words = "代開"
},
[32] ={
     id = 32,
     words = "代考"
},
[33] ={
     id = 33,
     words = "代孕"
},
[34] ={
     id = 34,
     words = "贷办"
},
[35] ={
     id = 35,
     words = "贷开"
},
[36] ={
     id = 36,
     words = "电狗"
},
[37] ={
     id = 37,
     words = "电鸡"
},
[38] ={
     id = 38,
     words = "發票"
},
[39] ={
     id = 39,
     words = "法轮"
},
[40] ={
     id = 40,
     words = "肛交"
},
[41] ={
     id = 41,
     words = "共狗"
},
[42] ={
     id = 42,
     words = "狗粮"
},
[43] ={
     id = 43,
     words = "换妻"
},
[44] ={
     id = 44,
     words = "黄冰"
},
[45] ={
     id = 45,
     words = "疆獨"
},
[46] ={
     id = 46,
     words = "巨乳"
},
[47] ={
     id = 47,
     words = "军刺"
},
[48] ={
     id = 48,
     words = "開碼"
},
[49] ={
     id = 49,
     words = "開票"
},
[50] ={
     id = 50,
     words = "磕彰"
},
[51] ={
     id = 51,
     words = "浪穴"
},
[52] ={
     id = 52,
     words = "猎槍"
},
[53] ={
     id = 53,
     words = "獵槍"
},
[54] ={
     id = 54,
     words = "六死"
},
[55] ={
     id = 55,
     words = "乱奸"
},
[56] ={
     id = 56,
     words = "亂倫"
},
[57] ={
     id = 57,
     words = "轮功"
},
[58] ={
     id = 58,
     words = "麻古"
},
[59] ={
     id = 59,
     words = "迷藥"
},
[60] ={
     id = 60,
     words = "蜜穴"
},
[61] ={
     id = 61,
     words = "内射"
},
[62] ={
     id = 62,
     words = "嫩穴"
},
[63] ={
     id = 63,
     words = "嫩阴"
},
[64] ={
     id = 64,
     words = "浓精"
},
[65] ={
     id = 65,
     words = "女優"
},
[66] ={
     id = 66,
     words = "喷尿"
},
[67] ={
     id = 67,
     words = "嫖鸡"
},
[68] ={
     id = 68,
     words = "气狗"
},
[69] ={
     id = 69,
     words = "气枪"
},
[70] ={
     id = 70,
     words = "汽狗"
},
[71] ={
     id = 71,
     words = "汽枪"
},
[72] ={
     id = 72,
     words = "氣槍"
},
[73] ={
     id = 73,
     words = "铅弹"
},
[74] ={
     id = 74,
     words = "枪模"
},
[75] ={
     id = 75,
     words = "请愿"
},
[76] ={
     id = 76,
     words = "肉洞"
},
[77] ={
     id = 77,
     words = "肉棍"
},
[78] ={
     id = 78,
     words = "乳交"
},
[79] ={
     id = 79,
     words = "三挫"
},
[80] ={
     id = 80,
     words = "三唑"
},
[81] ={
     id = 81,
     words = "骚妇"
},
[82] ={
     id = 82,
     words = "骚浪"
},
[83] ={
     id = 83,
     words = "骚穴"
},
[84] ={
     id = 84,
     words = "骚嘴"
},
[85] ={
     id = 85,
     words = "尸博"
},
[86] ={
     id = 86,
     words = "手狗"
},
[87] ={
     id = 87,
     words = "手槍"
},
[88] ={
     id = 88,
     words = "兽交"
},
[89] ={
     id = 89,
     words = "熟妇"
},
[90] ={
     id = 90,
     words = "特码"
},
[91] ={
     id = 91,
     words = "替考"
},
[92] ={
     id = 92,
     words = "文强"
},
[93] ={
     id = 93,
     words = "瓮安"
},
[94] ={
     id = 94,
     words = "希脏"
},
[95] ={
     id = 95,
     words = "小穴"
},
[96] ={
     id = 96,
     words = "颜射"
},
[97] ={
     id = 97,
     words = "陰唇"
},
[98] ={
     id = 98,
     words = "陰道"
},
[99] ={
     id = 99,
     words = "陰戶"
},
[100] ={
     id = 100,
     words = "淫肉"
},
[101] ={
     id = 101,
     words = "淫兽"
},
[102] ={
     id = 102,
     words = "淫水"
},
[103] ={
     id = 103,
     words = "淫穴"
},
[104] ={
     id = 104,
     words = "咏妓"
},
[105] ={
     id = 105,
     words = "證件"
},
[106] ={
     id = 106,
     words = "助考"
},
[107] ={
     id = 107,
     words = "唑仑"
},
[108] ={
     id = 108,
     words = "朱德"
},
[109] ={
     id = 109,
     words = "林彪"
},
[110] ={
     id = 110,
     words = "陈毅"
},
[111] ={
     id = 111,
     words = "贺龙"
},
[112] ={
     id = 112,
     words = "孙文"
},
[113] ={
     id = 113,
     words = "陈云"
},
[114] ={
     id = 114,
     words = "李鹏"
},
[115] ={
     id = 115,
     words = "罗干"
},
[116] ={
     id = 116,
     words = "黄菊"
},
[117] ={
     id = 117,
     words = "吴仪"
},
[118] ={
     id = 118,
     words = "王刚"
},
[119] ={
     id = 119,
     words = "刘淇"
},
[120] ={
     id = 120,
     words = "连战"
},
[121] ={
     id = 121,
     words = "布什"
},
[122] ={
     id = 122,
     words = "小泉"
},
[123] ={
     id = 123,
     words = "安南"
},
[124] ={
     id = 124,
     words = "普京"
},
[125] ={
     id = 125,
     words = "里根"
},
[126] ={
     id = 126,
     words = "林肯"
},
[127] ={
     id = 127,
     words = "列宁"
},
[128] ={
     id = 128,
     words = "路易"
},
[129] ={
     id = 129,
     words = "劳拉"
},
[130] ={
     id = 130,
     words = "柴玲"
},
[131] ={
     id = 131,
     words = "江青"
},
[132] ={
     id = 132,
     words = "王丹"
},
[133] ={
     id = 133,
     words = "班禅"
},
[134] ={
     id = 134,
     words = "阿扁"
},
[135] ={
     id = 135,
     words = "鲁迅"
},
[136] ={
     id = 136,
     words = "牛顿"
},
[137] ={
     id = 137,
     words = "梵高"
},
[138] ={
     id = 138,
     words = "六四"
},
[139] ={
     id = 139,
     words = "密宗"
},
[140] ={
     id = 140,
     words = "民国"
},
[141] ={
     id = 141,
     words = "民运"
},
[142] ={
     id = 142,
     words = "民主"
},
[143] ={
     id = 143,
     words = "纳粹"
},
[144] ={
     id = 144,
     words = "南蛮"
},
[145] ={
     id = 145,
     words = "起义"
},
[146] ={
     id = 146,
     words = "圣战"
},
[147] ={
     id = 147,
     words = "示威"
},
[148] ={
     id = 148,
     words = "台独"
},
[149] ={
     id = 149,
     words = "台联"
},
[150] ={
     id = 150,
     words = "屠杀"
},
[151] ={
     id = 151,
     words = "新党"
},
[152] ={
     id = 152,
     words = "疆独"
},
[153] ={
     id = 153,
     words = "藏独"
},
[154] ={
     id = 154,
     words = "学潮"
},
[155] ={
     id = 155,
     words = "学运"
},
[156] ={
     id = 156,
     words = "游行"
},
[157] ={
     id = 157,
     words = "圆满"
},
[158] ={
     id = 158,
     words = "造反"
},
[159] ={
     id = 159,
     words = "镇压"
},
[160] ={
     id = 160,
     words = "政变"
},
[161] ={
     id = 161,
     words = "政治"
},
[162] ={
     id = 162,
     words = "中共"
},
[163] ={
     id = 163,
     words = "反党"
},
[164] ={
     id = 164,
     words = "反共"
},
[165] ={
     id = 165,
     words = "政府"
},
[166] ={
     id = 166,
     words = "自焚"
},
[167] ={
     id = 167,
     words = "共党"
},
[168] ={
     id = 168,
     words = "共匪"
},
[169] ={
     id = 169,
     words = "支那"
},
[170] ={
     id = 170,
     words = "氢弹"
},
[171] ={
     id = 171,
     words = "导弹"
},
[172] ={
     id = 172,
     words = "道教"
},
[173] ={
     id = 173,
     words = "多维"
},
[174] ={
     id = 174,
     words = "佛教"
},
[175] ={
     id = 175,
     words = "佛祖"
},
[176] ={
     id = 176,
     words = "如来"
},
[177] ={
     id = 177,
     words = "普贤"
},
[178] ={
     id = 178,
     words = "文殊"
},
[179] ={
     id = 179,
     words = "地藏"
},
[180] ={
     id = 180,
     words = "河殇"
},
[181] ={
     id = 181,
     words = "回教"
},
[182] ={
     id = 182,
     words = "升天"
},
[183] ={
     id = 183,
     words = "圣母"
},
[184] ={
     id = 184,
     words = "耶稣"
},
[185] ={
     id = 185,
     words = "大法"
},
[186] ={
     id = 186,
     words = "风水"
},
[187] ={
     id = 187,
     words = "神汉"
},
[188] ={
     id = 188,
     words = "神婆"
},
[189] ={
     id = 189,
     words = "阎王"
},
[190] ={
     id = 190,
     words = "回回"
},
[191] ={
     id = 191,
     words = "谋杀"
},
[192] ={
     id = 192,
     words = "杀人"
},
[193] ={
     id = 193,
     words = "吸毒"
},
[194] ={
     id = 194,
     words = "贩毒"
},
[195] ={
     id = 195,
     words = "赌博"
},
[196] ={
     id = 196,
     words = "拐卖"
},
[197] ={
     id = 197,
     words = "走私"
},
[198] ={
     id = 198,
     words = "卖淫"
},
[199] ={
     id = 199,
     words = "监狱"
},
[200] ={
     id = 200,
     words = "强奸"
},
[201] ={
     id = 201,
     words = "轮奸"
},
[202] ={
     id = 202,
     words = "抢劫"
},
[203] ={
     id = 203,
     words = "下注"
},
[204] ={
     id = 204,
     words = "押大"
},
[205] ={
     id = 205,
     words = "押小"
},
[206] ={
     id = 206,
     words = "抽头"
},
[207] ={
     id = 207,
     words = "坐庄"
},
[208] ={
     id = 208,
     words = "赌马"
},
[209] ={
     id = 209,
     words = "赌球"
},
[210] ={
     id = 210,
     words = "筹码"
},
[211] ={
     id = 211,
     words = "大麻"
},
[212] ={
     id = 212,
     words = "鸦片"
},
[213] ={
     id = 213,
     words = "罂粟"
},
[214] ={
     id = 214,
     words = "白粉"
},
[215] ={
     id = 215,
     words = "嗑药"
},
[216] ={
     id = 216,
     words = "SM"
},
[217] ={
     id = 217,
     words = "爱滋"
},
[218] ={
     id = 218,
     words = "淋病"
},
[219] ={
     id = 219,
     words = "梅毒"
},
[220] ={
     id = 220,
     words = "爱液"
},
[221] ={
     id = 221,
     words = "吹箫"
},
[222] ={
     id = 222,
     words = "肛门"
},
[223] ={
     id = 223,
     words = "龟头"
},
[224] ={
     id = 224,
     words = "黄色"
},
[225] ={
     id = 225,
     words = "机八"
},
[226] ={
     id = 226,
     words = "机巴"
},
[227] ={
     id = 227,
     words = "鸡八"
},
[228] ={
     id = 228,
     words = "鸡巴"
},
[229] ={
     id = 229,
     words = "机掰"
},
[230] ={
     id = 230,
     words = "鸡叭"
},
[231] ={
     id = 231,
     words = "鸡鸡"
},
[232] ={
     id = 232,
     words = "鸡掰"
},
[233] ={
     id = 233,
     words = "鸡奸"
},
[234] ={
     id = 234,
     words = "妓女"
},
[235] ={
     id = 235,
     words = "精液"
},
[236] ={
     id = 236,
     words = "精子"
},
[237] ={
     id = 237,
     words = "口交"
},
[238] ={
     id = 238,
     words = "滥交"
},
[239] ={
     id = 239,
     words = "乱交"
},
[240] ={
     id = 240,
     words = "屁眼"
},
[241] ={
     id = 241,
     words = "嫖娼"
},
[242] ={
     id = 242,
     words = "情色"
},
[243] ={
     id = 243,
     words = "肉棒"
},
[244] ={
     id = 244,
     words = "乳房"
},
[245] ={
     id = 245,
     words = "乳峰"
},
[246] ={
     id = 246,
     words = "乳头"
},
[247] ={
     id = 247,
     words = "乳晕"
},
[248] ={
     id = 248,
     words = "三陪"
},
[249] ={
     id = 249,
     words = "色情"
},
[250] ={
     id = 250,
     words = "射精"
},
[251] ={
     id = 251,
     words = "手淫"
},
[252] ={
     id = 252,
     words = "伟哥"
},
[253] ={
     id = 253,
     words = "性交"
},
[254] ={
     id = 254,
     words = "性虐"
},
[255] ={
     id = 255,
     words = "性欲"
},
[256] ={
     id = 256,
     words = "阳物"
},
[257] ={
     id = 257,
     words = "阴部"
},
[258] ={
     id = 258,
     words = "阴唇"
},
[259] ={
     id = 259,
     words = "阴道"
},
[260] ={
     id = 260,
     words = "阴蒂"
},
[261] ={
     id = 261,
     words = "阴核"
},
[262] ={
     id = 262,
     words = "阴户"
},
[263] ={
     id = 263,
     words = "阴茎"
},
[264] ={
     id = 264,
     words = "阴门"
},
[265] ={
     id = 265,
     words = "淫秽"
},
[266] ={
     id = 266,
     words = "淫乱"
},
[267] ={
     id = 267,
     words = "淫娃"
},
[268] ={
     id = 268,
     words = "淫液"
},
[269] ={
     id = 269,
     words = "淫汁"
},
[270] ={
     id = 270,
     words = "淫洞"
},
[271] ={
     id = 271,
     words = "做爱"
},
[272] ={
     id = 272,
     words = "梦遗"
},
[273] ={
     id = 273,
     words = "阳痿"
},
[274] ={
     id = 274,
     words = "早泄"
},
[275] ={
     id = 275,
     words = "奸淫"
},
[276] ={
     id = 276,
     words = "sb"
},
[277] ={
     id = 277,
     words = "白痴"
},
[278] ={
     id = 278,
     words = "笨蛋"
},
[279] ={
     id = 279,
     words = "变态"
},
[280] ={
     id = 280,
     words = "婊子"
},
[281] ={
     id = 281,
     words = "操你"
},
[282] ={
     id = 282,
     words = "草你"
},
[283] ={
     id = 283,
     words = "册那"
},
[284] ={
     id = 284,
     words = "侧那"
},
[285] ={
     id = 285,
     words = "测拿"
},
[286] ={
     id = 286,
     words = "蠢猪"
},
[287] ={
     id = 287,
     words = "荡妇"
},
[288] ={
     id = 288,
     words = "发骚"
},
[289] ={
     id = 289,
     words = "废物"
},
[290] ={
     id = 290,
     words = "干妳"
},
[291] ={
     id = 291,
     words = "干你"
},
[292] ={
     id = 292,
     words = "贱货"
},
[293] ={
     id = 293,
     words = "贱人"
},
[294] ={
     id = 294,
     words = "烂人"
},
[295] ={
     id = 295,
     words = "老母"
},
[296] ={
     id = 296,
     words = "老土"
},
[297] ={
     id = 297,
     words = "妈比"
},
[298] ={
     id = 298,
     words = "妈的"
},
[299] ={
     id = 299,
     words = "马的"
},
[300] ={
     id = 300,
     words = "破鞋"
},
[301] ={
     id = 301,
     words = "仆街"
},
[302] ={
     id = 302,
     words = "去死"
},
[303] ={
     id = 303,
     words = "日你"
},
[304] ={
     id = 304,
     words = "骚货"
},
[305] ={
     id = 305,
     words = "傻B"
},
[306] ={
     id = 306,
     words = "傻比"
},
[307] ={
     id = 307,
     words = "傻子"
},
[308] ={
     id = 308,
     words = "上妳"
},
[309] ={
     id = 309,
     words = "上你"
},
[310] ={
     id = 310,
     words = "我操"
},
[311] ={
     id = 311,
     words = "我日"
},
[312] ={
     id = 312,
     words = "猪猡"
},
[313] ={
     id = 313,
     words = "骑你"
},
[314] ={
     id = 314,
     words = "湿了"
},
[315] ={
     id = 315,
     words = "操他"
},
[316] ={
     id = 316,
     words = "操她"
},
[317] ={
     id = 317,
     words = "骑他"
},
[318] ={
     id = 318,
     words = "骑她"
},
[319] ={
     id = 319,
     words = "欠骑"
},
[320] ={
     id = 320,
     words = "干他"
},
[321] ={
     id = 321,
     words = "干她"
},
[322] ={
     id = 322,
     words = "干死"
},
[323] ={
     id = 323,
     words = "干爆"
},
[324] ={
     id = 324,
     words = "干机"
},
[325] ={
     id = 325,
     words = "机叭"
},
[326] ={
     id = 326,
     words = "臭鸡"
},
[327] ={
     id = 327,
     words = "臭机"
},
[328] ={
     id = 328,
     words = "烂鸟"
},
[329] ={
     id = 329,
     words = "览叫"
},
[330] ={
     id = 330,
     words = "阳具"
},
[331] ={
     id = 331,
     words = "肉壶"
},
[332] ={
     id = 332,
     words = "奶子"
},
[333] ={
     id = 333,
     words = "干鸡"
},
[334] ={
     id = 334,
     words = "干入"
},
[335] ={
     id = 335,
     words = "插你"
},
[336] ={
     id = 336,
     words = "爽你"
},
[337] ={
     id = 337,
     words = "干干"
},
[338] ={
     id = 338,
     words = "干X"
},
[339] ={
     id = 339,
     words = "他干"
},
[340] ={
     id = 340,
     words = "干它"
},
[341] ={
     id = 341,
     words = "干牠"
},
[342] ={
     id = 342,
     words = "干您"
},
[343] ={
     id = 343,
     words = "干汝"
},
[344] ={
     id = 344,
     words = "干林"
},
[345] ={
     id = 345,
     words = "操林"
},
[346] ={
     id = 346,
     words = "干尼"
},
[347] ={
     id = 347,
     words = "操尼"
},
[348] ={
     id = 348,
     words = "干勒"
},
[349] ={
     id = 349,
     words = "干我"
},
[350] ={
     id = 350,
     words = "干到"
},
[351] ={
     id = 351,
     words = "干啦"
},
[352] ={
     id = 352,
     words = "干爽"
},
[353] ={
     id = 353,
     words = "欠干"
},
[354] ={
     id = 354,
     words = "狗干"
},
[355] ={
     id = 355,
     words = "我干"
},
[356] ={
     id = 356,
     words = "来干"
},
[357] ={
     id = 357,
     words = "轮干"
},
[358] ={
     id = 358,
     words = "援交"
},
[359] ={
     id = 359,
     words = "奸暴"
},
[360] ={
     id = 360,
     words = "再奸"
},
[361] ={
     id = 361,
     words = "我奸"
},
[362] ={
     id = 362,
     words = "奸你"
},
[363] ={
     id = 363,
     words = "奸他"
},
[364] ={
     id = 364,
     words = "奸她"
},
[365] ={
     id = 365,
     words = "淫湿"
},
[366] ={
     id = 366,
     words = "鸡歪"
},
[367] ={
     id = 367,
     words = "臭西"
},
[368] ={
     id = 368,
     words = "遗精"
},
[369] ={
     id = 369,
     words = "烂逼"
},
[370] ={
     id = 370,
     words = "戳你"
},
[371] ={
     id = 371,
     words = "挨球"
},
[372] ={
     id = 372,
     words = "卖逼"
},
[373] ={
     id = 373,
     words = "日死"
},
[374] ={
     id = 374,
     words = "奶娘"
},
[375] ={
     id = 375,
     words = "他娘"
},
[376] ={
     id = 376,
     words = "她娘"
},
[377] ={
     id = 377,
     words = "骚B"
},
[378] ={
     id = 378,
     words = "逼毛"
},
[379] ={
     id = 379,
     words = "叼你"
},
[380] ={
     id = 380,
     words = "嫩b"
},
[381] ={
     id = 381,
     words = "管理"
},
[382] ={
     id = 382,
     words = "管里"
},
[383] ={
     id = 383,
     words = "官方"
},
[384] ={
     id = 384,
     words = "维护"
},
[385] ={
     id = 385,
     words = "系统"
},
[386] ={
     id = 386,
     words = "盗取"
},
[387] ={
     id = 387,
     words = "审查"
},
[388] ={
     id = 388,
     words = "巡查"
},
[389] ={
     id = 389,
     words = "监督"
},
[390] ={
     id = 390,
     words = "监管"
},
[391] ={
     id = 391,
     words = "GM"
},
[392] ={
     id = 392,
     words = "付款"
},
[393] ={
     id = 393,
     words = "联系"
},
[394] ={
     id = 394,
     words = "元宝"
},
[395] ={
     id = 395,
     words = "黄金"
},
[396] ={
     id = 396,
     words = "支付"
},
[397] ={
     id = 397,
     words = "qq"
},
[398] ={
     id = 398,
     words = "详谈"
},
[399] ={
     id = 399,
     words = "平台"
},
[400] ={
     id = 400,
     words = "运营"
},
[401] ={
     id = 401,
     words = "私服"
},
[402] ={
     id = 402,
     words = "外挂"
},
[403] ={
     id = 403,
     words = "布朗"
},
[404] ={
     id = 404,
     words = "开房"
},
[405] ={
     id = 405,
     words = "藏青"
},
[406] ={
     id = 406,
     words = "藏复"
},
[407] ={
     id = 407,
     words = "美国"
},
[408] ={
     id = 408,
     words = "法国"
},
[409] ={
     id = 409,
     words = "煞笔"
},
[410] ={
     id = 410,
     words = "UR"
},
[411] ={
     id = 411,
     words = "他妈"
},
[412] ={
     id = 412,
     words = "她妈"
},
[413] ={
     id = 413,
     words = "牛逼"
},
[414] ={
     id = 414,
     words = "傻逼"
},
[415] ={
     id = 415,
     words = "混沌"
},
[416] ={
     id = 416,
     words = "你妈"
},
[417] ={
     id = 417,
     words = "装逼"
},
[418] ={
     id = 418,
     words = "装B"
},
[419] ={
     id = 419,
     words = "删号"
},
[420] ={
     id = 420,
     words = "卖号"
},
[421] ={
     id = 421,
     words = "妈逼"
},
[422] ={
     id = 422,
     words = "JB"
},
[423] ={
     id = 423,
     words = "淘宝"
},
[424] ={
     id = 424,
     words = "j8"
},
[425] ={
     id = 425,
     words = "吗的"
},
[426] ={
     id = 426,
     words = "8仙"
},
[427] ={
     id = 427,
     words = "狗日"
},
[428] ={
     id = 428,
     words = "h站"
},
[429] ={
     id = 429,
     words = "龙虎"
},
[430] ={
     id = 430,
     words = "虎门"
},
[431] ={
     id = 431,
     words = "战牌"
},
[432] ={
     id = 432,
     words = "bt"
},
[433] ={
     id = 433,
     words = "sf"
},
[434] ={
     id = 434,
     words = "WG"
},
[435] ={
     id = 435,
     words = "阿拉"
},
[436] ={
     id = 436,
     words = "八九"
},
[437] ={
     id = 437,
     words = "包皮"
},
[438] ={
     id = 438,
     words = "保钓"
},
[439] ={
     id = 439,
     words = "暴动"
},
[440] ={
     id = 440,
     words = "暴乱"
},
[441] ={
     id = 441,
     words = "暴徒"
},
[442] ={
     id = 442,
     words = "贝肉"
},
[443] ={
     id = 443,
     words = "苯比"
},
[444] ={
     id = 444,
     words = "笨屄"
},
[445] ={
     id = 445,
     words = "笨逼"
},
[446] ={
     id = 446,
     words = "屄毛"
},
[447] ={
     id = 447,
     words = "逼样"
},
[448] ={
     id = 448,
     words = "比毛"
},
[449] ={
     id = 449,
     words = "宾周"
},
[450] ={
     id = 450,
     words = "波霸"
},
[451] ={
     id = 451,
     words = "博讯"
},
[452] ={
     id = 452,
     words = "操逼"
},
[453] ={
     id = 453,
     words = "操比"
},
[454] ={
     id = 454,
     words = "操蛋"
},
[455] ={
     id = 455,
     words = "草妈"
},
[456] ={
     id = 456,
     words = "插妳"
},
[457] ={
     id = 457,
     words = "朝鲜"
},
[458] ={
     id = 458,
     words = "车臣"
},
[459] ={
     id = 459,
     words = "车仑"
},
[460] ={
     id = 460,
     words = "陈功"
},
[461] ={
     id = 461,
     words = "吃屎"
},
[462] ={
     id = 462,
     words = "赤匪"
},
[463] ={
     id = 463,
     words = "抽插"
},
[464] ={
     id = 464,
     words = "春药"
},
[465] ={
     id = 465,
     words = "达赖"
},
[466] ={
     id = 466,
     words = "打炮"
},
[467] ={
     id = 467,
     words = "大B"
},
[468] ={
     id = 468,
     words = "大逼"
},
[469] ={
     id = 469,
     words = "大便"
},
[470] ={
     id = 470,
     words = "大师"
},
[471] ={
     id = 471,
     words = "呆卵"
},
[472] ={
     id = 472,
     words = "戴红"
},
[473] ={
     id = 473,
     words = "戴晶"
},
[474] ={
     id = 474,
     words = "屌7"
},
[475] ={
     id = 475,
     words = "屌鸠"
},
[476] ={
     id = 476,
     words = "屌毛"
},
[477] ={
     id = 477,
     words = "屌妳"
},
[478] ={
     id = 478,
     words = "屌七"
},
[479] ={
     id = 479,
     words = "屌西"
},
[480] ={
     id = 480,
     words = "东升"
},
[481] ={
     id = 481,
     words = "东突"
},
[482] ={
     id = 482,
     words = "独立"
},
[483] ={
     id = 483,
     words = "二B"
},
[484] ={
     id = 484,
     words = "二屄"
},
[485] ={
     id = 485,
     words = "二逼"
},
[486] ={
     id = 486,
     words = "发抡"
},
[487] ={
     id = 487,
     words = "发伦"
},
[488] ={
     id = 488,
     words = "发轮"
},
[489] ={
     id = 489,
     words = "发论"
},
[490] ={
     id = 490,
     words = "法功"
},
[491] ={
     id = 491,
     words = "法愣"
},
[492] ={
     id = 492,
     words = "法仑"
},
[493] ={
     id = 493,
     words = "反动"
},
[494] ={
     id = 494,
     words = "反华"
},
[495] ={
     id = 495,
     words = "反日"
},
[496] ={
     id = 496,
     words = "阝月"
},
[497] ={
     id = 497,
     words = "傅鹏"
},
[498] ={
     id = 498,
     words = "高俊"
},
[499] ={
     id = 499,
     words = "睾丸"
},
[500] ={
     id = 500,
     words = "工力"
},
[501] ={
     id = 501,
     words = "公安"
},
[502] ={
     id = 502,
     words = "狗b"
},
[503] ={
     id = 503,
     words = "狗操"
},
[504] ={
     id = 504,
     words = "狗卵"
},
[505] ={
     id = 505,
     words = "狗娘"
},
[506] ={
     id = 506,
     words = "狗屁"
},
[507] ={
     id = 507,
     words = "狗屎"
},
[508] ={
     id = 508,
     words = "狗养"
},
[509] ={
     id = 509,
     words = "龟公"
},
[510] ={
     id = 510,
     words = "鬼村"
},
[511] ={
     id = 511,
     words = "哈批"
},
[512] ={
     id = 512,
     words = "洪兴"
},
[513] ={
     id = 513,
     words = "洪志"
},
[514] ={
     id = 514,
     words = "后庭"
},
[515] ={
     id = 515,
     words = "花柳"
},
[516] ={
     id = 516,
     words = "欢城"
},
[517] ={
     id = 517,
     words = "昏药"
},
[518] ={
     id = 518,
     words = "火棒"
},
[519] ={
     id = 519,
     words = "鸡芭"
},
[520] ={
     id = 520,
     words = "基督"
},
[521] ={
     id = 521,
     words = "妓院"
},
[522] ={
     id = 522,
     words = "贱逼"
},
[523] ={
     id = 523,
     words = "江八"
},
[524] ={
     id = 524,
     words = "江猪"
},
[525] ={
     id = 525,
     words = "姣西"
},
[526] ={
     id = 526,
     words = "叫床"
},
[527] ={
     id = 527,
     words = "叫鸡"
},
[528] ={
     id = 528,
     words = "禁书"
},
[529] ={
     id = 529,
     words = "静坐"
},
[530] ={
     id = 530,
     words = "鸠屎"
},
[531] ={
     id = 531,
     words = "军妓"
},
[532] ={
     id = 532,
     words = "军委"
},
[533] ={
     id = 533,
     words = "抗日"
},
[534] ={
     id = 534,
     words = "靠腰"
},
[535] ={
     id = 535,
     words = "客服"
},
[536] ={
     id = 536,
     words = "狂操"
},
[537] ={
     id = 537,
     words = "拉登"
},
[538] ={
     id = 538,
     words = "懒教"
},
[539] ={
     id = 539,
     words = "烂B"
},
[540] ={
     id = 540,
     words = "烂屄"
},
[541] ={
     id = 541,
     words = "烂比"
},
[542] ={
     id = 542,
     words = "烂屌"
},
[543] ={
     id = 543,
     words = "烂货"
},
[544] ={
     id = 544,
     words = "老逼"
},
[545] ={
     id = 545,
     words = "李山"
},
[546] ={
     id = 546,
     words = "联大"
},
[547] ={
     id = 547,
     words = "联易"
},
[548] ={
     id = 548,
     words = "刘军"
},
[549] ={
     id = 549,
     words = "流氓"
},
[550] ={
     id = 550,
     words = "骡干"
},
[551] ={
     id = 551,
     words = "妈批"
},
[552] ={
     id = 552,
     words = "妈祖"
},
[553] ={
     id = 553,
     words = "妈B"
},
[554] ={
     id = 554,
     words = "吗啡"
},
[555] ={
     id = 555,
     words = "卖B"
},
[556] ={
     id = 556,
     words = "卖比"
},
[557] ={
     id = 557,
     words = "卖国"
},
[558] ={
     id = 558,
     words = "卖卡"
},
[559] ={
     id = 559,
     words = "蒙独"
},
[560] ={
     id = 560,
     words = "迷药"
},
[561] ={
     id = 561,
     words = "密洞"
},
[562] ={
     id = 562,
     words = "伱妈"
},
[563] ={
     id = 563,
     words = "你爸"
},
[564] ={
     id = 564,
     words = "你姥"
},
[565] ={
     id = 565,
     words = "你娘"
},
[566] ={
     id = 566,
     words = "鸟你"
},
[567] ={
     id = 567,
     words = "牛比"
},
[568] ={
     id = 568,
     words = "虐待"
},
[569] ={
     id = 569,
     words = "喷你"
},
[570] ={
     id = 570,
     words = "彭真"
},
[571] ={
     id = 571,
     words = "皮条"
},
[572] ={
     id = 572,
     words = "嫖客"
},
[573] ={
     id = 573,
     words = "破坏"
},
[574] ={
     id = 574,
     words = "强卫"
},
[575] ={
     id = 575,
     words = "乔石"
},
[576] ={
     id = 576,
     words = "侨办"
},
[577] ={
     id = 577,
     words = "切七"
},
[578] ={
     id = 578,
     words = "人大"
},
[579] ={
     id = 579,
     words = "人弹"
},
[580] ={
     id = 580,
     words = "人民"
},
[581] ={
     id = 581,
     words = "肉壁"
},
[582] ={
     id = 582,
     words = "肉缝"
},
[583] ={
     id = 583,
     words = "肉穴"
},
[584] ={
     id = 584,
     words = "撒尿"
},
[585] ={
     id = 585,
     words = "塞白"
},
[586] ={
     id = 586,
     words = "骚逼"
},
[587] ={
     id = 587,
     words = "傻屄"
},
[588] ={
     id = 588,
     words = "傻吊"
},
[589] ={
     id = 589,
     words = "傻卵"
},
[590] ={
     id = 590,
     words = "煞逼"
},
[591] ={
     id = 591,
     words = "石进"
},
[592] ={
     id = 592,
     words = "食屎"
},
[593] ={
     id = 593,
     words = "是鸡"
},
[594] ={
     id = 594,
     words = "售号"
},
[595] ={
     id = 595,
     words = "氵去"
},
[596] ={
     id = 596,
     words = "他爹"
},
[597] ={
     id = 597,
     words = "台办"
},
[598] ={
     id = 598,
     words = "太监"
},
[599] ={
     id = 599,
     words = "天皇"
},
[600] ={
     id = 600,
     words = "舔西"
},
[601] ={
     id = 601,
     words = "推油"
},
[602] ={
     id = 602,
     words = "退党"
},
[603] ={
     id = 603,
     words = "万税"
},
[604] ={
     id = 604,
     words = "王昊"
},
[605] ={
     id = 605,
     words = "王震"
},
[606] ={
     id = 606,
     words = "网管"
},
[607] ={
     id = 607,
     words = "温馨"
},
[608] ={
     id = 608,
     words = "倭国"
},
[609] ={
     id = 609,
     words = "倭寇"
},
[610] ={
     id = 610,
     words = "鲜族"
},
[611] ={
     id = 611,
     words = "邪教"
},
[612] ={
     id = 612,
     words = "性爱"
},
[613] ={
     id = 613,
     words = "血逼"
},
[614] ={
     id = 614,
     words = "丫的"
},
[615] ={
     id = 615,
     words = "阳精"
},
[616] ={
     id = 616,
     words = "耶苏"
},
[617] ={
     id = 617,
     words = "夜情"
},
[618] ={
     id = 618,
     words = "伊朗"
},
[619] ={
     id = 619,
     words = "阴毛"
},
[620] ={
     id = 620,
     words = "阴水"
},
[621] ={
     id = 621,
     words = "淫荡"
},
[622] ={
     id = 622,
     words = "淫货"
},
[623] ={
     id = 623,
     words = "淫贱"
},
[624] ={
     id = 624,
     words = "淫叫"
},
[625] ={
     id = 625,
     words = "淫毛"
},
[626] ={
     id = 626,
     words = "淫靡"
},
[627] ={
     id = 627,
     words = "淫欲"
},
[628] ={
     id = 628,
     words = "硬挺"
},
[629] ={
     id = 629,
     words = "玉杵"
},
[630] ={
     id = 630,
     words = "曰你"
},
[631] ={
     id = 631,
     words = "月经"
},
[632] ={
     id = 632,
     words = "杂种"
},
[633] ={
     id = 633,
     words = "张磊"
},
[634] ={
     id = 634,
     words = "政协"
},
[635] ={
     id = 635,
     words = "值勤"
},
[636] ={
     id = 636,
     words = "中国"
},
[637] ={
     id = 637,
     words = "中央"
},
[638] ={
     id = 638,
     words = "猪操"
},
[639] ={
     id = 639,
     words = "主席"
},
[640] ={
     id = 640,
     words = "装屄"
},
[641] ={
     id = 641,
     words = "宗教"
},
[642] ={
     id = 642,
     words = "总局"
},
[643] ={
     id = 643,
     words = "总理"
},
[644] ={
     id = 644,
     words = "作爱"
},
[645] ={
     id = 645,
     words = "礼品"
},
[646] ={
     id = 646,
     words = "领取"
},
[647] ={
     id = 647,
     words = "操婊"
},
[648] ={
     id = 648,
     words = "操操"
},
[649] ={
     id = 649,
     words = "操肏"
},
[650] ={
     id = 650,
     words = "毛肛"
},
[651] ={
     id = 651,
     words = "毛睾"
},
[652] ={
     id = 652,
     words = "毛滚"
},
[653] ={
     id = 653,
     words = "毛鸡"
},
[654] ={
     id = 654,
     words = "毛妓"
},
[655] ={
     id = 655,
     words = "毛奸"
},
[656] ={
     id = 656,
     words = "毛贱"
},
[657] ={
     id = 657,
     words = "毛鸠"
},
[658] ={
     id = 658,
     words = "毛尻"
},
[659] ={
     id = 659,
     words = "毛靠"
},
[660] ={
     id = 660,
     words = "毛卵"
},
[661] ={
     id = 661,
     words = "毛乳"
},
[662] ={
     id = 662,
     words = "毛骚"
},
[663] ={
     id = 663,
     words = "毛淫"
},
[664] ={
     id = 664,
     words = "牛B"
},
[665] ={
     id = 665,
     words = "∪R"
},
[666] ={
     id = 666,
     words = "ＵＲ"
},
[667] ={
     id = 667,
     words = "信息"
},
[668] ={
     id = 668,
     words = "K粉"
},
[669] ={
     id = 669,
     words = "冰粉"
},
[670] ={
     id = 670,
     words = "2逼"
},
[671] ={
     id = 671,
     words = "3P"
},
[672] ={
     id = 672,
     words = "AV"
},
[673] ={
     id = 673,
     words = "ａ片"
},
[674] ={
     id = 674,
     words = "A片"
},
[675] ={
     id = 675,
     words = "b毛"
},
[676] ={
     id = 676,
     words = "ｂ样"
},
[677] ={
     id = 677,
     words = "b样"
},
[678] ={
     id = 678,
     words = "g点"
},
[679] ={
     id = 679,
     words = "g片"
},
[680] ={
     id = 680,
     words = "ｊ8"
},
[681] ={
     id = 681,
     words = "ｊｂ"
},
[682] ={
     id = 682,
     words = "ｊｉ"
},
[683] ={
     id = 683,
     words = "K房"
},
[684] ={
     id = 684,
     words = "ｋ粉"
},
[685] ={
     id = 685,
     words = "K姐"
},
[686] ={
     id = 686,
     words = "o靠"
},
[687] ={
     id = 687,
     words = "Q币"
},
[688] ={
     id = 688,
     words = "R靠"
},
[689] ={
     id = 689,
     words = "ｓｂ"
},
[690] ={
     id = 690,
     words = "TW"
},
[691] ={
     id = 691,
     words = "ㄐ八"
},
[692] ={
     id = 692,
     words = "ㄐ巴"
},
[693] ={
     id = 693,
     words = "ㄐ掰"
},
[694] ={
     id = 694,
     words = "愛液"
},
[695] ={
     id = 695,
     words = "八嘎"
},
[696] ={
     id = 696,
     words = "扒屄"
},
[697] ={
     id = 697,
     words = "扒穴"
},
[698] ={
     id = 698,
     words = "拔屄"
},
[699] ={
     id = 699,
     words = "掰穴"
},
[700] ={
     id = 700,
     words = "暴動"
},
[701] ={
     id = 701,
     words = "暴干"
},
[702] ={
     id = 702,
     words = "暴幹"
},
[703] ={
     id = 703,
     words = "暴奸"
},
[704] ={
     id = 704,
     words = "暴亂"
},
[705] ={
     id = 705,
     words = "暴乳"
},
[706] ={
     id = 706,
     words = "暴淫"
},
[707] ={
     id = 707,
     words = "暴政"
},
[708] ={
     id = 708,
     words = "鮑彤"
},
[709] ={
     id = 709,
     words = "爆吧"
},
[710] ={
     id = 710,
     words = "爆操"
},
[711] ={
     id = 711,
     words = "爆草"
},
[712] ={
     id = 712,
     words = "爆乳"
},
[713] ={
     id = 713,
     words = "爆炸"
},
[714] ={
     id = 714,
     words = "被操"
},
[715] ={
     id = 715,
     words = "被插"
},
[716] ={
     id = 716,
     words = "被干"
},
[717] ={
     id = 717,
     words = "被幹"
},
[718] ={
     id = 718,
     words = "笨比"
},
[719] ={
     id = 719,
     words = "屄屄"
},
[720] ={
     id = 720,
     words = "逼奸"
},
[721] ={
     id = 721,
     words = "逼痒"
},
[722] ={
     id = 722,
     words = "逼癢"
},
[723] ={
     id = 723,
     words = "逼樣"
},
[724] ={
     id = 724,
     words = "逼孕"
},
[725] ={
     id = 725,
     words = "比的"
},
[726] ={
     id = 726,
     words = "比卵"
},
[727] ={
     id = 727,
     words = "比水"
},
[728] ={
     id = 728,
     words = "比样"
},
[729] ={
     id = 729,
     words = "避孕"
},
[730] ={
     id = 730,
     words = "鞭神"
},
[731] ={
     id = 731,
     words = "鞭王"
},
[732] ={
     id = 732,
     words = "癟三"
},
[733] ={
     id = 733,
     words = "賓周"
},
[734] ={
     id = 734,
     words = "勃起"
},
[735] ={
     id = 735,
     words = "薄码"
},
[736] ={
     id = 736,
     words = "薄碼"
},
[737] ={
     id = 737,
     words = "不举"
},
[738] ={
     id = 738,
     words = "菜B"
},
[739] ={
     id = 739,
     words = "菜逼"
},
[740] ={
     id = 740,
     words = "蔵獨"
},
[741] ={
     id = 741,
     words = "操b"
},
[742] ={
     id = 742,
     words = "操屄"
},
[743] ={
     id = 743,
     words = "操狗"
},
[744] ={
     id = 744,
     words = "操黑"
},
[745] ={
     id = 745,
     words = "操鸡"
},
[746] ={
     id = 746,
     words = "操雞"
},
[747] ={
     id = 747,
     words = "操烂"
},
[748] ={
     id = 748,
     words = "操爛"
},
[749] ={
     id = 749,
     words = "操妳"
},
[750] ={
     id = 750,
     words = "操妻"
},
[751] ={
     id = 751,
     words = "操射"
},
[752] ={
     id = 752,
     words = "操神"
},
[753] ={
     id = 753,
     words = "操爽"
},
[754] ={
     id = 754,
     words = "操死"
},
[755] ={
     id = 755,
     words = "操王"
},
[756] ={
     id = 756,
     words = "操我"
},
[757] ={
     id = 757,
     words = "操穴"
},
[758] ={
     id = 758,
     words = "操肿"
},
[759] ={
     id = 759,
     words = "操腫"
},
[760] ={
     id = 760,
     words = "曹你"
},
[761] ={
     id = 761,
     words = "草嫣"
},
[762] ={
     id = 762,
     words = "肏屄"
},
[763] ={
     id = 763,
     words = "肏穴"
},
[764] ={
     id = 764,
     words = "冊老"
},
[765] ={
     id = 765,
     words = "冊那"
},
[766] ={
     id = 766,
     words = "册老"
},
[767] ={
     id = 767,
     words = "厕奴"
},
[768] ={
     id = 768,
     words = "廁奴"
},
[769] ={
     id = 769,
     words = "插B"
},
[770] ={
     id = 770,
     words = "插暴"
},
[771] ={
     id = 771,
     words = "插逼"
},
[772] ={
     id = 772,
     words = "插比"
},
[773] ={
     id = 773,
     words = "插干"
},
[774] ={
     id = 774,
     words = "插她"
},
[775] ={
     id = 775,
     words = "插进"
},
[776] ={
     id = 776,
     words = "插進"
},
[777] ={
     id = 777,
     words = "插入"
},
[778] ={
     id = 778,
     words = "插死"
},
[779] ={
     id = 779,
     words = "插他"
},
[780] ={
     id = 780,
     words = "插我"
},
[781] ={
     id = 781,
     words = "插穴"
},
[782] ={
     id = 782,
     words = "插阴"
},
[783] ={
     id = 783,
     words = "插陰"
},
[784] ={
     id = 784,
     words = "蝉童"
},
[785] ={
     id = 785,
     words = "產黨"
},
[786] ={
     id = 786,
     words = "娼妇"
},
[787] ={
     id = 787,
     words = "娼妓"
},
[788] ={
     id = 788,
     words = "猖妓"
},
[789] ={
     id = 789,
     words = "常劲"
},
[790] ={
     id = 790,
     words = "潮吹"
},
[791] ={
     id = 791,
     words = "潮喷"
},
[792] ={
     id = 792,
     words = "潮噴"
},
[793] ={
     id = 793,
     words = "潮姫"
},
[794] ={
     id = 794,
     words = "車侖"
},
[795] ={
     id = 795,
     words = "成人"
},
[796] ={
     id = 796,
     words = "程凯"
},
[797] ={
     id = 797,
     words = "程真"
},
[798] ={
     id = 798,
     words = "吃精"
},
[799] ={
     id = 799,
     words = "痴女"
},
[800] ={
     id = 800,
     words = "痴乳"
},
[801] ={
     id = 801,
     words = "癡乳"
},
[802] ={
     id = 802,
     words = "赤化"
},
[803] ={
     id = 803,
     words = "赤裸"
},
[804] ={
     id = 804,
     words = "臭b"
},
[805] ={
     id = 805,
     words = "臭作"
},
[806] ={
     id = 806,
     words = "传销"
},
[807] ={
     id = 807,
     words = "傳銷"
},
[808] ={
     id = 808,
     words = "春藥"
},
[809] ={
     id = 809,
     words = "戳B"
},
[810] ={
     id = 810,
     words = "戳逼"
},
[811] ={
     id = 811,
     words = "戳比"
},
[812] ={
     id = 812,
     words = "次郎"
},
[813] ={
     id = 813,
     words = "粗硬"
},
[814] ={
     id = 814,
     words = "错B"
},
[815] ={
     id = 815,
     words = "错逼"
},
[816] ={
     id = 816,
     words = "错比"
},
[817] ={
     id = 817,
     words = "錯B"
},
[818] ={
     id = 818,
     words = "錯比"
},
[819] ={
     id = 819,
     words = "打砲"
},
[820] ={
     id = 820,
     words = "大比"
},
[821] ={
     id = 821,
     words = "大波"
},
[822] ={
     id = 822,
     words = "大乳"
},
[823] ={
     id = 823,
     words = "大煙"
},
[824] ={
     id = 824,
     words = "呆比"
},
[825] ={
     id = 825,
     words = "代挂"
},
[826] ={
     id = 826,
     words = "代理"
},
[827] ={
     id = 827,
     words = "代练"
},
[828] ={
     id = 828,
     words = "代炼"
},
[829] ={
     id = 829,
     words = "代链"
},
[830] ={
     id = 830,
     words = "代練"
},
[831] ={
     id = 831,
     words = "荡妹"
},
[832] ={
     id = 832,
     words = "荡女"
},
[833] ={
     id = 833,
     words = "蕩婦"
},
[834] ={
     id = 834,
     words = "蕩妹"
},
[835] ={
     id = 835,
     words = "蕩女"
},
[836] ={
     id = 836,
     words = "盗撮"
},
[837] ={
     id = 837,
     words = "盗电"
},
[838] ={
     id = 838,
     words = "盜撮"
},
[839] ={
     id = 839,
     words = "邓发"
},
[840] ={
     id = 840,
     words = "点卡"
},
[841] ={
     id = 841,
     words = "吊子"
},
[842] ={
     id = 842,
     words = "腚眼"
},
[843] ={
     id = 843,
     words = "東突"
},
[844] ={
     id = 844,
     words = "动乱"
},
[845] ={
     id = 845,
     words = "動乱"
},
[846] ={
     id = 846,
     words = "動亂"
},
[847] ={
     id = 847,
     words = "毒贩"
},
[848] ={
     id = 848,
     words = "毒販"
},
[849] ={
     id = 849,
     words = "毒品"
},
[850] ={
     id = 850,
     words = "沌决"
},
[851] ={
     id = 851,
     words = "堕淫"
},
[852] ={
     id = 852,
     words = "墮淫"
},
[853] ={
     id = 853,
     words = "屙民"
},
[854] ={
     id = 854,
     words = "饿b"
},
[855] ={
     id = 855,
     words = "饿比"
},
[856] ={
     id = 856,
     words = "餓比"
},
[857] ={
     id = 857,
     words = "发浪"
},
[858] ={
     id = 858,
     words = "发愣"
},
[859] ={
     id = 859,
     words = "发仑"
},
[860] ={
     id = 860,
     words = "发沦"
},
[861] ={
     id = 861,
     words = "发纶"
},
[862] ={
     id = 862,
     words = "発妻"
},
[863] ={
     id = 863,
     words = "發浪"
},
[864] ={
     id = 864,
     words = "發掄"
},
[865] ={
     id = 865,
     words = "發侖"
},
[866] ={
     id = 866,
     words = "發倫"
},
[867] ={
     id = 867,
     words = "發淪"
},
[868] ={
     id = 868,
     words = "發綸"
},
[869] ={
     id = 869,
     words = "發輪"
},
[870] ={
     id = 870,
     words = "發論"
},
[871] ={
     id = 871,
     words = "法%*"
},
[872] ={
     id = 872,
     words = "法×"
},
[873] ={
     id = 873,
     words = "法抡"
},
[874] ={
     id = 874,
     words = "法掄"
},
[875] ={
     id = 875,
     words = "法伦"
},
[876] ={
     id = 876,
     words = "法沦"
},
[877] ={
     id = 877,
     words = "法纶"
},
[878] ={
     id = 878,
     words = "法侖"
},
[879] ={
     id = 879,
     words = "法倫"
},
[880] ={
     id = 880,
     words = "法淪"
},
[881] ={
     id = 881,
     words = "法綸"
},
[882] ={
     id = 882,
     words = "法輪"
},
[883] ={
     id = 883,
     words = "法论"
},
[884] ={
     id = 884,
     words = "法論"
},
[885] ={
     id = 885,
     words = "法谪"
},
[886] ={
     id = 886,
     words = "反動"
},
[887] ={
     id = 887,
     words = "反攻"
},
[888] ={
     id = 888,
     words = "放尿"
},
[889] ={
     id = 889,
     words = "放屁"
},
[890] ={
     id = 890,
     words = "肥逼"
},
[891] ={
     id = 891,
     words = "肥西"
},
[892] ={
     id = 892,
     words = "肥穴"
},
[893] ={
     id = 893,
     words = "废墟"
},
[894] ={
     id = 894,
     words = "廢墟"
},
[895] ={
     id = 895,
     words = "焚烧"
},
[896] ={
     id = 896,
     words = "粉屄"
},
[897] ={
     id = 897,
     words = "粉穴"
},
[898] ={
     id = 898,
     words = "粪便"
},
[899] ={
     id = 899,
     words = "糞便"
},
[900] ={
     id = 900,
     words = "封淫"
},
[901] ={
     id = 901,
     words = "逢乃"
},
[902] ={
     id = 902,
     words = "干逼"
},
[903] ={
     id = 903,
     words = "干比"
},
[904] ={
     id = 904,
     words = "干娘"
},
[905] ={
     id = 905,
     words = "干炮"
},
[906] ={
     id = 906,
     words = "干穴"
},
[907] ={
     id = 907,
     words = "幹逼"
},
[908] ={
     id = 908,
     words = "幹比"
},
[909] ={
     id = 909,
     words = "幹她"
},
[910] ={
     id = 910,
     words = "幹妳"
},
[911] ={
     id = 911,
     words = "幹你"
},
[912] ={
     id = 912,
     words = "幹炮"
},
[913] ={
     id = 913,
     words = "幹砲"
},
[914] ={
     id = 914,
     words = "幹死"
},
[915] ={
     id = 915,
     words = "幹他"
},
[916] ={
     id = 916,
     words = "幹穴"
},
[917] ={
     id = 917,
     words = "肛屄"
},
[918] ={
     id = 918,
     words = "肛門"
},
[919] ={
     id = 919,
     words = "岡巒"
},
[920] ={
     id = 920,
     words = "剛比"
},
[921] ={
     id = 921,
     words = "剛度"
},
[922] ={
     id = 922,
     words = "髙潮"
},
[923] ={
     id = 923,
     words = "睪丸"
},
[924] ={
     id = 924,
     words = "搞B"
},
[925] ={
     id = 925,
     words = "搞比"
},
[926] ={
     id = 926,
     words = "搞她"
},
[927] ={
     id = 927,
     words = "搞你"
},
[928] ={
     id = 928,
     words = "搞死"
},
[929] ={
     id = 929,
     words = "搞他"
},
[930] ={
     id = 930,
     words = "戈扬"
},
[931] ={
     id = 931,
     words = "個批"
},
[932] ={
     id = 932,
     words = "耿飙"
},
[933] ={
     id = 933,
     words = "耿飚"
},
[934] ={
     id = 934,
     words = "弓虽"
},
[935] ={
     id = 935,
     words = "弓雖"
},
[936] ={
     id = 936,
     words = "功法"
},
[937] ={
     id = 937,
     words = "共产"
},
[938] ={
     id = 938,
     words = "共黨"
},
[939] ={
     id = 939,
     words = "共和"
},
[940] ={
     id = 940,
     words = "共军"
},
[941] ={
     id = 941,
     words = "共軍"
},
[942] ={
     id = 942,
     words = "狗比"
},
[943] ={
     id = 943,
     words = "狗成"
},
[944] ={
     id = 944,
     words = "狗诚"
},
[945] ={
     id = 945,
     words = "狗城"
},
[946] ={
     id = 946,
     words = "狗乘"
},
[947] ={
     id = 947,
     words = "狗幹"
},
[948] ={
     id = 948,
     words = "狗剩"
},
[949] ={
     id = 949,
     words = "狗養"
},
[950] ={
     id = 950,
     words = "購金"
},
[951] ={
     id = 951,
     words = "瓜批"
},
[952] ={
     id = 952,
     words = "龟毛"
},
[953] ={
     id = 953,
     words = "龟奴"
},
[954] ={
     id = 954,
     words = "龟投"
},
[955] ={
     id = 955,
     words = "龟頭"
},
[956] ={
     id = 956,
     words = "亀頭"
},
[957] ={
     id = 957,
     words = "龜公"
},
[958] ={
     id = 958,
     words = "龜奴"
},
[959] ={
     id = 959,
     words = "龜头"
},
[960] ={
     id = 960,
     words = "龜投"
},
[961] ={
     id = 961,
     words = "龜頭"
},
[962] ={
     id = 962,
     words = "鬼公"
},
[963] ={
     id = 963,
     words = "裹本"
},
[964] ={
     id = 964,
     words = "含屌"
},
[965] ={
     id = 965,
     words = "含鳥"
},
[966] ={
     id = 966,
     words = "豪乳"
},
[967] ={
     id = 967,
     words = "号靠"
},
[968] ={
     id = 968,
     words = "黑屄"
},
[969] ={
     id = 969,
     words = "黑逼"
},
[970] ={
     id = 970,
     words = "黑鬼"
},
[971] ={
     id = 971,
     words = "洪传"
},
[972] ={
     id = 972,
     words = "洪興"
},
[973] ={
     id = 973,
     words = "洪吟"
},
[974] ={
     id = 974,
     words = "後庭"
},
[975] ={
     id = 975,
     words = "互淫"
},
[976] ={
     id = 976,
     words = "护法"
},
[977] ={
     id = 977,
     words = "华义"
},
[978] ={
     id = 978,
     words = "華義"
},
[979] ={
     id = 979,
     words = "換妻"
},
[980] ={
     id = 980,
     words = "皇军"
},
[981] ={
     id = 981,
     words = "皇軍"
},
[982] ={
     id = 982,
     words = "黃片"
},
[983] ={
     id = 983,
     words = "黄祸"
},
[984] ={
     id = 984,
     words = "黄片"
},
[985] ={
     id = 985,
     words = "汇款"
},
[986] ={
     id = 986,
     words = "匯款"
},
[987] ={
     id = 987,
     words = "机吧"
},
[988] ={
     id = 988,
     words = "机战"
},
[989] ={
     id = 989,
     words = "鸡8"
},
[990] ={
     id = 990,
     words = "鸡吧"
},
[991] ={
     id = 991,
     words = "鸡店"
},
[992] ={
     id = 992,
     words = "鸡女"
},
[993] ={
     id = 993,
     words = "鸡院"
},
[994] ={
     id = 994,
     words = "機八"
},
[995] ={
     id = 995,
     words = "機巴"
},
[996] ={
     id = 996,
     words = "機吧"
},
[997] ={
     id = 997,
     words = "機戰"
},
[998] ={
     id = 998,
     words = "激插"
},
[999] ={
     id = 999,
     words = "激烈"
},
[1000] ={
     id = 1000,
     words = "激情"
},
[1001] ={
     id = 1001,
     words = "激战"
},
[1002] ={
     id = 1002,
     words = "雞8"
},
[1003] ={
     id = 1003,
     words = "雞八"
},
[1004] ={
     id = 1004,
     words = "雞巴"
},
[1005] ={
     id = 1005,
     words = "雞叭"
},
[1006] ={
     id = 1006,
     words = "雞吧"
},
[1007] ={
     id = 1007,
     words = "雞芭"
},
[1008] ={
     id = 1008,
     words = "雞掰"
},
[1009] ={
     id = 1009,
     words = "雞雞"
},
[1010] ={
     id = 1010,
     words = "雞奸"
},
[1011] ={
     id = 1011,
     words = "雞女"
},
[1012] ={
     id = 1012,
     words = "雞歪"
},
[1013] ={
     id = 1013,
     words = "雞院"
},
[1014] ={
     id = 1014,
     words = "鷄巴"
},
[1015] ={
     id = 1015,
     words = "极景"
},
[1016] ={
     id = 1016,
     words = "極景"
},
[1017] ={
     id = 1017,
     words = "集会"
},
[1018] ={
     id = 1018,
     words = "集會"
},
[1019] ={
     id = 1019,
     words = "几八"
},
[1020] ={
     id = 1020,
     words = "几巴"
},
[1021] ={
     id = 1021,
     words = "几叭"
},
[1022] ={
     id = 1022,
     words = "几芭"
},
[1023] ={
     id = 1023,
     words = "幾八"
},
[1024] ={
     id = 1024,
     words = "幾巴"
},
[1025] ={
     id = 1025,
     words = "幾叭"
},
[1026] ={
     id = 1026,
     words = "幾芭"
},
[1027] ={
     id = 1027,
     words = "纪元"
},
[1028] ={
     id = 1028,
     words = "紀元"
},
[1029] ={
     id = 1029,
     words = "祭日"
},
[1030] ={
     id = 1030,
     words = "嘉联"
},
[1031] ={
     id = 1031,
     words = "假币"
},
[1032] ={
     id = 1032,
     words = "假钞"
},
[1033] ={
     id = 1033,
     words = "奸情"
},
[1034] ={
     id = 1034,
     words = "奸染"
},
[1035] ={
     id = 1035,
     words = "奸污"
},
[1036] ={
     id = 1036,
     words = "奸幼"
},
[1037] ={
     id = 1037,
     words = "姦情"
},
[1038] ={
     id = 1038,
     words = "姦染"
},
[1039] ={
     id = 1039,
     words = "姦汙"
},
[1040] ={
     id = 1040,
     words = "姦淫"
},
[1041] ={
     id = 1041,
     words = "贱B"
},
[1042] ={
     id = 1042,
     words = "贱比"
},
[1043] ={
     id = 1043,
     words = "贱种"
},
[1044] ={
     id = 1044,
     words = "劍網"
},
[1045] ={
     id = 1045,
     words = "賤B"
},
[1046] ={
     id = 1046,
     words = "賤逼"
},
[1047] ={
     id = 1047,
     words = "賤比"
},
[1048] ={
     id = 1048,
     words = "賤貨"
},
[1049] ={
     id = 1049,
     words = "賤人"
},
[1050] ={
     id = 1050,
     words = "賤種"
},
[1051] ={
     id = 1051,
     words = "江豬"
},
[1052] ={
     id = 1052,
     words = "僵贼"
},
[1053] ={
     id = 1053,
     words = "交媾"
},
[1054] ={
     id = 1054,
     words = "交配"
},
[1055] ={
     id = 1055,
     words = "脚交"
},
[1056] ={
     id = 1056,
     words = "腳交"
},
[1057] ={
     id = 1057,
     words = "叫春"
},
[1058] ={
     id = 1058,
     words = "叫雞"
},
[1059] ={
     id = 1059,
     words = "劫机"
},
[1060] ={
     id = 1060,
     words = "金酷"
},
[1061] ={
     id = 1061,
     words = "津瑞"
},
[1062] ={
     id = 1062,
     words = "紧穴"
},
[1063] ={
     id = 1063,
     words = "锦涛"
},
[1064] ={
     id = 1064,
     words = "锦天"
},
[1065] ={
     id = 1065,
     words = "緊穴"
},
[1066] ={
     id = 1066,
     words = "劲暴"
},
[1067] ={
     id = 1067,
     words = "劲爆"
},
[1068] ={
     id = 1068,
     words = "劲乐"
},
[1069] ={
     id = 1069,
     words = "劲樂"
},
[1070] ={
     id = 1070,
     words = "劲舞"
},
[1071] ={
     id = 1071,
     words = "勁暴"
},
[1072] ={
     id = 1072,
     words = "勁爆"
},
[1073] ={
     id = 1073,
     words = "勁乐"
},
[1074] ={
     id = 1074,
     words = "勁樂"
},
[1075] ={
     id = 1075,
     words = "勁舞"
},
[1076] ={
     id = 1076,
     words = "经血"
},
[1077] ={
     id = 1077,
     words = "經血"
},
[1078] ={
     id = 1078,
     words = "精蟲"
},
[1079] ={
     id = 1079,
     words = "精水"
},
[1080] ={
     id = 1080,
     words = "精童"
},
[1081] ={
     id = 1081,
     words = "警奴"
},
[1082] ={
     id = 1082,
     words = "九城"
},
[1083] ={
     id = 1083,
     words = "九霾"
},
[1084] ={
     id = 1084,
     words = "九评"
},
[1085] ={
     id = 1085,
     words = "九評"
},
[1086] ={
     id = 1086,
     words = "菊穴"
},
[1087] ={
     id = 1087,
     words = "巨奶"
},
[1088] ={
     id = 1088,
     words = "巨骚"
},
[1089] ={
     id = 1089,
     words = "巨騷"
},
[1090] ={
     id = 1090,
     words = "軍妓"
},
[1091] ={
     id = 1091,
     words = "开苞"
},
[1092] ={
     id = 1092,
     words = "開苞"
},
[1093] ={
     id = 1093,
     words = "開天"
},
[1094] ={
     id = 1094,
     words = "尻庇"
},
[1095] ={
     id = 1095,
     words = "靠爸"
},
[1096] ={
     id = 1096,
     words = "靠母"
},
[1097] ={
     id = 1097,
     words = "靠夭"
},
[1098] ={
     id = 1098,
     words = "磕药"
},
[1099] ={
     id = 1099,
     words = "磕藥"
},
[1100] ={
     id = 1100,
     words = "抠穴"
},
[1101] ={
     id = 1101,
     words = "摳穴"
},
[1102] ={
     id = 1102,
     words = "口爆"
},
[1103] ={
     id = 1103,
     words = "口圭"
},
[1104] ={
     id = 1104,
     words = "口合"
},
[1105] ={
     id = 1105,
     words = "口活"
},
[1106] ={
     id = 1106,
     words = "口射"
},
[1107] ={
     id = 1107,
     words = "口淫"
},
[1108] ={
     id = 1108,
     words = "哭么"
},
[1109] ={
     id = 1109,
     words = "哭夭"
},
[1110] ={
     id = 1110,
     words = "狂插"
},
[1111] ={
     id = 1111,
     words = "拉客"
},
[1112] ={
     id = 1112,
     words = "滥B"
},
[1113] ={
     id = 1113,
     words = "滥逼"
},
[1114] ={
     id = 1114,
     words = "滥比"
},
[1115] ={
     id = 1115,
     words = "滥货"
},
[1116] ={
     id = 1116,
     words = "濫B"
},
[1117] ={
     id = 1117,
     words = "濫逼"
},
[1118] ={
     id = 1118,
     words = "濫比"
},
[1119] ={
     id = 1119,
     words = "濫貨"
},
[1120] ={
     id = 1120,
     words = "濫交"
},
[1121] ={
     id = 1121,
     words = "爛B"
},
[1122] ={
     id = 1122,
     words = "爛逼"
},
[1123] ={
     id = 1123,
     words = "爛比"
},
[1124] ={
     id = 1124,
     words = "爛貨"
},
[1125] ={
     id = 1125,
     words = "狼友"
},
[1126] ={
     id = 1126,
     words = "浪妇"
},
[1127] ={
     id = 1127,
     words = "浪婦"
},
[1128] ={
     id = 1128,
     words = "浪叫"
},
[1129] ={
     id = 1129,
     words = "浪女"
},
[1130] ={
     id = 1130,
     words = "劳改"
},
[1131] ={
     id = 1131,
     words = "老b"
},
[1132] ={
     id = 1132,
     words = "老鸨"
},
[1133] ={
     id = 1133,
     words = "老比"
},
[1134] ={
     id = 1134,
     words = "老二"
},
[1135] ={
     id = 1135,
     words = "老江"
},
[1136] ={
     id = 1136,
     words = "老卵"
},
[1137] ={
     id = 1137,
     words = "老毛"
},
[1138] ={
     id = 1138,
     words = "老味"
},
[1139] ={
     id = 1139,
     words = "亮屄"
},
[1140] ={
     id = 1140,
     words = "亮穴"
},
[1141] ={
     id = 1141,
     words = "凌锋"
},
[1142] ={
     id = 1142,
     words = "凌辱"
},
[1143] ={
     id = 1143,
     words = "淩辱"
},
[1144] ={
     id = 1144,
     words = "流亡"
},
[1145] ={
     id = 1145,
     words = "流淫"
},
[1146] ={
     id = 1146,
     words = "劉傑"
},
[1147] ={
     id = 1147,
     words = "劉淇"
},
[1148] ={
     id = 1148,
     words = "龍陽"
},
[1149] ={
     id = 1149,
     words = "婁義"
},
[1150] ={
     id = 1150,
     words = "漏B"
},
[1151] ={
     id = 1151,
     words = "漏逼"
},
[1152] ={
     id = 1152,
     words = "露B"
},
[1153] ={
     id = 1153,
     words = "露屄"
},
[1154] ={
     id = 1154,
     words = "露逼"
},
[1155] ={
     id = 1155,
     words = "露点"
},
[1156] ={
     id = 1156,
     words = "露點"
},
[1157] ={
     id = 1157,
     words = "露毛"
},
[1158] ={
     id = 1158,
     words = "露乳"
},
[1159] ={
     id = 1159,
     words = "露穴"
},
[1160] ={
     id = 1160,
     words = "陆肆"
},
[1161] ={
     id = 1161,
     words = "陸肆"
},
[1162] ={
     id = 1162,
     words = "乱伦"
},
[1163] ={
     id = 1163,
     words = "亂交"
},
[1164] ={
     id = 1164,
     words = "抡功"
},
[1165] ={
     id = 1165,
     words = "掄功"
},
[1166] ={
     id = 1166,
     words = "仑功"
},
[1167] ={
     id = 1167,
     words = "伦功"
},
[1168] ={
     id = 1168,
     words = "沦功"
},
[1169] ={
     id = 1169,
     words = "纶功"
},
[1170] ={
     id = 1170,
     words = "侖功"
},
[1171] ={
     id = 1171,
     words = "轮暴"
},
[1172] ={
     id = 1172,
     words = "轮操"
},
[1173] ={
     id = 1173,
     words = "轮大"
},
[1174] ={
     id = 1174,
     words = "轮公"
},
[1175] ={
     id = 1175,
     words = "轮攻"
},
[1176] ={
     id = 1176,
     words = "倫功"
},
[1177] ={
     id = 1177,
     words = "淪功"
},
[1178] ={
     id = 1178,
     words = "綸功"
},
[1179] ={
     id = 1179,
     words = "輪暴"
},
[1180] ={
     id = 1180,
     words = "輪公"
},
[1181] ={
     id = 1181,
     words = "輪功"
},
[1182] ={
     id = 1182,
     words = "輪攻"
},
[1183] ={
     id = 1183,
     words = "輪奸"
},
[1184] ={
     id = 1184,
     words = "輪姦"
},
[1185] ={
     id = 1185,
     words = "羅幹"
},
[1186] ={
     id = 1186,
     words = "騾幹"
},
[1187] ={
     id = 1187,
     words = "裸聊"
},
[1188] ={
     id = 1188,
     words = "裸陪"
},
[1189] ={
     id = 1189,
     words = "媽B"
},
[1190] ={
     id = 1190,
     words = "媽逼"
},
[1191] ={
     id = 1191,
     words = "媽比"
},
[1192] ={
     id = 1192,
     words = "媽的"
},
[1193] ={
     id = 1193,
     words = "媽批"
},
[1194] ={
     id = 1194,
     words = "吗b"
},
[1195] ={
     id = 1195,
     words = "吗逼"
},
[1196] ={
     id = 1196,
     words = "吗比"
},
[1197] ={
     id = 1197,
     words = "吗个"
},
[1198] ={
     id = 1198,
     words = "嗎b"
},
[1199] ={
     id = 1199,
     words = "嗎逼"
},
[1200] ={
     id = 1200,
     words = "嗎比"
},
[1201] ={
     id = 1201,
     words = "嗎的"
},
[1202] ={
     id = 1202,
     words = "嗎啡"
},
[1203] ={
     id = 1203,
     words = "嗎個"
},
[1204] ={
     id = 1204,
     words = "买春"
},
[1205] ={
     id = 1205,
     words = "買幣"
},
[1206] ={
     id = 1206,
     words = "買春"
},
[1207] ={
     id = 1207,
     words = "買賣"
},
[1208] ={
     id = 1208,
     words = "卖骚"
},
[1209] ={
     id = 1209,
     words = "賣B"
},
[1210] ={
     id = 1210,
     words = "賣逼"
},
[1211] ={
     id = 1211,
     words = "賣比"
},
[1212] ={
     id = 1212,
     words = "賣幣"
},
[1213] ={
     id = 1213,
     words = "賣國"
},
[1214] ={
     id = 1214,
     words = "賣號"
},
[1215] ={
     id = 1215,
     words = "賣卡"
},
[1216] ={
     id = 1216,
     words = "賣騷"
},
[1217] ={
     id = 1217,
     words = "賣淫"
},
[1218] ={
     id = 1218,
     words = "瞒报"
},
[1219] ={
     id = 1219,
     words = "毛鲍"
},
[1220] ={
     id = 1220,
     words = "毛鮑"
},
[1221] ={
     id = 1221,
     words = "毛黄"
},
[1222] ={
     id = 1222,
     words = "毛片"
},
[1223] ={
     id = 1223,
     words = "毛私"
},
[1224] ={
     id = 1224,
     words = "毛外"
},
[1225] ={
     id = 1225,
     words = "美乳"
},
[1226] ={
     id = 1226,
     words = "美腿"
},
[1227] ={
     id = 1227,
     words = "美穴"
},
[1228] ={
     id = 1228,
     words = "妹穴"
},
[1229] ={
     id = 1229,
     words = "夢~"
},
[1230] ={
     id = 1230,
     words = "猛插"
},
[1231] ={
     id = 1231,
     words = "猛干"
},
[1232] ={
     id = 1232,
     words = "蒙獨"
},
[1233] ={
     id = 1233,
     words = "迷奸"
},
[1234] ={
     id = 1234,
     words = "秘唇"
},
[1235] ={
     id = 1235,
     words = "秘裂"
},
[1236] ={
     id = 1236,
     words = "密穴"
},
[1237] ={
     id = 1237,
     words = "蜜洞"
},
[1238] ={
     id = 1238,
     words = "蜜汁"
},
[1239] ={
     id = 1239,
     words = "绵恒"
},
[1240] ={
     id = 1240,
     words = "苗疆"
},
[1241] ={
     id = 1241,
     words = "民運"
},
[1242] ={
     id = 1242,
     words = "民猪"
},
[1243] ={
     id = 1243,
     words = "明慧"
},
[1244] ={
     id = 1244,
     words = "魔幣"
},
[1245] ={
     id = 1245,
     words = "母奸"
},
[1246] ={
     id = 1246,
     words = "内挂"
},
[1247] ={
     id = 1247,
     words = "奶头"
},
[1248] ={
     id = 1248,
     words = "奶頭"
},
[1249] ={
     id = 1249,
     words = "奶罩"
},
[1250] ={
     id = 1250,
     words = "妳娘"
},
[1251] ={
     id = 1251,
     words = "脑残"
},
[1252] ={
     id = 1252,
     words = "嫐屄"
},
[1253] ={
     id = 1253,
     words = "內褲"
},
[1254] ={
     id = 1254,
     words = "內射"
},
[1255] ={
     id = 1255,
     words = "內衣"
},
[1256] ={
     id = 1256,
     words = "嫩鲍"
},
[1257] ={
     id = 1257,
     words = "嫩鮑"
},
[1258] ={
     id = 1258,
     words = "嫩屄"
},
[1259] ={
     id = 1259,
     words = "嫩逼"
},
[1260] ={
     id = 1260,
     words = "嫩缝"
},
[1261] ={
     id = 1261,
     words = "嫩縫"
},
[1262] ={
     id = 1262,
     words = "嫩奶"
},
[1263] ={
     id = 1263,
     words = "嫩嫩"
},
[1264] ={
     id = 1264,
     words = "嫩女"
},
[1265] ={
     id = 1265,
     words = "嫩肉"
},
[1266] ={
     id = 1266,
     words = "你媽"
},
[1267] ={
     id = 1267,
     words = "你奶"
},
[1268] ={
     id = 1268,
     words = "你爷"
},
[1269] ={
     id = 1269,
     words = "你爺"
},
[1270] ={
     id = 1270,
     words = "娘b"
},
[1271] ={
     id = 1271,
     words = "娘比"
},
[1272] ={
     id = 1272,
     words = "娘的"
},
[1273] ={
     id = 1273,
     words = "鸟g"
},
[1274] ={
     id = 1274,
     words = "鳥g"
},
[1275] ={
     id = 1275,
     words = "捏弄"
},
[1276] ={
     id = 1276,
     words = "女屄"
},
[1277] ={
     id = 1277,
     words = "女尔"
},
[1278] ={
     id = 1278,
     words = "女干"
},
[1279] ={
     id = 1279,
     words = "女幹"
},
[1280] ={
     id = 1280,
     words = "女尻"
},
[1281] ={
     id = 1281,
     words = "女良"
},
[1282] ={
     id = 1282,
     words = "女马"
},
[1283] ={
     id = 1283,
     words = "女馬"
},
[1284] ={
     id = 1284,
     words = "女乃"
},
[1285] ={
     id = 1285,
     words = "女同"
},
[1286] ={
     id = 1286,
     words = "女也"
},
[1287] ={
     id = 1287,
     words = "女医"
},
[1288] ={
     id = 1288,
     words = "女优"
},
[1289] ={
     id = 1289,
     words = "虐奴"
},
[1290] ={
     id = 1290,
     words = "炮友"
},
[1291] ={
     id = 1291,
     words = "喷精"
},
[1292] ={
     id = 1292,
     words = "噴精"
},
[1293] ={
     id = 1293,
     words = "皮條"
},
[1294] ={
     id = 1294,
     words = "姘头"
},
[1295] ={
     id = 1295,
     words = "姘頭"
},
[1296] ={
     id = 1296,
     words = "品穴"
},
[1297] ={
     id = 1297,
     words = "迫奸"
},
[1298] ={
     id = 1298,
     words = "破处"
},
[1299] ={
     id = 1299,
     words = "破處"
},
[1300] ={
     id = 1300,
     words = "绮梦"
},
[1301] ={
     id = 1301,
     words = "千年"
},
[1302] ={
     id = 1302,
     words = "欠操"
},
[1303] ={
     id = 1303,
     words = "欠日"
},
[1304] ={
     id = 1304,
     words = "強暴"
},
[1305] ={
     id = 1305,
     words = "強姦"
},
[1306] ={
     id = 1306,
     words = "強衛"
},
[1307] ={
     id = 1307,
     words = "强暴"
},
[1308] ={
     id = 1308,
     words = "抢尸"
},
[1309] ={
     id = 1309,
     words = "亲美"
},
[1310] ={
     id = 1310,
     words = "亲日"
},
[1311] ={
     id = 1311,
     words = "親日"
},
[1312] ={
     id = 1312,
     words = "禽兽"
},
[1313] ={
     id = 1313,
     words = "禽獸"
},
[1314] ={
     id = 1314,
     words = "情兽"
},
[1315] ={
     id = 1315,
     words = "情獸"
},
[1316] ={
     id = 1316,
     words = "穷b"
},
[1317] ={
     id = 1317,
     words = "穷逼"
},
[1318] ={
     id = 1318,
     words = "全裸"
},
[1319] ={
     id = 1319,
     words = "拳交"
},
[1320] ={
     id = 1320,
     words = "群p"
},
[1321] ={
     id = 1321,
     words = "群奸"
},
[1322] ={
     id = 1322,
     words = "群交"
},
[1323] ={
     id = 1323,
     words = "人妻"
},
[1324] ={
     id = 1324,
     words = "人权"
},
[1325] ={
     id = 1325,
     words = "日b"
},
[1326] ={
     id = 1326,
     words = "日X"
},
[1327] ={
     id = 1327,
     words = "日屄"
},
[1328] ={
     id = 1328,
     words = "日逼"
},
[1329] ={
     id = 1329,
     words = "日比"
},
[1330] ={
     id = 1330,
     words = "日穿"
},
[1331] ={
     id = 1331,
     words = "日蛋"
},
[1332] ={
     id = 1332,
     words = "日翻"
},
[1333] ={
     id = 1333,
     words = "日她"
},
[1334] ={
     id = 1334,
     words = "日軍"
},
[1335] ={
     id = 1335,
     words = "日批"
},
[1336] ={
     id = 1336,
     words = "日爽"
},
[1337] ={
     id = 1337,
     words = "日王"
},
[1338] ={
     id = 1338,
     words = "肉逼"
},
[1339] ={
     id = 1339,
     words = "肉唇"
},
[1340] ={
     id = 1340,
     words = "肉縫"
},
[1341] ={
     id = 1341,
     words = "肉沟"
},
[1342] ={
     id = 1342,
     words = "肉茎"
},
[1343] ={
     id = 1343,
     words = "肉莖"
},
[1344] ={
     id = 1344,
     words = "肉具"
},
[1345] ={
     id = 1345,
     words = "肉香"
},
[1346] ={
     id = 1346,
     words = "肉箫"
},
[1347] ={
     id = 1347,
     words = "肉簫"
},
[1348] ={
     id = 1348,
     words = "肉欲"
},
[1349] ={
     id = 1349,
     words = "肉慾"
},
[1350] ={
     id = 1350,
     words = "乳霸"
},
[1351] ={
     id = 1351,
     words = "乳爆"
},
[1352] ={
     id = 1352,
     words = "乳沟"
},
[1353] ={
     id = 1353,
     words = "乳溝"
},
[1354] ={
     id = 1354,
     words = "乳尖"
},
[1355] ={
     id = 1355,
     words = "乳尻"
},
[1356] ={
     id = 1356,
     words = "乳母"
},
[1357] ={
     id = 1357,
     words = "乳射"
},
[1358] ={
     id = 1358,
     words = "乳頭"
},
[1359] ={
     id = 1359,
     words = "乳腺"
},
[1360] ={
     id = 1360,
     words = "乳暈"
},
[1361] ={
     id = 1361,
     words = "乳罩"
},
[1362] ={
     id = 1362,
     words = "润星"
},
[1363] ={
     id = 1363,
     words = "潤星"
},
[1364] ={
     id = 1364,
     words = "萨斯"
},
[1365] ={
     id = 1365,
     words = "三P"
},
[1366] ={
     id = 1366,
     words = "搔穴"
},
[1367] ={
     id = 1367,
     words = "骚棒"
},
[1368] ={
     id = 1368,
     words = "骚包"
},
[1369] ={
     id = 1369,
     words = "骚屄"
},
[1370] ={
     id = 1370,
     words = "骚比"
},
[1371] ={
     id = 1371,
     words = "骚洞"
},
[1372] ={
     id = 1372,
     words = "骚棍"
},
[1373] ={
     id = 1373,
     words = "骚鸡"
},
[1374] ={
     id = 1374,
     words = "骚卵"
},
[1375] ={
     id = 1375,
     words = "骚妈"
},
[1376] ={
     id = 1376,
     words = "骚妹"
},
[1377] ={
     id = 1377,
     words = "骚母"
},
[1378] ={
     id = 1378,
     words = "骚女"
},
[1379] ={
     id = 1379,
     words = "骚批"
},
[1380] ={
     id = 1380,
     words = "骚妻"
},
[1381] ={
     id = 1381,
     words = "骚乳"
},
[1382] ={
     id = 1382,
     words = "骚水"
},
[1383] ={
     id = 1383,
     words = "騷B"
},
[1384] ={
     id = 1384,
     words = "騷棒"
},
[1385] ={
     id = 1385,
     words = "騷包"
},
[1386] ={
     id = 1386,
     words = "騷屄"
},
[1387] ={
     id = 1387,
     words = "騷逼"
},
[1388] ={
     id = 1388,
     words = "騷比"
},
[1389] ={
     id = 1389,
     words = "騷洞"
},
[1390] ={
     id = 1390,
     words = "騷棍"
},
[1391] ={
     id = 1391,
     words = "騷貨"
},
[1392] ={
     id = 1392,
     words = "騷雞"
},
[1393] ={
     id = 1393,
     words = "騷浪"
},
[1394] ={
     id = 1394,
     words = "騷卵"
},
[1395] ={
     id = 1395,
     words = "騷媽"
},
[1396] ={
     id = 1396,
     words = "騷妹"
},
[1397] ={
     id = 1397,
     words = "騷母"
},
[1398] ={
     id = 1398,
     words = "騷女"
},
[1399] ={
     id = 1399,
     words = "騷批"
},
[1400] ={
     id = 1400,
     words = "騷妻"
},
[1401] ={
     id = 1401,
     words = "騷乳"
},
[1402] ={
     id = 1402,
     words = "騷水"
},
[1403] ={
     id = 1403,
     words = "騷穴"
},
[1404] ={
     id = 1404,
     words = "色狼"
},
[1405] ={
     id = 1405,
     words = "色魔"
},
[1406] ={
     id = 1406,
     words = "色区"
},
[1407] ={
     id = 1407,
     words = "色區"
},
[1408] ={
     id = 1408,
     words = "色色"
},
[1409] ={
     id = 1409,
     words = "色诱"
},
[1410] ={
     id = 1410,
     words = "色欲"
},
[1411] ={
     id = 1411,
     words = "色慾"
},
[1412] ={
     id = 1412,
     words = "殺手"
},
[1413] ={
     id = 1413,
     words = "傻×"
},
[1414] ={
     id = 1414,
     words = "傻瓜"
},
[1415] ={
     id = 1415,
     words = "傻鸟"
},
[1416] ={
     id = 1416,
     words = "傻鳥"
},
[1417] ={
     id = 1417,
     words = "傻批"
},
[1418] ={
     id = 1418,
     words = "煞筆"
},
[1419] ={
     id = 1419,
     words = "尚禾"
},
[1420] ={
     id = 1420,
     words = "射了"
},
[1421] ={
     id = 1421,
     words = "射奶"
},
[1422] ={
     id = 1422,
     words = "射你"
},
[1423] ={
     id = 1423,
     words = "射屏"
},
[1424] ={
     id = 1424,
     words = "射爽"
},
[1425] ={
     id = 1425,
     words = "射颜"
},
[1426] ={
     id = 1426,
     words = "射顏"
},
[1427] ={
     id = 1427,
     words = "深喉"
},
[1428] ={
     id = 1428,
     words = "神泪"
},
[1429] ={
     id = 1429,
     words = "神淚"
},
[1430] ={
     id = 1430,
     words = "神泣"
},
[1431] ={
     id = 1431,
     words = "神曲"
},
[1432] ={
     id = 1432,
     words = "沈彤"
},
[1433] ={
     id = 1433,
     words = "盛雪"
},
[1434] ={
     id = 1434,
     words = "聖火"
},
[1435] ={
     id = 1435,
     words = "聖母"
},
[1436] ={
     id = 1436,
     words = "聖戰"
},
[1437] ={
     id = 1437,
     words = "尸虫"
},
[1438] ={
     id = 1438,
     words = "尸体"
},
[1439] ={
     id = 1439,
     words = "尸體"
},
[1440] ={
     id = 1440,
     words = "屍体"
},
[1441] ={
     id = 1441,
     words = "屍體"
},
[1442] ={
     id = 1442,
     words = "食精"
},
[1443] ={
     id = 1443,
     words = "世模"
},
[1444] ={
     id = 1444,
     words = "事屎"
},
[1445] ={
     id = 1445,
     words = "是雞"
},
[1446] ={
     id = 1446,
     words = "释欲"
},
[1447] ={
     id = 1447,
     words = "釋欲"
},
[1448] ={
     id = 1448,
     words = "受精"
},
[1449] ={
     id = 1449,
     words = "兽奸"
},
[1450] ={
     id = 1450,
     words = "兽欲"
},
[1451] ={
     id = 1451,
     words = "售號"
},
[1452] ={
     id = 1452,
     words = "售卡"
},
[1453] ={
     id = 1453,
     words = "獸奸"
},
[1454] ={
     id = 1454,
     words = "獸交"
},
[1455] ={
     id = 1455,
     words = "獸欲"
},
[1456] ={
     id = 1456,
     words = "熟婦"
},
[1457] ={
     id = 1457,
     words = "熟母"
},
[1458] ={
     id = 1458,
     words = "熟女"
},
[1459] ={
     id = 1459,
     words = "双插"
},
[1460] ={
     id = 1460,
     words = "爽穴"
},
[1461] ={
     id = 1461,
     words = "爽呀"
},
[1462] ={
     id = 1462,
     words = "水扁"
},
[1463] ={
     id = 1463,
     words = "税力"
},
[1464] ={
     id = 1464,
     words = "丝袜"
},
[1465] ={
     id = 1465,
     words = "丝诱"
},
[1466] ={
     id = 1466,
     words = "私处"
},
[1467] ={
     id = 1467,
     words = "私處"
},
[1468] ={
     id = 1468,
     words = "絲襪"
},
[1469] ={
     id = 1469,
     words = "酥穴"
},
[1470] ={
     id = 1470,
     words = "酥痒"
},
[1471] ={
     id = 1471,
     words = "酥癢"
},
[1472] ={
     id = 1472,
     words = "他媽"
},
[1473] ={
     id = 1473,
     words = "它妈"
},
[1474] ={
     id = 1474,
     words = "台獨"
},
[1475] ={
     id = 1475,
     words = "台聯"
},
[1476] ={
     id = 1476,
     words = "台盟"
},
[1477] ={
     id = 1477,
     words = "臺幣"
},
[1478] ={
     id = 1478,
     words = "臺獨"
},
[1479] ={
     id = 1479,
     words = "太監"
},
[1480] ={
     id = 1480,
     words = "桃色"
},
[1481] ={
     id = 1481,
     words = "套子"
},
[1482] ={
     id = 1482,
     words = "腾人"
},
[1483] ={
     id = 1483,
     words = "腾仁"
},
[1484] ={
     id = 1484,
     words = "腾任"
},
[1485] ={
     id = 1485,
     words = "腾武"
},
[1486] ={
     id = 1486,
     words = "滕人"
},
[1487] ={
     id = 1487,
     words = "滕仁"
},
[1488] ={
     id = 1488,
     words = "滕任"
},
[1489] ={
     id = 1489,
     words = "滕武"
},
[1490] ={
     id = 1490,
     words = "藤人"
},
[1491] ={
     id = 1491,
     words = "藤仁"
},
[1492] ={
     id = 1492,
     words = "藤任"
},
[1493] ={
     id = 1493,
     words = "藤武"
},
[1494] ={
     id = 1494,
     words = "騰仁"
},
[1495] ={
     id = 1495,
     words = "騰武"
},
[1496] ={
     id = 1496,
     words = "体奸"
},
[1497] ={
     id = 1497,
     words = "體奸"
},
[1498] ={
     id = 1498,
     words = "剃毛"
},
[1499] ={
     id = 1499,
     words = "天畅"
},
[1500] ={
     id = 1500,
     words = "天暢"
},
[1501] ={
     id = 1501,
     words = "天图"
},
[1502] ={
     id = 1502,
     words = "天阉"
},
[1503] ={
     id = 1503,
     words = "天閹"
},
[1504] ={
     id = 1504,
     words = "天浴"
},
[1505] ={
     id = 1505,
     words = "舔b"
},
[1506] ={
     id = 1506,
     words = "舔屄"
},
[1507] ={
     id = 1507,
     words = "舔逼"
},
[1508] ={
     id = 1508,
     words = "舔脚"
},
[1509] ={
     id = 1509,
     words = "舔腳"
},
[1510] ={
     id = 1510,
     words = "舔奶"
},
[1511] ={
     id = 1511,
     words = "舔吮"
},
[1512] ={
     id = 1512,
     words = "舔穴"
},
[1513] ={
     id = 1513,
     words = "同床"
},
[1514] ={
     id = 1514,
     words = "同房"
},
[1515] ={
     id = 1515,
     words = "捅B"
},
[1516] ={
     id = 1516,
     words = "捅逼"
},
[1517] ={
     id = 1517,
     words = "捅比"
},
[1518] ={
     id = 1518,
     words = "捅她"
},
[1519] ={
     id = 1519,
     words = "捅你"
},
[1520] ={
     id = 1520,
     words = "捅他"
},
[1521] ={
     id = 1521,
     words = "捅我"
},
[1522] ={
     id = 1522,
     words = "痛经"
},
[1523] ={
     id = 1523,
     words = "偷欢"
},
[1524] ={
     id = 1524,
     words = "偷歡"
},
[1525] ={
     id = 1525,
     words = "偷拍"
},
[1526] ={
     id = 1526,
     words = "偷情"
},
[1527] ={
     id = 1527,
     words = "屠城"
},
[1528] ={
     id = 1528,
     words = "退黨"
},
[1529] ={
     id = 1529,
     words = "吞精"
},
[1530] ={
     id = 1530,
     words = "臀部"
},
[1531] ={
     id = 1531,
     words = "挖挂"
},
[1532] ={
     id = 1532,
     words = "歪逼"
},
[1533] ={
     id = 1533,
     words = "外卦"
},
[1534] ={
     id = 1534,
     words = "外掛"
},
[1535] ={
     id = 1535,
     words = "外阴"
},
[1536] ={
     id = 1536,
     words = "外陰"
},
[1537] ={
     id = 1537,
     words = "玩逼"
},
[1538] ={
     id = 1538,
     words = "玩穴"
},
[1539] ={
     id = 1539,
     words = "汪岷"
},
[1540] ={
     id = 1540,
     words = "王八"
},
[1541] ={
     id = 1541,
     words = "王策"
},
[1542] ={
     id = 1542,
     words = "网爱"
},
[1543] ={
     id = 1543,
     words = "網愛"
},
[1544] ={
     id = 1544,
     words = "網管"
},
[1545] ={
     id = 1545,
     words = "猥亵"
},
[1546] ={
     id = 1546,
     words = "猥褻"
},
[1547] ={
     id = 1547,
     words = "温B"
},
[1548] ={
     id = 1548,
     words = "温逼"
},
[1549] ={
     id = 1549,
     words = "温比"
},
[1550] ={
     id = 1550,
     words = "溫B"
},
[1551] ={
     id = 1551,
     words = "溫逼"
},
[1552] ={
     id = 1552,
     words = "溫比"
},
[1553] ={
     id = 1553,
     words = "瘟B"
},
[1554] ={
     id = 1554,
     words = "瘟比"
},
[1555] ={
     id = 1555,
     words = "我草"
},
[1556] ={
     id = 1556,
     words = "我幹"
},
[1557] ={
     id = 1557,
     words = "我考"
},
[1558] ={
     id = 1558,
     words = "我靠"
},
[1559] ={
     id = 1559,
     words = "无界"
},
[1560] ={
     id = 1560,
     words = "吸精"
},
[1561] ={
     id = 1561,
     words = "下贱"
},
[1562] ={
     id = 1562,
     words = "下賤"
},
[1563] ={
     id = 1563,
     words = "下流"
},
[1564] ={
     id = 1564,
     words = "下身"
},
[1565] ={
     id = 1565,
     words = "下体"
},
[1566] ={
     id = 1566,
     words = "下體"
},
[1567] ={
     id = 1567,
     words = "下阴"
},
[1568] ={
     id = 1568,
     words = "下陰"
},
[1569] ={
     id = 1569,
     words = "下作"
},
[1570] ={
     id = 1570,
     words = "夏樹"
},
[1571] ={
     id = 1571,
     words = "仙剑"
},
[1572] ={
     id = 1572,
     words = "仙劍"
},
[1573] ={
     id = 1573,
     words = "仙靠"
},
[1574] ={
     id = 1574,
     words = "鮮族"
},
[1575] ={
     id = 1575,
     words = "藓鲍"
},
[1576] ={
     id = 1576,
     words = "蘚鮑"
},
[1577] ={
     id = 1577,
     words = "相奸"
},
[1578] ={
     id = 1578,
     words = "嚮導"
},
[1579] ={
     id = 1579,
     words = "小B"
},
[1580] ={
     id = 1580,
     words = "小逼"
},
[1581] ={
     id = 1581,
     words = "小便"
},
[1582] ={
     id = 1582,
     words = "肖强"
},
[1583] ={
     id = 1583,
     words = "歇b"
},
[1584] ={
     id = 1584,
     words = "歇逼"
},
[1585] ={
     id = 1585,
     words = "新黨"
},
[1586] ={
     id = 1586,
     words = "信仰"
},
[1587] ={
     id = 1587,
     words = "星云"
},
[1588] ={
     id = 1588,
     words = "行房"
},
[1589] ={
     id = 1589,
     words = "邢铮"
},
[1590] ={
     id = 1590,
     words = "幸存"
},
[1591] ={
     id = 1591,
     words = "性愛"
},
[1592] ={
     id = 1592,
     words = "性病"
},
[1593] ={
     id = 1593,
     words = "性虎"
},
[1594] ={
     id = 1594,
     words = "性奴"
},
[1595] ={
     id = 1595,
     words = "性器"
},
[1596] ={
     id = 1596,
     words = "性情"
},
[1597] ={
     id = 1597,
     words = "性趣"
},
[1598] ={
     id = 1598,
     words = "性息"
},
[1599] ={
     id = 1599,
     words = "性佣"
},
[1600] ={
     id = 1600,
     words = "性傭"
},
[1601] ={
     id = 1601,
     words = "倖存"
},
[1602] ={
     id = 1602,
     words = "胸部"
},
[1603] ={
     id = 1603,
     words = "胸垫"
},
[1604] ={
     id = 1604,
     words = "胸罩"
},
[1605] ={
     id = 1605,
     words = "熊炎"
},
[1606] ={
     id = 1606,
     words = "熊焱"
},
[1607] ={
     id = 1607,
     words = "畜生"
},
[1608] ={
     id = 1608,
     words = "薛伟"
},
[1609] ={
     id = 1609,
     words = "穴海"
},
[1610] ={
     id = 1610,
     words = "穴口"
},
[1611] ={
     id = 1611,
     words = "穴爽"
},
[1612] ={
     id = 1612,
     words = "穴图"
},
[1613] ={
     id = 1613,
     words = "穴圖"
},
[1614] ={
     id = 1614,
     words = "穴淫"
},
[1615] ={
     id = 1615,
     words = "学联"
},
[1616] ={
     id = 1616,
     words = "學潮"
},
[1617] ={
     id = 1617,
     words = "血B"
},
[1618] ={
     id = 1618,
     words = "血比"
},
[1619] ={
     id = 1619,
     words = "血洒"
},
[1620] ={
     id = 1620,
     words = "血灑"
},
[1621] ={
     id = 1621,
     words = "血洗"
},
[1622] ={
     id = 1622,
     words = "寻仙"
},
[1623] ={
     id = 1623,
     words = "尋仙"
},
[1624] ={
     id = 1624,
     words = "压制"
},
[1625] ={
     id = 1625,
     words = "鸭店"
},
[1626] ={
     id = 1626,
     words = "鴉片"
},
[1627] ={
     id = 1627,
     words = "壓迫"
},
[1628] ={
     id = 1628,
     words = "壓制"
},
[1629] ={
     id = 1629,
     words = "亚情"
},
[1630] ={
     id = 1630,
     words = "亞情"
},
[1631] ={
     id = 1631,
     words = "烟膏"
},
[1632] ={
     id = 1632,
     words = "煙膏"
},
[1633] ={
     id = 1633,
     words = "岩崎"
},
[1634] ={
     id = 1634,
     words = "阎安"
},
[1635] ={
     id = 1635,
     words = "颜骑"
},
[1636] ={
     id = 1636,
     words = "顏騎"
},
[1637] ={
     id = 1637,
     words = "顏射"
},
[1638] ={
     id = 1638,
     words = "掩埋"
},
[1639] ={
     id = 1639,
     words = "艳尻"
},
[1640] ={
     id = 1640,
     words = "艳乳"
},
[1641] ={
     id = 1641,
     words = "艳照"
},
[1642] ={
     id = 1642,
     words = "豔乳"
},
[1643] ={
     id = 1643,
     words = "豔照"
},
[1644] ={
     id = 1644,
     words = "扬震"
},
[1645] ={
     id = 1645,
     words = "阳萎"
},
[1646] ={
     id = 1646,
     words = "杨巍"
},
[1647] ={
     id = 1647,
     words = "杨勇"
},
[1648] ={
     id = 1648,
     words = "杨振"
},
[1649] ={
     id = 1649,
     words = "杨震"
},
[1650] ={
     id = 1650,
     words = "杨周"
},
[1651] ={
     id = 1651,
     words = "陽精"
},
[1652] ={
     id = 1652,
     words = "陽具"
},
[1653] ={
     id = 1653,
     words = "陽萎"
},
[1654] ={
     id = 1654,
     words = "陽痿"
},
[1655] ={
     id = 1655,
     words = "陽物"
},
[1656] ={
     id = 1656,
     words = "野合"
},
[1657] ={
     id = 1657,
     words = "一党"
},
[1658] ={
     id = 1658,
     words = "一黨"
},
[1659] ={
     id = 1659,
     words = "阴屄"
},
[1660] ={
     id = 1660,
     words = "阴缔"
},
[1661] ={
     id = 1661,
     words = "阴阜"
},
[1662] ={
     id = 1662,
     words = "阴沟"
},
[1663] ={
     id = 1663,
     words = "阴莖"
},
[1664] ={
     id = 1664,
     words = "阴精"
},
[1665] ={
     id = 1665,
     words = "阴囊"
},
[1666] ={
     id = 1666,
     words = "阴穴"
},
[1667] ={
     id = 1667,
     words = "陰屄"
},
[1668] ={
     id = 1668,
     words = "陰部"
},
[1669] ={
     id = 1669,
     words = "陰蒂"
},
[1670] ={
     id = 1670,
     words = "陰締"
},
[1671] ={
     id = 1671,
     words = "陰阜"
},
[1672] ={
     id = 1672,
     words = "陰核"
},
[1673] ={
     id = 1673,
     words = "陰茎"
},
[1674] ={
     id = 1674,
     words = "陰莖"
},
[1675] ={
     id = 1675,
     words = "陰精"
},
[1676] ={
     id = 1676,
     words = "陰毛"
},
[1677] ={
     id = 1677,
     words = "陰門"
},
[1678] ={
     id = 1678,
     words = "陰囊"
},
[1679] ={
     id = 1679,
     words = "陰水"
},
[1680] ={
     id = 1680,
     words = "淫B"
},
[1681] ={
     id = 1681,
     words = "淫屄"
},
[1682] ={
     id = 1682,
     words = "淫逼"
},
[1683] ={
     id = 1683,
     words = "淫痴"
},
[1684] ={
     id = 1684,
     words = "淫癡"
},
[1685] ={
     id = 1685,
     words = "淫虫"
},
[1686] ={
     id = 1686,
     words = "淫蟲"
},
[1687] ={
     id = 1687,
     words = "淫蕩"
},
[1688] ={
     id = 1688,
     words = "淫店"
},
[1689] ={
     id = 1689,
     words = "淫妇"
},
[1690] ={
     id = 1690,
     words = "淫婦"
},
[1691] ={
     id = 1691,
     words = "淫棍"
},
[1692] ={
     id = 1692,
     words = "淫河"
},
[1693] ={
     id = 1693,
     words = "淫穢"
},
[1694] ={
     id = 1694,
     words = "淫貨"
},
[1695] ={
     id = 1695,
     words = "淫奸"
},
[1696] ={
     id = 1696,
     words = "淫賤"
},
[1697] ={
     id = 1697,
     words = "淫浆"
},
[1698] ={
     id = 1698,
     words = "淫漿"
},
[1699] ={
     id = 1699,
     words = "淫姐"
},
[1700] ={
     id = 1700,
     words = "淫浪"
},
[1701] ={
     id = 1701,
     words = "淫流"
},
[1702] ={
     id = 1702,
     words = "淫亂"
},
[1703] ={
     id = 1703,
     words = "淫妹"
},
[1704] ={
     id = 1704,
     words = "淫糜"
},
[1705] ={
     id = 1705,
     words = "淫蜜"
},
[1706] ={
     id = 1706,
     words = "淫魔"
},
[1707] ={
     id = 1707,
     words = "淫母"
},
[1708] ={
     id = 1708,
     words = "淫娘"
},
[1709] ={
     id = 1709,
     words = "淫妞"
},
[1710] ={
     id = 1710,
     words = "淫奴"
},
[1711] ={
     id = 1711,
     words = "淫女"
},
[1712] ={
     id = 1712,
     words = "淫虐"
},
[1713] ={
     id = 1713,
     words = "淫妻"
},
[1714] ={
     id = 1714,
     words = "淫腔"
},
[1715] ={
     id = 1715,
     words = "淫情"
},
[1716] ={
     id = 1716,
     words = "淫色"
},
[1717] ={
     id = 1717,
     words = "淫书"
},
[1718] ={
     id = 1718,
     words = "淫書"
},
[1719] ={
     id = 1719,
     words = "淫图"
},
[1720] ={
     id = 1720,
     words = "淫圖"
},
[1721] ={
     id = 1721,
     words = "淫网"
},
[1722] ={
     id = 1722,
     words = "淫西"
},
[1723] ={
     id = 1723,
     words = "淫样"
},
[1724] ={
     id = 1724,
     words = "淫樣"
},
[1725] ={
     id = 1725,
     words = "淫贼"
},
[1726] ={
     id = 1726,
     words = "应招"
},
[1727] ={
     id = 1727,
     words = "应召"
},
[1728] ={
     id = 1728,
     words = "罌粟"
},
[1729] ={
     id = 1729,
     words = "友惠"
},
[1730] ={
     id = 1730,
     words = "幼B"
},
[1731] ={
     id = 1731,
     words = "幼逼"
},
[1732] ={
     id = 1732,
     words = "幼齿"
},
[1733] ={
     id = 1733,
     words = "幼妓"
},
[1734] ={
     id = 1734,
     words = "幼交"
},
[1735] ={
     id = 1735,
     words = "幼男"
},
[1736] ={
     id = 1736,
     words = "幼女"
},
[1737] ={
     id = 1737,
     words = "幼图"
},
[1738] ={
     id = 1738,
     words = "幼圖"
},
[1739] ={
     id = 1739,
     words = "诱奸"
},
[1740] ={
     id = 1740,
     words = "誘姦"
},
[1741] ={
     id = 1741,
     words = "玉乳"
},
[1742] ={
     id = 1742,
     words = "玉穴"
},
[1743] ={
     id = 1743,
     words = "浴尿"
},
[1744] ={
     id = 1744,
     words = "曰本"
},
[1745] ={
     id = 1745,
     words = "雜種"
},
[1746] ={
     id = 1746,
     words = "早洩"
},
[1747] ={
     id = 1747,
     words = "造爱"
},
[1748] ={
     id = 1748,
     words = "造愛"
},
[1749] ={
     id = 1749,
     words = "则民"
},
[1750] ={
     id = 1750,
     words = "择民"
},
[1751] ={
     id = 1751,
     words = "泽民"
},
[1752] ={
     id = 1752,
     words = "贼民"
},
[1753] ={
     id = 1753,
     words = "招鸡"
},
[1754] ={
     id = 1754,
     words = "招雞"
},
[1755] ={
     id = 1755,
     words = "招妓"
},
[1756] ={
     id = 1756,
     words = "贞操"
},
[1757] ={
     id = 1757,
     words = "貞操"
},
[1758] ={
     id = 1758,
     words = "姫辱"
},
[1759] ={
     id = 1759,
     words = "政變"
},
[1760] ={
     id = 1760,
     words = "知障"
},
[1761] ={
     id = 1761,
     words = "智障"
},
[1762] ={
     id = 1762,
     words = "中出"
},
[1763] ={
     id = 1763,
     words = "中奖"
},
[1764] ={
     id = 1764,
     words = "中獎"
},
[1765] ={
     id = 1765,
     words = "朱毛"
},
[1766] ={
     id = 1766,
     words = "豬操"
},
[1767] ={
     id = 1767,
     words = "梓霖"
},
[1768] ={
     id = 1768,
     words = "紫黛"
},
[1769] ={
     id = 1769,
     words = "自残"
},
[1770] ={
     id = 1770,
     words = "自慰"
},
[1771] ={
     id = 1771,
     words = "鑽插"
},
[1772] ={
     id = 1772,
     words = "钻插"
},
[1773] ={
     id = 1773,
     words = "作愛"
},
[1774] ={
     id = 1774,
     words = "坐脸"
},
[1775] ={
     id = 1775,
     words = "坐台"
},
[1776] ={
     id = 1776,
     words = "做愛"
},
[1777] ={
     id = 1777,
     words = "做鸡"
},
[1778] ={
     id = 1778,
     words = "做雞"
},
[1779] ={
     id = 1779,
     words = "做鸭"
},
[1780] ={
     id = 1780,
     words = "做鴨"
},
[1781] ={
     id = 1781,
     words = "安街逆"
},
[1782] ={
     id = 1782,
     words = "安门事"
},
[1783] ={
     id = 1783,
     words = "安眠藥"
},
[1784] ={
     id = 1784,
     words = "八九民"
},
[1785] ={
     id = 1785,
     words = "八九学"
},
[1786] ={
     id = 1786,
     words = "罢工门"
},
[1787] ={
     id = 1787,
     words = "败培训"
},
[1788] ={
     id = 1788,
     words = "办本科"
},
[1789] ={
     id = 1789,
     words = "办文凭"
},
[1790] ={
     id = 1790,
     words = "半刺刀"
},
[1791] ={
     id = 1791,
     words = "辦毕业"
},
[1792] ={
     id = 1792,
     words = "爆发骚"
},
[1793] ={
     id = 1793,
     words = "被打死"
},
[1794] ={
     id = 1794,
     words = "被中共"
},
[1795] ={
     id = 1795,
     words = "本无码"
},
[1796] ={
     id = 1796,
     words = "毕业證"
},
[1797] ={
     id = 1797,
     words = "变牌绝"
},
[1798] ={
     id = 1798,
     words = "冰火毒"
},
[1799] ={
     id = 1799,
     words = "冰火佳"
},
[1800] ={
     id = 1800,
     words = "冰火漫"
},
[1801] ={
     id = 1801,
     words = "冰淫传"
},
[1802] ={
     id = 1802,
     words = "波推龙"
},
[1803] ={
     id = 1803,
     words = "博彩娱"
},
[1804] ={
     id = 1804,
     words = "不查都"
},
[1805] ={
     id = 1805,
     words = "不查全"
},
[1806] ={
     id = 1806,
     words = "采花堂"
},
[1807] ={
     id = 1807,
     words = "踩踏事"
},
[1808] ={
     id = 1808,
     words = "苍山兰"
},
[1809] ={
     id = 1809,
     words = "苍蝇水"
},
[1810] ={
     id = 1810,
     words = "藏春阁"
},
[1811] ={
     id = 1811,
     words = "操了嫂"
},
[1812] ={
     id = 1812,
     words = "操嫂子"
},
[1813] ={
     id = 1813,
     words = "插屁屁"
},
[1814] ={
     id = 1814,
     words = "察象蚂"
},
[1815] ={
     id = 1815,
     words = "拆迁灭"
},
[1816] ={
     id = 1816,
     words = "车牌隐"
},
[1817] ={
     id = 1817,
     words = "成人电"
},
[1818] ={
     id = 1818,
     words = "成人聊"
},
[1819] ={
     id = 1819,
     words = "成人片"
},
[1820] ={
     id = 1820,
     words = "成人视"
},
[1821] ={
     id = 1821,
     words = "成人图"
},
[1822] ={
     id = 1822,
     words = "成人文"
},
[1823] ={
     id = 1823,
     words = "成人小"
},
[1824] ={
     id = 1824,
     words = "城管灭"
},
[1825] ={
     id = 1825,
     words = "惩公安"
},
[1826] ={
     id = 1826,
     words = "惩贪难"
},
[1827] ={
     id = 1827,
     words = "充气娃"
},
[1828] ={
     id = 1828,
     words = "冲凉死"
},
[1829] ={
     id = 1829,
     words = "出售军"
},
[1830] ={
     id = 1830,
     words = "纯度白"
},
[1831] ={
     id = 1831,
     words = "纯度黄"
},
[1832] ={
     id = 1832,
     words = "催眠水"
},
[1833] ={
     id = 1833,
     words = "催情粉"
},
[1834] ={
     id = 1834,
     words = "催情药"
},
[1835] ={
     id = 1835,
     words = "催情藥"
},
[1836] ={
     id = 1836,
     words = "答案包"
},
[1837] ={
     id = 1837,
     words = "打标语"
},
[1838] ={
     id = 1838,
     words = "打错门"
},
[1839] ={
     id = 1839,
     words = "打死人"
},
[1840] ={
     id = 1840,
     words = "大鸡巴"
},
[1841] ={
     id = 1841,
     words = "大雞巴"
},
[1842] ={
     id = 1842,
     words = "大纪元"
},
[1843] ={
     id = 1843,
     words = "大揭露"
},
[1844] ={
     id = 1844,
     words = "大奶子"
},
[1845] ={
     id = 1845,
     words = "大肉棒"
},
[1846] ={
     id = 1846,
     words = "大嘴歌"
},
[1847] ={
     id = 1847,
     words = "代办各"
},
[1848] ={
     id = 1848,
     words = "代办文"
},
[1849] ={
     id = 1849,
     words = "代办学"
},
[1850] ={
     id = 1850,
     words = "代办制"
},
[1851] ={
     id = 1851,
     words = "代表烦"
},
[1852] ={
     id = 1852,
     words = "代您考"
},
[1853] ={
     id = 1853,
     words = "代写毕"
},
[1854] ={
     id = 1854,
     words = "代写论"
},
[1855] ={
     id = 1855,
     words = "贷借款"
},
[1856] ={
     id = 1856,
     words = "戴海静"
},
[1857] ={
     id = 1857,
     words = "党的官"
},
[1858] ={
     id = 1858,
     words = "党后萎"
},
[1859] ={
     id = 1859,
     words = "导叫失"
},
[1860] ={
     id = 1860,
     words = "导人最"
},
[1861] ={
     id = 1861,
     words = "导小商"
},
[1862] ={
     id = 1862,
     words = "到花心"
},
[1863] ={
     id = 1863,
     words = "得财兼"
},
[1864] ={
     id = 1864,
     words = "的同修"
},
[1865] ={
     id = 1865,
     words = "灯草和"
},
[1866] ={
     id = 1866,
     words = "等级證"
},
[1867] ={
     id = 1867,
     words = "等屁民"
},
[1868] ={
     id = 1868,
     words = "邓玉娇"
},
[1869] ={
     id = 1869,
     words = "地震哥"
},
[1870] ={
     id = 1870,
     words = "递纸死"
},
[1871] ={
     id = 1871,
     words = "电话监"
},
[1872] ={
     id = 1872,
     words = "甸果敢"
},
[1873] ={
     id = 1873,
     words = "蝶舞按"
},
[1874] ={
     id = 1874,
     words = "丁香社"
},
[1875] ={
     id = 1875,
     words = "丁子霖"
},
[1876] ={
     id = 1876,
     words = "顶花心"
},
[1877] ={
     id = 1877,
     words = "东复活"
},
[1878] ={
     id = 1878,
     words = "东京热"
},
[1879] ={
     id = 1879,
     words = "東京熱"
},
[1880] ={
     id = 1880,
     words = "都当警"
},
[1881] ={
     id = 1881,
     words = "毒蛇钻"
},
[1882] ={
     id = 1882,
     words = "赌球网"
},
[1883] ={
     id = 1883,
     words = "短信截"
},
[1884] ={
     id = 1884,
     words = "多美康"
},
[1885] ={
     id = 1885,
     words = "躲猫猫"
},
[1886] ={
     id = 1886,
     words = "俄羅斯"
},
[1887] ={
     id = 1887,
     words = "恩氟烷"
},
[1888] ={
     id = 1888,
     words = "儿园惨"
},
[1889] ={
     id = 1889,
     words = "儿园砍"
},
[1890] ={
     id = 1890,
     words = "儿园杀"
},
[1891] ={
     id = 1891,
     words = "儿园凶"
},
[1892] ={
     id = 1892,
     words = "二奶大"
},
[1893] ={
     id = 1893,
     words = "发牌绝"
},
[1894] ={
     id = 1894,
     words = "发票出"
},
[1895] ={
     id = 1895,
     words = "发票代"
},
[1896] ={
     id = 1896,
     words = "发票销"
},
[1897] ={
     id = 1897,
     words = "法车仑"
},
[1898] ={
     id = 1898,
     words = "法伦功"
},
[1899] ={
     id = 1899,
     words = "法轮佛"
},
[1900] ={
     id = 1900,
     words = "法维权"
},
[1901] ={
     id = 1901,
     words = "法一轮"
},
[1902] ={
     id = 1902,
     words = "法正乾"
},
[1903] ={
     id = 1903,
     words = "反屏蔽"
},
[1904] ={
     id = 1904,
     words = "范燕琼"
},
[1905] ={
     id = 1905,
     words = "方迷香"
},
[1906] ={
     id = 1906,
     words = "仿真枪"
},
[1907] ={
     id = 1907,
     words = "仿真证"
},
[1908] ={
     id = 1908,
     words = "诽谤罪"
},
[1909] ={
     id = 1909,
     words = "费私服"
},
[1910] ={
     id = 1910,
     words = "封锁消"
},
[1911] ={
     id = 1911,
     words = "佛同修"
},
[1912] ={
     id = 1912,
     words = "福香巴"
},
[1913] ={
     id = 1913,
     words = "府包庇"
},
[1914] ={
     id = 1914,
     words = "妇销魂"
},
[1915] ={
     id = 1915,
     words = "附送枪"
},
[1916] ={
     id = 1916,
     words = "富民穷"
},
[1917] ={
     id = 1917,
     words = "感扑克"
},
[1918] ={
     id = 1918,
     words = "冈本真"
},
[1919] ={
     id = 1919,
     words = "岡本真"
},
[1920] ={
     id = 1920,
     words = "钢针狗"
},
[1921] ={
     id = 1921,
     words = "钢珠枪"
},
[1922] ={
     id = 1922,
     words = "港馬會"
},
[1923] ={
     id = 1923,
     words = "港鑫華"
},
[1924] ={
     id = 1924,
     words = "高考黑"
},
[1925] ={
     id = 1925,
     words = "高莺莺"
},
[1926] ={
     id = 1926,
     words = "搞媛交"
},
[1927] ={
     id = 1927,
     words = "告长期"
},
[1928] ={
     id = 1928,
     words = "告洋状"
},
[1929] ={
     id = 1929,
     words = "跟踪器"
},
[1930] ={
     id = 1930,
     words = "工力人"
},
[1931] ={
     id = 1931,
     words = "共王储"
},
[1932] ={
     id = 1932,
     words = "乖乖粉"
},
[1933] ={
     id = 1933,
     words = "官商勾"
},
[1934] ={
     id = 1934,
     words = "跪真相"
},
[1935] ={
     id = 1935,
     words = "国家妓"
},
[1936] ={
     id = 1936,
     words = "国库折"
},
[1937] ={
     id = 1937,
     words = "國內美"
},
[1938] ={
     id = 1938,
     words = "海访民"
},
[1939] ={
     id = 1939,
     words = "豪圈钱"
},
[1940] ={
     id = 1940,
     words = "和狗交"
},
[1941] ={
     id = 1941,
     words = "和狗性"
},
[1942] ={
     id = 1942,
     words = "和狗做"
},
[1943] ={
     id = 1943,
     words = "紅色恐"
},
[1944] ={
     id = 1944,
     words = "胡紧套"
},
[1945] ={
     id = 1945,
     words = "胡錦濤"
},
[1946] ={
     id = 1946,
     words = "胡适眼"
},
[1947] ={
     id = 1947,
     words = "胡耀邦"
},
[1948] ={
     id = 1948,
     words = "湖淫娘"
},
[1949] ={
     id = 1949,
     words = "虎头猎"
},
[1950] ={
     id = 1950,
     words = "华国锋"
},
[1951] ={
     id = 1951,
     words = "华门开"
},
[1952] ={
     id = 1952,
     words = "划老公"
},
[1953] ={
     id = 1953,
     words = "活不起"
},
[1954] ={
     id = 1954,
     words = "机号定"
},
[1955] ={
     id = 1955,
     words = "机号卫"
},
[1956] ={
     id = 1956,
     words = "机卡密"
},
[1957] ={
     id = 1957,
     words = "激情电"
},
[1958] ={
     id = 1958,
     words = "激情短"
},
[1959] ={
     id = 1959,
     words = "激情妹"
},
[1960] ={
     id = 1960,
     words = "激情炮"
},
[1961] ={
     id = 1961,
     words = "级办理"
},
[1962] ={
     id = 1962,
     words = "级答案"
},
[1963] ={
     id = 1963,
     words = "急需嫖"
},
[1964] ={
     id = 1964,
     words = "集体腐"
},
[1965] ={
     id = 1965,
     words = "挤乳汁"
},
[1966] ={
     id = 1966,
     words = "擠乳汁"
},
[1967] ={
     id = 1967,
     words = "甲虫跳"
},
[1968] ={
     id = 1968,
     words = "甲流了"
},
[1969] ={
     id = 1969,
     words = "奸成瘾"
},
[1970] ={
     id = 1970,
     words = "监听器"
},
[1971] ={
     id = 1971,
     words = "监听王"
},
[1972] ={
     id = 1972,
     words = "简易炸"
},
[1973] ={
     id = 1973,
     words = "江太上"
},
[1974] ={
     id = 1974,
     words = "江系人"
},
[1975] ={
     id = 1975,
     words = "江贼民"
},
[1976] ={
     id = 1976,
     words = "蒋彦永"
},
[1977] ={
     id = 1977,
     words = "叫自慰"
},
[1978] ={
     id = 1978,
     words = "揭贪难"
},
[1979] ={
     id = 1979,
     words = "姐包夜"
},
[1980] ={
     id = 1980,
     words = "姐服务"
},
[1981] ={
     id = 1981,
     words = "姐兼职"
},
[1982] ={
     id = 1982,
     words = "姐上门"
},
[1983] ={
     id = 1983,
     words = "金扎金"
},
[1984] ={
     id = 1984,
     words = "金钟气"
},
[1985] ={
     id = 1985,
     words = "津地震"
},
[1986] ={
     id = 1986,
     words = "京地震"
},
[1987] ={
     id = 1987,
     words = "警察被"
},
[1988] ={
     id = 1988,
     words = "警用品"
},
[1989] ={
     id = 1989,
     words = "径步枪"
},
[1990] ={
     id = 1990,
     words = "敬请忍"
},
[1991] ={
     id = 1991,
     words = "九评共"
},
[1992] ={
     id = 1992,
     words = "就爱插"
},
[1993] ={
     id = 1993,
     words = "就要色"
},
[1994] ={
     id = 1994,
     words = "举国体"
},
[1995] ={
     id = 1995,
     words = "绝食声"
},
[1996] ={
     id = 1996,
     words = "军品特"
},
[1997] ={
     id = 1997,
     words = "军用手"
},
[1998] ={
     id = 1998,
     words = "开邓选"
},
[1999] ={
     id = 1999,
     words = "砍杀幼"
},
[2000] ={
     id = 2000,
     words = "砍伤儿"
},
[2001] ={
     id = 2001,
     words = "康跳楼"
},
[2002] ={
     id = 2002,
     words = "考答案"
},
[2003] ={
     id = 2003,
     words = "考机构"
},
[2004] ={
     id = 2004,
     words = "考考邓"
},
[2005] ={
     id = 2005,
     words = "考联盟"
},
[2006] ={
     id = 2006,
     words = "考前答"
},
[2007] ={
     id = 2007,
     words = "考前付"
},
[2008] ={
     id = 2008,
     words = "考设备"
},
[2009] ={
     id = 2009,
     words = "考试保"
},
[2010] ={
     id = 2010,
     words = "考试枪"
},
[2011] ={
     id = 2011,
     words = "克分析"
},
[2012] ={
     id = 2012,
     words = "克千术"
},
[2013] ={
     id = 2013,
     words = "克透视"
},
[2014] ={
     id = 2014,
     words = "孔摄像"
},
[2015] ={
     id = 2015,
     words = "控制媒"
},
[2016] ={
     id = 2016,
     words = "口手枪"
},
[2017] ={
     id = 2017,
     words = "骷髅死"
},
[2018] ={
     id = 2018,
     words = "快速办"
},
[2019] ={
     id = 2019,
     words = "拉登说"
},
[2020] ={
     id = 2020,
     words = "来福猎"
},
[2021] ={
     id = 2021,
     words = "拦截器"
},
[2022] ={
     id = 2022,
     words = "老虎机"
},
[2023] ={
     id = 2023,
     words = "黎阳平"
},
[2024] ={
     id = 2024,
     words = "李洪志"
},
[2025] ={
     id = 2025,
     words = "李咏曰"
},
[2026] ={
     id = 2026,
     words = "理证件"
},
[2027] ={
     id = 2027,
     words = "力月西"
},
[2028] ={
     id = 2028,
     words = "丽媛离"
},
[2029] ={
     id = 2029,
     words = "利他林"
},
[2030] ={
     id = 2030,
     words = "连发手"
},
[2031] ={
     id = 2031,
     words = "聯繫電"
},
[2032] ={
     id = 2032,
     words = "炼大法"
},
[2033] ={
     id = 2033,
     words = "两会代"
},
[2034] ={
     id = 2034,
     words = "聊视频"
},
[2035] ={
     id = 2035,
     words = "聊斋艳"
},
[2036] ={
     id = 2036,
     words = "猎枪销"
},
[2037] ={
     id = 2037,
     words = "领土拿"
},
[2038] ={
     id = 2038,
     words = "流血事"
},
[2039] ={
     id = 2039,
     words = "六合彩"
},
[2040] ={
     id = 2040,
     words = "六四事"
},
[2041] ={
     id = 2041,
     words = "隆手指"
},
[2042] ={
     id = 2042,
     words = "陆封锁"
},
[2043] ={
     id = 2043,
     words = "陆同修"
},
[2044] ={
     id = 2044,
     words = "氯胺酮"
},
[2045] ={
     id = 2045,
     words = "乱伦类"
},
[2046] ={
     id = 2046,
     words = "乱伦小"
},
[2047] ={
     id = 2047,
     words = "伦理大"
},
[2048] ={
     id = 2048,
     words = "伦理毛"
},
[2049] ={
     id = 2049,
     words = "伦理片"
},
[2050] ={
     id = 2050,
     words = "轮手枪"
},
[2051] ={
     id = 2051,
     words = "论文代"
},
[2052] ={
     id = 2052,
     words = "裸聊网"
},
[2053] ={
     id = 2053,
     words = "裸舞视"
},
[2054] ={
     id = 2054,
     words = "落霞缀"
},
[2055] ={
     id = 2055,
     words = "麻果配"
},
[2056] ={
     id = 2056,
     words = "麻果丸"
},
[2057] ={
     id = 2057,
     words = "麻将透"
},
[2058] ={
     id = 2058,
     words = "麻醉狗"
},
[2059] ={
     id = 2059,
     words = "麻醉枪"
},
[2060] ={
     id = 2060,
     words = "麻醉槍"
},
[2061] ={
     id = 2061,
     words = "麻醉藥"
},
[2062] ={
     id = 2062,
     words = "卖发票"
},
[2063] ={
     id = 2063,
     words = "卖自考"
},
[2064] ={
     id = 2064,
     words = "漫步丝"
},
[2065] ={
     id = 2065,
     words = "忙爱国"
},
[2066] ={
     id = 2066,
     words = "毛一鲜"
},
[2067] ={
     id = 2067,
     words = "妹按摩"
},
[2068] ={
     id = 2068,
     words = "妹上门"
},
[2069] ={
     id = 2069,
     words = "门按摩"
},
[2070] ={
     id = 2070,
     words = "门保健"
},
[2071] ={
     id = 2071,
     words = "門服務"
},
[2072] ={
     id = 2072,
     words = "氓培训"
},
[2073] ={
     id = 2073,
     words = "蒙汗药"
},
[2074] ={
     id = 2074,
     words = "迷幻型"
},
[2075] ={
     id = 2075,
     words = "迷幻药"
},
[2076] ={
     id = 2076,
     words = "迷幻藥"
},
[2077] ={
     id = 2077,
     words = "迷昏口"
},
[2078] ={
     id = 2078,
     words = "迷昏药"
},
[2079] ={
     id = 2079,
     words = "迷昏藥"
},
[2080] ={
     id = 2080,
     words = "迷魂香"
},
[2081] ={
     id = 2081,
     words = "迷魂药"
},
[2082] ={
     id = 2082,
     words = "迷魂藥"
},
[2083] ={
     id = 2083,
     words = "迷奸药"
},
[2084] ={
     id = 2084,
     words = "迷情水"
},
[2085] ={
     id = 2085,
     words = "迷情药"
},
[2086] ={
     id = 2086,
     words = "谜奸药"
},
[2087] ={
     id = 2087,
     words = "灭绝罪"
},
[2088] ={
     id = 2088,
     words = "民储害"
},
[2089] ={
     id = 2089,
     words = "民抗议"
},
[2090] ={
     id = 2090,
     words = "明慧网"
},
[2091] ={
     id = 2091,
     words = "摩小姐"
},
[2092] ={
     id = 2092,
     words = "母乳家"
},
[2093] ={
     id = 2093,
     words = "木齐针"
},
[2094] ={
     id = 2094,
     words = "幕前戲"
},
[2095] ={
     id = 2095,
     words = "南充针"
},
[2096] ={
     id = 2096,
     words = "拟涛哥"
},
[2097] ={
     id = 2097,
     words = "妞上门"
},
[2098] ={
     id = 2098,
     words = "女激情"
},
[2099] ={
     id = 2099,
     words = "女技师"
},
[2100] ={
     id = 2100,
     words = "女上门"
},
[2101] ={
     id = 2101,
     words = "鸥之歌"
},
[2102] ={
     id = 2102,
     words = "拍肩型"
},
[2103] ={
     id = 2103,
     words = "牌分析"
},
[2104] ={
     id = 2104,
     words = "牌技网"
},
[2105] ={
     id = 2105,
     words = "陪考枪"
},
[2106] ={
     id = 2106,
     words = "配有消"
},
[2107] ={
     id = 2107,
     words = "嫖俄罗"
},
[2108] ={
     id = 2108,
     words = "平惨案"
},
[2109] ={
     id = 2109,
     words = "普通嘌"
},
[2110] ={
     id = 2110,
     words = "期货配"
},
[2111] ={
     id = 2111,
     words = "奇淫散"
},
[2112] ={
     id = 2112,
     words = "枪出售"
},
[2113] ={
     id = 2113,
     words = "枪的参"
},
[2114] ={
     id = 2114,
     words = "枪的分"
},
[2115] ={
     id = 2115,
     words = "枪的结"
},
[2116] ={
     id = 2116,
     words = "枪的制"
},
[2117] ={
     id = 2117,
     words = "枪货到"
},
[2118] ={
     id = 2118,
     words = "枪手队"
},
[2119] ={
     id = 2119,
     words = "枪手网"
},
[2120] ={
     id = 2120,
     words = "枪销售"
},
[2121] ={
     id = 2121,
     words = "枪械制"
},
[2122] ={
     id = 2122,
     words = "枪子弹"
},
[2123] ={
     id = 2123,
     words = "切听器"
},
[2124] ={
     id = 2124,
     words = "窃听器"
},
[2125] ={
     id = 2125,
     words = "勤捞致"
},
[2126] ={
     id = 2126,
     words = "氢弹手"
},
[2127] ={
     id = 2127,
     words = "清純壆"
},
[2128] ={
     id = 2128,
     words = "情妹妹"
},
[2129] ={
     id = 2129,
     words = "情视频"
},
[2130] ={
     id = 2130,
     words = "情自拍"
},
[2131] ={
     id = 2131,
     words = "氰化钾"
},
[2132] ={
     id = 2132,
     words = "氰化钠"
},
[2133] ={
     id = 2133,
     words = "请集会"
},
[2134] ={
     id = 2134,
     words = "请示威"
},
[2135] ={
     id = 2135,
     words = "琼花问"
},
[2136] ={
     id = 2136,
     words = "娶韩国"
},
[2137] ={
     id = 2137,
     words = "全真证"
},
[2138] ={
     id = 2138,
     words = "群奸暴"
},
[2139] ={
     id = 2139,
     words = "惹的国"
},
[2140] ={
     id = 2140,
     words = "人权律"
},
[2141] ={
     id = 2141,
     words = "人体艺"
},
[2142] ={
     id = 2142,
     words = "人游行"
},
[2143] ={
     id = 2143,
     words = "人真钱"
},
[2144] ={
     id = 2144,
     words = "认牌绝"
},
[2145] ={
     id = 2145,
     words = "柔胸粉"
},
[2146] ={
     id = 2146,
     words = "如厕死"
},
[2147] ={
     id = 2147,
     words = "赛后骚"
},
[2148] ={
     id = 2148,
     words = "三级片"
},
[2149] ={
     id = 2149,
     words = "三秒倒"
},
[2150] ={
     id = 2150,
     words = "三网友"
},
[2151] ={
     id = 2151,
     words = "色电影"
},
[2152] ={
     id = 2152,
     words = "色妹妹"
},
[2153] ={
     id = 2153,
     words = "色视频"
},
[2154] ={
     id = 2154,
     words = "色小说"
},
[2155] ={
     id = 2155,
     words = "杀指南"
},
[2156] ={
     id = 2156,
     words = "山涉黑"
},
[2157] ={
     id = 2157,
     words = "上门激"
},
[2158] ={
     id = 2158,
     words = "烧瓶的"
},
[2159] ={
     id = 2159,
     words = "韶关斗"
},
[2160] ={
     id = 2160,
     words = "韶关玩"
},
[2161] ={
     id = 2161,
     words = "韶关旭"
},
[2162] ={
     id = 2162,
     words = "射网枪"
},
[2163] ={
     id = 2163,
     words = "深喉冰"
},
[2164] ={
     id = 2164,
     words = "神七假"
},
[2165] ={
     id = 2165,
     words = "生被砍"
},
[2166] ={
     id = 2166,
     words = "生踩踏"
},
[2167] ={
     id = 2167,
     words = "失身水"
},
[2168] ={
     id = 2168,
     words = "失意药"
},
[2169] ={
     id = 2169,
     words = "狮子旗"
},
[2170] ={
     id = 2170,
     words = "十八等"
},
[2171] ={
     id = 2171,
     words = "十大谎"
},
[2172] ={
     id = 2172,
     words = "十大禁"
},
[2173] ={
     id = 2173,
     words = "实体娃"
},
[2174] ={
     id = 2174,
     words = "式粉推"
},
[2175] ={
     id = 2175,
     words = "视解密"
},
[2176] ={
     id = 2176,
     words = "是躲猫"
},
[2177] ={
     id = 2177,
     words = "手变牌"
},
[2178] ={
     id = 2178,
     words = "手答案"
},
[2179] ={
     id = 2179,
     words = "手机跟"
},
[2180] ={
     id = 2180,
     words = "手机监"
},
[2181] ={
     id = 2181,
     words = "手机窃"
},
[2182] ={
     id = 2182,
     words = "手机追"
},
[2183] ={
     id = 2183,
     words = "手拉鸡"
},
[2184] ={
     id = 2184,
     words = "手木仓"
},
[2185] ={
     id = 2185,
     words = "售步枪"
},
[2186] ={
     id = 2186,
     words = "售纯度"
},
[2187] ={
     id = 2187,
     words = "售单管"
},
[2188] ={
     id = 2188,
     words = "售防身"
},
[2189] ={
     id = 2189,
     words = "售狗子"
},
[2190] ={
     id = 2190,
     words = "售虎头"
},
[2191] ={
     id = 2191,
     words = "售火药"
},
[2192] ={
     id = 2192,
     words = "售假币"
},
[2193] ={
     id = 2193,
     words = "售健卫"
},
[2194] ={
     id = 2194,
     words = "售军用"
},
[2195] ={
     id = 2195,
     words = "售猎枪"
},
[2196] ={
     id = 2196,
     words = "售氯胺"
},
[2197] ={
     id = 2197,
     words = "售麻醉"
},
[2198] ={
     id = 2198,
     words = "售冒名"
},
[2199] ={
     id = 2199,
     words = "售枪支"
},
[2200] ={
     id = 2200,
     words = "售热武"
},
[2201] ={
     id = 2201,
     words = "售三棱"
},
[2202] ={
     id = 2202,
     words = "售手枪"
},
[2203] ={
     id = 2203,
     words = "售五四"
},
[2204] ={
     id = 2204,
     words = "售信用"
},
[2205] ={
     id = 2205,
     words = "售子弹"
},
[2206] ={
     id = 2206,
     words = "售左轮"
},
[2207] ={
     id = 2207,
     words = "书办理"
},
[2208] ={
     id = 2208,
     words = "术牌具"
},
[2209] ={
     id = 2209,
     words = "双管立"
},
[2210] ={
     id = 2210,
     words = "双管平"
},
[2211] ={
     id = 2211,
     words = "水阎王"
},
[2212] ={
     id = 2212,
     words = "丝护士"
},
[2213] ={
     id = 2213,
     words = "丝情侣"
},
[2214] ={
     id = 2214,
     words = "丝袜保"
},
[2215] ={
     id = 2215,
     words = "丝袜恋"
},
[2216] ={
     id = 2216,
     words = "丝袜美"
},
[2217] ={
     id = 2217,
     words = "丝袜妹"
},
[2218] ={
     id = 2218,
     words = "丝袜网"
},
[2219] ={
     id = 2219,
     words = "丝足按"
},
[2220] ={
     id = 2220,
     words = "司法黑"
},
[2221] ={
     id = 2221,
     words = "四博会"
},
[2222] ={
     id = 2222,
     words = "四小码"
},
[2223] ={
     id = 2223,
     words = "素女心"
},
[2224] ={
     id = 2224,
     words = "速代办"
},
[2225] ={
     id = 2225,
     words = "速取证"
},
[2226] ={
     id = 2226,
     words = "蹋纳税"
},
[2227] ={
     id = 2227,
     words = "泰兴幼"
},
[2228] ={
     id = 2228,
     words = "泰州幼"
},
[2229] ={
     id = 2229,
     words = "探测狗"
},
[2230] ={
     id = 2230,
     words = "涛共产"
},
[2231] ={
     id = 2231,
     words = "特工资"
},
[2232] ={
     id = 2232,
     words = "特上门"
},
[2233] ={
     id = 2233,
     words = "替人体"
},
[2234] ={
     id = 2234,
     words = "天朝特"
},
[2235] ={
     id = 2235,
     words = "田罢工"
},
[2236] ={
     id = 2236,
     words = "田田桑"
},
[2237] ={
     id = 2237,
     words = "田停工"
},
[2238] ={
     id = 2238,
     words = "庭保养"
},
[2239] ={
     id = 2239,
     words = "偷電器"
},
[2240] ={
     id = 2240,
     words = "偷肃贪"
},
[2241] ={
     id = 2241,
     words = "偷听器"
},
[2242] ={
     id = 2242,
     words = "偷偷贪"
},
[2243] ={
     id = 2243,
     words = "头双管"
},
[2244] ={
     id = 2244,
     words = "透视镜"
},
[2245] ={
     id = 2245,
     words = "透视扑"
},
[2246] ={
     id = 2246,
     words = "透视器"
},
[2247] ={
     id = 2247,
     words = "透视药"
},
[2248] ={
     id = 2248,
     words = "透视仪"
},
[2249] ={
     id = 2249,
     words = "秃鹰汽"
},
[2250] ={
     id = 2250,
     words = "推油按"
},
[2251] ={
     id = 2251,
     words = "脱衣艳"
},
[2252] ={
     id = 2252,
     words = "瓦斯手"
},
[2253] ={
     id = 2253,
     words = "袜按摩"
},
[2254] ={
     id = 2254,
     words = "湾版假"
},
[2255] ={
     id = 2255,
     words = "王立军"
},
[2256] ={
     id = 2256,
     words = "王益案"
},
[2257] ={
     id = 2257,
     words = "网民案"
},
[2258] ={
     id = 2258,
     words = "网民诬"
},
[2259] ={
     id = 2259,
     words = "围攻警"
},
[2260] ={
     id = 2260,
     words = "维汉员"
},
[2261] ={
     id = 2261,
     words = "维权基"
},
[2262] ={
     id = 2262,
     words = "维权人"
},
[2263] ={
     id = 2263,
     words = "维权谈"
},
[2264] ={
     id = 2264,
     words = "委坐船"
},
[2265] ={
     id = 2265,
     words = "温家堡"
},
[2266] ={
     id = 2266,
     words = "温影帝"
},
[2267] ={
     id = 2267,
     words = "溫家寶"
},
[2268] ={
     id = 2268,
     words = "瘟加饱"
},
[2269] ={
     id = 2269,
     words = "瘟假饱"
},
[2270] ={
     id = 2270,
     words = "文凭证"
},
[2271] ={
     id = 2271,
     words = "纹了毛"
},
[2272] ={
     id = 2272,
     words = "闻封锁"
},
[2273] ={
     id = 2273,
     words = "乌蝇水"
},
[2274] ={
     id = 2274,
     words = "无码专"
},
[2275] ={
     id = 2275,
     words = "五套功"
},
[2276] ={
     id = 2276,
     words = "五月天"
},
[2277] ={
     id = 2277,
     words = "午夜电"
},
[2278] ={
     id = 2278,
     words = "午夜极"
},
[2279] ={
     id = 2279,
     words = "武警暴"
},
[2280] ={
     id = 2280,
     words = "武警殴"
},
[2281] ={
     id = 2281,
     words = "雾型迷"
},
[2282] ={
     id = 2282,
     words = "西藏限"
},
[2283] ={
     id = 2283,
     words = "习进平"
},
[2284] ={
     id = 2284,
     words = "习晋平"
},
[2285] ={
     id = 2285,
     words = "席复活"
},
[2286] ={
     id = 2286,
     words = "洗澡死"
},
[2287] ={
     id = 2287,
     words = "喜贪赃"
},
[2288] ={
     id = 2288,
     words = "限制言"
},
[2289] ={
     id = 2289,
     words = "陷害案"
},
[2290] ={
     id = 2290,
     words = "陷害罪"
},
[2291] ={
     id = 2291,
     words = "相自首"
},
[2292] ={
     id = 2292,
     words = "硝化甘"
},
[2293] ={
     id = 2293,
     words = "校骚乱"
},
[2294] ={
     id = 2294,
     words = "协晃悠"
},
[2295] ={
     id = 2295,
     words = "写两会"
},
[2296] ={
     id = 2296,
     words = "新建户"
},
[2297] ={
     id = 2297,
     words = "新疆叛"
},
[2298] ={
     id = 2298,
     words = "新疆限"
},
[2299] ={
     id = 2299,
     words = "新金瓶"
},
[2300] ={
     id = 2300,
     words = "新唐人"
},
[2301] ={
     id = 2301,
     words = "星上门"
},
[2302] ={
     id = 2302,
     words = "型手枪"
},
[2303] ={
     id = 2303,
     words = "姓忽悠"
},
[2304] ={
     id = 2304,
     words = "幸运码"
},
[2305] ={
     id = 2305,
     words = "性爱日"
},
[2306] ={
     id = 2306,
     words = "性福情"
},
[2307] ={
     id = 2307,
     words = "性感少"
},
[2308] ={
     id = 2308,
     words = "胸主席"
},
[2309] ={
     id = 2309,
     words = "徐玉元"
},
[2310] ={
     id = 2310,
     words = "学骚乱"
},
[2311] ={
     id = 2311,
     words = "学位證"
},
[2312] ={
     id = 2312,
     words = "學生妹"
},
[2313] ={
     id = 2313,
     words = "烟感器"
},
[2314] ={
     id = 2314,
     words = "严晓玲"
},
[2315] ={
     id = 2315,
     words = "言论罪"
},
[2316] ={
     id = 2316,
     words = "盐酸曲"
},
[2317] ={
     id = 2317,
     words = "恙虫病"
},
[2318] ={
     id = 2318,
     words = "要人权"
},
[2319] ={
     id = 2319,
     words = "要射了"
},
[2320] ={
     id = 2320,
     words = "要泄了"
},
[2321] ={
     id = 2321,
     words = "夜激情"
},
[2322] ={
     id = 2322,
     words = "液体炸"
},
[2323] ={
     id = 2323,
     words = "遗情书"
},
[2324] ={
     id = 2324,
     words = "蚁力神"
},
[2325] ={
     id = 2325,
     words = "益受贿"
},
[2326] ={
     id = 2326,
     words = "淫魔舞"
},
[2327] ={
     id = 2327,
     words = "淫情女"
},
[2328] ={
     id = 2328,
     words = "淫騷妹"
},
[2329] ={
     id = 2329,
     words = "淫兽学"
},
[2330] ={
     id = 2330,
     words = "隐形耳"
},
[2331] ={
     id = 2331,
     words = "应子弹"
},
[2332] ={
     id = 2332,
     words = "婴儿命"
},
[2333] ={
     id = 2333,
     words = "用手枪"
},
[2334] ={
     id = 2334,
     words = "幽谷三"
},
[2335] ={
     id = 2335,
     words = "游精佑"
},
[2336] ={
     id = 2336,
     words = "幼齿类"
},
[2337] ={
     id = 2337,
     words = "愚民同"
},
[2338] ={
     id = 2338,
     words = "愚民政"
},
[2339] ={
     id = 2339,
     words = "与狗性"
},
[2340] ={
     id = 2340,
     words = "玉蒲团"
},
[2341] ={
     id = 2341,
     words = "冤民大"
},
[2342] ={
     id = 2342,
     words = "鸳鸯洗"
},
[2343] ={
     id = 2343,
     words = "园惨案"
},
[2344] ={
     id = 2344,
     words = "园砍杀"
},
[2345] ={
     id = 2345,
     words = "园凶杀"
},
[2346] ={
     id = 2346,
     words = "园血案"
},
[2347] ={
     id = 2347,
     words = "原装弹"
},
[2348] ={
     id = 2348,
     words = "袁腾飞"
},
[2349] ={
     id = 2349,
     words = "晕倒型"
},
[2350] ={
     id = 2350,
     words = "韵徐娘"
},
[2351] ={
     id = 2351,
     words = "遭便衣"
},
[2352] ={
     id = 2352,
     words = "遭到警"
},
[2353] ={
     id = 2353,
     words = "遭警察"
},
[2354] ={
     id = 2354,
     words = "遭武警"
},
[2355] ={
     id = 2355,
     words = "择油录"
},
[2356] ={
     id = 2356,
     words = "曾道人"
},
[2357] ={
     id = 2357,
     words = "炸弹教"
},
[2358] ={
     id = 2358,
     words = "炸广州"
},
[2359] ={
     id = 2359,
     words = "炸立交"
},
[2360] ={
     id = 2360,
     words = "炸药配"
},
[2361] ={
     id = 2361,
     words = "炸药制"
},
[2362] ={
     id = 2362,
     words = "张春桥"
},
[2363] ={
     id = 2363,
     words = "找枪手"
},
[2364] ={
     id = 2364,
     words = "找援交"
},
[2365] ={
     id = 2365,
     words = "赵紫阳"
},
[2366] ={
     id = 2366,
     words = "针刺案"
},
[2367] ={
     id = 2367,
     words = "针刺伤"
},
[2368] ={
     id = 2368,
     words = "针刺事"
},
[2369] ={
     id = 2369,
     words = "针刺死"
},
[2370] ={
     id = 2370,
     words = "真善忍"
},
[2371] ={
     id = 2371,
     words = "证件办"
},
[2372] ={
     id = 2372,
     words = "证书办"
},
[2373] ={
     id = 2373,
     words = "政府操"
},
[2374] ={
     id = 2374,
     words = "政论区"
},
[2375] ={
     id = 2375,
     words = "植物冰"
},
[2376] ={
     id = 2376,
     words = "殖器护"
},
[2377] ={
     id = 2377,
     words = "指纹膜"
},
[2378] ={
     id = 2378,
     words = "指纹套"
},
[2379] ={
     id = 2379,
     words = "制服诱"
},
[2380] ={
     id = 2380,
     words = "制手枪"
},
[2381] ={
     id = 2381,
     words = "中共黑"
},
[2382] ={
     id = 2382,
     words = "众像羔"
},
[2383] ={
     id = 2383,
     words = "州惨案"
},
[2384] ={
     id = 2384,
     words = "州三箭"
},
[2385] ={
     id = 2385,
     words = "昼将近"
},
[2386] ={
     id = 2386,
     words = "主席忏"
},
[2387] ={
     id = 2387,
     words = "助考网"
},
[2388] ={
     id = 2388,
     words = "专业代"
},
[2389] ={
     id = 2389,
     words = "专业助"
},
[2390] ={
     id = 2390,
     words = "装弹甲"
},
[2391] ={
     id = 2391,
     words = "装枪套"
},
[2392] ={
     id = 2392,
     words = "装消音"
},
[2393] ={
     id = 2393,
     words = "着涛哥"
},
[2394] ={
     id = 2394,
     words = "资格證"
},
[2395] ={
     id = 2395,
     words = "资料泄"
},
[2396] ={
     id = 2396,
     words = "字牌汽"
},
[2397] ={
     id = 2397,
     words = "自慰用"
},
[2398] ={
     id = 2398,
     words = "自由圣"
},
[2399] ={
     id = 2399,
     words = "自由亚"
},
[2400] ={
     id = 2400,
     words = "醉钢枪"
},
[2401] ={
     id = 2401,
     words = "醉迷药"
},
[2402] ={
     id = 2402,
     words = "醉乙醚"
},
[2403] ={
     id = 2403,
     words = "尊爵粉"
},
[2404] ={
     id = 2404,
     words = "作弊器"
},
[2405] ={
     id = 2405,
     words = "做爱小"
},
[2406] ={
     id = 2406,
     words = "做证件"
},
[2407] ={
     id = 2407,
     words = "毛泽东"
},
[2408] ={
     id = 2408,
     words = "周恩来"
},
[2409] ={
     id = 2409,
     words = "刘少奇"
},
[2410] ={
     id = 2410,
     words = "彭德怀"
},
[2411] ={
     id = 2411,
     words = "刘伯承"
},
[2412] ={
     id = 2412,
     words = "聂荣臻"
},
[2413] ={
     id = 2413,
     words = "徐向前"
},
[2414] ={
     id = 2414,
     words = "罗荣桓"
},
[2415] ={
     id = 2415,
     words = "叶剑英"
},
[2416] ={
     id = 2416,
     words = "李大钊"
},
[2417] ={
     id = 2417,
     words = "陈独秀"
},
[2418] ={
     id = 2418,
     words = "孙中山"
},
[2419] ={
     id = 2419,
     words = "孙逸仙"
},
[2420] ={
     id = 2420,
     words = "邓小平"
},
[2421] ={
     id = 2421,
     words = "江泽民"
},
[2422] ={
     id = 2422,
     words = "朱镕基"
},
[2423] ={
     id = 2423,
     words = "李瑞环"
},
[2424] ={
     id = 2424,
     words = "尉健行"
},
[2425] ={
     id = 2425,
     words = "李岚清"
},
[2426] ={
     id = 2426,
     words = "胡锦涛"
},
[2427] ={
     id = 2427,
     words = "温家宝"
},
[2428] ={
     id = 2428,
     words = "吴邦国"
},
[2429] ={
     id = 2429,
     words = "曾庆红"
},
[2430] ={
     id = 2430,
     words = "贾庆林"
},
[2431] ={
     id = 2431,
     words = "吴官正"
},
[2432] ={
     id = 2432,
     words = "李长春"
},
[2433] ={
     id = 2433,
     words = "回良玉"
},
[2434] ={
     id = 2434,
     words = "曾培炎"
},
[2435] ={
     id = 2435,
     words = "周永康"
},
[2436] ={
     id = 2436,
     words = "曹刚川"
},
[2437] ={
     id = 2437,
     words = "唐家璇"
},
[2438] ={
     id = 2438,
     words = "华建敏"
},
[2439] ={
     id = 2439,
     words = "陈至立"
},
[2440] ={
     id = 2440,
     words = "陈良宇"
},
[2441] ={
     id = 2441,
     words = "张德江"
},
[2442] ={
     id = 2442,
     words = "张立昌"
},
[2443] ={
     id = 2443,
     words = "俞正声"
},
[2444] ={
     id = 2444,
     words = "王乐泉"
},
[2445] ={
     id = 2445,
     words = "刘云山"
},
[2446] ={
     id = 2446,
     words = "王兆国"
},
[2447] ={
     id = 2447,
     words = "贺国强"
},
[2448] ={
     id = 2448,
     words = "郭伯雄"
},
[2449] ={
     id = 2449,
     words = "李登辉"
},
[2450] ={
     id = 2450,
     words = "陈水扁"
},
[2451] ={
     id = 2451,
     words = "宋楚瑜"
},
[2452] ={
     id = 2452,
     words = "吕秀莲"
},
[2453] ={
     id = 2453,
     words = "郁慕明"
},
[2454] ={
     id = 2454,
     words = "蒋介石"
},
[2455] ={
     id = 2455,
     words = "蒋中正"
},
[2456] ={
     id = 2456,
     words = "蒋经国"
},
[2457] ={
     id = 2457,
     words = "马英九"
},
[2458] ={
     id = 2458,
     words = "布莱尔"
},
[2459] ={
     id = 2459,
     words = "纯一郎"
},
[2460] ={
     id = 2460,
     words = "默克尔"
},
[2461] ={
     id = 2461,
     words = "克林顿"
},
[2462] ={
     id = 2462,
     words = "尼克松"
},
[2463] ={
     id = 2463,
     words = "杜鲁门"
},
[2464] ={
     id = 2464,
     words = "斯大林"
},
[2465] ={
     id = 2465,
     words = "马克思"
},
[2466] ={
     id = 2466,
     words = "恩格斯"
},
[2467] ={
     id = 2467,
     words = "金正日"
},
[2468] ={
     id = 2468,
     words = "金日成"
},
[2469] ={
     id = 2469,
     words = "萨达姆"
},
[2470] ={
     id = 2470,
     words = "胡志明"
},
[2471] ={
     id = 2471,
     words = "希拉克"
},
[2472] ={
     id = 2472,
     words = "撒切尔"
},
[2473] ={
     id = 2473,
     words = "阿罗约"
},
[2474] ={
     id = 2474,
     words = "曼德拉"
},
[2475] ={
     id = 2475,
     words = "华盛顿"
},
[2476] ={
     id = 2476,
     words = "拿破仑"
},
[2477] ={
     id = 2477,
     words = "鲍威尔"
},
[2478] ={
     id = 2478,
     words = "本拉登"
},
[2479] ={
     id = 2479,
     words = "奥马尔"
},
[2480] ={
     id = 2480,
     words = "姚文元"
},
[2481] ={
     id = 2481,
     words = "王洪文"
},
[2482] ={
     id = 2482,
     words = "希特勒"
},
[2483] ={
     id = 2483,
     words = "高丽朴"
},
[2484] ={
     id = 2484,
     words = "李大师"
},
[2485] ={
     id = 2485,
     words = "赖昌星"
},
[2486] ={
     id = 2486,
     words = "马加爵"
},
[2487] ={
     id = 2487,
     words = "哥白尼"
},
[2488] ={
     id = 2488,
     words = "哥伦布"
},
[2489] ={
     id = 2489,
     words = "达芬奇"
},
[2490] ={
     id = 2490,
     words = "毕加索"
},
[2491] ={
     id = 2491,
     words = "海明威"
},
[2492] ={
     id = 2492,
     words = "民进党"
},
[2493] ={
     id = 2493,
     words = "民主潮"
},
[2494] ={
     id = 2494,
     words = "摩门教"
},
[2495] ={
     id = 2495,
     words = "亲民党"
},
[2496] ={
     id = 2496,
     words = "瘸腿帮"
},
[2497] ={
     id = 2497,
     words = "人民报"
},
[2498] ={
     id = 2498,
     words = "法轮功"
},
[2499] ={
     id = 2499,
     words = "太子党"
},
[2500] ={
     id = 2500,
     words = "新疆国"
},
[2501] ={
     id = 2501,
     words = "西藏国"
},
[2502] ={
     id = 2502,
     words = "藏青会"
},
[2503] ={
     id = 2503,
     words = "藏妇会"
},
[2504] ={
     id = 2504,
     words = "一贯道"
},
[2505] ={
     id = 2505,
     words = "政治犯"
},
[2506] ={
     id = 2506,
     words = "共产党"
},
[2507] ={
     id = 2507,
     words = "民主党"
},
[2508] ={
     id = 2508,
     words = "转法轮"
},
[2509] ={
     id = 2509,
     words = "苏家屯"
},
[2510] ={
     id = 2510,
     words = "塔利班"
},
[2511] ={
     id = 2511,
     words = "高治联"
},
[2512] ={
     id = 2512,
     words = "高自联"
},
[2513] ={
     id = 2513,
     words = "文化部"
},
[2514] ={
     id = 2514,
     words = "核武器"
},
[2515] ={
     id = 2515,
     words = "原子弹"
},
[2516] ={
     id = 2516,
     words = "核潜艇"
},
[2517] ={
     id = 2517,
     words = "大参考"
},
[2518] ={
     id = 2518,
     words = "小参考"
},
[2519] ={
     id = 2519,
     words = "观世音"
},
[2520] ={
     id = 2520,
     words = "穆斯林"
},
[2521] ={
     id = 2521,
     words = "耶和华"
},
[2522] ={
     id = 2522,
     words = "伊斯兰"
},
[2523] ={
     id = 2523,
     words = "白莲教"
},
[2524] ={
     id = 2524,
     words = "天主教"
},
[2525] ={
     id = 2525,
     words = "基督教"
},
[2526] ={
     id = 2526,
     words = "东正教"
},
[2527] ={
     id = 2527,
     words = "真理教"
},
[2528] ={
     id = 2528,
     words = "黄大仙"
},
[2529] ={
     id = 2529,
     words = "跳大神"
},
[2530] ={
     id = 2530,
     words = "大卫教"
},
[2531] ={
     id = 2531,
     words = "老毛子"
},
[2532] ={
     id = 2532,
     words = "轮盘赌"
},
[2533] ={
     id = 2533,
     words = "可卡因"
},
[2534] ={
     id = 2534,
     words = "海洛因"
},
[2535] ={
     id = 2535,
     words = "摇头丸"
},
[2536] ={
     id = 2536,
     words = "杜冷丁"
},
[2537] ={
     id = 2537,
     words = "sex"
},
[2538] ={
     id = 2538,
     words = "臭机八"
},
[2539] ={
     id = 2539,
     words = "臭鸡巴"
},
[2540] ={
     id = 2540,
     words = "吹喇叭"
},
[2541] ={
     id = 2541,
     words = "强奸犯"
},
[2542] ={
     id = 2542,
     words = "威而钢"
},
[2543] ={
     id = 2543,
     words = "威而柔"
},
[2544] ={
     id = 2544,
     words = "性高潮"
},
[2545] ={
     id = 2545,
     words = "一夜情"
},
[2546] ={
     id = 2546,
     words = "援交妹"
},
[2547] ={
     id = 2547,
     words = "NMD"
},
[2548] ={
     id = 2548,
     words = "NND"
},
[2549] ={
     id = 2549,
     words = "tmd"
},
[2550] ={
     id = 2550,
     words = "K他命"
},
[2551] ={
     id = 2551,
     words = "操她妈"
},
[2552] ={
     id = 2552,
     words = "操妳妈"
},
[2553] ={
     id = 2553,
     words = "操你妈"
},
[2554] ={
     id = 2554,
     words = "操他妈"
},
[2555] ={
     id = 2555,
     words = "干她妈"
},
[2556] ={
     id = 2556,
     words = "干妳娘"
},
[2557] ={
     id = 2557,
     words = "干你妈"
},
[2558] ={
     id = 2558,
     words = "干你娘"
},
[2559] ={
     id = 2559,
     words = "干他妈"
},
[2560] ={
     id = 2560,
     words = "妳娘的"
},
[2561] ={
     id = 2561,
     words = "你妈逼"
},
[2562] ={
     id = 2562,
     words = "去她妈"
},
[2563] ={
     id = 2563,
     words = "去妳的"
},
[2564] ={
     id = 2564,
     words = "去妳妈"
},
[2565] ={
     id = 2565,
     words = "去你的"
},
[2566] ={
     id = 2566,
     words = "去你妈"
},
[2567] ={
     id = 2567,
     words = "去他妈"
},
[2568] ={
     id = 2568,
     words = "赛她娘"
},
[2569] ={
     id = 2569,
     words = "赛妳娘"
},
[2570] ={
     id = 2570,
     words = "赛你娘"
},
[2571] ={
     id = 2571,
     words = "赛他娘"
},
[2572] ={
     id = 2572,
     words = "神经病"
},
[2573] ={
     id = 2573,
     words = "屎妳娘"
},
[2574] ={
     id = 2574,
     words = "屎你娘"
},
[2575] ={
     id = 2575,
     words = "他妈的"
},
[2576] ={
     id = 2576,
     words = "王八蛋"
},
[2577] ={
     id = 2577,
     words = "乡巴佬"
},
[2578] ={
     id = 2578,
     words = "欠人骑"
},
[2579] ={
     id = 2579,
     words = "来爽我"
},
[2580] ={
     id = 2580,
     words = "来插我"
},
[2581] ={
     id = 2581,
     words = "摸咪咪"
},
[2582] ={
     id = 2582,
     words = "JOB"
},
[2583] ={
     id = 2583,
     words = "MY_"
},
[2584] ={
     id = 2584,
     words = "ASS"
},
[2585] ={
     id = 2585,
     words = "我咧干"
},
[2586] ={
     id = 2586,
     words = "轮流干"
},
[2587] ={
     id = 2587,
     words = "干一干"
},
[2588] ={
     id = 2588,
     words = "奸一奸"
},
[2589] ={
     id = 2589,
     words = "大血比"
},
[2590] ={
     id = 2590,
     words = "叼你妈"
},
[2591] ={
     id = 2591,
     words = "靠你妈"
},
[2592] ={
     id = 2592,
     words = "我日你"
},
[2593] ={
     id = 2593,
     words = "草拟妈"
},
[2594] ={
     id = 2594,
     words = "插你妈"
},
[2595] ={
     id = 2595,
     words = "渣波波"
},
[2596] ={
     id = 2596,
     words = "管理员"
},
[2597] ={
     id = 2597,
     words = "服务器"
},
[2598] ={
     id = 2598,
     words = "人民币"
},
[2599] ={
     id = 2599,
     words = "RMB"
},
[2600] ={
     id = 2600,
     words = "奥巴马"
},
[2601] ={
     id = 2601,
     words = "习近平"
},
[2602] ={
     id = 2602,
     words = "钓鱼岛"
},
[2603] ={
     id = 2603,
     words = "八 仙"
},
[2604] ={
     id = 2604,
     words = "混沌诀"
},
[2605] ={
     id = 2605,
     words = "日你妈"
},
[2606] ={
     id = 2606,
     words = "不玩了"
},
[2607] ={
     id = 2607,
     words = "烂游戏"
},
[2608] ={
     id = 2608,
     words = "删 号"
},
[2609] ={
     id = 2609,
     words = "草你妈"
},
[2610] ={
     id = 2610,
     words = "U-R"
},
[2611] ={
     id = 2611,
     words = "8 仙"
},
[2612] ={
     id = 2612,
     words = "NPC"
},
[2613] ={
     id = 2613,
     words = "flg"
},
[2614] ={
     id = 2614,
     words = "fu("
},
[2615] ={
     id = 2615,
     words = "fuc"
},
[2616] ={
     id = 2616,
     words = "fuk"
},
[2617] ={
     id = 2617,
     words = "fv("
},
[2618] ={
     id = 2618,
     words = "fvc"
},
[2619] ={
     id = 2619,
     words = "on9"
},
[2620] ={
     id = 2620,
     words = "安全局"
},
[2621] ={
     id = 2621,
     words = "保监会"
},
[2622] ={
     id = 2622,
     words = "保密局"
},
[2623] ={
     id = 2623,
     words = "鲍岳桥"
},
[2624] ={
     id = 2624,
     words = "薄一波"
},
[2625] ={
     id = 2625,
     words = "布雷尔"
},
[2626] ={
     id = 2626,
     words = "财政部"
},
[2627] ={
     id = 2627,
     words = "参事室"
},
[2628] ={
     id = 2628,
     words = "操GM"
},
[2629] ={
     id = 2629,
     words = "操XX"
},
[2630] ={
     id = 2630,
     words = "测绘局"
},
[2631] ={
     id = 2631,
     words = "插GM"
},
[2632] ={
     id = 2632,
     words = "插深些"
},
[2633] ={
     id = 2633,
     words = "产权局"
},
[2634] ={
     id = 2634,
     words = "陈希同"
},
[2635] ={
     id = 2635,
     words = "陈晓宁"
},
[2636] ={
     id = 2636,
     words = "吃大便"
},
[2637] ={
     id = 2637,
     words = "迟浩田"
},
[2638] ={
     id = 2638,
     words = "臭化西"
},
[2639] ={
     id = 2639,
     words = "大波波"
},
[2640] ={
     id = 2640,
     words = "大花B"
},
[2641] ={
     id = 2641,
     words = "大会堂"
},
[2642] ={
     id = 2642,
     words = "大麻油"
},
[2643] ={
     id = 2643,
     words = "戴维教"
},
[2644] ={
     id = 2644,
     words = "大血B"
},
[2645] ={
     id = 2645,
     words = "党主席"
},
[2646] ={
     id = 2646,
     words = "档案局"
},
[2647] ={
     id = 2647,
     words = "盗窃犯"
},
[2648] ={
     id = 2648,
     words = "地震局"
},
[2649] ={
     id = 2649,
     words = "电监会"
},
[2650] ={
     id = 2650,
     words = "钓鱼台"
},
[2651] ={
     id = 2651,
     words = "丁关根"
},
[2652] ={
     id = 2652,
     words = "董建华"
},
[2653] ={
     id = 2653,
     words = "董贱华"
},
[2654] ={
     id = 2654,
     words = "董文华"
},
[2655] ={
     id = 2655,
     words = "懂文华"
},
[2656] ={
     id = 2656,
     words = "多维社"
},
[2657] ={
     id = 2657,
     words = "多维网"
},
[2658] ={
     id = 2658,
     words = "发改委"
},
[2659] ={
     id = 2659,
     words = "发抡功"
},
[2660] ={
     id = 2660,
     words = "发伦功"
},
[2661] ={
     id = 2661,
     words = "发论公"
},
[2662] ={
     id = 2662,
     words = "发论功"
},
[2663] ={
     id = 2663,
     words = "发正念"
},
[2664] ={
     id = 2664,
     words = "法西斯"
},
[2665] ={
     id = 2665,
     words = "法制办"
},
[2666] ={
     id = 2666,
     words = "反革命"
},
[2667] ={
     id = 2667,
     words = "反政府"
},
[2668] ={
     id = 2668,
     words = "傅作义"
},
[2669] ={
     id = 2669,
     words = "干GM"
},
[2670] ={
     id = 2670,
     words = "干拎娘"
},
[2671] ={
     id = 2671,
     words = "干妳妈"
},
[2672] ={
     id = 2672,
     words = "干七八"
},
[2673] ={
     id = 2673,
     words = "干死你"
},
[2674] ={
     id = 2674,
     words = "港澳办"
},
[2675] ={
     id = 2675,
     words = "膏药旗"
},
[2676] ={
     id = 2676,
     words = "工商局"
},
[2677] ={
     id = 2677,
     words = "公安部"
},
[2678] ={
     id = 2678,
     words = "公安局"
},
[2679] ={
     id = 2679,
     words = "狗日的"
},
[2680] ={
     id = 2680,
     words = "广电局"
},
[2681] ={
     id = 2681,
     words = "龟儿子"
},
[2682] ={
     id = 2682,
     words = "龟孙子"
},
[2683] ={
     id = 2683,
     words = "国安局"
},
[2684] ={
     id = 2684,
     words = "国防部"
},
[2685] ={
     id = 2685,
     words = "国管局"
},
[2686] ={
     id = 2686,
     words = "国民党"
},
[2687] ={
     id = 2687,
     words = "国务院"
},
[2688] ={
     id = 2688,
     words = "国研室"
},
[2689] ={
     id = 2689,
     words = "国资委"
},
[2690] ={
     id = 2690,
     words = "海洋局"
},
[2691] ={
     id = 2691,
     words = "何候华"
},
[2692] ={
     id = 2692,
     words = "黑社会"
},
[2693] ={
     id = 2693,
     words = "黑手党"
},
[2694] ={
     id = 2694,
     words = "红卫兵"
},
[2695] ={
     id = 2695,
     words = "胡XX"
},
[2696] ={
     id = 2696,
     words = "胡紧涛"
},
[2697] ={
     id = 2697,
     words = "胡紧掏"
},
[2698] ={
     id = 2698,
     words = "胡锦淘"
},
[2699] ={
     id = 2699,
     words = "胡乔木"
},
[2700] ={
     id = 2700,
     words = "胡主席"
},
[2701] ={
     id = 2701,
     words = "黄　菊"
},
[2702] ={
     id = 2702,
     words = "计生委"
},
[2703] ={
     id = 2703,
     words = "监察部"
},
[2704] ={
     id = 2704,
     words = "监管局"
},
[2705] ={
     id = 2705,
     words = "检察院"
},
[2706] ={
     id = 2706,
     words = "建设部"
},
[2707] ={
     id = 2707,
     words = "江八点"
},
[2708] ={
     id = 2708,
     words = "江独裁"
},
[2709] ={
     id = 2709,
     words = "江核心"
},
[2710] ={
     id = 2710,
     words = "江戏子"
},
[2711] ={
     id = 2711,
     words = "江择民"
},
[2712] ={
     id = 2712,
     words = "江折民"
},
[2713] ={
     id = 2713,
     words = "江猪媳"
},
[2714] ={
     id = 2714,
     words = "江主席"
},
[2715] ={
     id = 2715,
     words = "僵贼民"
},
[2716] ={
     id = 2716,
     words = "酱猪媳"
},
[2717] ={
     id = 2717,
     words = "交通部"
},
[2718] ={
     id = 2718,
     words = "叫小姐"
},
[2719] ={
     id = 2719,
     words = "教育部"
},
[2720] ={
     id = 2720,
     words = "她妈的"
},
[2721] ={
     id = 2721,
     words = "纠察员"
},
[2722] ={
     id = 2722,
     words = "看牌器"
},
[2723] ={
     id = 2723,
     words = "看棋器"
},
[2724] ={
     id = 2724,
     words = "可待因"
},
[2725] ={
     id = 2725,
     words = "可卡叶"
},
[2726] ={
     id = 2726,
     words = "寇晓伟"
},
[2727] ={
     id = 2727,
     words = "黎阳评"
},
[2728] ={
     id = 2728,
     words = "李弘旨"
},
[2729] ={
     id = 2729,
     words = "李红志"
},
[2730] ={
     id = 2730,
     words = "李宏旨"
},
[2731] ={
     id = 2731,
     words = "李宏志"
},
[2732] ={
     id = 2732,
     words = "李鹏%*"
},
[2733] ={
     id = 2733,
     words = "李铁映"
},
[2734] ={
     id = 2734,
     words = "李先念"
},
[2735] ={
     id = 2735,
     words = "联合国"
},
[2736] ={
     id = 2736,
     words = "粮食局"
},
[2737] ={
     id = 2737,
     words = "林业局"
},
[2738] ={
     id = 2738,
     words = "刘　淇"
},
[2739] ={
     id = 2739,
     words = "六.四"
},
[2740] ={
     id = 2740,
     words = "六。四"
},
[2741] ={
     id = 2741,
     words = "六?四"
},
[2742] ={
     id = 2742,
     words = "六-四"
},
[2743] ={
     id = 2743,
     words = "龙新民"
},
[2744] ={
     id = 2744,
     words = "旅游局"
},
[2745] ={
     id = 2745,
     words = "罗　干"
},
[2746] ={
     id = 2746,
     words = "麻醉药"
},
[2747] ={
     id = 2747,
     words = "吗啡碱"
},
[2748] ={
     id = 2748,
     words = "吗啡片"
},
[2749] ={
     id = 2749,
     words = "买财富"
},
[2750] ={
     id = 2750,
     words = "麦角酸"
},
[2751] ={
     id = 2751,
     words = "卖.国"
},
[2752] ={
     id = 2752,
     words = "卖ID"
},
[2753] ={
     id = 2753,
     words = "卖QQ"
},
[2754] ={
     id = 2754,
     words = "卖财富"
},
[2755] ={
     id = 2755,
     words = "卖软件"
},
[2756] ={
     id = 2756,
     words = "毛XX"
},
[2757] ={
     id = 2757,
     words = "毛厕洞"
},
[2758] ={
     id = 2758,
     words = "毛贼东"
},
[2759] ={
     id = 2759,
     words = "毛主席"
},
[2760] ={
     id = 2760,
     words = "梅花网"
},
[2761] ={
     id = 2761,
     words = "美国佬"
},
[2762] ={
     id = 2762,
     words = "美利坚"
},
[2763] ={
     id = 2763,
     words = "蒙尘药"
},
[2764] ={
     id = 2764,
     words = "迷歼药"
},
[2765] ={
     id = 2765,
     words = "民航局"
},
[2766] ={
     id = 2766,
     words = "民政部"
},
[2767] ={
     id = 2767,
     words = "妳妈的"
},
[2768] ={
     id = 2768,
     words = "妳马的"
},
[2769] ={
     id = 2769,
     words = "南联盟"
},
[2770] ={
     id = 2770,
     words = "南蛮子"
},
[2771] ={
     id = 2771,
     words = "你大爷"
},
[2772] ={
     id = 2772,
     words = "你老母"
},
[2773] ={
     id = 2773,
     words = "你老味"
},
[2774] ={
     id = 2774,
     words = "你妈的"
},
[2775] ={
     id = 2775,
     words = "鸟GM"
},
[2776] ={
     id = 2776,
     words = "农业部"
},
[2777] ={
     id = 2777,
     words = "气象局"
},
[2778] ={
     id = 2778,
     words = "钱其琛"
},
[2779] ={
     id = 2779,
     words = "人代会"
},
[2780] ={
     id = 2780,
     words = "日GM"
},
[2781] ={
     id = 2781,
     words = "日X妈"
},
[2782] ={
     id = 2782,
     words = "日你娘"
},
[2783] ={
     id = 2783,
     words = "日他娘"
},
[2784] ={
     id = 2784,
     words = "肉棍子"
},
[2785] ={
     id = 2785,
     words = "塞你爸"
},
[2786] ={
     id = 2786,
     words = "塞你公"
},
[2787] ={
     id = 2787,
     words = "塞你母"
},
[2788] ={
     id = 2788,
     words = "塞你娘"
},
[2789] ={
     id = 2789,
     words = "三陪女"
},
[2790] ={
     id = 2790,
     words = "三唑仑"
},
[2791] ={
     id = 2791,
     words = "杀人犯"
},
[2792] ={
     id = 2792,
     words = "商务部"
},
[2793] ={
     id = 2793,
     words = "社科院"
},
[2794] ={
     id = 2794,
     words = "审计署"
},
[2795] ={
     id = 2795,
     words = "生春袋"
},
[2796] ={
     id = 2796,
     words = "生鸦片"
},
[2797] ={
     id = 2797,
     words = "圣女峰"
},
[2798] ={
     id = 2798,
     words = "十八摸"
},
[2799] ={
     id = 2799,
     words = "食捻屎"
},
[2800] ={
     id = 2800,
     words = "驶你爸"
},
[2801] ={
     id = 2801,
     words = "驶你公"
},
[2802] ={
     id = 2802,
     words = "驶你母"
},
[2803] ={
     id = 2803,
     words = "驶你娘"
},
[2804] ={
     id = 2804,
     words = "受虐狂"
},
[2805] ={
     id = 2805,
     words = "售ID"
},
[2806] ={
     id = 2806,
     words = "售软件"
},
[2807] ={
     id = 2807,
     words = "水利部"
},
[2808] ={
     id = 2808,
     words = "司法部"
},
[2809] ={
     id = 2809,
     words = "私-服"
},
[2810] ={
     id = 2810,
     words = "私—服"
},
[2811] ={
     id = 2811,
     words = "死gd"
},
[2812] ={
     id = 2812,
     words = "死gm"
},
[2813] ={
     id = 2813,
     words = "死全家"
},
[2814] ={
     id = 2814,
     words = "四人帮"
},
[2815] ={
     id = 2815,
     words = "宋祖英"
},
[2816] ={
     id = 2816,
     words = "他马的"
},
[2817] ={
     id = 2817,
     words = "他母亲"
},
[2818] ={
     id = 2818,
     words = "他祖宗"
},
[2819] ={
     id = 2819,
     words = "台湾党"
},
[2820] ={
     id = 2820,
     words = "台湾狗"
},
[2821] ={
     id = 2821,
     words = "台湾国"
},
[2822] ={
     id = 2822,
     words = "天安门"
},
[2823] ={
     id = 2823,
     words = "田纪云"
},
[2824] ={
     id = 2824,
     words = "铁道部"
},
[2825] ={
     id = 2825,
     words = "统计局"
},
[2826] ={
     id = 2826,
     words = "外　挂"
},
[2827] ={
     id = 2827,
     words = "外_挂"
},
[2828] ={
     id = 2828,
     words = "外-挂"
},
[2829] ={
     id = 2829,
     words = "外—挂"
},
[2830] ={
     id = 2830,
     words = "外汇局"
},
[2831] ={
     id = 2831,
     words = "外交部"
},
[2832] ={
     id = 2832,
     words = "外专局"
},
[2833] ={
     id = 2833,
     words = "王宝森"
},
[2834] ={
     id = 2834,
     words = "王岐山"
},
[2835] ={
     id = 2835,
     words = "王太华"
},
[2836] ={
     id = 2836,
     words = "卫生部"
},
[2837] ={
     id = 2837,
     words = "温加宝"
},
[2838] ={
     id = 2838,
     words = "温家保"
},
[2839] ={
     id = 2839,
     words = "温总理"
},
[2840] ={
     id = 2840,
     words = "文物局"
},
[2841] ={
     id = 2841,
     words = "我操你"
},
[2842] ={
     id = 2842,
     words = "吴　仪"
},
[2843] ={
     id = 2843,
     words = "洗脑班"
},
[2844] ={
     id = 2844,
     words = "想上你"
},
[2845] ={
     id = 2845,
     words = "小鸡鸡"
},
[2846] ={
     id = 2846,
     words = "小日本"
},
[2847] ={
     id = 2847,
     words = "小肉粒"
},
[2848] ={
     id = 2848,
     words = "小乳头"
},
[2849] ={
     id = 2849,
     words = "新光明"
},
[2850] ={
     id = 2850,
     words = "新华社"
},
[2851] ={
     id = 2851,
     words = "新生网"
},
[2852] ={
     id = 2852,
     words = "新闻办"
},
[2853] ={
     id = 2853,
     words = "新义安"
},
[2854] ={
     id = 2854,
     words = "信访局"
},
[2855] ={
     id = 2855,
     words = "兴奋剂"
},
[2856] ={
     id = 2856,
     words = "性虐待"
},
[2857] ={
     id = 2857,
     words = "性无能"
},
[2858] ={
     id = 2858,
     words = "徐光春"
},
[2859] ={
     id = 2859,
     words = "巡查员"
},
[2860] ={
     id = 2860,
     words = "鸦片液"
},
[2861] ={
     id = 2861,
     words = "鸦片渣"
},
[2862] ={
     id = 2862,
     words = "烟草局"
},
[2863] ={
     id = 2863,
     words = "严方军"
},
[2864] ={
     id = 2864,
     words = "摇头玩"
},
[2865] ={
     id = 2865,
     words = "伊拉克"
},
[2866] ={
     id = 2866,
     words = "抑制剂"
},
[2867] ={
     id = 2867,
     words = "邮政局"
},
[2868] ={
     id = 2868,
     words = "曰GM"
},
[2869] ={
     id = 2869,
     words = "扎卡维"
},
[2870] ={
     id = 2870,
     words = "张朝阳"
},
[2871] ={
     id = 2871,
     words = "张潮阳"
},
[2872] ={
     id = 2872,
     words = "张小平"
},
[2873] ={
     id = 2873,
     words = "正见网"
},
[2874] ={
     id = 2874,
     words = "正清网"
},
[2875] ={
     id = 2875,
     words = "正悟网"
},
[2876] ={
     id = 2876,
     words = "证监会"
},
[2877] ={
     id = 2877,
     words = "质检局"
},
[2878] ={
     id = 2878,
     words = "致幻剂"
},
[2879] ={
     id = 2879,
     words = "中科院"
},
[2880] ={
     id = 2880,
     words = "中南海"
},
[2881] ={
     id = 2881,
     words = "中宣部"
},
[2882] ={
     id = 2882,
     words = "周总理"
},
[2883] ={
     id = 2883,
     words = "朱容鸡"
},
[2884] ={
     id = 2884,
     words = "朱容基"
},
[2885] ={
     id = 2885,
     words = "朱熔基"
},
[2886] ={
     id = 2886,
     words = "朱总理"
},
[2887] ={
     id = 2887,
     words = "猪容基"
},
[2888] ={
     id = 2888,
     words = "坐台的"
},
[2889] ={
     id = 2889,
     words = "UR靠"
},
[2890] ={
     id = 2890,
     words = "我操靠"
},
[2891] ={
     id = 2891,
     words = "鸡巴靠"
},
[2892] ={
     id = 2892,
     words = "煞笔靠"
},
[2893] ={
     id = 2893,
     words = "傻B靠"
},
[2894] ={
     id = 2894,
     words = "我日靠"
},
[2895] ={
     id = 2895,
     words = "性交靠"
},
[2896] ={
     id = 2896,
     words = "口交靠"
},
[2897] ={
     id = 2897,
     words = "婊子靠"
},
[2898] ={
     id = 2898,
     words = "妓女靠"
},
[2899] ={
     id = 2899,
     words = "他妈靠"
},
[2900] ={
     id = 2900,
     words = "她妈靠"
},
[2901] ={
     id = 2901,
     words = "牛逼靠"
},
[2902] ={
     id = 2902,
     words = "牛比靠"
},
[2903] ={
     id = 2903,
     words = "牛B靠"
},
[2904] ={
     id = 2904,
     words = "傻逼靠"
},
[2905] ={
     id = 2905,
     words = "八仙靠"
},
[2906] ={
     id = 2906,
     words = "∪R靠"
},
[2907] ={
     id = 2907,
     words = "混沌靠"
},
[2908] ={
     id = 2908,
     words = "你妈靠"
},
[2909] ={
     id = 2909,
     words = "装逼靠"
},
[2910] ={
     id = 2910,
     words = "装B靠"
},
[2911] ={
     id = 2911,
     words = "删号靠"
},
[2912] ={
     id = 2912,
     words = "卖号靠"
},
[2913] ={
     id = 2913,
     words = "妈的靠"
},
[2914] ={
     id = 2914,
     words = "妈逼靠"
},
[2915] ={
     id = 2915,
     words = "JB靠"
},
[2916] ={
     id = 2916,
     words = "淘宝靠"
},
[2917] ={
     id = 2917,
     words = "j8靠"
},
[2918] ={
     id = 2918,
     words = "吗的靠"
},
[2919] ={
     id = 2919,
     words = "8仙靠"
},
[2920] ={
     id = 2920,
     words = "狗日靠"
},
[2921] ={
     id = 2921,
     words = "色情靠"
},
[2922] ={
     id = 2922,
     words = "黄色靠"
},
[2923] ={
     id = 2923,
     words = "h站靠"
},
[2924] ={
     id = 2924,
     words = "龙虎靠"
},
[2925] ={
     id = 2925,
     words = "虎门靠"
},
[2926] ={
     id = 2926,
     words = "战牌靠"
},
[2927] ={
     id = 2927,
     words = "ＵＲ靠"
},
[2928] ={
     id = 2928,
     words = "藏独靠"
},
[2929] ={
     id = 2929,
     words = "台独靠"
},
[2930] ={
     id = 2930,
     words = "2逼靠"
},
[2931] ={
     id = 2931,
     words = "操逼毛"
},
[2932] ={
     id = 2932,
     words = "操逼样"
},
[2933] ={
     id = 2933,
     words = "操比毛"
},
[2934] ={
     id = 2934,
     words = "操婊子"
},
[2935] ={
     id = 2935,
     words = "操宾周"
},
[2936] ={
     id = 2936,
     words = "操冰毒"
},
[2937] ={
     id = 2937,
     words = "操波霸"
},
[2938] ={
     id = 2938,
     words = "操博讯"
},
[2939] ={
     id = 2939,
     words = "操布什"
},
[2940] ={
     id = 2940,
     words = "操藏独"
},
[2941] ={
     id = 2941,
     words = "操操逼"
},
[2942] ={
     id = 2942,
     words = "操操比"
},
[2943] ={
     id = 2943,
     words = "操操蛋"
},
[2944] ={
     id = 2944,
     words = "操操你"
},
[2945] ={
     id = 2945,
     words = "操操他"
},
[2946] ={
     id = 2946,
     words = "操草妈"
},
[2947] ={
     id = 2947,
     words = "操插妳"
},
[2948] ={
     id = 2948,
     words = "操插你"
},
[2949] ={
     id = 2949,
     words = "操朝鲜"
},
[2950] ={
     id = 2950,
     words = "操车臣"
},
[2951] ={
     id = 2951,
     words = "操车仑"
},
[2952] ={
     id = 2952,
     words = "操陈功"
},
[2953] ={
     id = 2953,
     words = "操陈毅"
},
[2954] ={
     id = 2954,
     words = "操吃屎"
},
[2955] ={
     id = 2955,
     words = "操赤匪"
},
[2956] ={
     id = 2956,
     words = "操抽插"
},
[2957] ={
     id = 2957,
     words = "操吹箫"
},
[2958] ={
     id = 2958,
     words = "操春药"
},
[2959] ={
     id = 2959,
     words = "操蠢猪"
},
[2960] ={
     id = 2960,
     words = "操戳你"
},
[2961] ={
     id = 2961,
     words = "操达赖"
},
[2962] ={
     id = 2962,
     words = "操打炮"
},
[2963] ={
     id = 2963,
     words = "操大B"
},
[2964] ={
     id = 2964,
     words = "操大逼"
},
[2965] ={
     id = 2965,
     words = "操大便"
},
[2966] ={
     id = 2966,
     words = "操大法"
},
[2967] ={
     id = 2967,
     words = "毛独立"
},
[2968] ={
     id = 2968,
     words = "毛二B"
},
[2969] ={
     id = 2969,
     words = "毛二屄"
},
[2970] ={
     id = 2970,
     words = "毛二逼"
},
[2971] ={
     id = 2971,
     words = "毛发抡"
},
[2972] ={
     id = 2972,
     words = "毛发伦"
},
[2973] ={
     id = 2973,
     words = "毛发轮"
},
[2974] ={
     id = 2974,
     words = "毛发论"
},
[2975] ={
     id = 2975,
     words = "毛发骚"
},
[2976] ={
     id = 2976,
     words = "毛法功"
},
[2977] ={
     id = 2977,
     words = "毛法愣"
},
[2978] ={
     id = 2978,
     words = "毛法仑"
},
[2979] ={
     id = 2979,
     words = "毛法轮"
},
[2980] ={
     id = 2980,
     words = "毛反动"
},
[2981] ={
     id = 2981,
     words = "毛反共"
},
[2982] ={
     id = 2982,
     words = "毛反华"
},
[2983] ={
     id = 2983,
     words = "毛反日"
},
[2984] ={
     id = 2984,
     words = "毛佛教"
},
[2985] ={
     id = 2985,
     words = "毛佛祖"
},
[2986] ={
     id = 2986,
     words = "毛阝月"
},
[2987] ={
     id = 2987,
     words = "毛傅鹏"
},
[2988] ={
     id = 2988,
     words = "毛干妳"
},
[2989] ={
     id = 2989,
     words = "毛干你"
},
[2990] ={
     id = 2990,
     words = "毛肛交"
},
[2991] ={
     id = 2991,
     words = "毛肛门"
},
[2992] ={
     id = 2992,
     words = "毛高俊"
},
[2993] ={
     id = 2993,
     words = "毛睾丸"
},
[2994] ={
     id = 2994,
     words = "毛工力"
},
[2995] ={
     id = 2995,
     words = "毛公安"
},
[2996] ={
     id = 2996,
     words = "毛共匪"
},
[2997] ={
     id = 2997,
     words = "毛共狗"
},
[2998] ={
     id = 2998,
     words = "毛狗b"
},
[2999] ={
     id = 2999,
     words = "毛狗操"
},
[3000] ={
     id = 3000,
     words = "毛狗卵"
},
[3001] ={
     id = 3001,
     words = "毛狗娘"
},
[3002] ={
     id = 3002,
     words = "毛狗屁"
},
[3003] ={
     id = 3003,
     words = "毛狗日"
},
[3004] ={
     id = 3004,
     words = "毛狗屎"
},
[3005] ={
     id = 3005,
     words = "毛狗养"
},
[3006] ={
     id = 3006,
     words = "毛龟公"
},
[3007] ={
     id = 3007,
     words = "毛龟头"
},
[3008] ={
     id = 3008,
     words = "毛鬼村"
},
[3009] ={
     id = 3009,
     words = "毛哈批"
},
[3010] ={
     id = 3010,
     words = "毛贺龙"
},
[3011] ={
     id = 3011,
     words = "毛洪兴"
},
[3012] ={
     id = 3012,
     words = "毛洪志"
},
[3013] ={
     id = 3013,
     words = "毛后庭"
},
[3014] ={
     id = 3014,
     words = "毛花柳"
},
[3015] ={
     id = 3015,
     words = "毛欢城"
},
[3016] ={
     id = 3016,
     words = "毛换妻"
},
[3017] ={
     id = 3017,
     words = "毛黄菊"
},
[3018] ={
     id = 3018,
     words = "毛回回"
},
[3019] ={
     id = 3019,
     words = "毛回教"
},
[3020] ={
     id = 3020,
     words = "毛昏药"
},
[3021] ={
     id = 3021,
     words = "毛火棒"
},
[3022] ={
     id = 3022,
     words = "毛机八"
},
[3023] ={
     id = 3023,
     words = "毛机巴"
},
[3024] ={
     id = 3024,
     words = "毛鸡八"
},
[3025] ={
     id = 3025,
     words = "毛鸡巴"
},
[3026] ={
     id = 3026,
     words = "毛鸡叭"
},
[3027] ={
     id = 3027,
     words = "毛鸡芭"
},
[3028] ={
     id = 3028,
     words = "毛鸡掰"
},
[3029] ={
     id = 3029,
     words = "毛鸡鸡"
},
[3030] ={
     id = 3030,
     words = "毛鸡奸"
},
[3031] ={
     id = 3031,
     words = "毛基督"
},
[3032] ={
     id = 3032,
     words = "毛妓女"
},
[3033] ={
     id = 3033,
     words = "毛妓院"
},
[3034] ={
     id = 3034,
     words = "毛奸你"
},
[3035] ={
     id = 3035,
     words = "毛奸淫"
},
[3036] ={
     id = 3036,
     words = "毛贱逼"
},
[3037] ={
     id = 3037,
     words = "毛贱货"
},
[3038] ={
     id = 3038,
     words = "毛贱人"
},
[3039] ={
     id = 3039,
     words = "毛江八"
},
[3040] ={
     id = 3040,
     words = "毛江青"
},
[3041] ={
     id = 3041,
     words = "毛江猪"
},
[3042] ={
     id = 3042,
     words = "毛疆独"
},
[3043] ={
     id = 3043,
     words = "毛姣西"
},
[3044] ={
     id = 3044,
     words = "毛叫床"
},
[3045] ={
     id = 3045,
     words = "毛叫鸡"
},
[3046] ={
     id = 3046,
     words = "毛禁书"
},
[3047] ={
     id = 3047,
     words = "毛精液"
},
[3048] ={
     id = 3048,
     words = "毛精子"
},
[3049] ={
     id = 3049,
     words = "毛静坐"
},
[3050] ={
     id = 3050,
     words = "毛鸠屎"
},
[3051] ={
     id = 3051,
     words = "毛军妓"
},
[3052] ={
     id = 3052,
     words = "毛军委"
},
[3053] ={
     id = 3053,
     words = "毛抗日"
},
[3054] ={
     id = 3054,
     words = "毛靠腰"
},
[3055] ={
     id = 3055,
     words = "毛客服"
},
[3056] ={
     id = 3056,
     words = "毛口交"
},
[3057] ={
     id = 3057,
     words = "毛狂操"
},
[3058] ={
     id = 3058,
     words = "毛拉登"
},
[3059] ={
     id = 3059,
     words = "毛懒教"
},
[3060] ={
     id = 3060,
     words = "毛烂B"
},
[3061] ={
     id = 3061,
     words = "毛烂屄"
},
[3062] ={
     id = 3062,
     words = "毛烂逼"
},
[3063] ={
     id = 3063,
     words = "毛烂比"
},
[3064] ={
     id = 3064,
     words = "毛烂屌"
},
[3065] ={
     id = 3065,
     words = "毛烂货"
},
[3066] ={
     id = 3066,
     words = "毛老逼"
},
[3067] ={
     id = 3067,
     words = "毛老母"
},
[3068] ={
     id = 3068,
     words = "毛李鹏"
},
[3069] ={
     id = 3069,
     words = "毛李山"
},
[3070] ={
     id = 3070,
     words = "毛连战"
},
[3071] ={
     id = 3071,
     words = "毛联大"
},
[3072] ={
     id = 3072,
     words = "毛联易"
},
[3073] ={
     id = 3073,
     words = "毛列宁"
},
[3074] ={
     id = 3074,
     words = "毛林彪"
},
[3075] ={
     id = 3075,
     words = "毛刘军"
},
[3076] ={
     id = 3076,
     words = "毛刘淇"
},
[3077] ={
     id = 3077,
     words = "毛流氓"
},
[3078] ={
     id = 3078,
     words = "毛六四"
},
[3079] ={
     id = 3079,
     words = "毛轮功"
},
[3080] ={
     id = 3080,
     words = "毛轮奸"
},
[3081] ={
     id = 3081,
     words = "毛罗干"
},
[3082] ={
     id = 3082,
     words = "毛骡干"
},
[3083] ={
     id = 3083,
     words = "毛妈逼"
},
[3084] ={
     id = 3084,
     words = "毛妈比"
},
[3085] ={
     id = 3085,
     words = "毛妈批"
},
[3086] ={
     id = 3086,
     words = "毛妈祖"
},
[3087] ={
     id = 3087,
     words = "毛妈B"
},
[3088] ={
     id = 3088,
     words = "毛妈的"
},
[3089] ={
     id = 3089,
     words = "毛吗啡"
},
[3090] ={
     id = 3090,
     words = "毛卖B"
},
[3091] ={
     id = 3091,
     words = "毛卖逼"
},
[3092] ={
     id = 3092,
     words = "毛卖比"
},
[3093] ={
     id = 3093,
     words = "毛卖国"
},
[3094] ={
     id = 3094,
     words = "毛卖号"
},
[3095] ={
     id = 3095,
     words = "毛卖卡"
},
[3096] ={
     id = 3096,
     words = "毛卖淫"
},
[3097] ={
     id = 3097,
     words = "毛美国"
},
[3098] ={
     id = 3098,
     words = "毛蒙独"
},
[3099] ={
     id = 3099,
     words = "毛迷药"
},
[3100] ={
     id = 3100,
     words = "毛密洞"
},
[3101] ={
     id = 3101,
     words = "毛密宗"
},
[3102] ={
     id = 3102,
     words = "毛民运"
},
[3103] ={
     id = 3103,
     words = "毛乳头"
},
[3104] ={
     id = 3104,
     words = "毛奶子"
},
[3105] ={
     id = 3105,
     words = "毛嫩B"
},
[3106] ={
     id = 3106,
     words = "毛伱妈"
},
[3107] ={
     id = 3107,
     words = "毛你爸"
},
[3108] ={
     id = 3108,
     words = "毛你姥"
},
[3109] ={
     id = 3109,
     words = "毛你妈"
},
[3110] ={
     id = 3110,
     words = "毛你娘"
},
[3111] ={
     id = 3111,
     words = "毛鸟你"
},
[3112] ={
     id = 3112,
     words = "毛牛逼"
},
[3113] ={
     id = 3113,
     words = "毛牛比"
},
[3114] ={
     id = 3114,
     words = "毛虐待"
},
[3115] ={
     id = 3115,
     words = "毛喷你"
},
[3116] ={
     id = 3116,
     words = "毛彭真"
},
[3117] ={
     id = 3117,
     words = "毛皮条"
},
[3118] ={
     id = 3118,
     words = "毛屁眼"
},
[3119] ={
     id = 3119,
     words = "毛嫖客"
},
[3120] ={
     id = 3120,
     words = "毛破坏"
},
[3121] ={
     id = 3121,
     words = "毛破鞋"
},
[3122] ={
     id = 3122,
     words = "毛仆街"
},
[3123] ={
     id = 3123,
     words = "毛普京"
},
[3124] ={
     id = 3124,
     words = "毛强奸"
},
[3125] ={
     id = 3125,
     words = "毛强卫"
},
[3126] ={
     id = 3126,
     words = "毛抢劫"
},
[3127] ={
     id = 3127,
     words = "毛乔石"
},
[3128] ={
     id = 3128,
     words = "毛侨办"
},
[3129] ={
     id = 3129,
     words = "毛切七"
},
[3130] ={
     id = 3130,
     words = "毛情色"
},
[3131] ={
     id = 3131,
     words = "毛去死"
},
[3132] ={
     id = 3132,
     words = "毛人大"
},
[3133] ={
     id = 3133,
     words = "毛人弹"
},
[3134] ={
     id = 3134,
     words = "毛人民"
},
[3135] ={
     id = 3135,
     words = "毛日你"
},
[3136] ={
     id = 3136,
     words = "毛肉棒"
},
[3137] ={
     id = 3137,
     words = "毛肉壁"
},
[3138] ={
     id = 3138,
     words = "毛肉洞"
},
[3139] ={
     id = 3139,
     words = "毛肉缝"
},
[3140] ={
     id = 3140,
     words = "毛肉棍"
},
[3141] ={
     id = 3141,
     words = "毛肉穴"
},
[3142] ={
     id = 3142,
     words = "毛乳房"
},
[3143] ={
     id = 3143,
     words = "毛乳交"
},
[3144] ={
     id = 3144,
     words = "毛撒尿"
},
[3145] ={
     id = 3145,
     words = "毛塞白"
},
[3146] ={
     id = 3146,
     words = "毛三陪"
},
[3147] ={
     id = 3147,
     words = "毛骚B"
},
[3148] ={
     id = 3148,
     words = "毛骚逼"
},
[3149] ={
     id = 3149,
     words = "毛骚货"
},
[3150] ={
     id = 3150,
     words = "毛色情"
},
[3151] ={
     id = 3151,
     words = "毛傻B"
},
[3152] ={
     id = 3152,
     words = "毛傻屄"
},
[3153] ={
     id = 3153,
     words = "毛傻逼"
},
[3154] ={
     id = 3154,
     words = "毛傻比"
},
[3155] ={
     id = 3155,
     words = "毛傻吊"
},
[3156] ={
     id = 3156,
     words = "毛傻卵"
},
[3157] ={
     id = 3157,
     words = "毛傻子"
},
[3158] ={
     id = 3158,
     words = "毛煞逼"
},
[3159] ={
     id = 3159,
     words = "毛上妳"
},
[3160] ={
     id = 3160,
     words = "毛上你"
},
[3161] ={
     id = 3161,
     words = "毛射精"
},
[3162] ={
     id = 3162,
     words = "毛石进"
},
[3163] ={
     id = 3163,
     words = "毛食屎"
},
[3164] ={
     id = 3164,
     words = "毛是鸡"
},
[3165] ={
     id = 3165,
     words = "毛手淫"
},
[3166] ={
     id = 3166,
     words = "毛售号"
},
[3167] ={
     id = 3167,
     words = "毛氵去"
},
[3168] ={
     id = 3168,
     words = "毛私服"
},
[3169] ={
     id = 3169,
     words = "毛孙文"
},
[3170] ={
     id = 3170,
     words = "毛他爹"
},
[3171] ={
     id = 3171,
     words = "毛他妈"
},
[3172] ={
     id = 3172,
     words = "毛台办"
},
[3173] ={
     id = 3173,
     words = "毛台独"
},
[3174] ={
     id = 3174,
     words = "毛台联"
},
[3175] ={
     id = 3175,
     words = "毛太监"
},
[3176] ={
     id = 3176,
     words = "毛特码"
},
[3177] ={
     id = 3177,
     words = "毛天皇"
},
[3178] ={
     id = 3178,
     words = "毛舔西"
},
[3179] ={
     id = 3179,
     words = "毛推油"
},
[3180] ={
     id = 3180,
     words = "毛退党"
},
[3181] ={
     id = 3181,
     words = "毛外挂"
},
[3182] ={
     id = 3182,
     words = "毛万税"
},
[3183] ={
     id = 3183,
     words = "毛王刚"
},
[3184] ={
     id = 3184,
     words = "毛王昊"
},
[3185] ={
     id = 3185,
     words = "毛王震"
},
[3186] ={
     id = 3186,
     words = "毛网管"
},
[3187] ={
     id = 3187,
     words = "毛温馨"
},
[3188] ={
     id = 3188,
     words = "毛倭国"
},
[3189] ={
     id = 3189,
     words = "毛倭寇"
},
[3190] ={
     id = 3190,
     words = "毛我操"
},
[3191] ={
     id = 3191,
     words = "毛我干"
},
[3192] ={
     id = 3192,
     words = "毛我日"
},
[3193] ={
     id = 3193,
     words = "毛吴仪"
},
[3194] ={
     id = 3194,
     words = "毛系统"
},
[3195] ={
     id = 3195,
     words = "毛鲜族"
},
[3196] ={
     id = 3196,
     words = "毛小泉"
},
[3197] ={
     id = 3197,
     words = "毛小穴"
},
[3198] ={
     id = 3198,
     words = "毛邪教"
},
[3199] ={
     id = 3199,
     words = "毛新党"
},
[3200] ={
     id = 3200,
     words = "毛性爱"
},
[3201] ={
     id = 3201,
     words = "毛性交"
},
[3202] ={
     id = 3202,
     words = "毛性欲"
},
[3203] ={
     id = 3203,
     words = "毛学潮"
},
[3204] ={
     id = 3204,
     words = "毛血逼"
},
[3205] ={
     id = 3205,
     words = "毛丫的"
},
[3206] ={
     id = 3206,
     words = "毛鸦片"
},
[3207] ={
     id = 3207,
     words = "毛阳精"
},
[3208] ={
     id = 3208,
     words = "毛阳具"
},
[3209] ={
     id = 3209,
     words = "毛耶苏"
},
[3210] ={
     id = 3210,
     words = "毛耶稣"
},
[3211] ={
     id = 3211,
     words = "毛夜情"
},
[3212] ={
     id = 3212,
     words = "毛伊朗"
},
[3213] ={
     id = 3213,
     words = "毛阴部"
},
[3214] ={
     id = 3214,
     words = "毛阴唇"
},
[3215] ={
     id = 3215,
     words = "毛阴道"
},
[3216] ={
     id = 3216,
     words = "毛阴蒂"
},
[3217] ={
     id = 3217,
     words = "毛阴核"
},
[3218] ={
     id = 3218,
     words = "毛阴户"
},
[3219] ={
     id = 3219,
     words = "毛阴茎"
},
[3220] ={
     id = 3220,
     words = "毛阴毛"
},
[3221] ={
     id = 3221,
     words = "毛阴水"
},
[3222] ={
     id = 3222,
     words = "毛淫荡"
},
[3223] ={
     id = 3223,
     words = "毛淫秽"
},
[3224] ={
     id = 3224,
     words = "毛淫货"
},
[3225] ={
     id = 3225,
     words = "毛淫贱"
},
[3226] ={
     id = 3226,
     words = "毛淫叫"
},
[3227] ={
     id = 3227,
     words = "毛淫毛"
},
[3228] ={
     id = 3228,
     words = "毛淫靡"
},
[3229] ={
     id = 3229,
     words = "毛淫水"
},
[3230] ={
     id = 3230,
     words = "毛淫娃"
},
[3231] ={
     id = 3231,
     words = "毛淫欲"
},
[3232] ={
     id = 3232,
     words = "毛硬挺"
},
[3233] ={
     id = 3233,
     words = "毛游行"
},
[3234] ={
     id = 3234,
     words = "毛玉杵"
},
[3235] ={
     id = 3235,
     words = "u r"
},
[3236] ={
     id = 3236,
     words = "古柯碱"
},
[3237] ={
     id = 3237,
     words = "10p"
},
[3238] ={
     id = 3238,
     words = "11p"
},
[3239] ={
     id = 3239,
     words = "11套"
},
[3240] ={
     id = 3240,
     words = "12p"
},
[3241] ={
     id = 3241,
     words = "13p"
},
[3242] ={
     id = 3242,
     words = "13点"
},
[3243] ={
     id = 3243,
     words = "13點"
},
[3244] ={
     id = 3244,
     words = "14p"
},
[3245] ={
     id = 3245,
     words = "15p"
},
[3246] ={
     id = 3246,
     words = "16大"
},
[3247] ={
     id = 3247,
     words = "１６大"
},
[3248] ={
     id = 3248,
     words = "17大"
},
[3249] ={
     id = 3249,
     words = "18禁"
},
[3250] ={
     id = 3250,
     words = "１８摸"
},
[3251] ={
     id = 3251,
     words = "18摸"
},
[3252] ={
     id = 3252,
     words = "18岁"
},
[3253] ={
     id = 3253,
     words = "5jq"
},
[3254] ={
     id = 3254,
     words = "５街区"
},
[3255] ={
     id = 3255,
     words = "5街区"
},
[3256] ={
     id = 3256,
     words = "６。４"
},
[3257] ={
     id = 3257,
     words = "6。4"
},
[3258] ={
     id = 3258,
     words = "7女医"
},
[3259] ={
     id = 3259,
     words = "8。9"
},
[3260] ={
     id = 3260,
     words = "9之游"
},
[3261] ={
     id = 3261,
     words = "9之遊"
},
[3262] ={
     id = 3262,
     words = "a4u"
},
[3263] ={
     id = 3263,
     words = "a4y"
},
[3264] ={
     id = 3264,
     words = "Ais"
},
[3265] ={
     id = 3265,
     words = "ａｉ滋"
},
[3266] ={
     id = 3266,
     words = "ai滋"
},
[3267] ={
     id = 3267,
     words = "AVI"
},
[3268] ={
     id = 3268,
     words = "AVW"
},
[3269] ={
     id = 3269,
     words = "ｂａｏ"
},
[3270] ={
     id = 3270,
     words = "ｂｅｉ"
},
[3271] ={
     id = 3271,
     words = "ｂｉ样"
},
[3272] ={
     id = 3272,
     words = "Bi样"
},
[3273] ={
     id = 3273,
     words = "BnB"
},
[3274] ={
     id = 3274,
     words = "B博士"
},
[3275] ={
     id = 3275,
     words = "ｃａｏ"
},
[3276] ={
     id = 3276,
     words = "dpp"
},
[3277] ={
     id = 3277,
     words = "ｄｕｉ"
},
[3278] ={
     id = 3278,
     words = "ERA"
},
[3279] ={
     id = 3279,
     words = "Fag"
},
[3280] ={
     id = 3280,
     words = "fa轮"
},
[3281] ={
     id = 3281,
     words = "G。M"
},
[3282] ={
     id = 3282,
     words = "G_m"
},
[3283] ={
     id = 3283,
     words = "GAN"
},
[3284] ={
     id = 3284,
     words = "GCD"
},
[3285] ={
     id = 3285,
     words = "ggq"
},
[3286] ={
     id = 3286,
     words = "G-M"
},
[3287] ={
     id = 3287,
     words = "H动漫"
},
[3288] ={
     id = 3288,
     words = "H動漫"
},
[3289] ={
     id = 3289,
     words = "Jam"
},
[3290] ={
     id = 3290,
     words = "ｊｉ女"
},
[3291] ={
     id = 3291,
     words = "Ji女"
},
[3292] ={
     id = 3292,
     words = "ｋｋ粉"
},
[3293] ={
     id = 3293,
     words = "MM屄"
},
[3294] ={
     id = 3294,
     words = "W指名"
},
[3295] ={
     id = 3295,
     words = "阿芙蓉"
},
[3296] ={
     id = 3296,
     words = "阿片烟"
},
[3297] ={
     id = 3297,
     words = "啊无卵"
},
[3298] ={
     id = 3298,
     words = "艾滋病"
},
[3299] ={
     id = 3299,
     words = "爱方式"
},
[3300] ={
     id = 3300,
     words = "玩女人"
},
[3301] ={
     id = 3301,
     words = "爱幼阁"
},
[3302] ={
     id = 3302,
     words = "愛女人"
},
[3303] ={
     id = 3303,
     words = "愛幼閣"
},
[3304] ={
     id = 3304,
     words = "愛滋病"
},
[3305] ={
     id = 3305,
     words = "安理会"
},
[3306] ={
     id = 3306,
     words = "安眠酮"
},
[3307] ={
     id = 3307,
     words = "安纳咖"
},
[3308] ={
     id = 3308,
     words = "按摩棒"
},
[3309] ={
     id = 3309,
     words = "傲神傳"
},
[3310] ={
     id = 3310,
     words = "奧巴馬"
},
[3311] ={
     id = 3311,
     words = "拔出来"
},
[3312] ={
     id = 3312,
     words = "拔出來"
},
[3313] ={
     id = 3313,
     words = "白立忱"
},
[3314] ={
     id = 3314,
     words = "白立朴"
},
[3315] ={
     id = 3315,
     words = "白小姐"
},
[3316] ={
     id = 3316,
     words = "百家乐"
},
[3317] ={
     id = 3317,
     words = "包pi"
},
[3318] ={
     id = 3318,
     words = "包二奶"
},
[3319] ={
     id = 3319,
     words = "鮑嶽橋"
},
[3320] ={
     id = 3320,
     words = "爆乳娘"
},
[3321] ={
     id = 3321,
     words = "北极冰"
},
[3322] ={
     id = 3322,
     words = "本拉丹"
},
[3323] ={
     id = 3323,
     words = "苯丙胺"
},
[3324] ={
     id = 3324,
     words = "逼孕套"
},
[3325] ={
     id = 3325,
     words = "碧香亭"
},
[3326] ={
     id = 3326,
     words = "避孕套"
},
[3327] ={
     id = 3327,
     words = "婊zi"
},
[3328] ={
     id = 3328,
     words = "波佳达"
},
[3329] ={
     id = 3329,
     words = "博白县"
},
[3330] ={
     id = 3330,
     words = "不要停"
},
[3331] ={
     id = 3331,
     words = "布雷爾"
},
[3332] ={
     id = 3332,
     words = "佈雷爾"
},
[3333] ={
     id = 3333,
     words = "步飞烟"
},
[3334] ={
     id = 3334,
     words = "步非烟"
},
[3335] ={
     id = 3335,
     words = "彩票机"
},
[3336] ={
     id = 3336,
     words = "採花堂"
},
[3337] ={
     id = 3337,
     words = "蔡崇国"
},
[3338] ={
     id = 3338,
     words = "蔡和森"
},
[3339] ={
     id = 3339,
     words = "蔡庆林"
},
[3340] ={
     id = 3340,
     words = "沧澜曲"
},
[3341] ={
     id = 3341,
     words = "藏婦會"
},
[3342] ={
     id = 3342,
     words = "藏青會"
},
[3343] ={
     id = 3343,
     words = "藏青社"
},
[3344] ={
     id = 3344,
     words = "操78"
},
[3345] ={
     id = 3345,
     words = "操表姐"
},
[3346] ={
     id = 3346,
     words = "操护士"
},
[3347] ={
     id = 3347,
     words = "操机掰"
},
[3348] ={
     id = 3348,
     words = "操妹妹"
},
[3349] ={
     id = 3349,
     words = "操母狗"
},
[3350] ={
     id = 3350,
     words = "操妳媽"
},
[3351] ={
     id = 3351,
     words = "操妳娘"
},
[3352] ={
     id = 3352,
     words = "操嫩穴"
},
[3353] ={
     id = 3353,
     words = "操你爸"
},
[3354] ={
     id = 3354,
     words = "操你媽"
},
[3355] ={
     id = 3355,
     words = "操你娘"
},
[3356] ={
     id = 3356,
     words = "操嫂嫂"
},
[3357] ={
     id = 3357,
     words = "操小穴"
},
[3358] ={
     id = 3358,
     words = "操小姨"
},
[3359] ={
     id = 3359,
     words = "操淫荡"
},
[3360] ={
     id = 3360,
     words = "曹长青"
},
[3361] ={
     id = 3361,
     words = "曹剛川"
},
[3362] ={
     id = 3362,
     words = "曹建明"
},
[3363] ={
     id = 3363,
     words = "曹庆泽"
},
[3364] ={
     id = 3364,
     words = "草你媽"
},
[3365] ={
     id = 3365,
     words = "草你娘"
},
[3366] ={
     id = 3366,
     words = "草擬媽"
},
[3367] ={
     id = 3367,
     words = "草芝麻"
},
[3368] ={
     id = 3368,
     words = "草枝麻"
},
[3369] ={
     id = 3369,
     words = "懆您妈"
},
[3370] ={
     id = 3370,
     words = "懆您娘"
},
[3371] ={
     id = 3371,
     words = "测试员"
},
[3372] ={
     id = 3372,
     words = "测试員"
},
[3373] ={
     id = 3373,
     words = "测試员"
},
[3374] ={
     id = 3374,
     words = "测試員"
},
[3375] ={
     id = 3375,
     words = "測试員"
},
[3376] ={
     id = 3376,
     words = "測試员"
},
[3377] ={
     id = 3377,
     words = "測試員"
},
[3378] ={
     id = 3378,
     words = "插后庭"
},
[3379] ={
     id = 3379,
     words = "插後庭"
},
[3380] ={
     id = 3380,
     words = "插嫩逼"
},
[3381] ={
     id = 3381,
     words = "插嫩穴"
},
[3382] ={
     id = 3382,
     words = "插你爸"
},
[3383] ={
     id = 3383,
     words = "插你媽"
},
[3384] ={
     id = 3384,
     words = "插你娘"
},
[3385] ={
     id = 3385,
     words = "插屁眼"
},
[3386] ={
     id = 3386,
     words = "插入穴"
},
[3387] ={
     id = 3387,
     words = "插死你"
},
[3388] ={
     id = 3388,
     words = "插小穴"
},
[3389] ={
     id = 3389,
     words = "插穴图"
},
[3390] ={
     id = 3390,
     words = "插阴茎"
},
[3391] ={
     id = 3391,
     words = "插淫屄"
},
[3392] ={
     id = 3392,
     words = "倡议书"
},
[3393] ={
     id = 3393,
     words = "超美)"
},
[3394] ={
     id = 3394,
     words = "朝天穴"
},
[3395] ={
     id = 3395,
     words = "陈炳基"
},
[3396] ={
     id = 3396,
     words = "陈伯达"
},
[3397] ={
     id = 3397,
     words = "陈昌智"
},
[3398] ={
     id = 3398,
     words = "陈慕华"
},
[3399] ={
     id = 3399,
     words = "陈丕显"
},
[3400] ={
     id = 3400,
     words = "陈破空"
},
[3401] ={
     id = 3401,
     words = "陈随便"
},
[3402] ={
     id = 3402,
     words = "陈锡联"
},
[3403] ={
     id = 3403,
     words = "陈宣良"
},
[3404] ={
     id = 3404,
     words = "陈一谘"
},
[3405] ={
     id = 3405,
     words = "陈永贵"
},
[3406] ={
     id = 3406,
     words = "陈总统"
},
[3407] ={
     id = 3407,
     words = "陳奎元"
},
[3408] ={
     id = 3408,
     words = "陳水扁"
},
[3409] ={
     id = 3409,
     words = "陳希同"
},
[3410] ={
     id = 3410,
     words = "陳曉寧"
},
[3411] ={
     id = 3411,
     words = "陳宗興"
},
[3412] ={
     id = 3412,
     words = "陳總統"
},
[3413] ={
     id = 3413,
     words = "成克杰"
},
[3414] ={
     id = 3414,
     words = "成人网"
},
[3415] ={
     id = 3415,
     words = "程铁军"
},
[3416] ={
     id = 3416,
     words = "吃鸡巴"
},
[3417] ={
     id = 3417,
     words = "吃雞巴"
},
[3418] ={
     id = 3418,
     words = "持田茜"
},
[3419] ={
     id = 3419,
     words = "遲浩田"
},
[3420] ={
     id = 3420,
     words = "抽动肉"
},
[3421] ={
     id = 3421,
     words = "臭西化"
},
[3422] ={
     id = 3422,
     words = "处女膜"
},
[3423] ={
     id = 3423,
     words = "处女穴"
},
[3424] ={
     id = 3424,
     words = "慈善会"
},
[3425] ={
     id = 3425,
     words = "慈善會"
},
[3426] ={
     id = 3426,
     words = "粗鸡巴"
},
[3427] ={
     id = 3427,
     words = "粗肉棒"
},
[3428] ={
     id = 3428,
     words = "粗肉洞"
},
[3429] ={
     id = 3429,
     words = "崔英杰"
},
[3430] ={
     id = 3430,
     words = "打飞机"
},
[3431] ={
     id = 3431,
     words = "打飛機"
},
[3432] ={
     id = 3432,
     words = "打手枪"
},
[3433] ={
     id = 3433,
     words = "打手槍"
},
[3434] ={
     id = 3434,
     words = "打野炮"
},
[3435] ={
     id = 3435,
     words = "打砸抢"
},
[3436] ={
     id = 3436,
     words = "大j8"
},
[3437] ={
     id = 3437,
     words = "大东亚"
},
[3438] ={
     id = 3438,
     words = "大東亞"
},
[3439] ={
     id = 3439,
     words = "大富翁"
},
[3440] ={
     id = 3440,
     words = "大花逼"
},
[3441] ={
     id = 3441,
     words = "大纪园"
},
[3442] ={
     id = 3442,
     words = "大紀元"
},
[3443] ={
     id = 3443,
     words = "大力丸"
},
[3444] ={
     id = 3444,
     words = "大卵泡"
},
[3445] ={
     id = 3445,
     words = "大卵子"
},
[3446] ={
     id = 3446,
     words = "大乱交"
},
[3447] ={
     id = 3447,
     words = "大亂交"
},
[3448] ={
     id = 3448,
     words = "大妈油"
},
[3449] ={
     id = 3449,
     words = "大奶头"
},
[3450] ={
     id = 3450,
     words = "大肉棍"
},
[3451] ={
     id = 3451,
     words = "大乳頭"
},
[3452] ={
     id = 3452,
     words = "大史记"
},
[3453] ={
     id = 3453,
     words = "大史纪"
},
[3454] ={
     id = 3454,
     words = "大使官"
},
[3455] ={
     id = 3455,
     words = "大使馆"
},
[3456] ={
     id = 3456,
     words = "大衛教"
},
[3457] ={
     id = 3457,
     words = "大阳具"
},
[3458] ={
     id = 3458,
     words = "大跃进"
},
[3459] ={
     id = 3459,
     words = "大字报"
},
[3460] ={
     id = 3460,
     words = "戴秉囯"
},
[3461] ={
     id = 3461,
     words = "戴秉國"
},
[3462] ={
     id = 3462,
     words = "戴相龙"
},
[3463] ={
     id = 3463,
     words = "党卫兵"
},
[3464] ={
     id = 3464,
     words = "党中央"
},
[3465] ={
     id = 3465,
     words = "黨中央"
},
[3466] ={
     id = 3466,
     words = "刀OL"
},
[3467] ={
     id = 3467,
     words = "盜竊犯"
},
[3468] ={
     id = 3468,
     words = "邓力群"
},
[3469] ={
     id = 3469,
     words = "邓笑贫"
},
[3470] ={
     id = 3470,
     words = "邓颖超"
},
[3471] ={
     id = 3471,
     words = "鄧朴方"
},
[3472] ={
     id = 3472,
     words = "鄧小平"
},
[3473] ={
     id = 3473,
     words = "鄧穎超"
},
[3474] ={
     id = 3474,
     words = "弟%*子"
},
[3475] ={
     id = 3475,
     words = "第一话"
},
[3476] ={
     id = 3476,
     words = "蒂巴因"
},
[3477] ={
     id = 3477,
     words = "叼你媽"
},
[3478] ={
     id = 3478,
     words = "釣魚島"
},
[3479] ={
     id = 3479,
     words = "丁關根"
},
[3480] ={
     id = 3480,
     words = "丁加班"
},
[3481] ={
     id = 3481,
     words = "丁石孙"
},
[3482] ={
     id = 3482,
     words = "丁石孫"
},
[3483] ={
     id = 3483,
     words = "丁字裤"
},
[3484] ={
     id = 3484,
     words = "东洋屄"
},
[3485] ={
     id = 3485,
     words = "東京猫"
},
[3486] ={
     id = 3486,
     words = "東洋屄"
},
[3487] ={
     id = 3487,
     words = "董必武"
},
[3488] ={
     id = 3488,
     words = "董建華"
},
[3489] ={
     id = 3489,
     words = "董賤華"
},
[3490] ={
     id = 3490,
     words = "都江堰"
},
[3491] ={
     id = 3491,
     words = "豆豆秀"
},
[3492] ={
     id = 3492,
     words = "杜智富"
},
[3493] ={
     id = 3493,
     words = "短信猫"
},
[3494] ={
     id = 3494,
     words = "沌决靠"
},
[3495] ={
     id = 3495,
     words = "多人轮"
},
[3496] ={
     id = 3496,
     words = "多人輪"
},
[3497] ={
     id = 3497,
     words = "多維社"
},
[3498] ={
     id = 3498,
     words = "多維網"
},
[3499] ={
     id = 3499,
     words = "俄罗斯"
},
[3500] ={
     id = 3500,
     words = "发$抡"
},
[3501] ={
     id = 3501,
     words = "发$仑"
},
[3502] ={
     id = 3502,
     words = "发$伦"
},
[3503] ={
     id = 3503,
     words = "发$沦"
},
[3504] ={
     id = 3504,
     words = "发$纶"
},
[3505] ={
     id = 3505,
     words = "发$轮"
},
[3506] ={
     id = 3506,
     words = "发$论"
},
[3507] ={
     id = 3507,
     words = "发%*抡"
},
[3508] ={
     id = 3508,
     words = "发%*仑"
},
[3509] ={
     id = 3509,
     words = "发%*伦"
},
[3510] ={
     id = 3510,
     words = "发%*沦"
},
[3511] ={
     id = 3511,
     words = "发%*纶"
},
[3512] ={
     id = 3512,
     words = "发%*轮"
},
[3513] ={
     id = 3513,
     words = "发%*论"
},
[3514] ={
     id = 3514,
     words = "发@抡"
},
[3515] ={
     id = 3515,
     words = "发@仑"
},
[3516] ={
     id = 3516,
     words = "发@伦"
},
[3517] ={
     id = 3517,
     words = "发@沦"
},
[3518] ={
     id = 3518,
     words = "发@纶"
},
[3519] ={
     id = 3519,
     words = "发@轮"
},
[3520] ={
     id = 3520,
     words = "发@论"
},
[3521] ={
     id = 3521,
     words = "发^抡"
},
[3522] ={
     id = 3522,
     words = "发^仑"
},
[3523] ={
     id = 3523,
     words = "发^伦"
},
[3524] ={
     id = 3524,
     words = "发^沦"
},
[3525] ={
     id = 3525,
     words = "发^纶"
},
[3526] ={
     id = 3526,
     words = "发^轮"
},
[3527] ={
     id = 3527,
     words = "发^论"
},
[3528] ={
     id = 3528,
     words = "发~抡"
},
[3529] ={
     id = 3529,
     words = "发~仑"
},
[3530] ={
     id = 3530,
     words = "发~伦"
},
[3531] ={
     id = 3531,
     words = "发~沦"
},
[3532] ={
     id = 3532,
     words = "发~纶"
},
[3533] ={
     id = 3533,
     words = "发~轮"
},
[3534] ={
     id = 3534,
     words = "发~论"
},
[3535] ={
     id = 3535,
     words = "發$侖"
},
[3536] ={
     id = 3536,
     words = "發$淪"
},
[3537] ={
     id = 3537,
     words = "發$輪"
},
[3538] ={
     id = 3538,
     words = "發%*侖"
},
[3539] ={
     id = 3539,
     words = "發%*淪"
},
[3540] ={
     id = 3540,
     words = "發%*輪"
},
[3541] ={
     id = 3541,
     words = "發@侖"
},
[3542] ={
     id = 3542,
     words = "發@淪"
},
[3543] ={
     id = 3543,
     words = "發@輪"
},
[3544] ={
     id = 3544,
     words = "發^掄"
},
[3545] ={
     id = 3545,
     words = "發^侖"
},
[3546] ={
     id = 3546,
     words = "發^倫"
},
[3547] ={
     id = 3547,
     words = "發^綸"
},
[3548] ={
     id = 3548,
     words = "發^輪"
},
[3549] ={
     id = 3549,
     words = "發^論"
},
[3550] ={
     id = 3550,
     words = "發~掄"
},
[3551] ={
     id = 3551,
     words = "發~侖"
},
[3552] ={
     id = 3552,
     words = "發~倫"
},
[3553] ={
     id = 3553,
     words = "發~淪"
},
[3554] ={
     id = 3554,
     words = "發~綸"
},
[3555] ={
     id = 3555,
     words = "發~輪"
},
[3556] ={
     id = 3556,
     words = "發~論"
},
[3557] ={
     id = 3557,
     words = "發掄功"
},
[3558] ={
     id = 3558,
     words = "發倫功"
},
[3559] ={
     id = 3559,
     words = "發論功"
},
[3560] ={
     id = 3560,
     words = "發正念"
},
[3561] ={
     id = 3561,
     words = "法$抡"
},
[3562] ={
     id = 3562,
     words = "法$掄"
},
[3563] ={
     id = 3563,
     words = "法$仑"
},
[3564] ={
     id = 3564,
     words = "法$伦"
},
[3565] ={
     id = 3565,
     words = "法$沦"
},
[3566] ={
     id = 3566,
     words = "法$纶"
},
[3567] ={
     id = 3567,
     words = "法$侖"
},
[3568] ={
     id = 3568,
     words = "法$轮"
},
[3569] ={
     id = 3569,
     words = "法$倫"
},
[3570] ={
     id = 3570,
     words = "法$淪"
},
[3571] ={
     id = 3571,
     words = "法$綸"
},
[3572] ={
     id = 3572,
     words = "法$輪"
},
[3573] ={
     id = 3573,
     words = "法$论"
},
[3574] ={
     id = 3574,
     words = "法$論"
},
[3575] ={
     id = 3575,
     words = "法%*功"
},
[3576] ={
     id = 3576,
     words = "法%*抡"
},
[3577] ={
     id = 3577,
     words = "法%*掄"
},
[3578] ={
     id = 3578,
     words = "法%*仑"
},
[3579] ={
     id = 3579,
     words = "法%*伦"
},
[3580] ={
     id = 3580,
     words = "法%*沦"
},
[3581] ={
     id = 3581,
     words = "法%*纶"
},
[3582] ={
     id = 3582,
     words = "法%*侖"
},
[3583] ={
     id = 3583,
     words = "法%*轮"
},
[3584] ={
     id = 3584,
     words = "法%*倫"
},
[3585] ={
     id = 3585,
     words = "法%*淪"
},
[3586] ={
     id = 3586,
     words = "法%*綸"
},
[3587] ={
     id = 3587,
     words = "法%*輪"
},
[3588] ={
     id = 3588,
     words = "法%*论"
},
[3589] ={
     id = 3589,
     words = "法%*論"
},
[3590] ={
     id = 3590,
     words = "法@抡"
},
[3591] ={
     id = 3591,
     words = "法@掄"
},
[3592] ={
     id = 3592,
     words = "法@仑"
},
[3593] ={
     id = 3593,
     words = "法@伦"
},
[3594] ={
     id = 3594,
     words = "法@沦"
},
[3595] ={
     id = 3595,
     words = "法@纶"
},
[3596] ={
     id = 3596,
     words = "法@侖"
},
[3597] ={
     id = 3597,
     words = "法@轮"
},
[3598] ={
     id = 3598,
     words = "法@倫"
},
[3599] ={
     id = 3599,
     words = "法@淪"
},
[3600] ={
     id = 3600,
     words = "法@綸"
},
[3601] ={
     id = 3601,
     words = "法@輪"
},
[3602] ={
     id = 3602,
     words = "法@论"
},
[3603] ={
     id = 3603,
     words = "法@論"
},
[3604] ={
     id = 3604,
     words = "法^抡"
},
[3605] ={
     id = 3605,
     words = "法^掄"
},
[3606] ={
     id = 3606,
     words = "法^仑"
},
[3607] ={
     id = 3607,
     words = "法^伦"
},
[3608] ={
     id = 3608,
     words = "法^沦"
},
[3609] ={
     id = 3609,
     words = "法^纶"
},
[3610] ={
     id = 3610,
     words = "法^侖"
},
[3611] ={
     id = 3611,
     words = "法^轮"
},
[3612] ={
     id = 3612,
     words = "法^倫"
},
[3613] ={
     id = 3613,
     words = "法^淪"
},
[3614] ={
     id = 3614,
     words = "法^綸"
},
[3615] ={
     id = 3615,
     words = "法^輪"
},
[3616] ={
     id = 3616,
     words = "法^论"
},
[3617] ={
     id = 3617,
     words = "法^論"
},
[3618] ={
     id = 3618,
     words = "法~抡"
},
[3619] ={
     id = 3619,
     words = "法~掄"
},
[3620] ={
     id = 3620,
     words = "法~仑"
},
[3621] ={
     id = 3621,
     words = "法~伦"
},
[3622] ={
     id = 3622,
     words = "法~沦"
},
[3623] ={
     id = 3623,
     words = "法~纶"
},
[3624] ={
     id = 3624,
     words = "法~侖"
},
[3625] ={
     id = 3625,
     words = "法~轮"
},
[3626] ={
     id = 3626,
     words = "法~倫"
},
[3627] ={
     id = 3627,
     words = "法~淪"
},
[3628] ={
     id = 3628,
     words = "法~綸"
},
[3629] ={
     id = 3629,
     words = "法~輪"
},
[3630] ={
     id = 3630,
     words = "法~论"
},
[3631] ={
     id = 3631,
     words = "法~論"
},
[3632] ={
     id = 3632,
     words = "法抡功"
},
[3633] ={
     id = 3633,
     words = "法仑工"
},
[3634] ={
     id = 3634,
     words = "法仑公"
},
[3635] ={
     id = 3635,
     words = "法仑功"
},
[3636] ={
     id = 3636,
     words = "法仑攻"
},
[3637] ={
     id = 3637,
     words = "法仑共"
},
[3638] ={
     id = 3638,
     words = "法囵功"
},
[3639] ={
     id = 3639,
     words = "法沦功"
},
[3640] ={
     id = 3640,
     words = "法侖功"
},
[3641] ={
     id = 3641,
     words = "法轮工"
},
[3642] ={
     id = 3642,
     words = "法轮公"
},
[3643] ={
     id = 3643,
     words = "法轮攻"
},
[3644] ={
     id = 3644,
     words = "法轮共"
},
[3645] ={
     id = 3645,
     words = "法陯功"
},
[3646] ={
     id = 3646,
     words = "法婨功"
},
[3647] ={
     id = 3647,
     words = "法崘功"
},
[3648] ={
     id = 3648,
     words = "法惀功"
},
[3649] ={
     id = 3649,
     words = "法菕功"
},
[3650] ={
     id = 3650,
     words = "法棆功"
},
[3651] ={
     id = 3651,
     words = "法腀功"
},
[3652] ={
     id = 3652,
     words = "法碖功"
},
[3653] ={
     id = 3653,
     words = "法蜦功"
},
[3654] ={
     id = 3654,
     words = "法踚功"
},
[3655] ={
     id = 3655,
     words = "法輪功"
},
[3656] ={
     id = 3656,
     words = "法磮功"
},
[3657] ={
     id = 3657,
     words = "法錀功"
},
[3658] ={
     id = 3658,
     words = "法鯩功"
},
[3659] ={
     id = 3659,
     words = "法稐功"
},
[3660] ={
     id = 3660,
     words = "法耣功"
},
[3661] ={
     id = 3661,
     words = "法论工"
},
[3662] ={
     id = 3662,
     words = "法论公"
},
[3663] ={
     id = 3663,
     words = "法论功"
},
[3664] ={
     id = 3664,
     words = "法论攻"
},
[3665] ={
     id = 3665,
     words = "法论共"
},
[3666] ={
     id = 3666,
     words = "法埨功"
},
[3667] ={
     id = 3667,
     words = "法溣功"
},
[3668] ={
     id = 3668,
     words = "法黁功"
},
[3669] ={
     id = 3669,
     words = "法谪功"
},
[3670] ={
     id = 3670,
     words = "反封锁"
},
[3671] ={
     id = 3671,
     words = "反人类"
},
[3672] ={
     id = 3672,
     words = "反人民"
},
[3673] ={
     id = 3673,
     words = "反社会"
},
[3674] ={
     id = 3674,
     words = "反社會"
},
[3675] ={
     id = 3675,
     words = "方励之"
},
[3676] ={
     id = 3676,
     words = "方晓日"
},
[3677] ={
     id = 3677,
     words = "方舟子"
},
[3678] ={
     id = 3678,
     words = "扉之阴"
},
[3679] ={
     id = 3679,
     words = "扉之陰"
},
[3680] ={
     id = 3680,
     words = "斐得勒"
},
[3681] ={
     id = 3681,
     words = "费良勇"
},
[3682] ={
     id = 3682,
     words = "分家在"
},
[3683] ={
     id = 3683,
     words = "芬太尼"
},
[3684] ={
     id = 3684,
     words = "粉红穴"
},
[3685] ={
     id = 3685,
     words = "粉紅穴"
},
[3686] ={
     id = 3686,
     words = "风尘劫"
},
[3687] ={
     id = 3687,
     words = "风艳阁"
},
[3688] ={
     id = 3688,
     words = "封从德"
},
[3689] ={
     id = 3689,
     words = "封神榜"
},
[3690] ={
     id = 3690,
     words = "風豔閣"
},
[3691] ={
     id = 3691,
     words = "冯东海"
},
[3692] ={
     id = 3692,
     words = "冯素英"
},
[3693] ={
     id = 3693,
     words = "浮夸风"
},
[3694] ={
     id = 3694,
     words = "福呵定"
},
[3695] ={
     id = 3695,
     words = "福摩萨"
},
[3696] ={
     id = 3696,
     words = "福摩薩"
},
[3697] ={
     id = 3697,
     words = "付申奇"
},
[3698] ={
     id = 3698,
     words = "傅全有"
},
[3699] ={
     id = 3699,
     words = "傅申奇"
},
[3700] ={
     id = 3700,
     words = "傅铁山"
},
[3701] ={
     id = 3701,
     words = "傅鐵山"
},
[3702] ={
     id = 3702,
     words = "傅志寰"
},
[3703] ={
     id = 3703,
     words = "傅作義"
},
[3704] ={
     id = 3704,
     words = "干bi"
},
[3705] ={
     id = 3705,
     words = "干ＧＭ"
},
[3706] ={
     id = 3706,
     words = "干x娘"
},
[3707] ={
     id = 3707,
     words = "干的你"
},
[3708] ={
     id = 3708,
     words = "干的爽"
},
[3709] ={
     id = 3709,
     words = "干机掰"
},
[3710] ={
     id = 3710,
     words = "干姐姐"
},
[3711] ={
     id = 3711,
     words = "干妳马"
},
[3712] ={
     id = 3712,
     words = "干你良"
},
[3713] ={
     id = 3713,
     words = "干您娘"
},
[3714] ={
     id = 3714,
     words = "干全家"
},
[3715] ={
     id = 3715,
     words = "干骚女"
},
[3716] ={
     id = 3716,
     words = "干嫂子"
},
[3717] ={
     id = 3717,
     words = "干小穴"
},
[3718] ={
     id = 3718,
     words = "干一家"
},
[3719] ={
     id = 3719,
     words = "幹bi"
},
[3720] ={
     id = 3720,
     words = "幹ＧＭ"
},
[3721] ={
     id = 3721,
     words = "幹GM"
},
[3722] ={
     id = 3722,
     words = "幹x娘"
},
[3723] ={
     id = 3723,
     words = "幹的你"
},
[3724] ={
     id = 3724,
     words = "幹的爽"
},
[3725] ={
     id = 3725,
     words = "幹機掰"
},
[3726] ={
     id = 3726,
     words = "幹拎娘"
},
[3727] ={
     id = 3727,
     words = "幹妳媽"
},
[3728] ={
     id = 3728,
     words = "幹妳馬"
},
[3729] ={
     id = 3729,
     words = "幹妳娘"
},
[3730] ={
     id = 3730,
     words = "幹你良"
},
[3731] ={
     id = 3731,
     words = "幹你媽"
},
[3732] ={
     id = 3732,
     words = "幹你娘"
},
[3733] ={
     id = 3733,
     words = "幹您娘"
},
[3734] ={
     id = 3734,
     words = "幹七八"
},
[3735] ={
     id = 3735,
     words = "幹全家"
},
[3736] ={
     id = 3736,
     words = "幹死你"
},
[3737] ={
     id = 3737,
     words = "幹一家"
},
[3738] ={
     id = 3738,
     words = "赣您娘"
},
[3739] ={
     id = 3739,
     words = "贛您娘"
},
[3740] ={
     id = 3740,
     words = "灨你娘"
},
[3741] ={
     id = 3741,
     words = "刚瘪三"
},
[3742] ={
     id = 3742,
     words = "钢管舞"
},
[3743] ={
     id = 3743,
     words = "剛癟三"
},
[3744] ={
     id = 3744,
     words = "鋼管舞"
},
[3745] ={
     id = 3745,
     words = "高级逼"
},
[3746] ={
     id = 3746,
     words = "高級逼"
},
[3747] ={
     id = 3747,
     words = "高丽棒"
},
[3748] ={
     id = 3748,
     words = "高丽樸"
},
[3749] ={
     id = 3749,
     words = "高麗棒"
},
[3750] ={
     id = 3750,
     words = "高麗朴"
},
[3751] ={
     id = 3751,
     words = "高麗樸"
},
[3752] ={
     id = 3752,
     words = "高文谦"
},
[3753] ={
     id = 3753,
     words = "膏藥旗"
},
[3754] ={
     id = 3754,
     words = "戈万钧"
},
[3755] ={
     id = 3755,
     words = "格老子"
},
[3756] ={
     id = 3756,
     words = "给你爽"
},
[3757] ={
     id = 3757,
     words = "給你爽"
},
[3758] ={
     id = 3758,
     words = "工自联"
},
[3759] ={
     id = 3759,
     words = "公务员"
},
[3760] ={
     id = 3760,
     words = "公媳乱"
},
[3761] ={
     id = 3761,
     words = "公媳亂"
},
[3762] ={
     id = 3762,
     words = "公子冲"
},
[3763] ={
     id = 3763,
     words = "公子开"
},
[3764] ={
     id = 3764,
     words = "龚学平"
},
[3765] ={
     id = 3765,
     words = "龚學平"
},
[3766] ={
     id = 3766,
     words = "龔学平"
},
[3767] ={
     id = 3767,
     words = "龔學平"
},
[3768] ={
     id = 3768,
     words = "共%*党"
},
[3769] ={
     id = 3769,
     words = "共產黨"
},
[3770] ={
     id = 3770,
     words = "共铲党"
},
[3771] ={
     id = 3771,
     words = "共鏟黨"
},
[3772] ={
     id = 3772,
     words = "共荣圈"
},
[3773] ={
     id = 3773,
     words = "共榮圈"
},
[3774] ={
     id = 3774,
     words = "狗卵子"
},
[3775] ={
     id = 3775,
     words = "狗杂种"
},
[3776] ={
     id = 3776,
     words = "狗雜種"
},
[3777] ={
     id = 3777,
     words = "顾顺章"
},
[3778] ={
     id = 3778,
     words = "瓜婆娘"
},
[3779] ={
     id = 3779,
     words = "瓜娃子"
},
[3780] ={
     id = 3780,
     words = "关卓中"
},
[3781] ={
     id = 3781,
     words = "觀世音"
},
[3782] ={
     id = 3782,
     words = "管里员"
},
[3783] ={
     id = 3783,
     words = "管理員"
},
[3784] ={
     id = 3784,
     words = "管裏員"
},
[3785] ={
     id = 3785,
     words = "广东王"
},
[3786] ={
     id = 3786,
     words = "龜兒子"
},
[3787] ={
     id = 3787,
     words = "鬼轮奸"
},
[3788] ={
     id = 3788,
     words = "鬼輪奸"
},
[3789] ={
     id = 3789,
     words = "鬼輪姦"
},
[3790] ={
     id = 3790,
     words = "滚滚球"
},
[3791] ={
     id = 3791,
     words = "滚那吗"
},
[3792] ={
     id = 3792,
     words = "滾滾球"
},
[3793] ={
     id = 3793,
     words = "滾那嗎"
},
[3794] ={
     id = 3794,
     words = "郭罗基"
},
[3795] ={
     id = 3795,
     words = "郭岩华"
},
[3796] ={
     id = 3796,
     words = "國民黨"
},
[3797] ={
     id = 3797,
     words = "國務院"
},
[3798] ={
     id = 3798,
     words = "海盗王"
},
[3799] ={
     id = 3799,
     words = "海盜王"
},
[3800] ={
     id = 3800,
     words = "海乐神"
},
[3801] ={
     id = 3801,
     words = "酣乐欣"
},
[3802] ={
     id = 3802,
     words = "韩东方"
},
[3803] ={
     id = 3803,
     words = "韩桂芝"
},
[3804] ={
     id = 3804,
     words = "韩联潮"
},
[3805] ={
     id = 3805,
     words = "韩启德"
},
[3806] ={
     id = 3806,
     words = "韩天石"
},
[3807] ={
     id = 3807,
     words = "韩杼滨"
},
[3808] ={
     id = 3808,
     words = "韓桂芝"
},
[3809] ={
     id = 3809,
     words = "韓啓德"
},
[3810] ={
     id = 3810,
     words = "韓啟德"
},
[3811] ={
     id = 3811,
     words = "汉娃娃"
},
[3812] ={
     id = 3812,
     words = "漢娃娃"
},
[3813] ={
     id = 3813,
     words = "好粗啊"
},
[3814] ={
     id = 3814,
     words = "好哥哥"
},
[3815] ={
     id = 3815,
     words = "好朋友"
},
[3816] ={
     id = 3816,
     words = "好舒服"
},
[3817] ={
     id = 3817,
     words = "好爽喲"
},
[3818] ={
     id = 3818,
     words = "郝建秀"
},
[3819] ={
     id = 3819,
     words = "何德普"
},
[3820] ={
     id = 3820,
     words = "何候華"
},
[3821] ={
     id = 3821,
     words = "何加栋"
},
[3822] ={
     id = 3822,
     words = "何加棟"
},
[3823] ={
     id = 3823,
     words = "賀國強"
},
[3824] ={
     id = 3824,
     words = "黑鲍娇"
},
[3825] ={
     id = 3825,
     words = "黑鮑娇"
},
[3826] ={
     id = 3826,
     words = "黑鮑嬌"
},
[3827] ={
     id = 3827,
     words = "黑毛屄"
},
[3828] ={
     id = 3828,
     words = "黑社會"
},
[3829] ={
     id = 3829,
     words = "黑手黨"
},
[3830] ={
     id = 3830,
     words = "黑天使"
},
[3831] ={
     id = 3831,
     words = "黑五类"
},
[3832] ={
     id = 3832,
     words = "红宝石"
},
[3833] ={
     id = 3833,
     words = "红灯区"
},
[3834] ={
     id = 3834,
     words = "红海湾"
},
[3835] ={
     id = 3835,
     words = "洪哲胜"
},
[3836] ={
     id = 3836,
     words = "紅燈區"
},
[3837] ={
     id = 3837,
     words = "紅衛兵"
},
[3838] ={
     id = 3838,
     words = "胡锦滔"
},
[3839] ={
     id = 3839,
     words = "胡锦濤"
},
[3840] ={
     id = 3840,
     words = "胡緊掏"
},
[3841] ={
     id = 3841,
     words = "胡緊濤"
},
[3842] ={
     id = 3842,
     words = "胡緊套"
},
[3843] ={
     id = 3843,
     words = "胡錦涛"
},
[3844] ={
     id = 3844,
     words = "胡錦滔"
},
[3845] ={
     id = 3845,
     words = "胡錦淘"
},
[3846] ={
     id = 3846,
     words = "胡景涛"
},
[3847] ={
     id = 3847,
     words = "胡景濤"
},
[3848] ={
     id = 3848,
     words = "胡启立"
},
[3849] ={
     id = 3849,
     words = "胡喬木"
},
[3850] ={
     id = 3850,
     words = "胡新宇"
},
[3851] ={
     id = 3851,
     words = "胡耀帮"
},
[3852] ={
     id = 3852,
     words = "葫芦案"
},
[3853] ={
     id = 3853,
     words = "葫蘆案"
},
[3854] ={
     id = 3854,
     words = "蝴蝶逼"
},
[3855] ={
     id = 3855,
     words = "护士穴"
},
[3856] ={
     id = 3856,
     words = "哗哗曼"
},
[3857] ={
     id = 3857,
     words = "華國鋒"
},
[3858] ={
     id = 3858,
     words = "華建敏"
},
[3859] ={
     id = 3859,
     words = "嘩嘩曼"
},
[3860] ={
     id = 3860,
     words = "欢乐城"
},
[3861] ={
     id = 3861,
     words = "歡樂城"
},
[3862] ={
     id = 3862,
     words = "黃孟複"
},
[3863] ={
     id = 3863,
     words = "黄慈萍"
},
[3864] ={
     id = 3864,
     words = "黄家骁"
},
[3865] ={
     id = 3865,
     words = "黄克诚"
},
[3866] ={
     id = 3866,
     words = "黄孟复"
},
[3867] ={
     id = 3867,
     words = "黄永胜"
},
[3868] ={
     id = 3868,
     words = "囘良玉"
},
[3869] ={
     id = 3869,
     words = "回民暴"
},
[3870] ={
     id = 3870,
     words = "悔过书"
},
[3871] ={
     id = 3871,
     words = "婚外恋"
},
[3872] ={
     id = 3872,
     words = "婚外戀"
},
[3873] ={
     id = 3873,
     words = "姬胜德"
},
[3874] ={
     id = 3874,
     words = "姬野爱"
},
[3875] ={
     id = 3875,
     words = "积克馆"
},
[3876] ={
     id = 3876,
     words = "激情色"
},
[3877] ={
     id = 3877,
     words = "激情淫"
},
[3878] ={
     id = 3878,
     words = "吉川萌"
},
[3879] ={
     id = 3879,
     words = "集体淫"
},
[3880] ={
     id = 3880,
     words = "集體淫"
},
[3881] ={
     id = 3881,
     words = "擠母奶"
},
[3882] ={
     id = 3882,
     words = "纪登奎"
},
[3883] ={
     id = 3883,
     words = "家乐福"
},
[3884] ={
     id = 3884,
     words = "贾廷安"
},
[3885] ={
     id = 3885,
     words = "贾育台"
},
[3886] ={
     id = 3886,
     words = "賈慶林"
},
[3887] ={
     id = 3887,
     words = "建国党"
},
[3888] ={
     id = 3888,
     words = "剑网2"
},
[3889] ={
     id = 3889,
     words = "剑网3"
},
[3890] ={
     id = 3890,
     words = "贱bi"
},
[3891] ={
     id = 3891,
     words = "劍網2"
},
[3892] ={
     id = 3892,
     words = "劍網3"
},
[3893] ={
     id = 3893,
     words = "賤bi"
},
[3894] ={
     id = 3894,
     words = "江八點"
},
[3895] ={
     id = 3895,
     words = "江八条"
},
[3896] ={
     id = 3896,
     words = "江八條"
},
[3897] ={
     id = 3897,
     words = "江獨裁"
},
[3898] ={
     id = 3898,
     words = "江流氓"
},
[3899] ={
     id = 3899,
     words = "江绵恒"
},
[3900] ={
     id = 3900,
     words = "江戲子"
},
[3901] ={
     id = 3901,
     words = "江则民"
},
[3902] ={
     id = 3902,
     words = "江泽慧"
},
[3903] ={
     id = 3903,
     words = "江則民"
},
[3904] ={
     id = 3904,
     words = "江擇民"
},
[3905] ={
     id = 3905,
     words = "江澤民"
},
[3906] ={
     id = 3906,
     words = "江賊民"
},
[3907] ={
     id = 3907,
     words = "江豬媳"
},
[3908] ={
     id = 3908,
     words = "姜春云"
},
[3909] ={
     id = 3909,
     words = "将则民"
},
[3910] ={
     id = 3910,
     words = "僵賊民"
},
[3911] ={
     id = 3911,
     words = "薑春雲"
},
[3912] ={
     id = 3912,
     words = "蒋树声"
},
[3913] ={
     id = 3913,
     words = "蒋彦勇"
},
[3914] ={
     id = 3914,
     words = "蒋震文"
},
[3915] ={
     id = 3915,
     words = "蒋正华"
},
[3916] ={
     id = 3916,
     words = "蒋中国"
},
[3917] ={
     id = 3917,
     words = "蔣介石"
},
[3918] ={
     id = 3918,
     words = "蔣經國"
},
[3919] ={
     id = 3919,
     words = "蔣樹聲"
},
[3920] ={
     id = 3920,
     words = "蔣彥永"
},
[3921] ={
     id = 3921,
     words = "蔣彥勇"
},
[3922] ={
     id = 3922,
     words = "蔣正華"
},
[3923] ={
     id = 3923,
     words = "蔣中正"
},
[3924] ={
     id = 3924,
     words = "降半旗"
},
[3925] ={
     id = 3925,
     words = "醬豬媳"
},
[3926] ={
     id = 3926,
     words = "教养院"
},
[3927] ={
     id = 3927,
     words = "她妈地"
},
[3928] ={
     id = 3928,
     words = "她媽的"
},
[3929] ={
     id = 3929,
     words = "她媽地"
},
[3930] ={
     id = 3930,
     words = "她马的"
},
[3931] ={
     id = 3931,
     words = "她馬的"
},
[3932] ={
     id = 3932,
     words = "金币网"
},
[3933] ={
     id = 3933,
     words = "金伯帆"
},
[3934] ={
     id = 3934,
     words = "金毛穴"
},
[3935] ={
     id = 3935,
     words = "金瓶梅"
},
[3936] ={
     id = 3936,
     words = "金三角"
},
[3937] ={
     id = 3937,
     words = "金新月"
},
[3938] ={
     id = 3938,
     words = "金尧如"
},
[3939] ={
     id = 3939,
     words = "金泽辰"
},
[3940] ={
     id = 3940,
     words = "劲舞团"
},
[3941] ={
     id = 3941,
     words = "勁舞團"
},
[3942] ={
     id = 3942,
     words = "精神病"
},
[3943] ={
     id = 3943,
     words = "精液浴"
},
[3944] ={
     id = 3944,
     words = "糾察員"
},
[3945] ={
     id = 3945,
     words = "久游网"
},
[3946] ={
     id = 3946,
     words = "久遊網"
},
[3947] ={
     id = 3947,
     words = "久之游"
},
[3948] ={
     id = 3948,
     words = "久之遊"
},
[3949] ={
     id = 3949,
     words = "就去日"
},
[3950] ={
     id = 3950,
     words = "菊花洞"
},
[3951] ={
     id = 3951,
     words = "菊花蕾"
},
[3952] ={
     id = 3952,
     words = "菊花穴"
},
[3953] ={
     id = 3953,
     words = "巨灵神"
},
[3954] ={
     id = 3954,
     words = "瞿秋白"
},
[3955] ={
     id = 3955,
     words = "卡弗蒂"
},
[3956] ={
     id = 3956,
     words = "砍死你"
},
[3957] ={
     id = 3957,
     words = "看護婦"
},
[3958] ={
     id = 3958,
     words = "看中国"
},
[3959] ={
     id = 3959,
     words = "靠你媽"
},
[3960] ={
     id = 3960,
     words = "柯赐海"
},
[3961] ={
     id = 3961,
     words = "柯賜海"
},
[3962] ={
     id = 3962,
     words = "柯庆施"
},
[3963] ={
     id = 3963,
     words = "柯慶施"
},
[3964] ={
     id = 3964,
     words = "科洛斯"
},
[3965] ={
     id = 3965,
     words = "可哥精"
},
[3966] ={
     id = 3966,
     words = "可卡葉"
},
[3967] ={
     id = 3967,
     words = "可可精"
},
[3968] ={
     id = 3968,
     words = "克林頓"
},
[3969] ={
     id = 3969,
     words = "空姐操"
},
[3970] ={
     id = 3970,
     words = "孔雀王"
},
[3971] ={
     id = 3971,
     words = "快来插"
},
[3972] ={
     id = 3972,
     words = "邝锦文"
},
[3973] ={
     id = 3973,
     words = "拉皮条"
},
[3974] ={
     id = 3974,
     words = "拉皮條"
},
[3975] ={
     id = 3975,
     words = "拉手冲"
},
[3976] ={
     id = 3976,
     words = "来栖!"
},
[3977] ={
     id = 3977,
     words = "賴昌星"
},
[3978] ={
     id = 3978,
     words = "老板娘"
},
[3979] ={
     id = 3979,
     words = "老瘪三"
},
[3980] ={
     id = 3980,
     words = "老癟三"
},
[3981] ={
     id = 3981,
     words = "老骚比"
},
[3982] ={
     id = 3982,
     words = "老骚货"
},
[3983] ={
     id = 3983,
     words = "老騷比"
},
[3984] ={
     id = 3984,
     words = "老騷貨"
},
[3985] ={
     id = 3985,
     words = "蛯原舞"
},
[3986] ={
     id = 3986,
     words = "黎安友"
},
[3987] ={
     id = 3987,
     words = "礼品机"
},
[3988] ={
     id = 3988,
     words = "李長春"
},
[3989] ={
     id = 3989,
     words = "李大師"
},
[3990] ={
     id = 3990,
     words = "李德生"
},
[3991] ={
     id = 3991,
     words = "李登輝"
},
[3992] ={
     id = 3992,
     words = "李登柱"
},
[3993] ={
     id = 3993,
     words = "李贵鲜"
},
[3994] ={
     id = 3994,
     words = "李弘志"
},
[3995] ={
     id = 3995,
     words = "李红痔"
},
[3996] ={
     id = 3996,
     words = "李红智"
},
[3997] ={
     id = 3997,
     words = "李洪宽"
},
[3998] ={
     id = 3998,
     words = "李洪智"
},
[3999] ={
     id = 3999,
     words = "李紅志"
},
[4000] ={
     id = 4000,
     words = "李紅智"
},
[4001] ={
     id = 4001,
     words = "李继耐"
},
[4002] ={
     id = 4002,
     words = "李建国"
},
[4003] ={
     id = 4003,
     words = "李建國"
},
[4004] ={
     id = 4004,
     words = "李金华"
},
[4005] ={
     id = 4005,
     words = "李金華"
},
[4006] ={
     id = 4006,
     words = "李克強"
},
[4007] ={
     id = 4007,
     words = "李克强"
},
[4008] ={
     id = 4008,
     words = "李兰菊"
},
[4009] ={
     id = 4009,
     words = "李嵐清"
},
[4010] ={
     id = 4010,
     words = "李老师"
},
[4011] ={
     id = 4011,
     words = "李老師"
},
[4012] ={
     id = 4012,
     words = "李立三"
},
[4013] ={
     id = 4013,
     words = "李沛瑶"
},
[4014] ={
     id = 4014,
     words = "李瑞環"
},
[4015] ={
     id = 4015,
     words = "李少民"
},
[4016] ={
     id = 4016,
     words = "李师父"
},
[4017] ={
     id = 4017,
     words = "李师付"
},
[4018] ={
     id = 4018,
     words = "李师傅"
},
[4019] ={
     id = 4019,
     words = "李師父"
},
[4020] ={
     id = 4020,
     words = "李師付"
},
[4021] ={
     id = 4021,
     words = "李師傅"
},
[4022] ={
     id = 4022,
     words = "李淑娴"
},
[4023] ={
     id = 4023,
     words = "李鐵映"
},
[4024] ={
     id = 4024,
     words = "李旺阳"
},
[4025] ={
     id = 4025,
     words = "李维汉"
},
[4026] ={
     id = 4026,
     words = "李文斌"
},
[4027] ={
     id = 4027,
     words = "李小朋"
},
[4028] ={
     id = 4028,
     words = "李小鹏"
},
[4029] ={
     id = 4029,
     words = "李雪峰"
},
[4030] ={
     id = 4030,
     words = "李兆焯"
},
[4031] ={
     id = 4031,
     words = "李至伦"
},
[4032] ={
     id = 4032,
     words = "李志绥"
},
[4033] ={
     id = 4033,
     words = "李总理"
},
[4034] ={
     id = 4034,
     words = "李总统"
},
[4035] ={
     id = 4035,
     words = "李作鹏"
},
[4036] ={
     id = 4036,
     words = "厉无畏"
},
[4037] ={
     id = 4037,
     words = "丽春苑"
},
[4038] ={
     id = 4038,
     words = "厲無畏"
},
[4039] ={
     id = 4039,
     words = "麗春苑"
},
[4040] ={
     id = 4040,
     words = "连胜德"
},
[4041] ={
     id = 4041,
     words = "连线机"
},
[4042] ={
     id = 4042,
     words = "莲花逼"
},
[4043] ={
     id = 4043,
     words = "蓮花逼"
},
[4044] ={
     id = 4044,
     words = "梁保华"
},
[4045] ={
     id = 4045,
     words = "梁光烈"
},
[4046] ={
     id = 4046,
     words = "梁擎墩"
},
[4047] ={
     id = 4047,
     words = "两国论"
},
[4048] ={
     id = 4048,
     words = "两腿间"
},
[4049] ={
     id = 4049,
     words = "兩國論"
},
[4050] ={
     id = 4050,
     words = "辽宁女"
},
[4051] ={
     id = 4051,
     words = "聊天室"
},
[4052] ={
     id = 4052,
     words = "廖承志"
},
[4053] ={
     id = 4053,
     words = "廖锡龙"
},
[4054] ={
     id = 4054,
     words = "林保华"
},
[4055] ={
     id = 4055,
     words = "林伯渠"
},
[4056] ={
     id = 4056,
     words = "林长盛"
},
[4057] ={
     id = 4057,
     words = "林樵清"
},
[4058] ={
     id = 4058,
     words = "林榮一"
},
[4059] ={
     id = 4059,
     words = "林慎立"
},
[4060] ={
     id = 4060,
     words = "林文漪"
},
[4061] ={
     id = 4061,
     words = "林祖涵"
},
[4062] ={
     id = 4062,
     words = "灵游记"
},
[4063] ={
     id = 4063,
     words = "靈遊記"
},
[4064] ={
     id = 4064,
     words = "刘宾深"
},
[4065] ={
     id = 4065,
     words = "刘宾雁"
},
[4066] ={
     id = 4066,
     words = "刘国凯"
},
[4067] ={
     id = 4067,
     words = "刘华清"
},
[4068] ={
     id = 4068,
     words = "刘俊国"
},
[4069] ={
     id = 4069,
     words = "刘凯中"
},
[4070] ={
     id = 4070,
     words = "刘澜涛"
},
[4071] ={
     id = 4071,
     words = "刘丽英"
},
[4072] ={
     id = 4072,
     words = "刘千石"
},
[4073] ={
     id = 4073,
     words = "刘全喜"
},
[4074] ={
     id = 4074,
     words = "刘山青"
},
[4075] ={
     id = 4075,
     words = "刘士贤"
},
[4076] ={
     id = 4076,
     words = "刘文胜"
},
[4077] ={
     id = 4077,
     words = "刘晓波"
},
[4078] ={
     id = 4078,
     words = "刘晓竹"
},
[4079] ={
     id = 4079,
     words = "刘延东"
},
[4080] ={
     id = 4080,
     words = "刘永川"
},
[4081] ={
     id = 4081,
     words = "刘正荣"
},
[4082] ={
     id = 4082,
     words = "流蜜汁"
},
[4083] ={
     id = 4083,
     words = "流水了"
},
[4084] ={
     id = 4084,
     words = "流淫水"
},
[4085] ={
     id = 4085,
     words = "劉伯承"
},
[4086] ={
     id = 4086,
     words = "劉奇葆"
},
[4087] ={
     id = 4087,
     words = "劉少奇"
},
[4088] ={
     id = 4088,
     words = "劉曉波"
},
[4089] ={
     id = 4089,
     words = "劉曉竹"
},
[4090] ={
     id = 4090,
     words = "劉延東"
},
[4091] ={
     id = 4091,
     words = "劉雲山"
},
[4092] ={
     id = 4092,
     words = "柳濑遥"
},
[4093] ={
     id = 4093,
     words = "柳下惠"
},
[4094] ={
     id = 4094,
     words = "六？四"
},
[4095] ={
     id = 4095,
     words = "六合采"
},
[4096] ={
     id = 4096,
     words = "六决不"
},
[4097] ={
     id = 4097,
     words = "龙虎豹"
},
[4098] ={
     id = 4098,
     words = "露阴照"
},
[4099] ={
     id = 4099,
     words = "露陰照"
},
[4100] ={
     id = 4100,
     words = "卢福坦"
},
[4101] ={
     id = 4101,
     words = "卢跃刚"
},
[4102] ={
     id = 4102,
     words = "陆定一"
},
[4103] ={
     id = 4103,
     words = "陆委会"
},
[4104] ={
     id = 4104,
     words = "路甬祥"
},
[4105] ={
     id = 4105,
     words = "吕京花"
},
[4106] ={
     id = 4106,
     words = "呂秀蓮"
},
[4107] ={
     id = 4107,
     words = "轮盘机"
},
[4108] ={
     id = 4108,
     words = "轮子功"
},
[4109] ={
     id = 4109,
     words = "輪子功"
},
[4110] ={
     id = 4110,
     words = "罗富和"
},
[4111] ={
     id = 4111,
     words = "罗礼诗"
},
[4112] ={
     id = 4112,
     words = "羅富和"
},
[4113] ={
     id = 4113,
     words = "妈的b"
},
[4114] ={
     id = 4114,
     words = "妈个b"
},
[4115] ={
     id = 4115,
     words = "妈个比"
},
[4116] ={
     id = 4116,
     words = "妈妈的"
},
[4117] ={
     id = 4117,
     words = "媽的B"
},
[4118] ={
     id = 4118,
     words = "媽個B"
},
[4119] ={
     id = 4119,
     words = "媽個比"
},
[4120] ={
     id = 4120,
     words = "媽媽的"
},
[4121] ={
     id = 4121,
     words = "麻黃素"
},
[4122] ={
     id = 4122,
     words = "麻黄素"
},
[4123] ={
     id = 4123,
     words = "马大维"
},
[4124] ={
     id = 4124,
     words = "马国瑞"
},
[4125] ={
     id = 4125,
     words = "马良骏"
},
[4126] ={
     id = 4126,
     words = "马巧珍"
},
[4127] ={
     id = 4127,
     words = "马三家"
},
[4128] ={
     id = 4128,
     words = "马时敏"
},
[4129] ={
     id = 4129,
     words = "马万祺"
},
[4130] ={
     id = 4130,
     words = "玛雅网"
},
[4131] ={
     id = 4131,
     words = "馬克思"
},
[4132] ={
     id = 4132,
     words = "馬巧珍"
},
[4133] ={
     id = 4133,
     words = "馬万祺"
},
[4134] ={
     id = 4134,
     words = "馬萬祺"
},
[4135] ={
     id = 4135,
     words = "馬英九"
},
[4136] ={
     id = 4136,
     words = "瑪雅網"
},
[4137] ={
     id = 4137,
     words = "买春堂"
},
[4138] ={
     id = 4138,
     words = "買財富"
},
[4139] ={
     id = 4139,
     words = "買月卡"
},
[4140] ={
     id = 4140,
     words = "売春婦"
},
[4141] ={
     id = 4141,
     words = "麦叫酸"
},
[4142] ={
     id = 4142,
     words = "卖。国"
},
[4143] ={
     id = 4143,
     words = "賣ID"
},
[4144] ={
     id = 4144,
     words = "賣QQ"
},
[4145] ={
     id = 4145,
     words = "賣財富"
},
[4146] ={
     id = 4146,
     words = "賣軟體"
},
[4147] ={
     id = 4147,
     words = "賣月卡"
},
[4148] ={
     id = 4148,
     words = "馒头屄"
},
[4149] ={
     id = 4149,
     words = "满洲国"
},
[4150] ={
     id = 4150,
     words = "滿洲國"
},
[4151] ={
     id = 4151,
     words = "毛廁洞"
},
[4152] ={
     id = 4152,
     words = "毛泽東"
},
[4153] ={
     id = 4153,
     words = "毛澤东"
},
[4154] ={
     id = 4154,
     words = "毛澤東"
},
[4155] ={
     id = 4155,
     words = "毛賊東"
},
[4156] ={
     id = 4156,
     words = "冒险岛"
},
[4157] ={
     id = 4157,
     words = "玫瑰园"
},
[4158] ={
     id = 4158,
     words = "梅花屄"
},
[4159] ={
     id = 4159,
     words = "梅花網"
},
[4160] ={
     id = 4160,
     words = "美國佬"
},
[4161] ={
     id = 4161,
     words = "美女穴"
},
[4162] ={
     id = 4162,
     words = "美骚妇"
},
[4163] ={
     id = 4163,
     words = "美騷婦"
},
[4164] ={
     id = 4164,
     words = "美沙酮"
},
[4165] ={
     id = 4165,
     words = "美少妇"
},
[4166] ={
     id = 4166,
     words = "美少婦"
},
[4167] ={
     id = 4167,
     words = "美仙子"
},
[4168] ={
     id = 4168,
     words = "妹的穴"
},
[4169] ={
     id = 4169,
     words = "妹妹穴"
},
[4170] ={
     id = 4170,
     words = "蒙巴顿"
},
[4171] ={
     id = 4171,
     words = "蒙古独"
},
[4172] ={
     id = 4172,
     words = "孟建柱"
},
[4173] ={
     id = 4173,
     words = "米田共"
},
[4174] ={
     id = 4174,
     words = "秘书长"
},
[4175] ={
     id = 4175,
     words = "免费淫"
},
[4176] ={
     id = 4176,
     words = "民進黨"
},
[4177] ={
     id = 4177,
     words = "民政局"
},
[4178] ={
     id = 4178,
     words = "民主墙"
},
[4179] ={
     id = 4179,
     words = "明慧網"
},
[4180] ={
     id = 4180,
     words = "摸阴蒂"
},
[4181] ={
     id = 4181,
     words = "摸陰蒂"
},
[4182] ={
     id = 4182,
     words = "模拟机"
},
[4183] ={
     id = 4183,
     words = "摩力游"
},
[4184] ={
     id = 4184,
     words = "摩力遊"
},
[4185] ={
     id = 4185,
     words = "摩洛客"
},
[4186] ={
     id = 4186,
     words = "摩門教"
},
[4187] ={
     id = 4187,
     words = "魔獸幣"
},
[4188] ={
     id = 4188,
     words = "莫伟强"
},
[4189] ={
     id = 4189,
     words = "那可汀"
},
[4190] ={
     id = 4190,
     words = "那吗B"
},
[4191] ={
     id = 4191,
     words = "那吗逼"
},
[4192] ={
     id = 4192,
     words = "那嗎B"
},
[4193] ={
     id = 4193,
     words = "那嗎逼"
},
[4194] ={
     id = 4194,
     words = "妳媽的"
},
[4195] ={
     id = 4195,
     words = "妳馬的"
},
[4196] ={
     id = 4196,
     words = "南丽美"
},
[4197] ={
     id = 4197,
     words = "南蠻子"
},
[4198] ={
     id = 4198,
     words = "嫩BB"
},
[4199] ={
     id = 4199,
     words = "嫩鲍鱼"
},
[4200] ={
     id = 4200,
     words = "嫩鮑魚"
},
[4201] ={
     id = 4201,
     words = "尼米兹"
},
[4202] ={
     id = 4202,
     words = "倪育贤"
},
[4203] ={
     id = 4203,
     words = "倪志福"
},
[4204] ={
     id = 4204,
     words = "你大爺"
},
[4205] ={
     id = 4205,
     words = "你老妹"
},
[4206] ={
     id = 4206,
     words = "你姥姥"
},
[4207] ={
     id = 4207,
     words = "你妈比"
},
[4208] ={
     id = 4208,
     words = "你媽逼"
},
[4209] ={
     id = 4209,
     words = "你媽比"
},
[4210] ={
     id = 4210,
     words = "你媽的"
},
[4211] ={
     id = 4211,
     words = "你马的"
},
[4212] ={
     id = 4212,
     words = "你馬的"
},
[4213] ={
     id = 4213,
     words = "你奶奶"
},
[4214] ={
     id = 4214,
     words = "你娘的"
},
[4215] ={
     id = 4215,
     words = "你娘咧"
},
[4216] ={
     id = 4216,
     words = "你全家"
},
[4217] ={
     id = 4217,
     words = "你色吗"
},
[4218] ={
     id = 4218,
     words = "你色嗎"
},
[4219] ={
     id = 4219,
     words = "你是鸡"
},
[4220] ={
     id = 4220,
     words = "你是雞"
},
[4221] ={
     id = 4221,
     words = "你是鸭"
},
[4222] ={
     id = 4222,
     words = "你是鴨"
},
[4223] ={
     id = 4223,
     words = "你祖宗"
},
[4224] ={
     id = 4224,
     words = "娘饿比"
},
[4225] ={
     id = 4225,
     words = "娘餓比"
},
[4226] ={
     id = 4226,
     words = "娘个比"
},
[4227] ={
     id = 4227,
     words = "娘個比"
},
[4228] ={
     id = 4228,
     words = "鳥gm"
},
[4229] ={
     id = 4229,
     words = "聶榮臻"
},
[4230] ={
     id = 4230,
     words = "宁王府"
},
[4231] ={
     id = 4231,
     words = "牛魔王"
},
[4232] ={
     id = 4232,
     words = "奴事件"
},
[4233] ={
     id = 4233,
     words = "奴畜抄"
},
[4234] ={
     id = 4234,
     words = "女教師"
},
[4235] ={
     id = 4235,
     words = "女人穴"
},
[4236] ={
     id = 4236,
     words = "女死囚"
},
[4237] ={
     id = 4237,
     words = "女友坊"
},
[4238] ={
     id = 4238,
     words = "拍卖官"
},
[4239] ={
     id = 4239,
     words = "潘国平"
},
[4240] ={
     id = 4240,
     words = "泡泡岛"
},
[4241] ={
     id = 4241,
     words = "泡泡堂"
},
[4242] ={
     id = 4242,
     words = "嘭嘭帮"
},
[4243] ={
     id = 4243,
     words = "嘭嘭幫"
},
[4244] ={
     id = 4244,
     words = "彭德懷"
},
[4245] ={
     id = 4245,
     words = "彭佩云"
},
[4246] ={
     id = 4246,
     words = "彭珮云"
},
[4247] ={
     id = 4247,
     words = "彭珮雲"
},
[4248] ={
     id = 4248,
     words = "皮条客"
},
[4249] ={
     id = 4249,
     words = "皮條客"
},
[4250] ={
     id = 4250,
     words = "品色堂"
},
[4251] ={
     id = 4251,
     words = "品香堂"
},
[4252] ={
     id = 4252,
     words = "平可夫"
},
[4253] ={
     id = 4253,
     words = "祁培文"
},
[4254] ={
     id = 4254,
     words = "奇乐网"
},
[4255] ={
     id = 4255,
     words = "钱国梁"
},
[4256] ={
     id = 4256,
     words = "钱运录"
},
[4257] ={
     id = 4257,
     words = "錢其琛"
},
[4258] ={
     id = 4258,
     words = "錢運錄"
},
[4259] ={
     id = 4259,
     words = "強姦犯"
},
[4260] ={
     id = 4260,
     words = "強姦你"
},
[4261] ={
     id = 4261,
     words = "强奸你"
},
[4262] ={
     id = 4262,
     words = "抢火炬"
},
[4263] ={
     id = 4263,
     words = "抢劫犯"
},
[4264] ={
     id = 4264,
     words = "抢粮记"
},
[4265] ={
     id = 4265,
     words = "搶劫犯"
},
[4266] ={
     id = 4266,
     words = "乔冠华"
},
[4267] ={
     id = 4267,
     words = "钦本立"
},
[4268] ={
     id = 4268,
     words = "親民黨"
},
[4269] ={
     id = 4269,
     words = "秦基伟"
},
[4270] ={
     id = 4270,
     words = "情色谷"
},
[4271] ={
     id = 4271,
     words = "邱会作"
},
[4272] ={
     id = 4272,
     words = "瘸腿幫"
},
[4273] ={
     id = 4273,
     words = "群阴会"
},
[4274] ={
     id = 4274,
     words = "群陰會"
},
[4275] ={
     id = 4275,
     words = "让你操"
},
[4276] ={
     id = 4276,
     words = "讓你操"
},
[4277] ={
     id = 4277,
     words = "热比娅"
},
[4278] ={
     id = 4278,
     words = "人家了"
},
[4279] ={
     id = 4279,
     words = "人民報"
},
[4280] ={
     id = 4280,
     words = "人民幣"
},
[4281] ={
     id = 4281,
     words = "任弼时"
},
[4282] ={
     id = 4282,
     words = "任建新"
},
[4283] ={
     id = 4283,
     words = "任你淫"
},
[4284] ={
     id = 4284,
     words = "日本人"
},
[4285] ={
     id = 4285,
     words = "日九城"
},
[4286] ={
     id = 4286,
     words = "日领馆"
},
[4287] ={
     id = 4287,
     words = "日你爸"
},
[4288] ={
     id = 4288,
     words = "日你媽"
},
[4289] ={
     id = 4289,
     words = "日死你"
},
[4290] ={
     id = 4290,
     words = "日朱骏"
},
[4291] ={
     id = 4291,
     words = "荣毅仁"
},
[4292] ={
     id = 4292,
     words = "榮毅仁"
},
[4293] ={
     id = 4293,
     words = "柔阴术"
},
[4294] ={
     id = 4294,
     words = "肉棒插"
},
[4295] ={
     id = 4295,
     words = "肉便器"
},
[4296] ={
     id = 4296,
     words = "肉蒲团"
},
[4297] ={
     id = 4297,
     words = "肉蒲團"
},
[4298] ={
     id = 4298,
     words = "撒泡尿"
},
[4299] ={
     id = 4299,
     words = "薩達姆"
},
[4300] ={
     id = 4300,
     words = "三K党"
},
[4301] ={
     id = 4301,
     words = "三K黨"
},
[4302] ={
     id = 4302,
     words = "三八淫"
},
[4303] ={
     id = 4303,
     words = "三挫仑"
},
[4304] ={
     id = 4304,
     words = "三国策"
},
[4305] ={
     id = 4305,
     words = "三級片"
},
[4306] ={
     id = 4306,
     words = "三角裤"
},
[4307] ={
     id = 4307,
     words = "桑国卫"
},
[4308] ={
     id = 4308,
     words = "桑國衛"
},
[4309] ={
     id = 4309,
     words = "骚B贱"
},
[4310] ={
     id = 4310,
     words = "骚屄儿"
},
[4311] ={
     id = 4311,
     words = "骚姐姐"
},
[4312] ={
     id = 4312,
     words = "骚妹妹"
},
[4313] ={
     id = 4313,
     words = "骚姨妈"
},
[4314] ={
     id = 4314,
     words = "騷B賤"
},
[4315] ={
     id = 4315,
     words = "騷姐姐"
},
[4316] ={
     id = 4316,
     words = "騷妹妹"
},
[4317] ={
     id = 4317,
     words = "騷姨媽"
},
[4318] ={
     id = 4318,
     words = "色成人"
},
[4319] ={
     id = 4319,
     words = "色弟弟"
},
[4320] ={
     id = 4320,
     words = "色空寺"
},
[4321] ={
     id = 4321,
     words = "色咪咪"
},
[4322] ={
     id = 4322,
     words = "色迷城"
},
[4323] ={
     id = 4323,
     words = "色色连"
},
[4324] ={
     id = 4324,
     words = "色书库"
},
[4325] ={
     id = 4325,
     words = "色图乡"
},
[4326] ={
     id = 4326,
     words = "色窝窝"
},
[4327] ={
     id = 4327,
     words = "色窩窩"
},
[4328] ={
     id = 4328,
     words = "色影院"
},
[4329] ={
     id = 4329,
     words = "殺人犯"
},
[4330] ={
     id = 4330,
     words = "山口组"
},
[4331] ={
     id = 4331,
     words = "山口組"
},
[4332] ={
     id = 4332,
     words = "山咲舞"
},
[4333] ={
     id = 4333,
     words = "上海帮"
},
[4334] ={
     id = 4334,
     words = "上有网"
},
[4335] ={
     id = 4335,
     words = "少妇穴"
},
[4336] ={
     id = 4336,
     words = "少修正"
},
[4337] ={
     id = 4337,
     words = "邵家健"
},
[4338] ={
     id = 4338,
     words = "舌头穴"
},
[4339] ={
     id = 4339,
     words = "舌頭穴"
},
[4340] ={
     id = 4340,
     words = "社会院"
},
[4341] ={
     id = 4341,
     words = "神风-"
},
[4342] ={
     id = 4342,
     words = "神風~"
},
[4343] ={
     id = 4343,
     words = "神谷姫"
},
[4344] ={
     id = 4344,
     words = "神經病"
},
[4345] ={
     id = 4345,
     words = "生殖器"
},
[4346] ={
     id = 4346,
     words = "生中出"
},
[4347] ={
     id = 4347,
     words = "盛华仁"
},
[4348] ={
     id = 4348,
     words = "盛宣鸣"
},
[4349] ={
     id = 4349,
     words = "盛宣鳴"
},
[4350] ={
     id = 4350,
     words = "聖女峰"
},
[4351] ={
     id = 4351,
     words = "师春生"
},
[4352] ={
     id = 4352,
     words = "師春生"
},
[4353] ={
     id = 4353,
     words = "十八代"
},
[4354] ={
     id = 4354,
     words = "十景缎"
},
[4355] ={
     id = 4355,
     words = "十六大"
},
[4356] ={
     id = 4356,
     words = "十七大"
},
[4357] ={
     id = 4357,
     words = "十三点"
},
[4358] ={
     id = 4358,
     words = "十三點"
},
[4359] ={
     id = 4359,
     words = "史迪威"
},
[4360] ={
     id = 4360,
     words = "史玉柱"
},
[4361] ={
     id = 4361,
     words = "矢崎茜"
},
[4362] ={
     id = 4362,
     words = "駛你爸"
},
[4363] ={
     id = 4363,
     words = "駛你公"
},
[4364] ={
     id = 4364,
     words = "駛你母"
},
[4365] ={
     id = 4365,
     words = "駛你娘"
},
[4366] ={
     id = 4366,
     words = "世界都"
},
[4367] ={
     id = 4367,
     words = "世维会"
},
[4368] ={
     id = 4368,
     words = "试看片"
},
[4369] ={
     id = 4369,
     words = "售軟體"
},
[4370] ={
     id = 4370,
     words = "双十节"
},
[4371] ={
     id = 4371,
     words = "爽mm"
},
[4372] ={
     id = 4372,
     words = "爽电影"
},
[4373] ={
     id = 4373,
     words = "爽死了"
},
[4374] ={
     id = 4374,
     words = "爽图网"
},
[4375] ={
     id = 4375,
     words = "司马晋"
},
[4376] ={
     id = 4376,
     words = "司马璐"
},
[4377] ={
     id = 4377,
     words = "司徒华"
},
[4378] ={
     id = 4378,
     words = "私！服"
},
[4379] ={
     id = 4379,
     words = "私#服"
},
[4380] ={
     id = 4380,
     words = "私%服"
},
[4381] ={
     id = 4381,
     words = "私%*服"
},
[4382] ={
     id = 4382,
     words = "私？服"
},
[4383] ={
     id = 4383,
     words = "私￥服"
},
[4384] ={
     id = 4384,
     words = "斯蒂芬"
},
[4385] ={
     id = 4385,
     words = "四川独"
},
[4386] ={
     id = 4386,
     words = "四人幫"
},
[4387] ={
     id = 4387,
     words = "四我周"
},
[4388] ={
     id = 4388,
     words = "宋xx"
},
[4389] ={
     id = 4389,
     words = "宋美龄"
},
[4390] ={
     id = 4390,
     words = "宋美齡"
},
[4391] ={
     id = 4391,
     words = "宋庆龄"
},
[4392] ={
     id = 4392,
     words = "宋慶齡"
},
[4393] ={
     id = 4393,
     words = "宋任穷"
},
[4394] ={
     id = 4394,
     words = "宋书元"
},
[4395] ={
     id = 4395,
     words = "搜神记"
},
[4396] ={
     id = 4396,
     words = "苏绍智"
},
[4397] ={
     id = 4397,
     words = "苏晓康"
},
[4398] ={
     id = 4398,
     words = "苏秀文"
},
[4399] ={
     id = 4399,
     words = "苏兆征"
},
[4400] ={
     id = 4400,
     words = "苏振华"
},
[4401] ={
     id = 4401,
     words = "蘇秀文"
},
[4402] ={
     id = 4402,
     words = "素人娘"
},
[4403] ={
     id = 4403,
     words = "孙大午"
},
[4404] ={
     id = 4404,
     words = "孙家正"
},
[4405] ={
     id = 4405,
     words = "孫家正"
},
[4406] ={
     id = 4406,
     words = "孫逸仙"
},
[4407] ={
     id = 4407,
     words = "孫中山"
},
[4408] ={
     id = 4408,
     words = "他ㄇㄉ"
},
[4409] ={
     id = 4409,
     words = "他ㄇ的"
},
[4410] ={
     id = 4410,
     words = "他妈地"
},
[4411] ={
     id = 4411,
     words = "他媽的"
},
[4412] ={
     id = 4412,
     words = "他媽地"
},
[4413] ={
     id = 4413,
     words = "他馬的"
},
[4414] ={
     id = 4414,
     words = "他吗的"
},
[4415] ={
     id = 4415,
     words = "他嗎的"
},
[4416] ={
     id = 4416,
     words = "他母親"
},
[4417] ={
     id = 4417,
     words = "他奶奶"
},
[4418] ={
     id = 4418,
     words = "他娘的"
},
[4419] ={
     id = 4419,
     words = "它妈的"
},
[4420] ={
     id = 4420,
     words = "它妈地"
},
[4421] ={
     id = 4421,
     words = "它媽的"
},
[4422] ={
     id = 4422,
     words = "它媽地"
},
[4423] ={
     id = 4423,
     words = "台聯黨"
},
[4424] ={
     id = 4424,
     words = "台湾独"
},
[4425] ={
     id = 4425,
     words = "台灣狗"
},
[4426] ={
     id = 4426,
     words = "台灣国"
},
[4427] ={
     id = 4427,
     words = "台灣國"
},
[4428] ={
     id = 4428,
     words = "台灣豬"
},
[4429] ={
     id = 4429,
     words = "臺湾國"
},
[4430] ={
     id = 4430,
     words = "臺灣黨"
},
[4431] ={
     id = 4431,
     words = "臺灣狗"
},
[4432] ={
     id = 4432,
     words = "臺灣國"
},
[4433] ={
     id = 4433,
     words = "谭绍文"
},
[4434] ={
     id = 4434,
     words = "谭震林"
},
[4435] ={
     id = 4435,
     words = "汤光中"
},
[4436] ={
     id = 4436,
     words = "唐柏桥"
},
[4437] ={
     id = 4437,
     words = "堂品色"
},
[4438] ={
     id = 4438,
     words = "特派员"
},
[4439] ={
     id = 4439,
     words = "滕文生"
},
[4440] ={
     id = 4440,
     words = "踢踢球"
},
[4441] ={
     id = 4441,
     words = "天安門"
},
[4442] ={
     id = 4442,
     words = "天上碑"
},
[4443] ={
     id = 4443,
     words = "天堂2"
},
[4444] ={
     id = 4444,
     words = "天下贰"
},
[4445] ={
     id = 4445,
     words = "天下貳"
},
[4446] ={
     id = 4446,
     words = "田纪雲"
},
[4447] ={
     id = 4447,
     words = "田紀云"
},
[4448] ={
     id = 4448,
     words = "田紀雲"
},
[4449] ={
     id = 4449,
     words = "田中爱"
},
[4450] ={
     id = 4450,
     words = "甜嫩穴"
},
[4451] ={
     id = 4451,
     words = "舔鸡巴"
},
[4452] ={
     id = 4452,
     words = "舔雞巴"
},
[4453] ={
     id = 4453,
     words = "舔屁眼"
},
[4454] ={
     id = 4454,
     words = "贴图区"
},
[4455] ={
     id = 4455,
     words = "同性恋"
},
[4456] ={
     id = 4456,
     words = "同性戀"
},
[4457] ={
     id = 4457,
     words = "捅死你"
},
[4458] ={
     id = 4458,
     words = "偷情網"
},
[4459] ={
     id = 4459,
     words = "凸点装"
},
[4460] ={
     id = 4460,
     words = "凸肉优"
},
[4461] ={
     id = 4461,
     words = "凸肉優"
},
[4462] ={
     id = 4462,
     words = "团中央"
},
[4463] ={
     id = 4463,
     words = "推推侠"
},
[4464] ={
     id = 4464,
     words = "推推俠"
},
[4465] ={
     id = 4465,
     words = "脫內褲"
},
[4466] ={
     id = 4466,
     words = "脫衣舞"
},
[4467] ={
     id = 4467,
     words = "脱内裤"
},
[4468] ={
     id = 4468,
     words = "脱衣舞"
},
[4469] ={
     id = 4469,
     words = "瓦良格"
},
[4470] ={
     id = 4470,
     words = "外$挂"
},
[4471] ={
     id = 4471,
     words = "外$掛"
},
[4472] ={
     id = 4472,
     words = "外%*挂"
},
[4473] ={
     id = 4473,
     words = "外%*掛"
},
[4474] ={
     id = 4474,
     words = "外？挂"
},
[4475] ={
     id = 4475,
     words = "外?挂"
},
[4476] ={
     id = 4476,
     words = "外？掛"
},
[4477] ={
     id = 4477,
     words = "外@挂"
},
[4478] ={
     id = 4478,
     words = "外@掛"
},
[4479] ={
     id = 4479,
     words = "外_掛"
},
[4480] ={
     id = 4480,
     words = "外~挂"
},
[4481] ={
     id = 4481,
     words = "外~掛"
},
[4482] ={
     id = 4482,
     words = "外-掛"
},
[4483] ={
     id = 4483,
     words = "外—掛"
},
[4484] ={
     id = 4484,
     words = "完蛋操"
},
[4485] ={
     id = 4485,
     words = "完全版"
},
[4486] ={
     id = 4486,
     words = "万润南"
},
[4487] ={
     id = 4487,
     words = "万晓东"
},
[4488] ={
     id = 4488,
     words = "万淫堂"
},
[4489] ={
     id = 4489,
     words = "萬人暴"
},
[4490] ={
     id = 4490,
     words = "萬淫堂"
},
[4491] ={
     id = 4491,
     words = "汪东兴"
},
[4492] ={
     id = 4492,
     words = "王寶森"
},
[4493] ={
     id = 4493,
     words = "王炳章"
},
[4494] ={
     id = 4494,
     words = "王超华"
},
[4495] ={
     id = 4495,
     words = "王从吾"
},
[4496] ={
     id = 4496,
     words = "王辅臣"
},
[4497] ={
     id = 4497,
     words = "王涵万"
},
[4498] ={
     id = 4498,
     words = "王汉斌"
},
[4499] ={
     id = 4499,
     words = "王鹤寿"
},
[4500] ={
     id = 4500,
     words = "王沪宁"
},
[4501] ={
     id = 4501,
     words = "王稼祥"
},
[4502] ={
     id = 4502,
     words = "王军涛"
},
[4503] ={
     id = 4503,
     words = "王俊博"
},
[4504] ={
     id = 4504,
     words = "王樂泉"
},
[4505] ={
     id = 4505,
     words = "王力雄"
},
[4506] ={
     id = 4506,
     words = "王瑞林"
},
[4507] ={
     id = 4507,
     words = "王润生"
},
[4508] ={
     id = 4508,
     words = "王若望"
},
[4509] ={
     id = 4509,
     words = "王胜俊"
},
[4510] ={
     id = 4510,
     words = "王勝俊"
},
[4511] ={
     id = 4511,
     words = "王太華"
},
[4512] ={
     id = 4512,
     words = "王文京"
},
[4513] ={
     id = 4513,
     words = "王希哲"
},
[4514] ={
     id = 4514,
     words = "王秀丽"
},
[4515] ={
     id = 4515,
     words = "王冶坪"
},
[4516] ={
     id = 4516,
     words = "王兆國"
},
[4517] ={
     id = 4517,
     words = "王志珍"
},
[4518] ={
     id = 4518,
     words = "王子杰"
},
[4519] ={
     id = 4519,
     words = "王子傑"
},
[4520] ={
     id = 4520,
     words = "网捷信"
},
[4521] ={
     id = 4521,
     words = "網捷信"
},
[4522] ={
     id = 4522,
     words = "韦国清"
},
[4523] ={
     id = 4523,
     words = "卫生巾"
},
[4524] ={
     id = 4524,
     words = "尉键行"
},
[4525] ={
     id = 4525,
     words = "慰安妇"
},
[4526] ={
     id = 4526,
     words = "慰安婦"
},
[4527] ={
     id = 4527,
     words = "慰春情"
},
[4528] ={
     id = 4528,
     words = "魏京生"
},
[4529] ={
     id = 4529,
     words = "魏新生"
},
[4530] ={
     id = 4530,
     words = "温家寶"
},
[4531] ={
     id = 4531,
     words = "温元凯"
},
[4532] ={
     id = 4532,
     words = "溫加寶"
},
[4533] ={
     id = 4533,
     words = "溫家宝"
},
[4534] ={
     id = 4534,
     words = "溫傢寳"
},
[4535] ={
     id = 4535,
     words = "溫總理"
},
[4536] ={
     id = 4536,
     words = "文九天"
},
[4537] ={
     id = 4537,
     words = "窝窝客"
},
[4538] ={
     id = 4538,
     words = "窩窩客"
},
[4539] ={
     id = 4539,
     words = "我的穴"
},
[4540] ={
     id = 4540,
     words = "我该死"
},
[4541] ={
     id = 4541,
     words = "我和她"
},
[4542] ={
     id = 4542,
     words = "我就色"
},
[4543] ={
     id = 4543,
     words = "我有网"
},
[4544] ={
     id = 4544,
     words = "我周容"
},
[4545] ={
     id = 4545,
     words = "乌兰夫"
},
[4546] ={
     id = 4546,
     words = "无疆界"
},
[4547] ={
     id = 4547,
     words = "无码片"
},
[4548] ={
     id = 4548,
     words = "无毛穴"
},
[4549] ={
     id = 4549,
     words = "无网界"
},
[4550] ={
     id = 4550,
     words = "无修正"
},
[4551] ={
     id = 4551,
     words = "吳邦囯"
},
[4552] ={
     id = 4552,
     words = "吳邦國"
},
[4553] ={
     id = 4553,
     words = "吳官正"
},
[4554] ={
     id = 4554,
     words = "吳桂賢"
},
[4555] ={
     id = 4555,
     words = "吴百益"
},
[4556] ={
     id = 4556,
     words = "吴方城"
},
[4557] ={
     id = 4557,
     words = "吴桂贤"
},
[4558] ={
     id = 4558,
     words = "吴弘达"
},
[4559] ={
     id = 4559,
     words = "吴宏达"
},
[4560] ={
     id = 4560,
     words = "吴仁华"
},
[4561] ={
     id = 4561,
     words = "吴学灿"
},
[4562] ={
     id = 4562,
     words = "吴学璨"
},
[4563] ={
     id = 4563,
     words = "無毛穴"
},
[4564] ={
     id = 4564,
     words = "無網界"
},
[4565] ={
     id = 4565,
     words = "無修正"
},
[4566] ={
     id = 4566,
     words = "五十路"
},
[4567] ={
     id = 4567,
     words = "午夜场"
},
[4568] ={
     id = 4568,
     words = "西藏独"
},
[4569] ={
     id = 4569,
     words = "西藏國"
},
[4570] ={
     id = 4570,
     words = "吸毒犯"
},
[4571] ={
     id = 4571,
     words = "习仲勋"
},
[4572] ={
     id = 4572,
     words = "習近平"
},
[4573] ={
     id = 4573,
     words = "洗腦班"
},
[4574] ={
     id = 4574,
     words = "狭义道"
},
[4575] ={
     id = 4575,
     words = "狹義道"
},
[4576] ={
     id = 4576,
     words = "下三烂"
},
[4577] ={
     id = 4577,
     words = "下三滥"
},
[4578] ={
     id = 4578,
     words = "下三濫"
},
[4579] ={
     id = 4579,
     words = "下三爛"
},
[4580] ={
     id = 4580,
     words = "夏树唯"
},
[4581] ={
     id = 4581,
     words = "夏赞忠"
},
[4582] ={
     id = 4582,
     words = "仙界传"
},
[4583] ={
     id = 4583,
     words = "仙界傳"
},
[4584] ={
     id = 4584,
     words = "香山圣"
},
[4585] ={
     id = 4585,
     words = "向忠发"
},
[4586] ={
     id = 4586,
     words = "项怀诚"
},
[4587] ={
     id = 4587,
     words = "项小吉"
},
[4588] ={
     id = 4588,
     words = "销魂洞"
},
[4589] ={
     id = 4589,
     words = "銷魂洞"
},
[4590] ={
     id = 4590,
     words = "小B样"
},
[4591] ={
     id = 4591,
     words = "小B樣"
},
[4592] ={
     id = 4592,
     words = "小MM"
},
[4593] ={
     id = 4593,
     words = "小比样"
},
[4594] ={
     id = 4594,
     words = "小比樣"
},
[4595] ={
     id = 4595,
     words = "小瘪三"
},
[4596] ={
     id = 4596,
     words = "小癟三"
},
[4597] ={
     id = 4597,
     words = "小电影"
},
[4598] ={
     id = 4598,
     words = "小電影"
},
[4599] ={
     id = 4599,
     words = "小鸡巴"
},
[4600] ={
     id = 4600,
     words = "小雞巴"
},
[4601] ={
     id = 4601,
     words = "小雞雞"
},
[4602] ={
     id = 4602,
     words = "小浪穴"
},
[4603] ={
     id = 4603,
     words = "小灵通"
},
[4604] ={
     id = 4604,
     words = "小卵泡"
},
[4605] ={
     id = 4605,
     words = "小卵子"
},
[4606] ={
     id = 4606,
     words = "小嫩逼"
},
[4607] ={
     id = 4607,
     words = "小嫩鸡"
},
[4608] ={
     id = 4608,
     words = "小嫩雞"
},
[4609] ={
     id = 4609,
     words = "小嫩穴"
},
[4610] ={
     id = 4610,
     words = "小肉缝"
},
[4611] ={
     id = 4611,
     words = "小肉穴"
},
[4612] ={
     id = 4612,
     words = "小乳頭"
},
[4613] ={
     id = 4613,
     words = "小骚逼"
},
[4614] ={
     id = 4614,
     words = "小骚比"
},
[4615] ={
     id = 4615,
     words = "小骚洞"
},
[4616] ={
     id = 4616,
     words = "小骚货"
},
[4617] ={
     id = 4617,
     words = "小騷比"
},
[4618] ={
     id = 4618,
     words = "小騷貨"
},
[4619] ={
     id = 4619,
     words = "小阴唇"
},
[4620] ={
     id = 4620,
     words = "小淫女"
},
[4621] ={
     id = 4621,
     words = "小淫穴"
},
[4622] ={
     id = 4622,
     words = "谢长廷"
},
[4623] ={
     id = 4623,
     words = "谢选骏"
},
[4624] ={
     id = 4624,
     words = "谢中之"
},
[4625] ={
     id = 4625,
     words = "謝長廷"
},
[4626] ={
     id = 4626,
     words = "辛灏年"
},
[4627] ={
     id = 4627,
     words = "新大陆"
},
[4628] ={
     id = 4628,
     words = "新大陸"
},
[4629] ={
     id = 4629,
     words = "新斷線"
},
[4630] ={
     id = 4630,
     words = "新幹線"
},
[4631] ={
     id = 4631,
     words = "新江湖"
},
[4632] ={
     id = 4632,
     words = "新疆独"
},
[4633] ={
     id = 4633,
     words = "新疆國"
},
[4634] ={
     id = 4634,
     words = "新魔界"
},
[4635] ={
     id = 4635,
     words = "新片！"
},
[4636] ={
     id = 4636,
     words = "新生網"
},
[4637] ={
     id = 4637,
     words = "新石器"
},
[4638] ={
     id = 4638,
     words = "新天翼"
},
[4639] ={
     id = 4639,
     words = "新義安"
},
[4640] ={
     id = 4640,
     words = "新语丝"
},
[4641] ={
     id = 4641,
     words = "新郑和"
},
[4642] ={
     id = 4642,
     words = "新鄭和"
},
[4643] ={
     id = 4643,
     words = "星之雪"
},
[4644] ={
     id = 4644,
     words = "性饥渴"
},
[4645] ={
     id = 4645,
     words = "性飢渴"
},
[4646] ={
     id = 4646,
     words = "性交课"
},
[4647] ={
     id = 4647,
     words = "性交課"
},
[4648] ={
     id = 4648,
     words = "性交图"
},
[4649] ={
     id = 4649,
     words = "性交圖"
},
[4650] ={
     id = 4650,
     words = "性奴会"
},
[4651] ={
     id = 4651,
     words = "性奴會"
},
[4652] ={
     id = 4652,
     words = "性骚扰"
},
[4653] ={
     id = 4653,
     words = "性生活"
},
[4654] ={
     id = 4654,
     words = "性無能"
},
[4655] ={
     id = 4655,
     words = "性之站"
},
[4656] ={
     id = 4656,
     words = "羞恥母"
},
[4657] ={
     id = 4657,
     words = "羞耻母"
},
[4658] ={
     id = 4658,
     words = "徐邦秦"
},
[4659] ={
     id = 4659,
     words = "徐炳慧"
},
[4660] ={
     id = 4660,
     words = "徐才厚"
},
[4661] ={
     id = 4661,
     words = "徐匡迪"
},
[4662] ={
     id = 4662,
     words = "徐水良"
},
[4663] ={
     id = 4663,
     words = "许家屯"
},
[4664] ={
     id = 4664,
     words = "许世友"
},
[4665] ={
     id = 4665,
     words = "轩辕二"
},
[4666] ={
     id = 4666,
     words = "轩辕剑"
},
[4667] ={
     id = 4667,
     words = "学生妹"
},
[4668] ={
     id = 4668,
     words = "学习班"
},
[4669] ={
     id = 4669,
     words = "学自联"
},
[4670] ={
     id = 4670,
     words = "巡查員"
},
[4671] ={
     id = 4671,
     words = "巡府媳"
},
[4672] ={
     id = 4672,
     words = "雅典娜"
},
[4673] ={
     id = 4673,
     words = "亚洲色"
},
[4674] ={
     id = 4674,
     words = "亞無碼"
},
[4675] ={
     id = 4675,
     words = "亞洲色"
},
[4676] ={
     id = 4676,
     words = "严家其"
},
[4677] ={
     id = 4677,
     words = "严家祺"
},
[4678] ={
     id = 4678,
     words = "严隽琪"
},
[4679] ={
     id = 4679,
     words = "阎明复"
},
[4680] ={
     id = 4680,
     words = "嚴雋琪"
},
[4681] ={
     id = 4681,
     words = "艳照门"
},
[4682] ={
     id = 4682,
     words = "艳照門"
},
[4683] ={
     id = 4683,
     words = "艷照门"
},
[4684] ={
     id = 4684,
     words = "艷照門"
},
[4685] ={
     id = 4685,
     words = "豔照門"
},
[4686] ={
     id = 4686,
     words = "杨白冰"
},
[4687] ={
     id = 4687,
     words = "杨得志"
},
[4688] ={
     id = 4688,
     words = "杨怀安"
},
[4689] ={
     id = 4689,
     words = "杨建利"
},
[4690] ={
     id = 4690,
     words = "杨尚昆"
},
[4691] ={
     id = 4691,
     words = "杨思敏"
},
[4692] ={
     id = 4692,
     words = "杨元元"
},
[4693] ={
     id = 4693,
     words = "杨月清"
},
[4694] ={
     id = 4694,
     words = "楊思敏"
},
[4695] ={
     id = 4695,
     words = "姚依林"
},
[4696] ={
     id = 4696,
     words = "姚月谦"
},
[4697] ={
     id = 4697,
     words = "搖头丸"
},
[4698] ={
     id = 4698,
     words = "搖頭丸"
},
[4699] ={
     id = 4699,
     words = "摇頭丸"
},
[4700] ={
     id = 4700,
     words = "要色色"
},
[4701] ={
     id = 4701,
     words = "耶和華"
},
[4702] ={
     id = 4702,
     words = "夜色城"
},
[4703] ={
     id = 4703,
     words = "夜总会"
},
[4704] ={
     id = 4704,
     words = "夜總會"
},
[4705] ={
     id = 4705,
     words = "一本道"
},
[4706] ={
     id = 4706,
     words = "一貫道"
},
[4707] ={
     id = 4707,
     words = "一四我"
},
[4708] ={
     id = 4708,
     words = "一夜欢"
},
[4709] ={
     id = 4709,
     words = "一夜歡"
},
[4710] ={
     id = 4710,
     words = "伊斯蘭"
},
[4711] ={
     id = 4711,
     words = "倚天二"
},
[4712] ={
     id = 4712,
     words = "易丹轩"
},
[4713] ={
     id = 4713,
     words = "易玩网"
},
[4714] ={
     id = 4714,
     words = "易志熹"
},
[4715] ={
     id = 4715,
     words = "殷素素"
},
[4716] ={
     id = 4716,
     words = "淫屄儿"
},
[4717] ={
     id = 4717,
     words = "淫荡插"
},
[4718] ={
     id = 4718,
     words = "淫电影"
},
[4719] ={
     id = 4719,
     words = "淫东方"
},
[4720] ={
     id = 4720,
     words = "淫告白"
},
[4721] ={
     id = 4721,
     words = "淫护士"
},
[4722] ={
     id = 4722,
     words = "淫奸啊"
},
[4723] ={
     id = 4723,
     words = "淫间道"
},
[4724] ={
     id = 4724,
     words = "淫浪女"
},
[4725] ={
     id = 4725,
     words = "淫驴屯"
},
[4726] ={
     id = 4726,
     words = "淫驢屯"
},
[4727] ={
     id = 4727,
     words = "淫妹妹"
},
[4728] ={
     id = 4728,
     words = "淫民堂"
},
[4729] ={
     id = 4729,
     words = "淫女穴"
},
[4730] ={
     id = 4730,
     words = "淫肉穴"
},
[4731] ={
     id = 4731,
     words = "淫少妇"
},
[4732] ={
     id = 4732,
     words = "淫水流"
},
[4733] ={
     id = 4733,
     words = "淫窝窝"
},
[4734] ={
     id = 4734,
     words = "银民吧"
},
[4735] ={
     id = 4735,
     words = "銀民吧"
},
[4736] ={
     id = 4736,
     words = "尹庆民"
},
[4737] ={
     id = 4737,
     words = "隐窝窝"
},
[4738] ={
     id = 4738,
     words = "隱窩窩"
},
[4739] ={
     id = 4739,
     words = "用力插"
},
[4740] ={
     id = 4740,
     words = "用力干"
},
[4741] ={
     id = 4741,
     words = "悠游网"
},
[4742] ={
     id = 4742,
     words = "悠遊網"
},
[4743] ={
     id = 4743,
     words = "由喜贵"
},
[4744] ={
     id = 4744,
     words = "游戏道"
},
[4745] ={
     id = 4745,
     words = "猶太豬"
},
[4746] ={
     id = 4746,
     words = "遊戲幣"
},
[4747] ={
     id = 4747,
     words = "幼香阁"
},
[4748] ={
     id = 4748,
     words = "幼香閣"
},
[4749] ={
     id = 4749,
     words = "于大海"
},
[4750] ={
     id = 4750,
     words = "于浩成"
},
[4751] ={
     id = 4751,
     words = "于天瑞"
},
[4752] ={
     id = 4752,
     words = "于永波"
},
[4753] ={
     id = 4753,
     words = "于幼军"
},
[4754] ={
     id = 4754,
     words = "余秋里"
},
[4755] ={
     id = 4755,
     words = "余英时"
},
[4756] ={
     id = 4756,
     words = "於天瑞"
},
[4757] ={
     id = 4757,
     words = "於永波"
},
[4758] ={
     id = 4758,
     words = "於幼軍"
},
[4759] ={
     id = 4759,
     words = "俞正聲"
},
[4760] ={
     id = 4760,
     words = "宇明网"
},
[4761] ={
     id = 4761,
     words = "雨星网"
},
[4762] ={
     id = 4762,
     words = "玉蒲團"
},
[4763] ={
     id = 4763,
     words = "预审查"
},
[4764] ={
     id = 4764,
     words = "原千寻"
},
[4765] ={
     id = 4765,
     words = "袁纯清"
},
[4766] ={
     id = 4766,
     words = "远志明"
},
[4767] ={
     id = 4767,
     words = "曰gＭ"
},
[4768] ={
     id = 4768,
     words = "运营长"
},
[4769] ={
     id = 4769,
     words = "运营官"
},
[4770] ={
     id = 4770,
     words = "运营人"
},
[4771] ={
     id = 4771,
     words = "运营商"
},
[4772] ={
     id = 4772,
     words = "运营者"
},
[4773] ={
     id = 4773,
     words = "运营组"
},
[4774] ={
     id = 4774,
     words = "运營者"
},
[4775] ={
     id = 4775,
     words = "运營组"
},
[4776] ={
     id = 4776,
     words = "运營組"
},
[4777] ={
     id = 4777,
     words = "運营者"
},
[4778] ={
     id = 4778,
     words = "運营組"
},
[4779] ={
     id = 4779,
     words = "運營者"
},
[4780] ={
     id = 4780,
     words = "運營组"
},
[4781] ={
     id = 4781,
     words = "運營組"
},
[4782] ={
     id = 4782,
     words = "昝爱宗"
},
[4783] ={
     id = 4783,
     words = "昝愛宗"
},
[4784] ={
     id = 4784,
     words = "曾庆紅"
},
[4785] ={
     id = 4785,
     words = "曾慶红"
},
[4786] ={
     id = 4786,
     words = "曾慶紅"
},
[4787] ={
     id = 4787,
     words = "张伯笠"
},
[4788] ={
     id = 4788,
     words = "张大权"
},
[4789] ={
     id = 4789,
     words = "张宏堡"
},
[4790] ={
     id = 4790,
     words = "张梅颖"
},
[4791] ={
     id = 4791,
     words = "张榕明"
},
[4792] ={
     id = 4792,
     words = "张廷发"
},
[4793] ={
     id = 4793,
     words = "张万年"
},
[4794] ={
     id = 4794,
     words = "张萬年"
},
[4795] ={
     id = 4795,
     words = "张伟国"
},
[4796] ={
     id = 4796,
     words = "张伟华"
},
[4797] ={
     id = 4797,
     words = "张闻天"
},
[4798] ={
     id = 4798,
     words = "张晓丞"
},
[4799] ={
     id = 4799,
     words = "张筱雨"
},
[4800] ={
     id = 4800,
     words = "张昭富"
},
[4801] ={
     id = 4801,
     words = "张志清"
},
[4802] ={
     id = 4802,
     words = "張朝陽"
},
[4803] ={
     id = 4803,
     words = "張德江"
},
[4804] ={
     id = 4804,
     words = "張宏堡"
},
[4805] ={
     id = 4805,
     words = "張立昌"
},
[4806] ={
     id = 4806,
     words = "張梅穎"
},
[4807] ={
     id = 4807,
     words = "張榕明"
},
[4808] ={
     id = 4808,
     words = "張万年"
},
[4809] ={
     id = 4809,
     words = "張萬年"
},
[4810] ={
     id = 4810,
     words = "張筱雨"
},
[4811] ={
     id = 4811,
     words = "赵海青"
},
[4812] ={
     id = 4812,
     words = "赵洪祝"
},
[4813] ={
     id = 4813,
     words = "赵品潞"
},
[4814] ={
     id = 4814,
     words = "赵小明"
},
[4815] ={
     id = 4815,
     words = "赵晓微"
},
[4816] ={
     id = 4816,
     words = "趙紫陽"
},
[4817] ={
     id = 4817,
     words = "真封神"
},
[4818] ={
     id = 4818,
     words = "真乃瞳"
},
[4819] ={
     id = 4819,
     words = "真舒服"
},
[4820] ={
     id = 4820,
     words = "姫野爱"
},
[4821] ={
     id = 4821,
     words = "正見網"
},
[4822] ={
     id = 4822,
     words = "正清網"
},
[4823] ={
     id = 4823,
     words = "正悟網"
},
[4824] ={
     id = 4824,
     words = "郑万通"
},
[4825] ={
     id = 4825,
     words = "政治局"
},
[4826] ={
     id = 4826,
     words = "鄭萬通"
},
[4827] ={
     id = 4827,
     words = "制服狩"
},
[4828] ={
     id = 4828,
     words = "致幻劑"
},
[4829] ={
     id = 4829,
     words = "智凡迪"
},
[4830] ={
     id = 4830,
     words = "中公网"
},
[4831] ={
     id = 4831,
     words = "中公網"
},
[4832] ={
     id = 4832,
     words = "中广网"
},
[4833] ={
     id = 4833,
     words = "中廣網"
},
[4834] ={
     id = 4834,
     words = "中国猪"
},
[4835] ={
     id = 4835,
     words = "中國狗"
},
[4836] ={
     id = 4836,
     words = "中國豬"
},
[4837] ={
     id = 4837,
     words = "中机电"
},
[4838] ={
     id = 4838,
     words = "中機電"
},
[4839] ={
     id = 4839,
     words = "仲里愛"
},
[4840] ={
     id = 4840,
     words = "重题工"
},
[4841] ={
     id = 4841,
     words = "周百刚"
},
[4842] ={
     id = 4842,
     words = "周恩來"
},
[4843] ={
     id = 4843,
     words = "周锋锁"
},
[4844] ={
     id = 4844,
     words = "周容重"
},
[4845] ={
     id = 4845,
     words = "周天法"
},
[4846] ={
     id = 4846,
     words = "周铁农"
},
[4847] ={
     id = 4847,
     words = "周鉄農"
},
[4848] ={
     id = 4848,
     words = "周鐵農"
},
[4849] ={
     id = 4849,
     words = "周子玉"
},
[4850] ={
     id = 4850,
     words = "周總理"
},
[4851] ={
     id = 4851,
     words = "朱嘉明"
},
[4852] ={
     id = 4852,
     words = "朱狨基"
},
[4853] ={
     id = 4853,
     words = "朱容雞"
},
[4854] ={
     id = 4854,
     words = "朱溶剂"
},
[4855] ={
     id = 4855,
     words = "朱鎔基"
},
[4856] ={
     id = 4856,
     words = "朱胜文"
},
[4857] ={
     id = 4857,
     words = "朱勝文"
},
[4858] ={
     id = 4858,
     words = "猪聋畸"
},
[4859] ={
     id = 4859,
     words = "猪毛1"
},
[4860] ={
     id = 4860,
     words = "豬容基"
},
[4861] ={
     id = 4861,
     words = "轉法輪"
},
[4862] ={
     id = 4862,
     words = "装屄呢"
},
[4863] ={
     id = 4863,
     words = "装逼呢"
},
[4864] ={
     id = 4864,
     words = "自民党"
},
[4865] ={
     id = 4865,
     words = "自由门"
},
[4866] ={
     id = 4866,
     words = "总书记"
},
[4867] ={
     id = 4867,
     words = "总统号"
},
[4868] ={
     id = 4868,
     words = "總書記"
},
[4869] ={
     id = 4869,
     words = "邹德威"
},
[4870] ={
     id = 4870,
     words = "邹家华"
},
[4871] ={
     id = 4871,
     words = "鄒德威"
},
[4872] ={
     id = 4872,
     words = "鄒家華"
},
[4873] ={
     id = 4873,
     words = "走资派"
},
[4874] ={
     id = 4874,
     words = "足脚交"
},
[4875] ={
     id = 4875,
     words = "足腳交"
},
[4876] ={
     id = 4876,
     words = "作ai"
},
[4877] ={
     id = 4877,
     words = "做ai"
},
[4878] ={
     id = 4878,
     words = "做爱图"
},
[4879] ={
     id = 4879,
     words = "指导员"
},
[4880] ={
     id = 4880,
     words = "彭丽媛"
},
[4881] ={
     id = 4881,
     words = "阿扁推翻"
},
[4882] ={
     id = 4882,
     words = "挨了一炮"
},
[4883] ={
     id = 4883,
     words = "爱液横流"
},
[4884] ={
     id = 4884,
     words = "安局豪华"
},
[4885] ={
     id = 4885,
     words = "案的准确"
},
[4886] ={
     id = 4886,
     words = "八九政治"
},
[4887] ={
     id = 4887,
     words = "把病人整"
},
[4888] ={
     id = 4888,
     words = "把邓小平"
},
[4889] ={
     id = 4889,
     words = "把学生整"
},
[4890] ={
     id = 4890,
     words = "白黄牙签"
},
[4891] ={
     id = 4891,
     words = "办理本科"
},
[4892] ={
     id = 4892,
     words = "办理各种"
},
[4893] ={
     id = 4893,
     words = "办理票据"
},
[4894] ={
     id = 4894,
     words = "办理文凭"
},
[4895] ={
     id = 4895,
     words = "办理真实"
},
[4896] ={
     id = 4896,
     words = "办理证书"
},
[4897] ={
     id = 4897,
     words = "办理资格"
},
[4898] ={
     id = 4898,
     words = "谤罪获刑"
},
[4899] ={
     id = 4899,
     words = "磅解码器"
},
[4900] ={
     id = 4900,
     words = "磅遥控器"
},
[4901] ={
     id = 4901,
     words = "保过答案"
},
[4902] ={
     id = 4902,
     words = "报复执法"
},
[4903] ={
     id = 4903,
     words = "北省委门"
},
[4904] ={
     id = 4904,
     words = "被指抄袭"
},
[4905] ={
     id = 4905,
     words = "本公司担"
},
[4906] ={
     id = 4906,
     words = "辩词与梦"
},
[4907] ={
     id = 4907,
     words = "冰火九重"
},
[4908] ={
     id = 4908,
     words = "冰在火上"
},
[4909] ={
     id = 4909,
     words = "博会暂停"
},
[4910] ={
     id = 4910,
     words = "博园区伪"
},
[4911] ={
     id = 4911,
     words = "不思四化"
},
[4912] ={
     id = 4912,
     words = "布卖淫女"
},
[4913] ={
     id = 4913,
     words = "部忙组阁"
},
[4914] ={
     id = 4914,
     words = "部是这样"
},
[4915] ={
     id = 4915,
     words = "财众科技"
},
[4916] ={
     id = 4916,
     words = "策没有不"
},
[4917] ={
     id = 4917,
     words = "成人卡通"
},
[4918] ={
     id = 4918,
     words = "抽着大中"
},
[4919] ={
     id = 4919,
     words = "抽着芙蓉"
},
[4920] ={
     id = 4920,
     words = "出成绩付"
},
[4921] ={
     id = 4921,
     words = "出售发票"
},
[4922] ={
     id = 4922,
     words = "穿透仪器"
},
[4923] ={
     id = 4923,
     words = "春水横溢"
},
[4924] ={
     id = 4924,
     words = "次通过考"
},
[4925] ={
     id = 4925,
     words = "达毕业证"
},
[4926] ={
     id = 4926,
     words = "答案提供"
},
[4927] ={
     id = 4927,
     words = "打飞机专"
},
[4928] ={
     id = 4928,
     words = "打死经过"
},
[4929] ={
     id = 4929,
     words = "打砸办公"
},
[4930] ={
     id = 4930,
     words = "大批贪官"
},
[4931] ={
     id = 4931,
     words = "代办发票"
},
[4932] ={
     id = 4932,
     words = "代理发票"
},
[4933] ={
     id = 4933,
     words = "代理票据"
},
[4934] ={
     id = 4934,
     words = "当代七整"
},
[4935] ={
     id = 4935,
     words = "当官要精"
},
[4936] ={
     id = 4936,
     words = "当官在于"
},
[4937] ={
     id = 4937,
     words = "党前干劲"
},
[4938] ={
     id = 4938,
     words = "刀架保安"
},
[4939] ={
     id = 4939,
     words = "导的情人"
},
[4940] ={
     id = 4940,
     words = "导人的最"
},
[4941] ={
     id = 4941,
     words = "等人老百"
},
[4942] ={
     id = 4942,
     words = "等人是老"
},
[4943] ={
     id = 4943,
     words = "等人手术"
},
[4944] ={
     id = 4944,
     words = "邓爷爷转"
},
[4945] ={
     id = 4945,
     words = "地产之歌"
},
[4946] ={
     id = 4946,
     words = "地下先烈"
},
[4947] ={
     id = 4947,
     words = "帝国之梦"
},
[4948] ={
     id = 4948,
     words = "点数优惠"
},
[4949] ={
     id = 4949,
     words = "东北独立"
},
[4950] ={
     id = 4950,
     words = "洞小口紧"
},
[4951] ={
     id = 4951,
     words = "都当小姐"
},
[4952] ={
     id = 4952,
     words = "都进中央"
},
[4953] ={
     id = 4953,
     words = "独立台湾"
},
[4954] ={
     id = 4954,
     words = "对日强硬"
},
[4955] ={
     id = 4955,
     words = "恶势力操"
},
[4956] ={
     id = 4956,
     words = "恶势力插"
},
[4957] ={
     id = 4957,
     words = "法院给废"
},
[4958] ={
     id = 4958,
     words = "反测速雷"
},
[4959] ={
     id = 4959,
     words = "反雷达测"
},
[4960] ={
     id = 4960,
     words = "防电子眼"
},
[4961] ={
     id = 4961,
     words = "防身药水"
},
[4962] ={
     id = 4962,
     words = "房贷给废"
},
[4963] ={
     id = 4963,
     words = "夫妻交换"
},
[4964] ={
     id = 4964,
     words = "福尔马林"
},
[4965] ={
     id = 4965,
     words = "福娃的預"
},
[4966] ={
     id = 4966,
     words = "福娃頭上"
},
[4967] ={
     id = 4967,
     words = "府集中领"
},
[4968] ={
     id = 4968,
     words = "复印件生"
},
[4969] ={
     id = 4969,
     words = "复印件制"
},
[4970] ={
     id = 4970,
     words = "富婆给废"
},
[4971] ={
     id = 4971,
     words = "改号软件"
},
[4972] ={
     id = 4972,
     words = "肛门是邻"
},
[4973] ={
     id = 4973,
     words = "港澳博球"
},
[4974] ={
     id = 4974,
     words = "高就在政"
},
[4975] ={
     id = 4975,
     words = "格证考试"
},
[4976] ={
     id = 4976,
     words = "各类考试"
},
[4977] ={
     id = 4977,
     words = "各类文凭"
},
[4978] ={
     id = 4978,
     words = "工程吞得"
},
[4979] ={
     id = 4979,
     words = "公安错打"
},
[4980] ={
     id = 4980,
     words = "公安网监"
},
[4981] ={
     id = 4981,
     words = "公开小姐"
},
[4982] ={
     id = 4982,
     words = "攻官小姐"
},
[4983] ={
     id = 4983,
     words = "狗屁专家"
},
[4984] ={
     id = 4984,
     words = "鼓动一些"
},
[4985] ={
     id = 4985,
     words = "官也不容"
},
[4986] ={
     id = 4986,
     words = "官因发帖"
},
[4987] ={
     id = 4987,
     words = "光学真题"
},
[4988] ={
     id = 4988,
     words = "滚圆大乳"
},
[4989] ={
     id = 4989,
     words = "国际投注"
},
[4990] ={
     id = 4990,
     words = "国家软弱"
},
[4991] ={
     id = 4991,
     words = "国家吞得"
},
[4992] ={
     id = 4992,
     words = "哈药直销"
},
[4993] ={
     id = 4993,
     words = "号屏蔽器"
},
[4994] ={
     id = 4994,
     words = "黑火药的"
},
[4995] ={
     id = 4995,
     words = "红色恐怖"
},
[4996] ={
     id = 4996,
     words = "红外透视"
},
[4997] ={
     id = 4997,
     words = "胡江内斗"
},
[4998] ={
     id = 4998,
     words = "化学扫盲"
},
[4999] ={
     id = 4999,
     words = "还会吹萧"
},
[5000] ={
     id = 5000,
     words = "还看锦涛"
},
[5001] ={
     id = 5001,
     words = "环球证件"
},
[5002] ={
     id = 5002,
     words = "皇冠投注"
},
[5003] ={
     id = 5003,
     words = "浑圆豪乳"
},
[5004] ={
     id = 5004,
     words = "火车也疯"
},
[5005] ={
     id = 5005,
     words = "机定位器"
},
[5006] ={
     id = 5006,
     words = "机屏蔽器"
},
[5007] ={
     id = 5007,
     words = "基本靠吼"
},
[5008] ={
     id = 5008,
     words = "绩过后付"
},
[5009] ={
     id = 5009,
     words = "集体打砸"
},
[5010] ={
     id = 5010,
     words = "佳静安定"
},
[5011] ={
     id = 5011,
     words = "家一样饱"
},
[5012] ={
     id = 5012,
     words = "家属被打"
},
[5013] ={
     id = 5013,
     words = "兼职上门"
},
[5014] ={
     id = 5014,
     words = "江胡内斗"
},
[5015] ={
     id = 5015,
     words = "津大地震"
},
[5016] ={
     id = 5016,
     words = "进来的罪"
},
[5017] ={
     id = 5017,
     words = "京要地震"
},
[5018] ={
     id = 5018,
     words = "经典谎言"
},
[5019] ={
     id = 5019,
     words = "精子射在"
},
[5020] ={
     id = 5020,
     words = "警察的幌"
},
[5021] ={
     id = 5021,
     words = "警察殴打"
},
[5022] ={
     id = 5022,
     words = "警察说保"
},
[5023] ={
     id = 5023,
     words = "警车雷达"
},
[5024] ={
     id = 5024,
     words = "警方包庇"
},
[5025] ={
     id = 5025,
     words = "究生答案"
},
[5026] ={
     id = 5026,
     words = "九龙论坛"
},
[5027] ={
     id = 5027,
     words = "酒象喝汤"
},
[5028] ={
     id = 5028,
     words = "酒像喝汤"
},
[5029] ={
     id = 5029,
     words = "据说全民"
},
[5030] ={
     id = 5030,
     words = "军长发威"
},
[5031] ={
     id = 5031,
     words = "开锁工具"
},
[5032] ={
     id = 5032,
     words = "康没有不"
},
[5033] ={
     id = 5033,
     words = "考后付款"
},
[5034] ={
     id = 5034,
     words = "考前答案"
},
[5035] ={
     id = 5035,
     words = "考试包过"
},
[5036] ={
     id = 5036,
     words = "考试答案"
},
[5037] ={
     id = 5037,
     words = "考试机构"
},
[5038] ={
     id = 5038,
     words = "考试联盟"
},
[5039] ={
     id = 5039,
     words = "考研考中"
},
[5040] ={
     id = 5040,
     words = "考中答案"
},
[5041] ={
     id = 5041,
     words = "空和雅典"
},
[5042] ={
     id = 5042,
     words = "控诉世博"
},
[5043] ={
     id = 5043,
     words = "矿难不公"
},
[5044] ={
     id = 5044,
     words = "拉开水晶"
},
[5045] ={
     id = 5045,
     words = "狼全部跪"
},
[5046] ={
     id = 5046,
     words = "雷人女官"
},
[5047] ={
     id = 5047,
     words = "类准确答"
},
[5048] ={
     id = 5048,
     words = "理各种证"
},
[5049] ={
     id = 5049,
     words = "理是影帝"
},
[5050] ={
     id = 5050,
     words = "理做帐报"
},
[5051] ={
     id = 5051,
     words = "力骗中央"
},
[5052] ={
     id = 5052,
     words = "两岸才子"
},
[5053] ={
     id = 5053,
     words = "两会又三"
},
[5054] ={
     id = 5054,
     words = "了件渔袍"
},
[5055] ={
     id = 5055,
     words = "猎好帮手"
},
[5056] ={
     id = 5056,
     words = "六月联盟"
},
[5057] ={
     id = 5057,
     words = "龙湾事件"
},
[5058] ={
     id = 5058,
     words = "伦理电影"
},
[5059] ={
     id = 5059,
     words = "罗斯小姐"
},
[5060] ={
     id = 5060,
     words = "蟆叫专家"
},
[5061] ={
     id = 5061,
     words = "卖地财政"
},
[5062] ={
     id = 5062,
     words = "卖银行卡"
},
[5063] ={
     id = 5063,
     words = "猫眼工具"
},
[5064] ={
     id = 5064,
     words = "媒体封锁"
},
[5065] ={
     id = 5065,
     words = "每周一死"
},
[5066] ={
     id = 5066,
     words = "美艳少妇"
},
[5067] ={
     id = 5067,
     words = "民九亿商"
},
[5068] ={
     id = 5068,
     words = "铭记印尼"
},
[5069] ={
     id = 5069,
     words = "幕没有不"
},
[5070] ={
     id = 5070,
     words = "泥马之歌"
},
[5071] ={
     id = 5071,
     words = "你的西域"
},
[5072] ={
     id = 5072,
     words = "怒的志愿"
},
[5073] ={
     id = 5073,
     words = "女人和狗"
},
[5074] ={
     id = 5074,
     words = "女任职名"
},
[5075] ={
     id = 5075,
     words = "拍肩神药"
},
[5076] ={
     id = 5076,
     words = "炮的小蜜"
},
[5077] ={
     id = 5077,
     words = "平叫到床"
},
[5078] ={
     id = 5078,
     words = "仆不怕饮"
},
[5079] ={
     id = 5079,
     words = "奇迹的黄"
},
[5080] ={
     id = 5080,
     words = "骑单车出"
},
[5081] ={
     id = 5081,
     words = "钱三字经"
},
[5082] ={
     id = 5082,
     words = "枪决女犯"
},
[5083] ={
     id = 5083,
     words = "枪决现场"
},
[5084] ={
     id = 5084,
     words = "强权政府"
},
[5085] ={
     id = 5085,
     words = "强硬发言"
},
[5086] ={
     id = 5086,
     words = "抢其火炬"
},
[5087] ={
     id = 5087,
     words = "禽流感了"
},
[5088] ={
     id = 5088,
     words = "清除负面"
},
[5089] ={
     id = 5089,
     words = "情聊天室"
},
[5090] ={
     id = 5090,
     words = "区的雷人"
},
[5091] ={
     id = 5091,
     words = "群起抗暴"
},
[5092] ={
     id = 5092,
     words = "群体性事"
},
[5093] ={
     id = 5093,
     words = "绕过封锁"
},
[5094] ={
     id = 5094,
     words = "人在云上"
},
[5095] ={
     id = 5095,
     words = "任于斯国"
},
[5096] ={
     id = 5096,
     words = "软弱的国"
},
[5097] ={
     id = 5097,
     words = "扫了爷爷"
},
[5098] ={
     id = 5098,
     words = "煽动不明"
},
[5099] ={
     id = 5099,
     words = "煽动群众"
},
[5100] ={
     id = 5100,
     words = "烧公安局"
},
[5101] ={
     id = 5101,
     words = "涉嫌抄袭"
},
[5102] ={
     id = 5102,
     words = "神韵艺术"
},
[5103] ={
     id = 5103,
     words = "生肖中特"
},
[5104] ={
     id = 5104,
     words = "圣战不息"
},
[5105] ={
     id = 5105,
     words = "盛行在舞"
},
[5106] ={
     id = 5106,
     words = "十个预言"
},
[5107] ={
     id = 5107,
     words = "十类人不"
},
[5108] ={
     id = 5108,
     words = "十七大幕"
},
[5109] ={
     id = 5109,
     words = "实毕业证"
},
[5110] ={
     id = 5110,
     words = "实学历文"
},
[5111] ={
     id = 5111,
     words = "士康事件"
},
[5112] ={
     id = 5112,
     words = "守所死法"
},
[5113] ={
     id = 5113,
     words = "售弹簧刀"
},
[5114] ={
     id = 5114,
     words = "售一元硬"
},
[5115] ={
     id = 5115,
     words = "司长期有"
},
[5116] ={
     id = 5116,
     words = "私房写真"
},
[5117] ={
     id = 5117,
     words = "死法分布"
},
[5118] ={
     id = 5118,
     words = "死要见毛"
},
[5119] ={
     id = 5119,
     words = "四大扯个"
},
[5120] ={
     id = 5120,
     words = "苏家屯集"
},
[5121] ={
     id = 5121,
     words = "诉讼集团"
},
[5122] ={
     id = 5122,
     words = "酸羟亚胺"
},
[5123] ={
     id = 5123,
     words = "太王四神"
},
[5124] ={
     id = 5124,
     words = "泰兴镇中"
},
[5125] ={
     id = 5125,
     words = "贪官也辛"
},
[5126] ={
     id = 5126,
     words = "涛一样胡"
},
[5127] ={
     id = 5127,
     words = "体透视镜"
},
[5128] ={
     id = 5128,
     words = "天鹅之旅"
},
[5129] ={
     id = 5129,
     words = "天推广歌"
},
[5130] ={
     id = 5130,
     words = "庭审直播"
},
[5131] ={
     id = 5131,
     words = "通钢总经"
},
[5132] ={
     id = 5132,
     words = "透视功能"
},
[5133] ={
     id = 5133,
     words = "透视眼镜"
},
[5134] ={
     id = 5134,
     words = "突破封锁"
},
[5135] ={
     id = 5135,
     words = "突破网路"
},
[5136] ={
     id = 5136,
     words = "外透视镜"
},
[5137] ={
     id = 5137,
     words = "外围赌球"
},
[5138] ={
     id = 5138,
     words = "万能钥匙"
},
[5139] ={
     id = 5139,
     words = "万人骚动"
},
[5140] ={
     id = 5140,
     words = "网民获刑"
},
[5141] ={
     id = 5141,
     words = "微型摄像"
},
[5142] ={
     id = 5142,
     words = "围攻上海"
},
[5143] ={
     id = 5143,
     words = "谓的和谐"
},
[5144] ={
     id = 5144,
     words = "温切斯特"
},
[5145] ={
     id = 5145,
     words = "闻被控制"
},
[5146] ={
     id = 5146,
     words = "我的西域"
},
[5147] ={
     id = 5147,
     words = "我搞台独"
},
[5148] ={
     id = 5148,
     words = "无耻语录"
},
[5149] ={
     id = 5149,
     words = "武警已增"
},
[5150] ={
     id = 5150,
     words = "务员答案"
},
[5151] ={
     id = 5151,
     words = "务员考试"
},
[5152] ={
     id = 5152,
     words = "西服进去"
},
[5153] ={
     id = 5153,
     words = "席临终前"
},
[5154] ={
     id = 5154,
     words = "席指着护"
},
[5155] ={
     id = 5155,
     words = "先烈纷纷"
},
[5156] ={
     id = 5156,
     words = "现大地震"
},
[5157] ={
     id = 5157,
     words = "现金投注"
},
[5158] ={
     id = 5158,
     words = "线透视镜"
},
[5159] ={
     id = 5159,
     words = "香港论坛"
},
[5160] ={
     id = 5160,
     words = "香港马会"
},
[5161] ={
     id = 5161,
     words = "香港一类"
},
[5162] ={
     id = 5162,
     words = "香港总彩"
},
[5163] ={
     id = 5163,
     words = "泄漏的内"
},
[5164] ={
     id = 5164,
     words = "信访专班"
},
[5165] ={
     id = 5165,
     words = "信接收器"
},
[5166] ={
     id = 5166,
     words = "兴中心幼"
},
[5167] ={
     id = 5167,
     words = "行长王益"
},
[5168] ={
     id = 5168,
     words = "形透视镜"
},
[5169] ={
     id = 5169,
     words = "性推广歌"
},
[5170] ={
     id = 5170,
     words = "丫与王益"
},
[5171] ={
     id = 5171,
     words = "言被劳教"
},
[5172] ={
     id = 5172,
     words = "姚明进去"
},
[5173] ={
     id = 5173,
     words = "要射精了"
},
[5174] ={
     id = 5174,
     words = "一小撮别"
},
[5175] ={
     id = 5175,
     words = "益关注组"
},
[5176] ={
     id = 5176,
     words = "阴间来电"
},
[5177] ={
     id = 5177,
     words = "隐形喷剂"
},
[5178] ={
     id = 5178,
     words = "有奶不一"
},
[5179] ={
     id = 5179,
     words = "右转是政"
},
[5180] ={
     id = 5180,
     words = "娱乐透视"
},
[5181] ={
     id = 5181,
     words = "育部女官"
},
[5182] ={
     id = 5182,
     words = "园发生砍"
},
[5183] ={
     id = 5183,
     words = "炸弹遥控"
},
[5184] ={
     id = 5184,
     words = "炸药的制"
},
[5185] ={
     id = 5185,
     words = "侦探设备"
},
[5186] ={
     id = 5186,
     words = "真钱斗地"
},
[5187] ={
     id = 5187,
     words = "真钱投注"
},
[5188] ={
     id = 5188,
     words = "真实文凭"
},
[5189] ={
     id = 5189,
     words = "真实资格"
},
[5190] ={
     id = 5190,
     words = "震其国土"
},
[5191] ={
     id = 5191,
     words = "证到付款"
},
[5192] ={
     id = 5192,
     words = "证件集团"
},
[5193] ={
     id = 5193,
     words = "证生成器"
},
[5194] ={
     id = 5194,
     words = "证一次性"
},
[5195] ={
     id = 5195,
     words = "指纹考勤"
},
[5196] ={
     id = 5196,
     words = "至国家高"
},
[5197] ={
     id = 5197,
     words = "志不愿跟"
},
[5198] ={
     id = 5198,
     words = "制证定金"
},
[5199] ={
     id = 5199,
     words = "制作证件"
},
[5200] ={
     id = 5200,
     words = "中的班禅"
},
[5201] ={
     id = 5201,
     words = "中国不强"
},
[5202] ={
     id = 5202,
     words = "种公务员"
},
[5203] ={
     id = 5203,
     words = "种学历证"
},
[5204] ={
     id = 5204,
     words = "州大批贪"
},
[5205] ={
     id = 5205,
     words = "宙最高法"
},
[5206] ={
     id = 5206,
     words = "住英国房"
},
[5207] ={
     id = 5207,
     words = "专业办理"
},
[5208] ={
     id = 5208,
     words = "专业代写"
},
[5209] ={
     id = 5209,
     words = "转是政府"
},
[5210] ={
     id = 5210,
     words = "赚钱资料"
},
[5211] ={
     id = 5211,
     words = "姿不对死"
},
[5212] ={
     id = 5212,
     words = "梓健特药"
},
[5213] ={
     id = 5213,
     words = "自己找枪"
},
[5214] ={
     id = 5214,
     words = "总会美女"
},
[5215] ={
     id = 5215,
     words = "足球玩法"
},
[5216] ={
     id = 5216,
     words = "最牛公安"
},
[5217] ={
     id = 5217,
     words = "左转是政"
},
[5218] ={
     id = 5218,
     words = "作各种证"
},
[5219] ={
     id = 5219,
     words = "作硝化甘"
},
[5220] ={
     id = 5220,
     words = "做原子弹"
},
[5221] ={
     id = 5221,
     words = "萨马兰奇"
},
[5222] ={
     id = 5222,
     words = "阿拉法特"
},
[5223] ={
     id = 5223,
     words = "赫鲁晓夫"
},
[5224] ={
     id = 5224,
     words = "西哈努克"
},
[5225] ={
     id = 5225,
     words = "卡斯特罗"
},
[5226] ={
     id = 5226,
     words = "富兰克林"
},
[5227] ={
     id = 5227,
     words = "亚历山大"
},
[5228] ={
     id = 5228,
     words = "达赖喇嘛"
},
[5229] ={
     id = 5229,
     words = "东条英机"
},
[5230] ={
     id = 5230,
     words = "墨索里尼"
},
[5231] ={
     id = 5231,
     words = "冈村秀树"
},
[5232] ={
     id = 5232,
     words = "冈村宁次"
},
[5233] ={
     id = 5233,
     words = "沃尔开西"
},
[5234] ={
     id = 5234,
     words = "额尔德尼"
},
[5235] ={
     id = 5235,
     words = "莎士比亚"
},
[5236] ={
     id = 5236,
     words = "六四运动"
},
[5237] ={
     id = 5237,
     words = "美国之音"
},
[5238] ={
     id = 5238,
     words = "南华早报"
},
[5239] ={
     id = 5239,
     words = "法轮大法"
},
[5240] ={
     id = 5240,
     words = "台独万岁"
},
[5241] ={
     id = 5241,
     words = "台独分子"
},
[5242] ={
     id = 5242,
     words = "台湾民国"
},
[5243] ={
     id = 5243,
     words = "台湾岛国"
},
[5244] ={
     id = 5244,
     words = "台湾独立"
},
[5245] ={
     id = 5245,
     words = "新疆独立"
},
[5246] ={
     id = 5246,
     words = "新疆分裂"
},
[5247] ={
     id = 5247,
     words = "西藏独立"
},
[5248] ={
     id = 5248,
     words = "西藏分裂"
},
[5249] ={
     id = 5249,
     words = "一党专政"
},
[5250] ={
     id = 5250,
     words = "一中一台"
},
[5251] ={
     id = 5251,
     words = "两个中国"
},
[5252] ={
     id = 5252,
     words = "中国之春"
},
[5253] ={
     id = 5253,
     words = "基地组织"
},
[5254] ={
     id = 5254,
     words = "东亚病夫"
},
[5255] ={
     id = 5255,
     words = "释迦牟尼"
},
[5256] ={
     id = 5256,
     words = "阿弥陀佛"
},
[5257] ={
     id = 5257,
     words = "穆罕默德"
},
[5258] ={
     id = 5258,
     words = "真主安拉"
},
[5259] ={
     id = 5259,
     words = "走向圆满"
},
[5260] ={
     id = 5260,
     words = "黑白无常"
},
[5261] ={
     id = 5261,
     words = "牛头马面"
},
[5262] ={
     id = 5262,
     words = "高丽棒子"
},
[5263] ={
     id = 5263,
     words = "蒙古鞑子"
},
[5264] ={
     id = 5264,
     words = "先奸后杀"
},
[5265] ={
     id = 5265,
     words = "安非他命"
},
[5266] ={
     id = 5266,
     words = "AIDS"
},
[5267] ={
     id = 5267,
     words = "DICK"
},
[5268] ={
     id = 5268,
     words = "FUCK"
},
[5269] ={
     id = 5269,
     words = "shit"
},
[5270] ={
     id = 5270,
     words = "SUCK"
},
[5271] ={
     id = 5271,
     words = "tnnd"
},
[5272] ={
     id = 5272,
     words = "干你妈B"
},
[5273] ={
     id = 5273,
     words = "干你妈逼"
},
[5274] ={
     id = 5274,
     words = "狗娘养的"
},
[5275] ={
     id = 5275,
     words = "妳老母的"
},
[5276] ={
     id = 5276,
     words = "BLOW"
},
[5277] ={
     id = 5277,
     words = "逼你老母"
},
[5278] ={
     id = 5278,
     words = "狗操卖逼"
},
[5279] ={
     id = 5279,
     words = "你妈了妹"
},
[5280] ={
     id = 5280,
     words = "服务管理"
},
[5281] ={
     id = 5281,
     words = "系统公告"
},
[5282] ={
     id = 5282,
     words = "KEFU"
},
[5283] ={
     id = 5283,
     words = "客户服务"
},
[5284] ={
     id = 5284,
     words = "服务天使"
},
[5285] ={
     id = 5285,
     words = "辅助程序"
},
[5286] ={
     id = 5286,
     words = "尖阁列岛"
},
[5287] ={
     id = 5287,
     words = "垃圾游戏"
},
[5288] ={
     id = 5288,
     words = "出售账号"
},
[5289] ={
     id = 5289,
     words = "出售此号"
},
[5290] ={
     id = 5290,
     words = "出售神符"
},
[5291] ={
     id = 5291,
     words = "街头对抗"
},
[5292] ={
     id = 5292,
     words = "混 沌决"
},
[5293] ={
     id = 5293,
     words = "bjzc"
},
[5294] ={
     id = 5294,
     words = "cctv"
},
[5295] ={
     id = 5295,
     words = "cdjp"
},
[5296] ={
     id = 5296,
     words = "cunt"
},
[5297] ={
     id = 5297,
     words = "damm"
},
[5298] ={
     id = 5298,
     words = "damn"
},
[5299] ={
     id = 5299,
     words = "fofg"
},
[5300] ={
     id = 5300,
     words = "phuc"
},
[5301] ={
     id = 5301,
     words = "piss"
},
[5302] ={
     id = 5302,
     words = "sega"
},
[5303] ={
     id = 5303,
     words = "sh!t"
},
[5304] ={
     id = 5304,
     words = "shyt"
},
[5305] ={
     id = 5305,
     words = "阿扁万岁"
},
[5306] ={
     id = 5306,
     words = "八九风波"
},
[5307] ={
     id = 5307,
     words = "办理证件"
},
[5308] ={
     id = 5308,
     words = "北京之春"
},
[5309] ={
     id = 5309,
     words = "本?拉登"
},
[5310] ={
     id = 5310,
     words = "操你妈屄"
},
[5311] ={
     id = 5311,
     words = "草的你妈"
},
[5312] ={
     id = 5312,
     words = "成人电影"
},
[5313] ={
     id = 5313,
     words = "抽你丫的"
},
[5314] ={
     id = 5314,
     words = "出售假币"
},
[5315] ={
     id = 5315,
     words = "出售枪支"
},
[5316] ={
     id = 5316,
     words = "出售手枪"
},
[5317] ={
     id = 5317,
     words = "粗制吗啡"
},
[5318] ={
     id = 5318,
     words = "大法弟子"
},
[5319] ={
     id = 5319,
     words = "大麻树脂"
},
[5320] ={
     id = 5320,
     words = "大学骚乱"
},
[5321] ={
     id = 5321,
     words = "代表大会"
},
[5322] ={
     id = 5322,
     words = "弟大物勃"
},
[5323] ={
     id = 5323,
     words = "帝国主义"
},
[5324] ={
     id = 5324,
     words = "东突组织"
},
[5325] ={
     id = 5325,
     words = "多维新闻"
},
[5326] ={
     id = 5326,
     words = "多维周刊"
},
[5327] ={
     id = 5327,
     words = "恶搞晚会"
},
[5328] ={
     id = 5328,
     words = "发奖使者"
},
[5329] ={
     id = 5329,
     words = "分裂祖国"
},
[5330] ={
     id = 5330,
     words = "斧头镰刀"
},
[5331] ={
     id = 5331,
     words = "干妳老母"
},
[5332] ={
     id = 5332,
     words = "高校暴乱"
},
[5333] ={
     id = 5333,
     words = "高校骚乱"
},
[5334] ={
     id = 5334,
     words = "工作人员"
},
[5335] ={
     id = 5335,
     words = "弓虽女干"
},
[5336] ={
     id = 5336,
     words = "共产主义"
},
[5337] ={
     id = 5337,
     words = "共青团员"
},
[5338] ={
     id = 5338,
     words = "古方迷香"
},
[5339] ={
     id = 5339,
     words = "官逼民反"
},
[5340] ={
     id = 5340,
     words = "官商勾结"
},
[5341] ={
     id = 5341,
     words = "管理人员"
},
[5342] ={
     id = 5342,
     words = "光明日报"
},
[5343] ={
     id = 5343,
     words = "国际法院"
},
[5344] ={
     id = 5344,
     words = "国家民委"
},
[5345] ={
     id = 5345,
     words = "国家主席"
},
[5346] ={
     id = 5346,
     words = "海关总署"
},
[5347] ={
     id = 5347,
     words = "欢城互动"
},
[5348] ={
     id = 5348,
     words = "环保总局"
},
[5349] ={
     id = 5349,
     words = "黄色电影"
},
[5350] ={
     id = 5350,
     words = "回民暴动"
},
[5351] ={
     id = 5351,
     words = "激情电影"
},
[5352] ={
     id = 5352,
     words = "计牌软件"
},
[5353] ={
     id = 5353,
     words = "奸夫淫妇"
},
[5354] ={
     id = 5354,
     words = "警匪一家"
},
[5355] ={
     id = 5355,
     words = "敬国神社"
},
[5356] ={
     id = 5356,
     words = "靖国神社"
},
[5357] ={
     id = 5357,
     words = "军国主义"
},
[5358] ={
     id = 5358,
     words = "看牌软件"
},
[5359] ={
     id = 5359,
     words = "看棋软件"
},
[5360] ={
     id = 5360,
     words = "恐怖份子"
},
[5361] ={
     id = 5361,
     words = "恐怖主义"
},
[5362] ={
     id = 5362,
     words = "联易互动"
},
[5363] ={
     id = 5363,
     words = "两腿之间"
},
[5364] ={
     id = 5364,
     words = "六四事件"
},
[5365] ={
     id = 5365,
     words = "六四真相"
},
[5366] ={
     id = 5366,
     words = "妈卖妈屁"
},
[5367] ={
     id = 5367,
     words = "麻醉钢枪"
},
[5368] ={
     id = 5368,
     words = "麻醉乙醚"
},
[5369] ={
     id = 5369,
     words = "马卖马屁"
},
[5370] ={
     id = 5370,
     words = "买卖枪支"
},
[5371] ={
     id = 5371,
     words = "卖党求荣"
},
[5372] ={
     id = 5372,
     words = "卖国求荣"
},
[5373] ={
     id = 5373,
     words = "蒙古达子"
},
[5374] ={
     id = 5374,
     words = "蒙古独立"
},
[5375] ={
     id = 5375,
     words = "莫索里尼"
},
[5376] ={
     id = 5376,
     words = "你二大爷"
},
[5377] ={
     id = 5377,
     words = "你姥姥的"
},
[5378] ={
     id = 5378,
     words = "你爷爷的"
},
[5379] ={
     id = 5379,
     words = "苹果日报"
},
[5380] ={
     id = 5380,
     words = "枪支弹药"
},
[5381] ={
     id = 5381,
     words = "窃听器材"
},
[5382] ={
     id = 5382,
     words = "青天白日"
},
[5383] ={
     id = 5383,
     words = "去你妈的"
},
[5384] ={
     id = 5384,
     words = "全国人大"
},
[5385] ={
     id = 5385,
     words = "人大代表"
},
[5386] ={
     id = 5386,
     words = "人民广场"
},
[5387] ={
     id = 5387,
     words = "人民日报"
},
[5388] ={
     id = 5388,
     words = "人民银行"
},
[5389] ={
     id = 5389,
     words = "人体炸弹"
},
[5390] ={
     id = 5390,
     words = "日本鬼子"
},
[5391] ={
     id = 5391,
     words = "乳波臀浪"
},
[5392] ={
     id = 5392,
     words = "塞你老母"
},
[5393] ={
     id = 5393,
     words = "塞你老师"
},
[5394] ={
     id = 5394,
     words = "三个呆婊"
},
[5395] ={
     id = 5395,
     words = "三个代婊"
},
[5396] ={
     id = 5396,
     words = "三民主义"
},
[5397] ={
     id = 5397,
     words = "三去车仑"
},
[5398] ={
     id = 5398,
     words = "色情电影"
},
[5399] ={
     id = 5399,
     words = "色情服务"
},
[5400] ={
     id = 5400,
     words = "社会主义"
},
[5401] ={
     id = 5401,
     words = "十年动乱"
},
[5402] ={
     id = 5402,
     words = "十五周年"
},
[5403] ={
     id = 5403,
     words = "驶你老母"
},
[5404] ={
     id = 5404,
     words = "驶你老师"
},
[5405] ={
     id = 5405,
     words = "世界日报"
},
[5406] ={
     id = 5406,
     words = "手机复制"
},
[5407] ={
     id = 5407,
     words = "双峰微颤"
},
[5408] ={
     id = 5408,
     words = "水去车仑"
},
[5409] ={
     id = 5409,
     words = "税务总局"
},
[5410] ={
     id = 5410,
     words = "四川独立"
},
[5411] ={
     id = 5411,
     words = "台湾帝国"
},
[5412] ={
     id = 5412,
     words = "特别公告"
},
[5413] ={
     id = 5413,
     words = "体育总局"
},
[5414] ={
     id = 5414,
     words = "天皇陛下"
},
[5415] ={
     id = 5415,
     words = "投毒杀人"
},
[5416] ={
     id = 5416,
     words = "透视软件"
},
[5417] ={
     id = 5417,
     words = "我妳老爸"
},
[5418] ={
     id = 5418,
     words = "五星红旗"
},
[5419] ={
     id = 5419,
     words = "西藏天葬"
},
[5420] ={
     id = 5420,
     words = "希望之声"
},
[5421] ={
     id = 5421,
     words = "系统讯息"
},
[5422] ={
     id = 5422,
     words = "新华内情"
},
[5423] ={
     id = 5423,
     words = "新闻出版"
},
[5424] ={
     id = 5424,
     words = "新闻管制"
},
[5425] ={
     id = 5425,
     words = "血腥图片"
},
[5426] ={
     id = 5426,
     words = "丫头养的"
},
[5427] ={
     id = 5427,
     words = "燕玲论坛"
},
[5428] ={
     id = 5428,
     words = "一党专制"
},
[5429] ={
     id = 5429,
     words = "一国两制"
},
[5430] ={
     id = 5430,
     words = "以茎至洞"
},
[5431] ={
     id = 5431,
     words = "阴小撕大"
},
[5432] ={
     id = 5432,
     words = "淫语连连"
},
[5433] ={
     id = 5433,
     words = "舆论钳制"
},
[5434] ={
     id = 5434,
     words = "欲火焚身"
},
[5435] ={
     id = 5435,
     words = "远程偷拍"
},
[5436] ={
     id = 5436,
     words = "月经不调"
},
[5437] ={
     id = 5437,
     words = "值勤账号"
},
[5438] ={
     id = 5438,
     words = "中共中央"
},
[5439] ={
     id = 5439,
     words = "中华民国"
},
[5440] ={
     id = 5440,
     words = "中医药局"
},
[5441] ={
     id = 5441,
     words = "追查国际"
},
[5442] ={
     id = 5442,
     words = "自杀手册"
},
[5443] ={
     id = 5443,
     words = "自杀指南"
},
[5444] ={
     id = 5444,
     words = "自由之门"
},
[5445] ={
     id = 5445,
     words = "自制手枪"
},
[5446] ={
     id = 5446,
     words = "自治机关"
},
[5447] ={
     id = 5447,
     words = "共产党靠"
},
[5448] ={
     id = 5448,
     words = "cao靠"
},
[5449] ={
     id = 5449,
     words = "他妈的靠"
},
[5450] ={
     id = 5450,
     words = "TMD靠"
},
[5451] ={
     id = 5451,
     words = "法轮功靠"
},
[5452] ={
     id = 5452,
     words = "江泽民靠"
},
[5453] ={
     id = 5453,
     words = "胡锦涛靠"
},
[5454] ={
     id = 5454,
     words = "温家宝靠"
},
[5455] ={
     id = 5455,
     words = "u r靠"
},
[5456] ={
     id = 5456,
     words = "八 仙靠"
},
[5457] ={
     id = 5457,
     words = "混沌诀靠"
},
[5458] ={
     id = 5458,
     words = "操你妈靠"
},
[5459] ={
     id = 5459,
     words = "日你妈靠"
},
[5460] ={
     id = 5460,
     words = "不玩了靠"
},
[5461] ={
     id = 5461,
     words = "烂游戏靠"
},
[5462] ={
     id = 5462,
     words = "删 号靠"
},
[5463] ={
     id = 5463,
     words = "草你妈靠"
},
[5464] ={
     id = 5464,
     words = "U-R靠"
},
[5465] ={
     id = 5465,
     words = "8 仙靠"
},
[5466] ={
     id = 5466,
     words = "毛泽东靠"
},
[5467] ={
     id = 5467,
     words = "NPC靠"
},
[5468] ={
     id = 5468,
     words = "13点靠"
},
[5469] ={
     id = 5469,
     words = "6?4靠"
},
[5470] ={
     id = 5470,
     words = "8?9靠"
},
[5471] ={
     id = 5471,
     words = "操薄一波"
},
[5472] ={
     id = 5472,
     words = "操布莱尔"
},
[5473] ={
     id = 5473,
     words = "操布雷尔"
},
[5474] ={
     id = 5474,
     words = "操财政部"
},
[5475] ={
     id = 5475,
     words = "操参事室"
},
[5476] ={
     id = 5476,
     words = "操操GM"
},
[5477] ={
     id = 5477,
     words = "操操XX"
},
[5478] ={
     id = 5478,
     words = "操操你妈"
},
[5479] ={
     id = 5479,
     words = "操曹刚川"
},
[5480] ={
     id = 5480,
     words = "操草你妈"
},
[5481] ={
     id = 5481,
     words = "操草拟妈"
},
[5482] ={
     id = 5482,
     words = "操测绘局"
},
[5483] ={
     id = 5483,
     words = "操插GM"
},
[5484] ={
     id = 5484,
     words = "操插你妈"
},
[5485] ={
     id = 5485,
     words = "操插深些"
},
[5486] ={
     id = 5486,
     words = "操产权局"
},
[5487] ={
     id = 5487,
     words = "操陈良宇"
},
[5488] ={
     id = 5488,
     words = "操陈水扁"
},
[5489] ={
     id = 5489,
     words = "操陈希同"
},
[5490] ={
     id = 5490,
     words = "操陈晓宁"
},
[5491] ={
     id = 5491,
     words = "操陈至立"
},
[5492] ={
     id = 5492,
     words = "操成人片"
},
[5493] ={
     id = 5493,
     words = "操吃大便"
},
[5494] ={
     id = 5494,
     words = "操迟浩田"
},
[5495] ={
     id = 5495,
     words = "操臭化西"
},
[5496] ={
     id = 5496,
     words = "操吹喇叭"
},
[5497] ={
     id = 5497,
     words = "操催情药"
},
[5498] ={
     id = 5498,
     words = "操大波波"
},
[5499] ={
     id = 5499,
     words = "毛董建华"
},
[5500] ={
     id = 5500,
     words = "毛董贱华"
},
[5501] ={
     id = 5501,
     words = "毛董文华"
},
[5502] ={
     id = 5502,
     words = "毛懂文华"
},
[5503] ={
     id = 5503,
     words = "毛多维社"
},
[5504] ={
     id = 5504,
     words = "毛多维网"
},
[5505] ={
     id = 5505,
     words = "毛恩格斯"
},
[5506] ={
     id = 5506,
     words = "毛发改委"
},
[5507] ={
     id = 5507,
     words = "毛发抡功"
},
[5508] ={
     id = 5508,
     words = "毛发伦功"
},
[5509] ={
     id = 5509,
     words = "毛发论公"
},
[5510] ={
     id = 5510,
     words = "毛发论功"
},
[5511] ={
     id = 5511,
     words = "毛发正念"
},
[5512] ={
     id = 5512,
     words = "毛法轮功"
},
[5513] ={
     id = 5513,
     words = "毛法西斯"
},
[5514] ={
     id = 5514,
     words = "毛法制办"
},
[5515] ={
     id = 5515,
     words = "毛反革命"
},
[5516] ={
     id = 5516,
     words = "毛反政府"
},
[5517] ={
     id = 5517,
     words = "毛傅作义"
},
[5518] ={
     id = 5518,
     words = "毛干GM"
},
[5519] ={
     id = 5519,
     words = "毛干拎娘"
},
[5520] ={
     id = 5520,
     words = "毛干妳妈"
},
[5521] ={
     id = 5521,
     words = "毛干妳娘"
},
[5522] ={
     id = 5522,
     words = "毛干你妈"
},
[5523] ={
     id = 5523,
     words = "毛干你娘"
},
[5524] ={
     id = 5524,
     words = "毛干七八"
},
[5525] ={
     id = 5525,
     words = "毛干死你"
},
[5526] ={
     id = 5526,
     words = "毛港澳办"
},
[5527] ={
     id = 5527,
     words = "毛膏药旗"
},
[5528] ={
     id = 5528,
     words = "毛工商局"
},
[5529] ={
     id = 5529,
     words = "毛公安部"
},
[5530] ={
     id = 5530,
     words = "毛公安局"
},
[5531] ={
     id = 5531,
     words = "毛共产党"
},
[5532] ={
     id = 5532,
     words = "毛狗日的"
},
[5533] ={
     id = 5533,
     words = "毛观世音"
},
[5534] ={
     id = 5534,
     words = "毛管理员"
},
[5535] ={
     id = 5535,
     words = "毛广电局"
},
[5536] ={
     id = 5536,
     words = "毛龟儿子"
},
[5537] ={
     id = 5537,
     words = "毛龟孙子"
},
[5538] ={
     id = 5538,
     words = "毛郭伯雄"
},
[5539] ={
     id = 5539,
     words = "毛国安局"
},
[5540] ={
     id = 5540,
     words = "毛国防部"
},
[5541] ={
     id = 5541,
     words = "毛国管局"
},
[5542] ={
     id = 5542,
     words = "毛国民党"
},
[5543] ={
     id = 5543,
     words = "毛国务院"
},
[5544] ={
     id = 5544,
     words = "毛国研室"
},
[5545] ={
     id = 5545,
     words = "毛国资委"
},
[5546] ={
     id = 5546,
     words = "毛海洛因"
},
[5547] ={
     id = 5547,
     words = "毛海洋局"
},
[5548] ={
     id = 5548,
     words = "毛何候华"
},
[5549] ={
     id = 5549,
     words = "毛贺国强"
},
[5550] ={
     id = 5550,
     words = "毛黑社会"
},
[5551] ={
     id = 5551,
     words = "毛黑手党"
},
[5552] ={
     id = 5552,
     words = "毛红卫兵"
},
[5553] ={
     id = 5553,
     words = "毛胡XX"
},
[5554] ={
     id = 5554,
     words = "毛胡紧涛"
},
[5555] ={
     id = 5555,
     words = "毛胡紧掏"
},
[5556] ={
     id = 5556,
     words = "毛胡紧套"
},
[5557] ={
     id = 5557,
     words = "毛胡锦涛"
},
[5558] ={
     id = 5558,
     words = "毛胡锦淘"
},
[5559] ={
     id = 5559,
     words = "毛胡乔木"
},
[5560] ={
     id = 5560,
     words = "毛胡耀邦"
},
[5561] ={
     id = 5561,
     words = "毛胡主席"
},
[5562] ={
     id = 5562,
     words = "毛华国锋"
},
[5563] ={
     id = 5563,
     words = "毛华建敏"
},
[5564] ={
     id = 5564,
     words = "毛黄　菊"
},
[5565] ={
     id = 5565,
     words = "毛回良玉"
},
[5566] ={
     id = 5566,
     words = "毛基督教"
},
[5567] ={
     id = 5567,
     words = "毛计生委"
},
[5568] ={
     id = 5568,
     words = "毛贾庆林"
},
[5569] ={
     id = 5569,
     words = "毛监察部"
},
[5570] ={
     id = 5570,
     words = "毛监管局"
},
[5571] ={
     id = 5571,
     words = "毛监听王"
},
[5572] ={
     id = 5572,
     words = "毛检察院"
},
[5573] ={
     id = 5573,
     words = "毛建设部"
},
[5574] ={
     id = 5574,
     words = "毛江八点"
},
[5575] ={
     id = 5575,
     words = "毛江独裁"
},
[5576] ={
     id = 5576,
     words = "毛江核心"
},
[5577] ={
     id = 5577,
     words = "毛江戏子"
},
[5578] ={
     id = 5578,
     words = "毛江择民"
},
[5579] ={
     id = 5579,
     words = "毛江泽民"
},
[5580] ={
     id = 5580,
     words = "毛江贼民"
},
[5581] ={
     id = 5581,
     words = "毛江折民"
},
[5582] ={
     id = 5582,
     words = "毛江猪媳"
},
[5583] ={
     id = 5583,
     words = "毛江主席"
},
[5584] ={
     id = 5584,
     words = "毛僵贼民"
},
[5585] ={
     id = 5585,
     words = "毛蒋介石"
},
[5586] ={
     id = 5586,
     words = "毛蒋经国"
},
[5587] ={
     id = 5587,
     words = "毛蒋中正"
},
[5588] ={
     id = 5588,
     words = "毛酱猪媳"
},
[5589] ={
     id = 5589,
     words = "毛交通部"
},
[5590] ={
     id = 5590,
     words = "毛叫小姐"
},
[5591] ={
     id = 5591,
     words = "毛教育部"
},
[5592] ={
     id = 5592,
     words = "毛她妈的"
},
[5593] ={
     id = 5593,
     words = "毛金日成"
},
[5594] ={
     id = 5594,
     words = "毛金正日"
},
[5595] ={
     id = 5595,
     words = "毛纠察员"
},
[5596] ={
     id = 5596,
     words = "毛看牌器"
},
[5597] ={
     id = 5597,
     words = "毛看棋器"
},
[5598] ={
     id = 5598,
     words = "毛靠你妈"
},
[5599] ={
     id = 5599,
     words = "毛可待因"
},
[5600] ={
     id = 5600,
     words = "毛可卡叶"
},
[5601] ={
     id = 5601,
     words = "毛可卡因"
},
[5602] ={
     id = 5602,
     words = "毛克林顿"
},
[5603] ={
     id = 5603,
     words = "毛寇晓伟"
},
[5604] ={
     id = 5604,
     words = "毛老毛子"
},
[5605] ={
     id = 5605,
     words = "毛黎阳评"
},
[5606] ={
     id = 5606,
     words = "毛李长春"
},
[5607] ={
     id = 5607,
     words = "毛李登辉"
},
[5608] ={
     id = 5608,
     words = "毛李弘旨"
},
[5609] ={
     id = 5609,
     words = "毛李红志"
},
[5610] ={
     id = 5610,
     words = "毛李宏旨"
},
[5611] ={
     id = 5611,
     words = "毛李宏志"
},
[5612] ={
     id = 5612,
     words = "毛李洪志"
},
[5613] ={
     id = 5613,
     words = "毛李岚清"
},
[5614] ={
     id = 5614,
     words = "毛李鹏%*"
},
[5615] ={
     id = 5615,
     words = "毛李瑞环"
},
[5616] ={
     id = 5616,
     words = "毛李铁映"
},
[5617] ={
     id = 5617,
     words = "毛李先念"
},
[5618] ={
     id = 5618,
     words = "毛联合国"
},
[5619] ={
     id = 5619,
     words = "毛粮食局"
},
[5620] ={
     id = 5620,
     words = "毛林业局"
},
[5621] ={
     id = 5621,
     words = "毛刘　淇"
},
[5622] ={
     id = 5622,
     words = "毛刘少奇"
},
[5623] ={
     id = 5623,
     words = "毛刘云山"
},
[5624] ={
     id = 5624,
     words = "毛六.四"
},
[5625] ={
     id = 5625,
     words = "毛六。四"
},
[5626] ={
     id = 5626,
     words = "毛六?四"
},
[5627] ={
     id = 5627,
     words = "毛六合彩"
},
[5628] ={
     id = 5628,
     words = "毛六-四"
},
[5629] ={
     id = 5629,
     words = "毛龙新民"
},
[5630] ={
     id = 5630,
     words = "毛吕秀莲"
},
[5631] ={
     id = 5631,
     words = "毛旅游局"
},
[5632] ={
     id = 5632,
     words = "毛罗　干"
},
[5633] ={
     id = 5633,
     words = "毛麻醉枪"
},
[5634] ={
     id = 5634,
     words = "毛麻醉药"
},
[5635] ={
     id = 5635,
     words = "毛马克思"
},
[5636] ={
     id = 5636,
     words = "毛马英九"
},
[5637] ={
     id = 5637,
     words = "毛吗啡碱"
},
[5638] ={
     id = 5638,
     words = "毛吗啡片"
},
[5639] ={
     id = 5639,
     words = "毛买财富"
},
[5640] ={
     id = 5640,
     words = "毛麦角酸"
},
[5641] ={
     id = 5641,
     words = "毛卖.国"
},
[5642] ={
     id = 5642,
     words = "毛卖ID"
},
[5643] ={
     id = 5643,
     words = "毛卖QQ"
},
[5644] ={
     id = 5644,
     words = "毛卖财富"
},
[5645] ={
     id = 5645,
     words = "毛卖软件"
},
[5646] ={
     id = 5646,
     words = "毛毛XX"
},
[5647] ={
     id = 5647,
     words = "毛毛厕洞"
},
[5648] ={
     id = 5648,
     words = "毛毛一鲜"
},
[5649] ={
     id = 5649,
     words = "毛毛泽东"
},
[5650] ={
     id = 5650,
     words = "毛毛贼东"
},
[5651] ={
     id = 5651,
     words = "毛毛主席"
},
[5652] ={
     id = 5652,
     words = "毛梅花网"
},
[5653] ={
     id = 5653,
     words = "毛美国佬"
},
[5654] ={
     id = 5654,
     words = "毛美利坚"
},
[5655] ={
     id = 5655,
     words = "毛蒙尘药"
},
[5656] ={
     id = 5656,
     words = "毛迷魂药"
},
[5657] ={
     id = 5657,
     words = "毛迷奸药"
},
[5658] ={
     id = 5658,
     words = "毛迷歼药"
},
[5659] ={
     id = 5659,
     words = "毛民航局"
},
[5660] ={
     id = 5660,
     words = "毛民进党"
},
[5661] ={
     id = 5661,
     words = "毛民政部"
},
[5662] ={
     id = 5662,
     words = "毛明慧网"
},
[5663] ={
     id = 5663,
     words = "毛摩门教"
},
[5664] ={
     id = 5664,
     words = "毛穆斯林"
},
[5665] ={
     id = 5665,
     words = "毛妳妈的"
},
[5666] ={
     id = 5666,
     words = "毛妳马的"
},
[5667] ={
     id = 5667,
     words = "毛妳娘的"
},
[5668] ={
     id = 5668,
     words = "毛南联盟"
},
[5669] ={
     id = 5669,
     words = "毛南蛮子"
},
[5670] ={
     id = 5670,
     words = "毛你大爷"
},
[5671] ={
     id = 5671,
     words = "毛你老母"
},
[5672] ={
     id = 5672,
     words = "毛你老味"
},
[5673] ={
     id = 5673,
     words = "毛你妈逼"
},
[5674] ={
     id = 5674,
     words = "毛你妈的"
},
[5675] ={
     id = 5675,
     words = "毛鸟GM"
},
[5676] ={
     id = 5676,
     words = "毛农业部"
},
[5677] ={
     id = 5677,
     words = "毛气象局"
},
[5678] ={
     id = 5678,
     words = "毛钱其琛"
},
[5679] ={
     id = 5679,
     words = "毛强奸犯"
},
[5680] ={
     id = 5680,
     words = "毛窃听器"
},
[5681] ={
     id = 5681,
     words = "毛亲民党"
},
[5682] ={
     id = 5682,
     words = "毛瘸腿帮"
},
[5683] ={
     id = 5683,
     words = "毛人代会"
},
[5684] ={
     id = 5684,
     words = "毛日GM"
},
[5685] ={
     id = 5685,
     words = "毛日X妈"
},
[5686] ={
     id = 5686,
     words = "毛日你妈"
},
[5687] ={
     id = 5687,
     words = "毛日你娘"
},
[5688] ={
     id = 5688,
     words = "毛日他娘"
},
[5689] ={
     id = 5689,
     words = "毛肉棍子"
},
[5690] ={
     id = 5690,
     words = "毛萨达姆"
},
[5691] ={
     id = 5691,
     words = "毛塞你爸"
},
[5692] ={
     id = 5692,
     words = "毛塞你公"
},
[5693] ={
     id = 5693,
     words = "毛塞你母"
},
[5694] ={
     id = 5694,
     words = "毛塞你娘"
},
[5695] ={
     id = 5695,
     words = "毛三级片"
},
[5696] ={
     id = 5696,
     words = "毛三陪女"
},
[5697] ={
     id = 5697,
     words = "毛三唑仑"
},
[5698] ={
     id = 5698,
     words = "毛杀人犯"
},
[5699] ={
     id = 5699,
     words = "毛商务部"
},
[5700] ={
     id = 5700,
     words = "毛社科院"
},
[5701] ={
     id = 5701,
     words = "毛神经病"
},
[5702] ={
     id = 5702,
     words = "毛审计署"
},
[5703] ={
     id = 5703,
     words = "毛生春袋"
},
[5704] ={
     id = 5704,
     words = "毛生鸦片"
},
[5705] ={
     id = 5705,
     words = "毛圣女峰"
},
[5706] ={
     id = 5706,
     words = "毛十八摸"
},
[5707] ={
     id = 5707,
     words = "毛食捻屎"
},
[5708] ={
     id = 5708,
     words = "毛驶你爸"
},
[5709] ={
     id = 5709,
     words = "毛驶你公"
},
[5710] ={
     id = 5710,
     words = "毛驶你母"
},
[5711] ={
     id = 5711,
     words = "毛驶你娘"
},
[5712] ={
     id = 5712,
     words = "毛受虐狂"
},
[5713] ={
     id = 5713,
     words = "毛售ID"
},
[5714] ={
     id = 5714,
     words = "毛售软件"
},
[5715] ={
     id = 5715,
     words = "毛水利部"
},
[5716] ={
     id = 5716,
     words = "毛司法部"
},
[5717] ={
     id = 5717,
     words = "毛私-服"
},
[5718] ={
     id = 5718,
     words = "毛私—服"
},
[5719] ={
     id = 5719,
     words = "毛斯大林"
},
[5720] ={
     id = 5720,
     words = "毛死gd"
},
[5721] ={
     id = 5721,
     words = "毛死gm"
},
[5722] ={
     id = 5722,
     words = "毛死全家"
},
[5723] ={
     id = 5723,
     words = "毛四人帮"
},
[5724] ={
     id = 5724,
     words = "毛宋楚瑜"
},
[5725] ={
     id = 5725,
     words = "毛宋祖英"
},
[5726] ={
     id = 5726,
     words = "毛孙逸仙"
},
[5727] ={
     id = 5727,
     words = "毛孙中山"
},
[5728] ={
     id = 5728,
     words = "毛他妈的"
},
[5729] ={
     id = 5729,
     words = "毛他马的"
},
[5730] ={
     id = 5730,
     words = "毛他母亲"
},
[5731] ={
     id = 5731,
     words = "毛他祖宗"
},
[5732] ={
     id = 5732,
     words = "毛台湾党"
},
[5733] ={
     id = 5733,
     words = "毛台湾狗"
},
[5734] ={
     id = 5734,
     words = "毛台湾国"
},
[5735] ={
     id = 5735,
     words = "毛太子党"
},
[5736] ={
     id = 5736,
     words = "毛唐家璇"
},
[5737] ={
     id = 5737,
     words = "毛天安门"
},
[5738] ={
     id = 5738,
     words = "毛田纪云"
},
[5739] ={
     id = 5739,
     words = "毛铁道部"
},
[5740] ={
     id = 5740,
     words = "毛统计局"
},
[5741] ={
     id = 5741,
     words = "毛外　挂"
},
[5742] ={
     id = 5742,
     words = "毛外_挂"
},
[5743] ={
     id = 5743,
     words = "毛外-挂"
},
[5744] ={
     id = 5744,
     words = "毛外—挂"
},
[5745] ={
     id = 5745,
     words = "毛外汇局"
},
[5746] ={
     id = 5746,
     words = "毛外交部"
},
[5747] ={
     id = 5747,
     words = "毛外专局"
},
[5748] ={
     id = 5748,
     words = "毛王八蛋"
},
[5749] ={
     id = 5749,
     words = "毛王宝森"
},
[5750] ={
     id = 5750,
     words = "毛王乐泉"
},
[5751] ={
     id = 5751,
     words = "毛王岐山"
},
[5752] ={
     id = 5752,
     words = "毛王太华"
},
[5753] ={
     id = 5753,
     words = "毛王兆国"
},
[5754] ={
     id = 5754,
     words = "毛威而钢"
},
[5755] ={
     id = 5755,
     words = "毛威而柔"
},
[5756] ={
     id = 5756,
     words = "毛卫生部"
},
[5757] ={
     id = 5757,
     words = "毛尉健行"
},
[5758] ={
     id = 5758,
     words = "毛温加宝"
},
[5759] ={
     id = 5759,
     words = "毛温家宝"
},
[5760] ={
     id = 5760,
     words = "毛温家保"
},
[5761] ={
     id = 5761,
     words = "毛温总理"
},
[5762] ={
     id = 5762,
     words = "毛文化部"
},
[5763] ={
     id = 5763,
     words = "毛文物局"
},
[5764] ={
     id = 5764,
     words = "毛我操你"
},
[5765] ={
     id = 5765,
     words = "毛我日你"
},
[5766] ={
     id = 5766,
     words = "毛吴　仪"
},
[5767] ={
     id = 5767,
     words = "毛吴邦国"
},
[5768] ={
     id = 5768,
     words = "毛吴官正"
},
[5769] ={
     id = 5769,
     words = "毛希拉克"
},
[5770] ={
     id = 5770,
     words = "毛希特勒"
},
[5771] ={
     id = 5771,
     words = "毛洗脑班"
},
[5772] ={
     id = 5772,
     words = "毛乡巴佬"
},
[5773] ={
     id = 5773,
     words = "毛想上你"
},
[5774] ={
     id = 5774,
     words = "毛小鸡鸡"
},
[5775] ={
     id = 5775,
     words = "毛小日本"
},
[5776] ={
     id = 5776,
     words = "毛小肉粒"
},
[5777] ={
     id = 5777,
     words = "毛小乳头"
},
[5778] ={
     id = 5778,
     words = "毛新光明"
},
[5779] ={
     id = 5779,
     words = "毛新华社"
},
[5780] ={
     id = 5780,
     words = "毛新生网"
},
[5781] ={
     id = 5781,
     words = "毛新唐人"
},
[5782] ={
     id = 5782,
     words = "毛新闻办"
},
[5783] ={
     id = 5783,
     words = "毛新义安"
},
[5784] ={
     id = 5784,
     words = "毛信访局"
},
[5785] ={
     id = 5785,
     words = "毛兴奋剂"
},
[5786] ={
     id = 5786,
     words = "毛性虐待"
},
[5787] ={
     id = 5787,
     words = "毛性无能"
},
[5788] ={
     id = 5788,
     words = "毛徐光春"
},
[5789] ={
     id = 5789,
     words = "毛巡查员"
},
[5790] ={
     id = 5790,
     words = "毛鸦片液"
},
[5791] ={
     id = 5791,
     words = "毛鸦片渣"
},
[5792] ={
     id = 5792,
     words = "毛烟草局"
},
[5793] ={
     id = 5793,
     words = "毛严方军"
},
[5794] ={
     id = 5794,
     words = "毛摇头丸"
},
[5795] ={
     id = 5795,
     words = "毛摇头玩"
},
[5796] ={
     id = 5796,
     words = "毛耶和华"
},
[5797] ={
     id = 5797,
     words = "毛叶剑英"
},
[5798] ={
     id = 5798,
     words = "毛一贯道"
},
[5799] ={
     id = 5799,
     words = "毛一夜情"
},
[5800] ={
     id = 5800,
     words = "毛伊拉克"
},
[5801] ={
     id = 5801,
     words = "毛伊斯兰"
},
[5802] ={
     id = 5802,
     words = "毛抑制剂"
},
[5803] ={
     id = 5803,
     words = "毛邮政局"
},
[5804] ={
     id = 5804,
     words = "毛俞正声"
},
[5805] ={
     id = 5805,
     words = "17爱网"
},
[5806] ={
     id = 5806,
     words = "18dy"
},
[5807] ={
     id = 5807,
     words = "18淫书"
},
[5808] ={
     id = 5808,
     words = "21cn"
},
[5809] ={
     id = 5809,
     words = "21ｃｎ"
},
[5810] ={
     id = 5810,
     words = "39CK"
},
[5811] ={
     id = 5811,
     words = "3D西游"
},
[5812] ={
     id = 5812,
     words = "3p炮图"
},
[5813] ={
     id = 5813,
     words = "3P炮圖"
},
[5814] ={
     id = 5814,
     words = "4。25"
},
[5815] ={
     id = 5815,
     words = "58jb"
},
[5816] ={
     id = 5816,
     words = "6？4靠"
},
[5817] ={
     id = 5817,
     words = "64yl"
},
[5818] ={
     id = 5818,
     words = "64动乱"
},
[5819] ={
     id = 5819,
     words = "64動亂"
},
[5820] ={
     id = 5820,
     words = "64事件"
},
[5821] ={
     id = 5821,
     words = "7。22"
},
[5822] ={
     id = 5822,
     words = "8？9靠"
},
[5823] ={
     id = 5823,
     words = "88jb"
},
[5824] ={
     id = 5824,
     words = "８８科技"
},
[5825] ={
     id = 5825,
     words = "89暴乱"
},
[5826] ={
     id = 5826,
     words = "89暴亂"
},
[5827] ={
     id = 5827,
     words = "89动乱"
},
[5828] ={
     id = 5828,
     words = "89動亂"
},
[5829] ={
     id = 5829,
     words = "89风波"
},
[5830] ={
     id = 5830,
     words = "89風波"
},
[5831] ={
     id = 5831,
     words = "89六四"
},
[5832] ={
     id = 5832,
     words = "89学潮"
},
[5833] ={
     id = 5833,
     words = "89學潮"
},
[5834] ={
     id = 5834,
     words = "89运动"
},
[5835] ={
     id = 5835,
     words = "98bb"
},
[5836] ={
     id = 5836,
     words = "99bb"
},
[5837] ={
     id = 5837,
     words = "9JBW"
},
[5838] ={
     id = 5838,
     words = "9v9e"
},
[5839] ={
     id = 5839,
     words = "9ｙｏｕ"
},
[5840] ={
     id = 5840,
     words = "9you"
},
[5841] ={
     id = 5841,
     words = "ａｉｄｓ"
},
[5842] ={
     id = 5842,
     words = "aika"
},
[5843] ={
     id = 5843,
     words = "ａｉｏｎ"
},
[5844] ={
     id = 5844,
     words = "alod"
},
[5845] ={
     id = 5845,
     words = "Anal"
},
[5846] ={
     id = 5846,
     words = "apex"
},
[5847] ={
     id = 5847,
     words = "av成人"
},
[5848] ={
     id = 5848,
     words = "av电影"
},
[5849] ={
     id = 5849,
     words = "AV女优"
},
[5850] ={
     id = 5850,
     words = "av贴图"
},
[5851] ={
     id = 5851,
     words = "av貼圖"
},
[5852] ={
     id = 5852,
     words = "a级电影"
},
[5853] ={
     id = 5853,
     words = "a片试看"
},
[5854] ={
     id = 5854,
     words = "A片下载"
},
[5855] ={
     id = 5855,
     words = "ｂａｎｇ"
},
[5856] ={
     id = 5856,
     words = "ｂａｏ皮"
},
[5857] ={
     id = 5857,
     words = "Bao皮"
},
[5858] ={
     id = 5858,
     words = "bb论坛"
},
[5859] ={
     id = 5859,
     words = "ｂｉｎｇ"
},
[5860] ={
     id = 5860,
     words = "boke"
},
[5861] ={
     id = 5861,
     words = "bong"
},
[5862] ={
     id = 5862,
     words = "BTA片"
},
[5863] ={
     id = 5863,
     words = "bt成人"
},
[5864] ={
     id = 5864,
     words = "BT激情"
},
[5865] ={
     id = 5865,
     words = "BT淫穴"
},
[5866] ={
     id = 5866,
     words = "bxqt"
},
[5867] ={
     id = 5867,
     words = "ｃａｏｂ"
},
[5868] ={
     id = 5868,
     words = "caoB"
},
[5869] ={
     id = 5869,
     words = "ｃａｏ你"
},
[5870] ={
     id = 5870,
     words = "cao你"
},
[5871] ={
     id = 5871,
     words = "ｃｈａ你"
},
[5872] ={
     id = 5872,
     words = "cha你"
},
[5873] ={
     id = 5873,
     words = "ｃｈｕｎ"
},
[5874] ={
     id = 5874,
     words = "ci77"
},
[5875] ={
     id = 5875,
     words = "cjsh"
},
[5876] ={
     id = 5876,
     words = "d7se"
},
[5877] ={
     id = 5877,
     words = "dfdz"
},
[5878] ={
     id = 5878,
     words = "ｄｉｃｋ"
},
[5879] ={
     id = 5879,
     words = "ｄｏｎｇ"
},
[5880] ={
     id = 5880,
     words = "dtfy"
},
[5881] ={
     id = 5881,
     words = "Eeos"
},
[5882] ={
     id = 5882,
     words = "eqsf"
},
[5883] ={
     id = 5883,
     words = "EROS"
},
[5884] ={
     id = 5884,
     words = "ｅｖｅｒ"
},
[5885] ={
     id = 5885,
     words = "E块冒险"
},
[5886] ={
     id = 5886,
     words = "falu"
},
[5887] ={
     id = 5887,
     words = "ｆａｎｇ"
},
[5888] ={
     id = 5888,
     words = "ｆｅｎｇ"
},
[5889] ={
     id = 5889,
     words = "ｆｉｌｓ"
},
[5890] ={
     id = 5890,
     words = "fils"
},
[5891] ={
     id = 5891,
     words = "ｆｒｅｅ"
},
[5892] ={
     id = 5892,
     words = "ｆｕｃｋ"
},
[5893] ={
     id = 5893,
     words = "ｇａｍｅ"
},
[5894] ={
     id = 5894,
     words = "ｇａｎｇ"
},
[5895] ={
     id = 5895,
     words = "gan你"
},
[5896] ={
     id = 5896,
     words = "Gate"
},
[5897] ={
     id = 5897,
     words = "ｇａｔｅ"
},
[5898] ={
     id = 5898,
     words = "ggol"
},
[5899] ={
     id = 5899,
     words = "GM美国"
},
[5900] ={
     id = 5900,
     words = "GM美國"
},
[5901] ={
     id = 5901,
     words = "ｇｏｎｇ"
},
[5902] ={
     id = 5902,
     words = "GOQO"
},
[5903] ={
     id = 5903,
     words = "ｇｕａｉ"
},
[5904] ={
     id = 5904,
     words = "ｈａｎｇ"
},
[5905] ={
     id = 5905,
     words = "ｈｅｎｇ"
},
[5906] ={
     id = 5906,
     words = "ｈｏｎｇ"
},
[5907] ={
     id = 5907,
     words = "ｈｕａｎ"
},
[5908] ={
     id = 5908,
     words = "Idol"
},
[5909] ={
     id = 5909,
     words = "igxe"
},
[5910] ={
     id = 5910,
     words = "item"
},
[5911] ={
     id = 5911,
     words = "jhsz"
},
[5912] ={
     id = 5912,
     words = "jhwg"
},
[5913] ={
     id = 5913,
     words = "ｊｉａｎ"
},
[5914] ={
     id = 5914,
     words = "ｊｉａｏ"
},
[5915] ={
     id = 5915,
     words = "ｊｉｂａ"
},
[5916] ={
     id = 5916,
     words = "jiba"
},
[5917] ={
     id = 5917,
     words = "ｊｉｎｇ"
},
[5918] ={
     id = 5918,
     words = "ｊｉｎｖ"
},
[5919] ={
     id = 5919,
     words = "jinv"
},
[5920] ={
     id = 5920,
     words = "ｋａｎｇ"
},
[5921] ={
     id = 5921,
     words = "kart"
},
[5922] ={
     id = 5922,
     words = "ｋｏｎｇ"
},
[5923] ={
     id = 5923,
     words = "ｋｕａｉ"
},
[5924] ={
     id = 5924,
     words = "ｌｉａｎ"
},
[5925] ={
     id = 5925,
     words = "ｌｉｎｇ"
},
[5926] ={
     id = 5926,
     words = "ｌｏｎｇ"
},
[5927] ={
     id = 5927,
     words = "ｌｕａｎ"
},
[5928] ={
     id = 5928,
     words = "Lust"
},
[5929] ={
     id = 5929,
     words = "Maid"
},
[5930] ={
     id = 5930,
     words = "Mai骚"
},
[5931] ={
     id = 5931,
     words = "ｍａｉ骚"
},
[5932] ={
     id = 5932,
     words = "Maki"
},
[5933] ={
     id = 5933,
     words = "Mako"
},
[5934] ={
     id = 5934,
     words = "Marc"
},
[5935] ={
     id = 5935,
     words = "ｍｅｎｇ"
},
[5936] ={
     id = 5936,
     words = "miki"
},
[5937] ={
     id = 5937,
     words = "ｍｉｎｇ"
},
[5938] ={
     id = 5938,
     words = "ｍｉｒ3"
},
[5939] ={
     id = 5939,
     words = "mir3"
},
[5940] ={
     id = 5940,
     words = "MM激情"
},
[5941] ={
     id = 5941,
     words = "mm美图"
},
[5942] ={
     id = 5942,
     words = "mm美圖"
},
[5943] ={
     id = 5943,
     words = "MM嫩穴"
},
[5944] ={
     id = 5944,
     words = "moyu"
},
[5945] ={
     id = 5945,
     words = "Myuu"
},
[5946] ={
     id = 5946,
     words = "ｎａｂｉ"
},
[5947] ={
     id = 5947,
     words = "nabi"
},
[5948] ={
     id = 5948,
     words = "nacb"
},
[5949] ={
     id = 5949,
     words = "nage"
},
[5950] ={
     id = 5950,
     words = "Neko"
},
[5951] ={
     id = 5951,
     words = "nike"
},
[5952] ={
     id = 5952,
     words = "Ninn"
},
[5953] ={
     id = 5953,
     words = "nmis"
},
[5954] ={
     id = 5954,
     words = "nnd="
},
[5955] ={
     id = 5955,
     words = "nude"
},
[5956] ={
     id = 5956,
     words = "Paki"
},
[5957] ={
     id = 5957,
     words = "pcik"
},
[5958] ={
     id = 5958,
     words = "ｐｅｎｇ"
},
[5959] ={
     id = 5959,
     words = "ｐｉａｏ"
},
[5960] ={
     id = 5960,
     words = "Pink"
},
[5961] ={
     id = 5961,
     words = "Poon"
},
[5962] ={
     id = 5962,
     words = "PORN"
},
[5963] ={
     id = 5963,
     words = "PP电影"
},
[5964] ={
     id = 5964,
     words = "ｐｕｔｅ"
},
[5965] ={
     id = 5965,
     words = "ｑｉａｎ"
},
[5966] ={
     id = 5966,
     words = "ｑｉｎｇ"
},
[5967] ={
     id = 5967,
     words = "qqpp"
},
[5968] ={
     id = 5968,
     words = "qqr2"
},
[5969] ={
     id = 5969,
     words = "ｑｑ幻想"
},
[5970] ={
     id = 5970,
     words = "QQ幻想"
},
[5971] ={
     id = 5971,
     words = "QQ音速"
},
[5972] ={
     id = 5972,
     words = "ｑｑ音速"
},
[5973] ={
     id = 5973,
     words = "ｒａｐｅ"
},
[5974] ={
     id = 5974,
     words = "Rape"
},
[5975] ={
     id = 5975,
     words = "Riko"
},
[5976] ={
     id = 5976,
     words = "rjwg"
},
[5977] ={
     id = 5977,
     words = "Runa"
},
[5978] ={
     id = 5978,
     words = "rxjh"
},
[5979] ={
     id = 5979,
     words = "rxwg"
},
[5980] ={
     id = 5980,
     words = "saga"
},
[5981] ={
     id = 5981,
     words = "Sana"
},
[5982] ={
     id = 5982,
     words = "SARS"
},
[5983] ={
     id = 5983,
     words = "ｓａｒｓ"
},
[5984] ={
     id = 5984,
     words = "sexy"
},
[5985] ={
     id = 5985,
     words = "ｓｅ中国"
},
[5986] ={
     id = 5986,
     words = "ｓｈａｏ"
},
[5987] ={
     id = 5987,
     words = "ｓｈｅｎ"
},
[5988] ={
     id = 5988,
     words = "ｓｈｉｔ"
},
[5989] ={
     id = 5989,
     words = "ｓｈｏｕ"
},
[5990] ={
     id = 5990,
     words = "ｓｈｕｉ"
},
[5991] ={
     id = 5991,
     words = "ｓｈｕｏ"
},
[5992] ={
     id = 5992,
     words = "sm调教"
},
[5993] ={
     id = 5993,
     words = "sm調教"
},
[5994] ={
     id = 5994,
     words = "sm女王"
},
[5995] ={
     id = 5995,
     words = "SM舔穴"
},
[5996] ={
     id = 5996,
     words = "SM援交"
},
[5997] ={
     id = 5997,
     words = "soma"
},
[5998] ={
     id = 5998,
     words = "ｓｏｕｌ"
},
[5999] ={
     id = 5999,
     words = "svdc"
},
[6000] ={
     id = 6000,
     words = "S级圣女"
},
[6001] ={
     id = 6001,
     words = "t2dk"
},
[6002] ={
     id = 6002,
     words = "ｔ2ｄｋ"
},
[6003] ={
     id = 6003,
     words = "taip"
},
[6004] ={
     id = 6004,
     words = "ｔａｎｇ"
},
[6005] ={
     id = 6005,
     words = "TeSt"
},
[6006] ={
     id = 6006,
     words = "ｔｉａｎ"
},
[6007] ={
     id = 6007,
     words = "ｔｉｎｇ"
},
[6008] ={
     id = 6008,
     words = "ｔｎｎｄ"
},
[6009] ={
     id = 6009,
     words = "ｔｏｎｇ"
},
[6010] ={
     id = 6010,
     words = "Tora"
},
[6011] ={
     id = 6011,
     words = "tta2"
},
[6012] ={
     id = 6012,
     words = "ttee"
},
[6013] ={
     id = 6013,
     words = "tth2"
},
[6014] ={
     id = 6014,
     words = "ｔｔｍｄ"
},
[6015] ={
     id = 6015,
     words = "Ttmd"
},
[6016] ={
     id = 6016,
     words = "tw18"
},
[6017] ={
     id = 6017,
     words = "vgbh"
},
[6018] ={
     id = 6018,
     words = "vice"
},
[6019] ={
     id = 6019,
     words = "Vol。"
},
[6020] ={
     id = 6020,
     words = "ｗａｎｇ"
},
[6021] ={
     id = 6021,
     words = "ｗａｒｓ"
},
[6022] ={
     id = 6022,
     words = "ｗｅｎｇ"
},
[6023] ={
     id = 6023,
     words = "wg99"
},
[6024] ={
     id = 6024,
     words = "wgpj"
},
[6025] ={
     id = 6025,
     words = "wg武功"
},
[6026] ={
     id = 6026,
     words = "Worx"
},
[6027] ={
     id = 6027,
     words = "ｘｉａｎ"
},
[6028] ={
     id = 6028,
     words = "ｘｉａｏ"
},
[6029] ={
     id = 6029,
     words = "ｘｉｎｇ"
},
[6030] ={
     id = 6030,
     words = "ｘｕａｎ"
},
[6031] ={
     id = 6031,
     words = "X妈牛比"
},
[6032] ={
     id = 6032,
     words = "X媽牛比"
},
[6033] ={
     id = 6033,
     words = "YGBH"
},
[6034] ={
     id = 6034,
     words = "ｙｉｎｇ"
},
[6035] ={
     id = 6035,
     words = "ｙｏｎｇ"
},
[6036] ={
     id = 6036,
     words = "ｙｕａｎ"
},
[6037] ={
     id = 6037,
     words = "Yuki"
},
[6038] ={
     id = 6038,
     words = "ｚｈａｎ"
},
[6039] ={
     id = 6039,
     words = "ｚｈｅｎ"
},
[6040] ={
     id = 6040,
     words = "ｚｈｏｕ"
},
[6041] ={
     id = 6041,
     words = "ｚｏｎｇ"
},
[6042] ={
     id = 6042,
     words = "ｚｕａｎ"
},
[6043] ={
     id = 6043,
     words = "ㄙㄞ你爸"
},
[6044] ={
     id = 6044,
     words = "ㄙㄞ你公"
},
[6045] ={
     id = 6045,
     words = "ㄙㄞ你母"
},
[6046] ={
     id = 6046,
     words = "ㄙㄞ你娘"
},
[6047] ={
     id = 6047,
     words = "阿扁萬歲"
},
[6048] ={
     id = 6048,
     words = "阿旺晋美"
},
[6049] ={
     id = 6049,
     words = "阿呀娃娃"
},
[6050] ={
     id = 6050,
     words = "阿雅娃娃"
},
[6051] ={
     id = 6051,
     words = "啊啊！”"
},
[6052] ={
     id = 6052,
     words = "啊呀娃娃"
},
[6053] ={
     id = 6053,
     words = "啊雅娃娃"
},
[6054] ={
     id = 6054,
     words = "安局办公楼"
},
[6055] ={
     id = 6055,
     words = "宝在甘肃修"
},
[6056] ={
     id = 6056,
     words = "才知道只生"
},
[6057] ={
     id = 6057,
     words = "国一九五七"
},
[6058] ={
     id = 6058,
     words = "娘两腿之间"
},
[6059] ={
     id = 6059,
     words = "女被人家搞"
},
[6060] ={
     id = 6060,
     words = "原一九五七"
},
[6061] ={
     id = 6061,
     words = "找政法委副"
},
[6062] ={
     id = 6062,
     words = "震惊一个民"
},
[6063] ={
     id = 6063,
     words = "着护士的胸"
},
[6064] ={
     id = 6064,
     words = "艾森豪威尔"
},
[6065] ={
     id = 6065,
     words = "山本五十六"
},
[6066] ={
     id = 6066,
     words = "米开朗基罗"
},
[6067] ={
     id = 6067,
     words = "斯蒂芬霍金"
},
[6068] ={
     id = 6068,
     words = "打倒共产党"
},
[6069] ={
     id = 6069,
     words = "天安门事件"
},
[6070] ={
     id = 6070,
     words = "政治反对派"
},
[6071] ={
     id = 6071,
     words = "核工业基地"
},
[6072] ={
     id = 6072,
     words = "penis"
},
[6073] ={
     id = 6073,
     words = "Bitch"
},
[6074] ={
     id = 6074,
     words = "ADMIN"
},
[6075] ={
     id = 6075,
     words = "活动管理员"
},
[6076] ={
     id = 6076,
     words = "游戏管理员"
},
[6077] ={
     id = 6077,
     words = "私人服务器"
},
[6078] ={
     id = 6078,
     words = "China"
},
[6079] ={
     id = 6079,
     words = "urban"
},
[6080] ={
     id = 6080,
     words = "牛B，牛比"
},
[6081] ={
     id = 6081,
     words = "T.M.D"
},
[6082] ={
     id = 6082,
     words = "龙 虎 门"
},
[6083] ={
     id = 6083,
     words = "WEB牌戰"
},
[6084] ={
     id = 6084,
     words = "WEB战牌"
},
[6085] ={
     id = 6085,
     words = "boxun"
},
[6086] ={
     id = 6086,
     words = "F.L.G"
},
[6087] ={
     id = 6087,
     words = "falun"
},
[6088] ={
     id = 6088,
     words = "fgmtv"
},
[6089] ={
     id = 6089,
     words = "gc365"
},
[6090] ={
     id = 6090,
     words = "PUSSY"
},
[6091] ={
     id = 6091,
     words = "screw"
},
[6092] ={
     id = 6092,
     words = "澳洲光明网"
},
[6093] ={
     id = 6093,
     words = "大东亚共荣"
},
[6094] ={
     id = 6094,
     words = "调理劳务系"
},
[6095] ={
     id = 6095,
     words = "独立台湾会"
},
[6096] ={
     id = 6096,
     words = "短信群发器"
},
[6097] ={
     id = 6097,
     words = "二乙基酰胺"
},
[6098] ={
     id = 6098,
     words = "法(轮)功"
},
[6099] ={
     id = 6099,
     words = "法%*轮%*功"
},
[6100] ={
     id = 6100,
     words = "反封锁技术"
},
[6101] ={
     id = 6101,
     words = "反恐委员会"
},
[6102] ={
     id = 6102,
     words = "佛展千手法"
},
[6103] ={
     id = 6103,
     words = "国防科工委"
},
[6104] ={
     id = 6104,
     words = "国民党万岁"
},
[6105] ={
     id = 6105,
     words = "国土资源部"
},
[6106] ={
     id = 6106,
     words = "黄色小电影"
},
[6107] ={
     id = 6107,
     words = "激情小电影"
},
[6108] ={
     id = 6108,
     words = "佳静安定片"
},
[6109] ={
     id = 6109,
     words = "江Core"
},
[6110] ={
     id = 6110,
     words = "经社理事会"
},
[6111] ={
     id = 6111,
     words = "军事委员会"
},
[6112] ={
     id = 6112,
     words = "狂操你全家"
},
[6113] ={
     id = 6113,
     words = "劳+教+所"
},
[6114] ={
     id = 6114,
     words = "劳动保障部"
},
[6115] ={
     id = 6115,
     words = "联合国大会"
},
[6116] ={
     id = 6116,
     words = "强效失意药"
},
[6117] ={
     id = 6117,
     words = "人民大会堂"
},
[6118] ={
     id = 6118,
     words = "色情小电影"
},
[6119] ={
     id = 6119,
     words = "社保基金会"
},
[6120] ={
     id = 6120,
     words = "身份生成器"
},
[6121] ={
     id = 6121,
     words = "神通加持法"
},
[6122] ={
     id = 6122,
     words = "升达毕业证"
},
[6123] ={
     id = 6123,
     words = "湿透的内裤"
},
[6124] ={
     id = 6124,
     words = "台湾共产党"
},
[6125] ={
     id = 6125,
     words = "台湾共和国"
},
[6126] ={
     id = 6126,
     words = "天安门档案"
},
[6127] ={
     id = 6127,
     words = "天安门屠杀"
},
[6128] ={
     id = 6128,
     words = "天安门一代"
},
[6129] ={
     id = 6129,
     words = "托管理事会"
},
[6130] ={
     id = 6130,
     words = "晚年周恩来"
},
[6131] ={
     id = 6131,
     words = "无界浏览器"
},
[6132] ={
     id = 6132,
     words = "小泉纯一郎"
},
[6133] ={
     id = 6133,
     words = "新闻出版署"
},
[6134] ={
     id = 6134,
     words = "信息产业部"
},
[6135] ={
     id = 6135,
     words = "英雄纪念碑"
},
[6136] ={
     id = 6136,
     words = "游戏发奖员"
},
[6137] ={
     id = 6137,
     words = "游戏宫理员"
},
[6138] ={
     id = 6138,
     words = "原子能机构"
},
[6139] ={
     id = 6139,
     words = "中国共产党"
},
[6140] ={
     id = 6140,
     words = "中央电视台"
},
[6141] ={
     id = 6141,
     words = "中央政治局"
},
[6142] ={
     id = 6142,
     words = "fuck靠"
},
[6143] ={
     id = 6143,
     words = "U  R靠"
},
[6144] ={
     id = 6144,
     words = "垃圾游戏靠"
},
[6145] ={
     id = 6145,
     words = "出售账号靠"
},
[6146] ={
     id = 6146,
     words = "出售此号靠"
},
[6147] ={
     id = 6147,
     words = "出售神符靠"
},
[6148] ={
     id = 6148,
     words = "街头对抗靠"
},
[6149] ={
     id = 6149,
     words = "法轮大法靠"
},
[6150] ={
     id = 6150,
     words = "混 沌决靠"
},
[6151] ={
     id = 6151,
     words = "操逼你老母"
},
[6152] ={
     id = 6152,
     words = "操操你妈屄"
},
[6153] ={
     id = 6153,
     words = "操草的你妈"
},
[6154] ={
     id = 6154,
     words = "操成人电影"
},
[6155] ={
     id = 6155,
     words = "操抽你丫的"
},
[6156] ={
     id = 6156,
     words = "操出售假币"
},
[6157] ={
     id = 6157,
     words = "操出售枪支"
},
[6158] ={
     id = 6158,
     words = "操出售手枪"
},
[6159] ={
     id = 6159,
     words = "操粗制吗啡"
},
[6160] ={
     id = 6160,
     words = "操达赖喇嘛"
},
[6161] ={
     id = 6161,
     words = "毛东突组织"
},
[6162] ={
     id = 6162,
     words = "毛东亚病夫"
},
[6163] ={
     id = 6163,
     words = "毛对日强硬"
},
[6164] ={
     id = 6164,
     words = "毛多维新闻"
},
[6165] ={
     id = 6165,
     words = "毛多维周刊"
},
[6166] ={
     id = 6166,
     words = "毛恶搞晚会"
},
[6167] ={
     id = 6167,
     words = "毛发奖使者"
},
[6168] ={
     id = 6168,
     words = "毛法轮大法"
},
[6169] ={
     id = 6169,
     words = "毛分裂祖国"
},
[6170] ={
     id = 6170,
     words = "毛斧头镰刀"
},
[6171] ={
     id = 6171,
     words = "毛干妳老母"
},
[6172] ={
     id = 6172,
     words = "毛干你妈b"
},
[6173] ={
     id = 6173,
     words = "毛干你妈逼"
},
[6174] ={
     id = 6174,
     words = "毛高丽棒子"
},
[6175] ={
     id = 6175,
     words = "毛高校暴乱"
},
[6176] ={
     id = 6176,
     words = "毛高校骚乱"
},
[6177] ={
     id = 6177,
     words = "毛工作人员"
},
[6178] ={
     id = 6178,
     words = "毛弓虽女干"
},
[6179] ={
     id = 6179,
     words = "毛共产主义"
},
[6180] ={
     id = 6180,
     words = "毛共青团员"
},
[6181] ={
     id = 6181,
     words = "毛古方迷香"
},
[6182] ={
     id = 6182,
     words = "毛官逼民反"
},
[6183] ={
     id = 6183,
     words = "毛官商勾结"
},
[6184] ={
     id = 6184,
     words = "毛管理人员"
},
[6185] ={
     id = 6185,
     words = "毛光明日报"
},
[6186] ={
     id = 6186,
     words = "毛国际法院"
},
[6187] ={
     id = 6187,
     words = "毛国家民委"
},
[6188] ={
     id = 6188,
     words = "毛国家主席"
},
[6189] ={
     id = 6189,
     words = "毛海关总署"
},
[6190] ={
     id = 6190,
     words = "毛欢城互动"
},
[6191] ={
     id = 6191,
     words = "毛环保总局"
},
[6192] ={
     id = 6192,
     words = "毛黄色电影"
},
[6193] ={
     id = 6193,
     words = "毛回民暴动"
},
[6194] ={
     id = 6194,
     words = "毛基地组织"
},
[6195] ={
     id = 6195,
     words = "毛激情电影"
},
[6196] ={
     id = 6196,
     words = "毛计牌软件"
},
[6197] ={
     id = 6197,
     words = "毛奸夫淫妇"
},
[6198] ={
     id = 6198,
     words = "毛警匪一家"
},
[6199] ={
     id = 6199,
     words = "毛敬国神社"
},
[6200] ={
     id = 6200,
     words = "毛靖国神社"
},
[6201] ={
     id = 6201,
     words = "毛军长发威"
},
[6202] ={
     id = 6202,
     words = "毛军国主义"
},
[6203] ={
     id = 6203,
     words = "毛看牌软件"
},
[6204] ={
     id = 6204,
     words = "毛看棋软件"
},
[6205] ={
     id = 6205,
     words = "毛恐怖份子"
},
[6206] ={
     id = 6206,
     words = "毛恐怖主义"
},
[6207] ={
     id = 6207,
     words = "毛联易互动"
},
[6208] ={
     id = 6208,
     words = "毛两腿之间"
},
[6209] ={
     id = 6209,
     words = "毛六四事件"
},
[6210] ={
     id = 6210,
     words = "毛六四真相"
},
[6211] ={
     id = 6211,
     words = "毛妈卖妈屁"
},
[6212] ={
     id = 6212,
     words = "毛麻醉钢枪"
},
[6213] ={
     id = 6213,
     words = "毛麻醉乙醚"
},
[6214] ={
     id = 6214,
     words = "毛马卖马屁"
},
[6215] ={
     id = 6215,
     words = "毛买卖枪支"
},
[6216] ={
     id = 6216,
     words = "毛卖党求荣"
},
[6217] ={
     id = 6217,
     words = "毛卖国求荣"
},
[6218] ={
     id = 6218,
     words = "毛美国之音"
},
[6219] ={
     id = 6219,
     words = "毛蒙古达子"
},
[6220] ={
     id = 6220,
     words = "毛蒙古独立"
},
[6221] ={
     id = 6221,
     words = "毛莫索里尼"
},
[6222] ={
     id = 6222,
     words = "毛穆罕默德"
},
[6223] ={
     id = 6223,
     words = "毛妳老母的"
},
[6224] ={
     id = 6224,
     words = "毛你二大爷"
},
[6225] ={
     id = 6225,
     words = "毛你姥姥的"
},
[6226] ={
     id = 6226,
     words = "毛你爷爷的"
},
[6227] ={
     id = 6227,
     words = "毛拍肩神药"
},
[6228] ={
     id = 6228,
     words = "毛苹果日报"
},
[6229] ={
     id = 6229,
     words = "毛枪决女犯"
},
[6230] ={
     id = 6230,
     words = "毛枪决现场"
},
[6231] ={
     id = 6231,
     words = "毛枪支弹药"
},
[6232] ={
     id = 6232,
     words = "毛强硬发言"
},
[6233] ={
     id = 6233,
     words = "毛窃听器材"
},
[6234] ={
     id = 6234,
     words = "毛青天白日"
},
[6235] ={
     id = 6235,
     words = "毛去你妈的"
},
[6236] ={
     id = 6236,
     words = "毛全国人大"
},
[6237] ={
     id = 6237,
     words = "毛人大代表"
},
[6238] ={
     id = 6238,
     words = "毛人民广场"
},
[6239] ={
     id = 6239,
     words = "毛人民日报"
},
[6240] ={
     id = 6240,
     words = "毛人民银行"
},
[6241] ={
     id = 6241,
     words = "毛人体炸弹"
},
[6242] ={
     id = 6242,
     words = "毛日本鬼子"
},
[6243] ={
     id = 6243,
     words = "毛乳波臀浪"
},
[6244] ={
     id = 6244,
     words = "毛塞你老母"
},
[6245] ={
     id = 6245,
     words = "毛塞你老师"
},
[6246] ={
     id = 6246,
     words = "毛三个呆婊"
},
[6247] ={
     id = 6247,
     words = "毛三个代婊"
},
[6248] ={
     id = 6248,
     words = "毛三民主义"
},
[6249] ={
     id = 6249,
     words = "毛三去车仑"
},
[6250] ={
     id = 6250,
     words = "毛色情电影"
},
[6251] ={
     id = 6251,
     words = "毛色情服务"
},
[6252] ={
     id = 6252,
     words = "毛社会主义"
},
[6253] ={
     id = 6253,
     words = "毛十年动乱"
},
[6254] ={
     id = 6254,
     words = "毛十五周年"
},
[6255] ={
     id = 6255,
     words = "毛驶你老母"
},
[6256] ={
     id = 6256,
     words = "毛驶你老师"
},
[6257] ={
     id = 6257,
     words = "毛世界日报"
},
[6258] ={
     id = 6258,
     words = "毛手机复制"
},
[6259] ={
     id = 6259,
     words = "毛双峰微颤"
},
[6260] ={
     id = 6260,
     words = "毛水去车仑"
},
[6261] ={
     id = 6261,
     words = "毛税务总局"
},
[6262] ={
     id = 6262,
     words = "毛四川独立"
},
[6263] ={
     id = 6263,
     words = "毛台湾帝国"
},
[6264] ={
     id = 6264,
     words = "毛台湾独立"
},
[6265] ={
     id = 6265,
     words = "毛台湾民国"
},
[6266] ={
     id = 6266,
     words = "毛特别公告"
},
[6267] ={
     id = 6267,
     words = "毛体育总局"
},
[6268] ={
     id = 6268,
     words = "毛天鹅之旅"
},
[6269] ={
     id = 6269,
     words = "毛天皇陛下"
},
[6270] ={
     id = 6270,
     words = "毛投毒杀人"
},
[6271] ={
     id = 6271,
     words = "毛透视软件"
},
[6272] ={
     id = 6272,
     words = "毛透视眼镜"
},
[6273] ={
     id = 6273,
     words = "毛我妳老爸"
},
[6274] ={
     id = 6274,
     words = "毛五星红旗"
},
[6275] ={
     id = 6275,
     words = "毛西藏独立"
},
[6276] ={
     id = 6276,
     words = "毛西藏天葬"
},
[6277] ={
     id = 6277,
     words = "毛希望之声"
},
[6278] ={
     id = 6278,
     words = "毛系统公告"
},
[6279] ={
     id = 6279,
     words = "毛系统讯息"
},
[6280] ={
     id = 6280,
     words = "毛新华内情"
},
[6281] ={
     id = 6281,
     words = "毛新疆独立"
},
[6282] ={
     id = 6282,
     words = "毛新闻出版"
},
[6283] ={
     id = 6283,
     words = "毛新闻管制"
},
[6284] ={
     id = 6284,
     words = "毛血腥图片"
},
[6285] ={
     id = 6285,
     words = "毛丫头养的"
},
[6286] ={
     id = 6286,
     words = "毛燕玲论坛"
},
[6287] ={
     id = 6287,
     words = "毛一党专制"
},
[6288] ={
     id = 6288,
     words = "毛一国两制"
},
[6289] ={
     id = 6289,
     words = "毛一中一台"
},
[6290] ={
     id = 6290,
     words = "毛以茎至洞"
},
[6291] ={
     id = 6291,
     words = "毛阴小撕大"
},
[6292] ={
     id = 6292,
     words = "毛淫语连连"
},
[6293] ={
     id = 6293,
     words = "毛舆论钳制"
},
[6294] ={
     id = 6294,
     words = "毛欲火焚身"
},
[6295] ={
     id = 6295,
     words = "fuck骚"
},
[6296] ={
     id = 6296,
     words = "c a o"
},
[6297] ={
     id = 6297,
     words = "vagaa"
},
[6298] ={
     id = 6298,
     words = "文化大革命"
},
[6299] ={
     id = 6299,
     words = "拉姆斯菲尔德"
},
[6300] ={
     id = 6300,
     words = "国内动态清样"
},
[6301] ={
     id = 6301,
     words = "Client"
},
[6302] ={
     id = 6302,
     words = "Server"
},
[6303] ={
     id = 6303,
     words = "rivals"
},
[6304] ={
     id = 6304,
     words = "eight仙"
},
[6305] ={
     id = 6305,
     words = "fosaon"
},
[6306] ={
     id = 6306,
     words = "minhui"
},
[6307] ={
     id = 6307,
     words = "snatch"
},
[6308] ={
     id = 6308,
     words = "操你八辈祖宗"
},
[6309] ={
     id = 6309,
     words = "发展研究中心"
},
[6310] ={
     id = 6310,
     words = "高校群体事件"
},
[6311] ={
     id = 6311,
     words = "国家主要部委"
},
[6312] ={
     id = 6312,
     words = "回族人吃猪肉"
},
[6313] ={
     id = 6313,
     words = "客户服务人员"
},
[6314] ={
     id = 6314,
     words = "日本RING"
},
[6315] ={
     id = 6315,
     words = "生孩子没屁眼"
},
[6316] ={
     id = 6316,
     words = "天安门录像带"
},
[6317] ={
     id = 6317,
     words = "新闻出版总署"
},
[6318] ={
     id = 6318,
     words = "扎卡维是英雄"
},
[6319] ={
     id = 6319,
     words = "中国恐怖组织"
},
[6320] ={
     id = 6320,
     words = "子女任职名单"
},
[6321] ={
     id = 6321,
     words = "自由亚洲电台"
},
[6322] ={
     id = 6322,
     words = "admin靠"
},
[6323] ={
     id = 6323,
     words = "urban靠"
},
[6324] ={
     id = 6324,
     words = "T.M.D靠"
},
[6325] ={
     id = 6325,
     words = "c a o靠"
},
[6326] ={
     id = 6326,
     words = "龙 虎 门靠"
},
[6327] ={
     id = 6327,
     words = "WEB牌戰靠"
},
[6328] ={
     id = 6328,
     words = "WEB战牌靠"
},
[6329] ={
     id = 6329,
     words = "u   r靠"
},
[6330] ={
     id = 6330,
     words = "操大东亚共荣"
},
[6331] ={
     id = 6331,
     words = "毛独立台湾会"
},
[6332] ={
     id = 6332,
     words = "毛短信群发器"
},
[6333] ={
     id = 6333,
     words = "毛二乙基酰胺"
},
[6334] ={
     id = 6334,
     words = "毛法(轮)功"
},
[6335] ={
     id = 6335,
     words = "毛法%*轮%*功"
},
[6336] ={
     id = 6336,
     words = "毛反封锁技术"
},
[6337] ={
     id = 6337,
     words = "毛反恐委员会"
},
[6338] ={
     id = 6338,
     words = "毛佛展千手法"
},
[6339] ={
     id = 6339,
     words = "毛国防科工委"
},
[6340] ={
     id = 6340,
     words = "毛国民党万岁"
},
[6341] ={
     id = 6341,
     words = "毛国土资源部"
},
[6342] ={
     id = 6342,
     words = "毛黄色小电影"
},
[6343] ={
     id = 6343,
     words = "毛激情小电影"
},
[6344] ={
     id = 6344,
     words = "毛佳静安定片"
},
[6345] ={
     id = 6345,
     words = "毛江Core"
},
[6346] ={
     id = 6346,
     words = "毛经社理事会"
},
[6347] ={
     id = 6347,
     words = "毛军事委员会"
},
[6348] ={
     id = 6348,
     words = "毛狂操你全家"
},
[6349] ={
     id = 6349,
     words = "毛劳+教+所"
},
[6350] ={
     id = 6350,
     words = "毛劳动保障部"
},
[6351] ={
     id = 6351,
     words = "毛联合国大会"
},
[6352] ={
     id = 6352,
     words = "毛强效失意药"
},
[6353] ={
     id = 6353,
     words = "毛人民大会堂"
},
[6354] ={
     id = 6354,
     words = "毛色情小电影"
},
[6355] ={
     id = 6355,
     words = "毛社保基金会"
},
[6356] ={
     id = 6356,
     words = "毛身份生成器"
},
[6357] ={
     id = 6357,
     words = "毛神通加持法"
},
[6358] ={
     id = 6358,
     words = "毛升达毕业证"
},
[6359] ={
     id = 6359,
     words = "毛湿透的内裤"
},
[6360] ={
     id = 6360,
     words = "毛台湾共产党"
},
[6361] ={
     id = 6361,
     words = "毛台湾共和国"
},
[6362] ={
     id = 6362,
     words = "毛天安门档案"
},
[6363] ={
     id = 6363,
     words = "毛天安门事件"
},
[6364] ={
     id = 6364,
     words = "毛天安门屠杀"
},
[6365] ={
     id = 6365,
     words = "毛天安门一代"
},
[6366] ={
     id = 6366,
     words = "毛托管理事会"
},
[6367] ={
     id = 6367,
     words = "毛晚年周恩来"
},
[6368] ={
     id = 6368,
     words = "毛无界浏览器"
},
[6369] ={
     id = 6369,
     words = "毛小泉纯一郎"
},
[6370] ={
     id = 6370,
     words = "毛新手指导员"
},
[6371] ={
     id = 6371,
     words = "毛新闻出版署"
},
[6372] ={
     id = 6372,
     words = "毛信息产业部"
},
[6373] ={
     id = 6373,
     words = "毛英雄纪念碑"
},
[6374] ={
     id = 6374,
     words = "毛游戏发奖员"
},
[6375] ={
     id = 6375,
     words = "毛游戏宫理员"
},
[6376] ={
     id = 6376,
     words = "毛游戏管理员"
},
[6377] ={
     id = 6377,
     words = "毛原子能机构"
},
[6378] ={
     id = 6378,
     words = "fuck色情"
},
[6379] ={
     id = 6379,
     words = "fuck傻B"
},
[6380] ={
     id = 6380,
     words = "fuck傻屄"
},
[6381] ={
     id = 6381,
     words = "fuck傻逼"
},
[6382] ={
     id = 6382,
     words = "fuck傻比"
},
[6383] ={
     id = 6383,
     words = "fuck傻吊"
},
[6384] ={
     id = 6384,
     words = "fuck傻卵"
},
[6385] ={
     id = 6385,
     words = "fuck傻子"
},
[6386] ={
     id = 6386,
     words = "fuck煞逼"
},
[6387] ={
     id = 6387,
     words = "fuck上妳"
},
[6388] ={
     id = 6388,
     words = "fuck上你"
},
[6389] ={
     id = 6389,
     words = "fuck射精"
},
[6390] ={
     id = 6390,
     words = "fuck石进"
},
[6391] ={
     id = 6391,
     words = "fuck食屎"
},
[6392] ={
     id = 6392,
     words = "fuck是鸡"
},
[6393] ={
     id = 6393,
     words = "fuck手淫"
},
[6394] ={
     id = 6394,
     words = "fuck售号"
},
[6395] ={
     id = 6395,
     words = "fuck氵去"
},
[6396] ={
     id = 6396,
     words = "fuck私服"
},
[6397] ={
     id = 6397,
     words = "fuck孙文"
},
[6398] ={
     id = 6398,
     words = "fuck他爹"
},
[6399] ={
     id = 6399,
     words = "fuck他妈"
},
[6400] ={
     id = 6400,
     words = "fuck台办"
},
[6401] ={
     id = 6401,
     words = "fuck台独"
},
[6402] ={
     id = 6402,
     words = "fuck台联"
},
[6403] ={
     id = 6403,
     words = "fuck太监"
},
[6404] ={
     id = 6404,
     words = "fuck特码"
},
[6405] ={
     id = 6405,
     words = "fuck天皇"
},
[6406] ={
     id = 6406,
     words = "fuck舔西"
},
[6407] ={
     id = 6407,
     words = "fuck推油"
},
[6408] ={
     id = 6408,
     words = "fuck退党"
},
[6409] ={
     id = 6409,
     words = "fuck外挂"
},
[6410] ={
     id = 6410,
     words = "fuck万税"
},
[6411] ={
     id = 6411,
     words = "fuck王刚"
},
[6412] ={
     id = 6412,
     words = "fuck王昊"
},
[6413] ={
     id = 6413,
     words = "fuck王震"
},
[6414] ={
     id = 6414,
     words = "fuck网管"
},
[6415] ={
     id = 6415,
     words = "fuck温馨"
},
[6416] ={
     id = 6416,
     words = "fuck倭国"
},
[6417] ={
     id = 6417,
     words = "fuck倭寇"
},
[6418] ={
     id = 6418,
     words = "fuck我操"
},
[6419] ={
     id = 6419,
     words = "fuck我干"
},
[6420] ={
     id = 6420,
     words = "fuck我日"
},
[6421] ={
     id = 6421,
     words = "fuck吴仪"
},
[6422] ={
     id = 6422,
     words = "fuck系统"
},
[6423] ={
     id = 6423,
     words = "fuck鲜族"
},
[6424] ={
     id = 6424,
     words = "fuck小泉"
},
[6425] ={
     id = 6425,
     words = "fuck小穴"
},
[6426] ={
     id = 6426,
     words = "fuck邪教"
},
[6427] ={
     id = 6427,
     words = "fuck新党"
},
[6428] ={
     id = 6428,
     words = "fuck性爱"
},
[6429] ={
     id = 6429,
     words = "fuck性交"
},
[6430] ={
     id = 6430,
     words = "urTNND"
},
[6431] ={
     id = 6431,
     words = "%*法%*轮%*功%*"
},
[6432] ={
     id = 6432,
     words = "%*李%*洪%*志%*"
},
[6433] ={
     id = 6433,
     words = "@sshole"
},
[6434] ={
     id = 6434,
     words = "a$$hole"
},
[6435] ={
     id = 6435,
     words = "a$shole"
},
[6436] ={
     id = 6436,
     words = "as$hole"
},
[6437] ={
     id = 6437,
     words = "asshole"
},
[6438] ={
     id = 6438,
     words = "bastard"
},
[6439] ={
     id = 6439,
     words = "bbscity"
},
[6440] ={
     id = 6440,
     words = "bignews"
},
[6441] ={
     id = 6441,
     words = "FUCKYOU"
},
[6442] ={
     id = 6442,
     words = "minghui"
},
[6443] ={
     id = 6443,
     words = "shengda"
},
[6444] ={
     id = 6444,
     words = "大%*FA弟%*子"
},
[6445] ={
     id = 6445,
     words = "东突暴动和独立"
},
[6446] ={
     id = 6446,
     words = "经济社会理事会"
},
[6447] ={
     id = 6447,
     words = "中华人民共和国"
},
[6448] ={
     id = 6448,
     words = "rivals靠"
},
[6449] ={
     id = 6449,
     words = "taobao靠"
},
[6450] ={
     id = 6450,
     words = "eight仙靠"
},
[6451] ={
     id = 6451,
     words = "610办公室靠"
},
[6452] ={
     id = 6452,
     words = "操操你八辈祖宗"
},
[6453] ={
     id = 6453,
     words = "毛发展研究中心"
},
[6454] ={
     id = 6454,
     words = "毛高校群体事件"
},
[6455] ={
     id = 6455,
     words = "毛国家主要部委"
},
[6456] ={
     id = 6456,
     words = "毛回族人吃猪肉"
},
[6457] ={
     id = 6457,
     words = "毛客户服务人员"
},
[6458] ={
     id = 6458,
     words = "毛拉姆斯菲尔德"
},
[6459] ={
     id = 6459,
     words = "毛日本RING"
},
[6460] ={
     id = 6460,
     words = "毛生孩子没屁眼"
},
[6461] ={
     id = 6461,
     words = "毛天安门录像带"
},
[6462] ={
     id = 6462,
     words = "毛新闻出版总署"
},
[6463] ={
     id = 6463,
     words = "fuck杀人犯"
},
[6464] ={
     id = 6464,
     words = "fuck商务部"
},
[6465] ={
     id = 6465,
     words = "fuck社科院"
},
[6466] ={
     id = 6466,
     words = "fuck神经病"
},
[6467] ={
     id = 6467,
     words = "fuck审计署"
},
[6468] ={
     id = 6468,
     words = "fuck生春袋"
},
[6469] ={
     id = 6469,
     words = "fuck生鸦片"
},
[6470] ={
     id = 6470,
     words = "fuck圣女峰"
},
[6471] ={
     id = 6471,
     words = "fuck十八摸"
},
[6472] ={
     id = 6472,
     words = "fuck食捻屎"
},
[6473] ={
     id = 6473,
     words = "fuck驶你爸"
},
[6474] ={
     id = 6474,
     words = "fuck驶你公"
},
[6475] ={
     id = 6475,
     words = "fuck驶你母"
},
[6476] ={
     id = 6476,
     words = "fuck驶你娘"
},
[6477] ={
     id = 6477,
     words = "fuck受虐狂"
},
[6478] ={
     id = 6478,
     words = "fuck售ID"
},
[6479] ={
     id = 6479,
     words = "fuck售软件"
},
[6480] ={
     id = 6480,
     words = "fuck水利部"
},
[6481] ={
     id = 6481,
     words = "fuck司法部"
},
[6482] ={
     id = 6482,
     words = "fuck私-服"
},
[6483] ={
     id = 6483,
     words = "fuck私—服"
},
[6484] ={
     id = 6484,
     words = "fuck斯大林"
},
[6485] ={
     id = 6485,
     words = "fuck死gd"
},
[6486] ={
     id = 6486,
     words = "fuck死gm"
},
[6487] ={
     id = 6487,
     words = "fuck死全家"
},
[6488] ={
     id = 6488,
     words = "fuck四人帮"
},
[6489] ={
     id = 6489,
     words = "fuck宋楚瑜"
},
[6490] ={
     id = 6490,
     words = "fuck宋祖英"
},
[6491] ={
     id = 6491,
     words = "fuck孙逸仙"
},
[6492] ={
     id = 6492,
     words = "fuck孙中山"
},
[6493] ={
     id = 6493,
     words = "fuck他妈的"
},
[6494] ={
     id = 6494,
     words = "fuck他马的"
},
[6495] ={
     id = 6495,
     words = "fuck他母亲"
},
[6496] ={
     id = 6496,
     words = "fuck他祖宗"
},
[6497] ={
     id = 6497,
     words = "fuck台湾党"
},
[6498] ={
     id = 6498,
     words = "fuck台湾狗"
},
[6499] ={
     id = 6499,
     words = "fuck台湾国"
},
[6500] ={
     id = 6500,
     words = "fuck太子党"
},
[6501] ={
     id = 6501,
     words = "fuck唐家璇"
},
[6502] ={
     id = 6502,
     words = "fuck天安门"
},
[6503] ={
     id = 6503,
     words = "fuck田纪云"
},
[6504] ={
     id = 6504,
     words = "fuck铁道部"
},
[6505] ={
     id = 6505,
     words = "fuck统计局"
},
[6506] ={
     id = 6506,
     words = "fuck外　挂"
},
[6507] ={
     id = 6507,
     words = "fuck外_挂"
},
[6508] ={
     id = 6508,
     words = "fuck外-挂"
},
[6509] ={
     id = 6509,
     words = "fuck外—挂"
},
[6510] ={
     id = 6510,
     words = "fuck外汇局"
},
[6511] ={
     id = 6511,
     words = "fuck外交部"
},
[6512] ={
     id = 6512,
     words = "fuck外专局"
},
[6513] ={
     id = 6513,
     words = "fuck王八蛋"
},
[6514] ={
     id = 6514,
     words = "fuck王宝森"
},
[6515] ={
     id = 6515,
     words = "fuck王乐泉"
},
[6516] ={
     id = 6516,
     words = "fuck王岐山"
},
[6517] ={
     id = 6517,
     words = "fuck王太华"
},
[6518] ={
     id = 6518,
     words = "fuck王兆国"
},
[6519] ={
     id = 6519,
     words = "fuck威而钢"
},
[6520] ={
     id = 6520,
     words = "fuck威而柔"
},
[6521] ={
     id = 6521,
     words = "fuck卫生部"
},
[6522] ={
     id = 6522,
     words = "fuck尉健行"
},
[6523] ={
     id = 6523,
     words = "fuck温加宝"
},
[6524] ={
     id = 6524,
     words = "fuck温家宝"
},
[6525] ={
     id = 6525,
     words = "fuck温家保"
},
[6526] ={
     id = 6526,
     words = "fuck温总理"
},
[6527] ={
     id = 6527,
     words = "fuck文化部"
},
[6528] ={
     id = 6528,
     words = "fuck文物局"
},
[6529] ={
     id = 6529,
     words = "fuck我操你"
},
[6530] ={
     id = 6530,
     words = "fuck我日你"
},
[6531] ={
     id = 6531,
     words = "fuck吴　仪"
},
[6532] ={
     id = 6532,
     words = "fuck吴邦国"
},
[6533] ={
     id = 6533,
     words = "fuck吴官正"
},
[6534] ={
     id = 6534,
     words = "fuck希拉克"
},
[6535] ={
     id = 6535,
     words = "fuck希特勒"
},
[6536] ={
     id = 6536,
     words = "fuck洗脑班"
},
[6537] ={
     id = 6537,
     words = "fuck乡巴佬"
},
[6538] ={
     id = 6538,
     words = "fuck想上你"
},
[6539] ={
     id = 6539,
     words = "fuck小鸡鸡"
},
[6540] ={
     id = 6540,
     words = "fuck小日本"
},
[6541] ={
     id = 6541,
     words = "fuck小肉粒"
},
[6542] ={
     id = 6542,
     words = "fuck小乳头"
},
[6543] ={
     id = 6543,
     words = "fuck新光明"
},
[6544] ={
     id = 6544,
     words = "fuck新华社"
},
[6545] ={
     id = 6545,
     words = "fuck新生网"
},
[6546] ={
     id = 6546,
     words = "fuck新唐人"
},
[6547] ={
     id = 6547,
     words = "fuck新闻办"
},
[6548] ={
     id = 6548,
     words = "fuck新义安"
},
[6549] ={
     id = 6549,
     words = "fuck信访局"
},
[6550] ={
     id = 6550,
     words = "fuck兴奋剂"
},
[6551] ={
     id = 6551,
     words = "butthead"
},
[6552] ={
     id = 6552,
     words = "butthole"
},
[6553] ={
     id = 6553,
     words = "dajiyuan"
},
[6554] ={
     id = 6554,
     words = "orgasmus"
},
[6555] ={
     id = 6555,
     words = "yuanming"
},
[6556] ={
     id = 6556,
     words = "届中央政治局委员"
},
[6557] ={
     id = 6557,
     words = "%*法%*轮%*功%*靠"
},
[6558] ={
     id = 6558,
     words = "%*李%*洪%*志%*靠"
},
[6559] ={
     id = 6559,
     words = "@sshole靠"
},
[6560] ={
     id = 6560,
     words = "操大%*FA弟%*子"
},
[6561] ={
     id = 6561,
     words = "毛东突暴动和独立"
},
[6562] ={
     id = 6562,
     words = "毛经济社会理事会"
},
[6563] ={
     id = 6563,
     words = "fuck色情电影"
},
[6564] ={
     id = 6564,
     words = "fuck色情服务"
},
[6565] ={
     id = 6565,
     words = "fuck社会主义"
},
[6566] ={
     id = 6566,
     words = "fuck十年动乱"
},
[6567] ={
     id = 6567,
     words = "fuck十五周年"
},
[6568] ={
     id = 6568,
     words = "fuck驶你老母"
},
[6569] ={
     id = 6569,
     words = "fuck驶你老师"
},
[6570] ={
     id = 6570,
     words = "fuck世界日报"
},
[6571] ={
     id = 6571,
     words = "fuck手机复制"
},
[6572] ={
     id = 6572,
     words = "fuck双峰微颤"
},
[6573] ={
     id = 6573,
     words = "fuck水去车仑"
},
[6574] ={
     id = 6574,
     words = "fuck税务总局"
},
[6575] ={
     id = 6575,
     words = "fuck四川独立"
},
[6576] ={
     id = 6576,
     words = "fuck台湾帝国"
},
[6577] ={
     id = 6577,
     words = "fuck台湾独立"
},
[6578] ={
     id = 6578,
     words = "fuck台湾民国"
},
[6579] ={
     id = 6579,
     words = "fuck特别公告"
},
[6580] ={
     id = 6580,
     words = "fuck体育总局"
},
[6581] ={
     id = 6581,
     words = "fuck天鹅之旅"
},
[6582] ={
     id = 6582,
     words = "fuck天皇陛下"
},
[6583] ={
     id = 6583,
     words = "fuck投毒杀人"
},
[6584] ={
     id = 6584,
     words = "fuck透视软件"
},
[6585] ={
     id = 6585,
     words = "fuck透视眼镜"
},
[6586] ={
     id = 6586,
     words = "fuck我妳老爸"
},
[6587] ={
     id = 6587,
     words = "fuck五星红旗"
},
[6588] ={
     id = 6588,
     words = "fuck西藏独立"
},
[6589] ={
     id = 6589,
     words = "fuck西藏天葬"
},
[6590] ={
     id = 6590,
     words = "fuck希望之声"
},
[6591] ={
     id = 6591,
     words = "fuck系统公告"
},
[6592] ={
     id = 6592,
     words = "fuck系统讯息"
},
[6593] ={
     id = 6593,
     words = "fuck新华内情"
},
[6594] ={
     id = 6594,
     words = "fuck新疆独立"
},
[6595] ={
     id = 6595,
     words = "fuck新闻出版"
},
[6596] ={
     id = 6596,
     words = "fuck新闻管制"
},
[6597] ={
     id = 6597,
     words = "GameMaste"
},
[6598] ={
     id = 6598,
     words = "peacehall"
},
[6599] ={
     id = 6599,
     words = "renminbao"
},
[6600] ={
     id = 6600,
     words = "zhengjian"
},
[6601] ={
     id = 6601,
     words = "zhengqing"
},
[6602] ={
     id = 6602,
     words = "几届中央政治局委员"
},
[6603] ={
     id = 6603,
     words = "毛届中央政治局委员"
},
[6604] ={
     id = 6604,
     words = "fuck色情小电影"
},
[6605] ={
     id = 6605,
     words = "fuck社保基金会"
},
[6606] ={
     id = 6606,
     words = "fuck身份生成器"
},
[6607] ={
     id = 6607,
     words = "fuck神通加持法"
},
[6608] ={
     id = 6608,
     words = "fuck升达毕业证"
},
[6609] ={
     id = 6609,
     words = "fuck湿透的内裤"
},
[6610] ={
     id = 6610,
     words = "fuck台湾共产党"
},
[6611] ={
     id = 6611,
     words = "fuck台湾共和国"
},
[6612] ={
     id = 6612,
     words = "fuck天安门档案"
},
[6613] ={
     id = 6613,
     words = "fuck天安门事件"
},
[6614] ={
     id = 6614,
     words = "fuck天安门屠杀"
},
[6615] ={
     id = 6615,
     words = "fuck天安门一代"
},
[6616] ={
     id = 6616,
     words = "fuck托管理事会"
},
[6617] ={
     id = 6617,
     words = "fuck晚年周恩来"
},
[6618] ={
     id = 6618,
     words = "fuck无界浏览器"
},
[6619] ={
     id = 6619,
     words = "fuck小泉纯一郎"
},
[6620] ={
     id = 6620,
     words = "fuck新手指导员"
},
[6621] ={
     id = 6621,
     words = "fuck新闻出版署"
},
[6622] ={
     id = 6622,
     words = "fuck信息产业部"
},
[6623] ={
     id = 6623,
     words = "epochtime"
},
[6624] ={
     id = 6624,
     words = "GAMEMASTER"
},
[6625] ={
     id = 6625,
     words = "epochtimes"
},
[6626] ={
     id = 6626,
     words = "zhengwunet"
},
[6627] ={
     id = 6627,
     words = "毛几届中央政治局委员"
},
[6628] ={
     id = 6628,
     words = "fuck生孩子没屁眼"
},
[6629] ={
     id = 6629,
     words = "fuck天安门录像带"
},
[6630] ={
     id = 6630,
     words = "fuck新闻出版总署"
},
[6631] ={
     id = 6631,
     words = "ＧＡＭＥ　ｍａｓｔｅｒ"
},
[6632] ={
     id = 6632,
     words = "mingpaonews"
},
[6633] ={
     id = 6633,
     words = "secretchina"
},
[6634] ={
     id = 6634,
     words = "soundofhope"
},
[6635] ={
     id = 6635,
     words = "zhongguohun"
},
[6636] ={
     id = 6636,
     words = "社.会.正.义.力.量"
},
[6637] ={
     id = 6637,
     words = "urban-rivals"
},
[6638] ={
     id = 6638,
     words = "chengmingmag"
},
[6639] ={
     id = 6639,
     words = "fawanghuihui"
},
[6640] ={
     id = 6640,
     words = "globalrescue"
},
[6641] ={
     id = 6641,
     words = "xinguangming"
},
[6642] ={
     id = 6642,
     words = "毛社.会.正.义.力.量"
},
[6643] ={
     id = 6643,
     words = "Administrator"
},
[6644] ={
     id = 6644,
     words = "beijingspring"
},
[6645] ={
     id = 6645,
     words = "urban-rivals靠"
},
[6646] ={
     id = 6646,
     words = "webgame.com.cn"
},
[6647] ={
     id = 6647,
     words = "chinesenewsweek"
},
[6648] ={
     id = 6648,
     words = "webgame.com.cn靠"
},
[6649] ={
     id = 6649,
     words = "fuck社.会.正.义.力.量"
},
[6650] ={
     id = 6650,
     words = "yuanmingxinsheng"
}
}
return data_pingbi_pingbi
