-- 发送异常邮件配置
-- 触发条件：缓存中记录数超过配置数
-- 除给相关人员发送企业qq邮件外 还会在游戏服requestlog表中做记录，方便追踪查看
local returnCfg=
{
	
	gem = {"钻石操作","添加钻石请求次数过多",100,8400},-- key名  邮件标题  邮件拼接内容  配置次数 单笔值
	-- 军团跨服战提取钻石
	akuafu = {"军团跨服战提取钻石","添加钻石请求次数过多",100,30000},-- key名  邮件标题  邮件拼接内容  配置次数 单笔值
	-- 怒海争锋
	nuhai = {"怒海争锋提取钻石","添加钻石请求次数过多",100,30000},-- key名  邮件标题  邮件拼接内容  配置次数 单笔值
	-- 指定道具检测
	p53 = {"指定道具警报","获得或使用了p53小箱钻石",5,0},
	p54 = {"指定道具警报","获得或使用了p54中箱钻石",5,0},
	p55 = {"指定道具警报","获得或使用了p55大箱钻石",5,0},
	p418 = {"指定道具警报","获得或者使用p418,10钻石宝箱",10,0},
	p419 = {"指定道具警报","获得或者使用p419,100钻石宝箱",5,0},
	p420 = {"指定道具警报","获得或者使用p420,1000钻石宝箱",1,0},
	p236 = {"指定道具警报","获得或者使用p236,1000钻石",1,0},
	
	p389 = {"指定道具警报","获得或者使用p389,钻石礼包（小）约300",1,0},
	p390 = {"指定道具警报","获得或者使用p390,钻石礼包（中）约1200",1,0},
	p391 = {"指定道具警报","获得或者使用p391,钻石礼包（大）约4800",1,0},

	p678 = {"指定道具警报","获得或者使用p678,200钻石礼包",1,0},
	p679 = {"指定道具警报","获得或者使用p679,500钻石礼包",1,0},

}

return returnCfg