local yybCfg={
[6224]={
    -- 第一档 应用宝每日礼包
    serverreward = {
            props_p1199=1,
        },
    reward = {
            p={{p1199=1}},
        },
    l=0,--任意等级
    f={0},
    tilte="应用宝每日礼包",
    content="恭喜您,成功领取到应用宝每日礼包",
    day=1,
},
[6217]={
    -- 第一档 应用宝新手礼包
    serverreward = {
            props_p1194=1,
        },
    reward = {
            p={{p1194=1}},
        },
    l=0,--任意等级
    f={0},
    tilte="应用宝新手礼包",
    content="恭喜您,成功领取到应用宝新手礼包",
},
[6218]={
    -- 第二档 应用包10级礼包
    serverreward = {
            props_p1195=1,
        },
    reward = {
            p={{p1195=1}},
        },
    l=10,--任意等级
    f={0},
    tilte="应用宝10级礼包",
    content="恭喜您角色达到10级,成功领取到应用宝10级礼包",
},
[6219]={
    -- 第三档 应用包15级礼包
    serverreward = {
            props_p1196=1,
        },
    reward = {
            p={{p1196=1}},
        },
    l=15,--任意等级
    f={0},
    tilte="应用宝15级礼包",
    content="恭喜您角色达到15级,成功领取到应用宝15级礼包",
},
[6220]={
    -- 第四档 应用包20级礼包
    serverreward = {
            props_p1197=1,
        },
    reward = {
            p={{p1197=1}},
        },
    l=20,--任意等级
    f={0},
    tilte="应用宝20级礼包",
    content="恭喜您角色达到20级,成功领取到应用宝20级礼包",
},
[6221]={
    -- 第二档 应用包30级礼包
    serverreward = {
            props_p1198=1,
        },
    reward = {
            p={{p1198=1}},
        },
    l=30,--任意等级
    f={0},
    tilte="应用宝30级礼包",
    content="恭喜您角色达到30级,成功领取到应用宝30级礼包",
},
-- 任务集市
[6225]={
    -- 第一档 任务集市新手礼包
    serverreward = {
            props_p1200=1,
        },
    reward = {
            p={{p1200=1}},
        },
    l=0,--任意等级
    f={0},
    tilte="任务集市新手礼包",
    content="恭喜您,成功领取到任务集市新手礼包",
},
[6226]={
    -- 第二档 任务集市10级礼包
    serverreward = {
            props_p1201=1,
        },
    reward = {
            p={{p1201=1}},
        },
    l=10,--10等级
    f={0},
    tilte="任务集市10级礼包",
    content="恭喜您角色达到10级,成功领取到任务集市10级礼包",
},
[6227]={
    -- 第三档 任务集市15级礼包
    serverreward = {
            props_p1202=1,
        },
    reward = {
            p={{p1202=1}},
        },
    l=15,--15等级
    f={0},
    tilte="任务集市15级礼包",
    content="恭喜您角色达到15级,成功领取到任务集市15级礼包",
},
[6228]={
    -- 第四档 任务集市20级礼包
    serverreward = {
            props_p1203=1,
        },
    reward = {
            p={{p1203=1}},
        },
    l=0,--20等级
    f={0},
    tilte="连续三天登陆礼包",
    content="恭喜您连续三天登陆,成功领取到连续三天登陆礼包",
},
-- 暂停使用
[6510]={
    -- 新可随机抽奖  巨炮大礼包
    serverreward={
        props_p886=1,
    },
    reward={
        p={{p886=1}},
    },
    l=0,--无等级限制
    f={0},
    day=1, 
    tilte="应用宝抽奖礼品",
    content="恭喜您幸运地获取巨炮大礼包！",
},

}

return yybCfg