
UIStrConfig:Add(
{
	-------------随身商店--------------
	['shop001'] = '随身商店',
	['shop002'] = '消耗品',
	['shop003'] = '回  购',
	['shop004'] = '隐藏使用等级不足的物品',

	-------------购买确认---------------
	['shop101'] = '物品购买',
	['shop102'] = '单价：',
	['shop103'] = '最大堆叠：',
	['shop104'] = '购买数量：',
	['shop105'] = '所需总价：',
	['shop106'] = '确定',
	['shop107'] = '取消',

	------------物品获得建议-------------
	['shop201'] = "",
	['shop202'] = '单价：',
	['shop203'] = '购买数量：',
	['shop204'] = '使用币种：',
	['shop205'] = '购买总价：',
	['shop206'] = 'MAX',
	['shop207'] = '购买',
	['shop208'] = '充值',
	['shop209'] = '元宝',
	['shop210'] = '绑元',

	-- 荣誉商店
	['shop301'] = '兑   换',
	['shop302'] = '荣誉商店',
	['shop303'] = '当前荣誉：',
	['shop304'] = '当前功勋：',

	--商城
	['shop401'] = '商城',
	['shop402'] = '元宝商城',
	['shop403'] = '绑元商城',


	-- 元宝商店
	['shoppingmall001'] = "1RMB=10元宝",
	['shoppingmall002'] = "您当前拥有：",
	
	-- 快速购买  adder:houxudong date:2016/6/22 
	['quickshop1'] = "购买",
}
)