-- OnAddSingleRoomNpc -- nNpcTemplate, nLiveTime 单房间存在的npc，配置在 tbSingleRoomNpc
-- AddRandPosNpcSet Templateid, nLevel, nRoomIndex, 随机点集合，随机个数，重生时间(不传就不重生)
-- AddRandPosBuffSet, szDropBuff, nRoomIndex, tbPosSet, tbRandNum ,"1000|30;1001|15;1002|15;1003|15;1004|15;1005|10;1", 1, {"last_buff_1", "last_buff_2", "last_buff_3", "last_buff_4"}, {1,1} };
-- AddRandTypeSet
-- AddRandTypeSetTimer
-- AddMapNpcByPosName nTemplateId, nLevel, nLiveTime, nRoomIndex, szPosName, nReviveTime
-- AddDropBuffByPosName szParam, nRoomIndex, szPosName

-- 随机房间刷怪 ，刷机房间组合，随机几个，每个房间随机几个，点名规则相同， check 检查


InDifferBattle.tbActiveTransNormal = {
    [1] = 
        {
            
      [25]  = {
                {"ProcChoooseFaction"};
              };
      [45]  = {
                {"ProcChoooseFaction"};
              };
      [60]  = {
                  { "SynGameTime",};
              };
      [70]  = {
                {"AutoSelectFaction"};
                {"ProcChoooseFaction"};
              };
      [80]  = {
                  { "SynGameTime",};
                  {"ProcChoooseFaction"};
             };
        };
  
       --第一个战斗阶段
        [2] = 
        {   
            [1]   = { 
                        --同步一下客户端时间
                        { "SynGameTime",};

                        --Templateid, nLevel, nRoomIndex, 随机点集合，随机个数，重生时间
                        {"AddRandPosNpcSet", 2096, 80, 24, {"npc_1", "npc_2", "npc_3", "npc_4", "npc_5"}, {3,5}, 20 }; --刷小怪的,一个小区域随机刷多少怪
                        {"AddRandPosNpcSet", 2097, 80, 25, {"npc_1", "npc_2", "npc_3", "npc_4", "npc_5"}, {3,5}, 20 };
                        {"AddRandPosNpcSet", 2098, 80, 10, {"npc_1", "npc_2", "npc_3", "npc_4", "npc_5"}, {3,5}, 20 };
                        {"AddRandPosNpcSet", 2099, 80, 11, {"npc_1", "npc_2", "npc_3", "npc_4", "npc_5"}, {3,5}, 20 };
                        {"AddRandPosNpcSet", 2100, 80, 12, {"npc_1", "npc_2", "npc_3", "npc_4", "npc_5"}, {3,5}, 20 };
                        {"AddRandPosNpcSet", 2097, 80, 23, {"npc_1", "npc_2", "npc_3", "npc_4", "npc_5"}, {3,5}, 20 };
                        {"AddRandPosNpcSet", 2098, 80, 9,  {"npc_1", "npc_2", "npc_3", "npc_4", "npc_5"}, {3,5}, 20 };
                        {"AddRandPosNpcSet", 2099, 80, 2,  {"npc_1", "npc_2", "npc_3", "npc_4", "npc_5"}, {3,5}, 20 };
                        {"AddRandPosNpcSet", 2100, 80, 3,  {"npc_1", "npc_2", "npc_3", "npc_4", "npc_5"}, {3,5}, 20 };
                        {"AddRandPosNpcSet", 2096, 80, 13, {"npc_1", "npc_2", "npc_3", "npc_4", "npc_5"}, {3,5}, 20 };
                        {"AddRandPosNpcSet", 2098, 80, 22, {"npc_1", "npc_2", "npc_3", "npc_4", "npc_5"}, {3,5}, 20 };
                        {"AddRandPosNpcSet", 2099, 80, 8,  {"npc_1", "npc_2", "npc_3", "npc_4", "npc_5"}, {3,5}, 20 };
                        {"AddRandPosNpcSet", 2100, 80, 1,  {"npc_1", "npc_2", "npc_3", "npc_4", "npc_5"}, {3,5}, 20 };
                        {"AddRandPosNpcSet", 2096, 80, 4,  {"npc_1", "npc_2", "npc_3", "npc_4", "npc_5"}, {3,5}, 20 };
                        {"AddRandPosNpcSet", 2097, 80, 14, {"npc_1", "npc_2", "npc_3", "npc_4", "npc_5"}, {3,5}, 20 };
                        {"AddRandPosNpcSet", 2099, 80, 21, {"npc_1", "npc_2", "npc_3", "npc_4", "npc_5"}, {3,5}, 20 };
                        {"AddRandPosNpcSet", 2100, 80, 7,  {"npc_1", "npc_2", "npc_3", "npc_4", "npc_5"}, {3,5}, 20 };
                        {"AddRandPosNpcSet", 2096, 80, 6,  {"npc_1", "npc_2", "npc_3", "npc_4", "npc_5"}, {3,5}, 20 };
                        {"AddRandPosNpcSet", 2097, 80, 5,  {"npc_1", "npc_2", "npc_3", "npc_4", "npc_5"}, {3,5}, 20 };
                        {"AddRandPosNpcSet", 2098, 80, 15, {"npc_1", "npc_2", "npc_3", "npc_4", "npc_5"}, {3,5}, 20 };
                        {"AddRandPosNpcSet", 2100, 80, 20, {"npc_1", "npc_2", "npc_3", "npc_4", "npc_5"}, {3,5}, 20 };
                        {"AddRandPosNpcSet", 2096, 80, 19, {"npc_1", "npc_2", "npc_3", "npc_4", "npc_5"}, {3,5}, 20 };
                        {"AddRandPosNpcSet", 2097, 80, 18, {"npc_1", "npc_2", "npc_3", "npc_4", "npc_5"}, {3,5}, 20 };
                        {"AddRandPosNpcSet", 2098, 80, 17, {"npc_1", "npc_2", "npc_3", "npc_4", "npc_5"}, {3,5}, 20 };
                        {"AddRandPosNpcSet", 2099, 80, 16, {"npc_1", "npc_2", "npc_3", "npc_4", "npc_5"}, {3,5}, 20 };

                        
                        {"AddRandTypeSetTimer", --在对应点随机执行一种事件，
                            1, "box_buff", 60, -- 房间号，点名, 下一次执行时间
                            { 
                              {0.5, "AddMapNpcByPosName", 1994, 1, 59},  --前面的是概率，后面的是函数及传参，存活时间
                              {0.5, "AddDropBuffByPosName", "1000|30;1001|15;1002|15;1003|15;1004|15;1005|10;1", } --如：1|20;2|30;5   1号buff概率20   2号buff概率30   总共随机5次；1号是buffid这个对应的是在  Setting\Item\DropBuffList.tab，这个表里的nObjId对应模型是在 Setting\Item\ObjData.tab 里
                            }, 
                        }; 
                        {"AddRandTypeSetTimer",
                            2, "box_buff" , 60,
                            { 
                              {0.5, "AddMapNpcByPosName", 1994, 1, 59},
                              {0.5, "AddDropBuffByPosName", "1000|30;1001|15;1002|15;1003|15;1004|15;1005|10;1", }
                            },
                        }; 
                        {"AddRandTypeSetTimer",
                            3, "box_buff" , 60,
                            { 
                              {0.5, "AddMapNpcByPosName", 1994, 1, 59},
                              {0.5, "AddDropBuffByPosName", "1000|30;1001|15;1002|15;1003|15;1004|15;1005|10;1", }
                            },
                        }; 
                        {"AddRandTypeSetTimer",
                            4, "box_buff" , 60,
                            { 
                              {0.5, "AddMapNpcByPosName", 1994, 1, 59},
                              {0.5, "AddDropBuffByPosName", "1000|30;1001|15;1002|15;1003|15;1004|15;1005|10;1", }
                            },
                        }; 
                        {"AddRandTypeSetTimer",
                            5, "box_buff" , 60,
                            { 
                              {0.5, "AddMapNpcByPosName", 1994, 1, 59},
                              {0.5, "AddDropBuffByPosName", "1000|30;1001|15;1002|15;1003|15;1004|15;1005|10;1", }
                            },
                        }; 
                        {"AddRandTypeSetTimer",
                            6, "box_buff" , 60,
                            { 
                              {0.5, "AddMapNpcByPosName", 1994, 1, 59},
                              {0.5, "AddDropBuffByPosName", "1000|30;1001|15;1002|15;1003|15;1004|15;1005|10;1", }
                            },
                        }; 
                        {"AddRandTypeSetTimer",
                            7, "box_buff" , 60,
                            { 
                              {0.5, "AddMapNpcByPosName", 1994, 1, 59},
                              {0.5, "AddDropBuffByPosName", "1000|30;1001|15;1002|15;1003|15;1004|15;1005|10;1", }
                            },
                        }; 
                        {"AddRandTypeSetTimer",
                            8, "box_buff" , 60,
                            { 
                              {0.5, "AddMapNpcByPosName", 1994, 1, 59},
                              {0.5, "AddDropBuffByPosName", "1000|30;1001|15;1002|15;1003|15;1004|15;1005|10;1", }
                            },
                        }; 
                        {"AddRandTypeSetTimer",
                            9, "box_buff" , 60,
                            { 
                              {0.5, "AddMapNpcByPosName", 1994, 1, 59},
                              {0.5, "AddDropBuffByPosName", "1000|30;1001|15;1002|15;1003|15;1004|15;1005|10;1", }
                            },
                        };
                        {"AddRandTypeSetTimer",
                            10, "box_buff" , 60,
                            { 
                              {0.5, "AddMapNpcByPosName", 1994, 1, 59},
                              {0.5, "AddDropBuffByPosName", "1000|30;1001|15;1002|15;1003|15;1004|15;1005|10;1", }
                            },
                        }; 
                        {"AddRandTypeSetTimer",
                            11, "box_buff" , 60,
                            { 
                              {0.5, "AddMapNpcByPosName", 1994, 1, 59},
                              {0.5, "AddDropBuffByPosName", "1000|30;1001|15;1002|15;1003|15;1004|15;1005|10;1", }
                            },
                        }; 
                        {"AddRandTypeSetTimer",
                            12, "box_buff" , 60,
                            { 
                              {0.5, "AddMapNpcByPosName", 1994, 1, 59},
                              {0.5, "AddDropBuffByPosName", "1000|30;1001|15;1002|15;1003|15;1004|15;1005|10;1", }
                            },
                        }; 
                        {"AddRandTypeSetTimer",
                            13, "box_buff" , 60,
                            { 
                              {0.5, "AddMapNpcByPosName", 1994, 1, 59},
                              {0.5, "AddDropBuffByPosName", "1000|30;1001|15;1002|15;1003|15;1004|15;1005|10;1", }
                            },
                        }; 
                        {"AddRandTypeSetTimer",
                            14, "box_buff" , 60,
                            { 
                              {0.5, "AddMapNpcByPosName", 1994, 1, 59},
                              {0.5, "AddDropBuffByPosName", "1000|30;1001|15;1002|15;1003|15;1004|15;1005|10;1", }
                            },
                        }; 
                        {"AddRandTypeSetTimer",
                            15, "box_buff" , 60,
                            { 
                              {0.5, "AddMapNpcByPosName", 1994, 1, 59},
                              {0.5, "AddDropBuffByPosName", "1000|30;1001|15;1002|15;1003|15;1004|15;1005|10;1", }
                            },
                        }; 
                        {"AddRandTypeSetTimer",
                            16, "box_buff" , 60,
                            { 
                              {0.5, "AddMapNpcByPosName", 1994, 1, 59},
                              {0.5, "AddDropBuffByPosName", "1000|30;1001|15;1002|15;1003|15;1004|15;1005|10;1", }
                            },
                        }; 
                        {"AddRandTypeSetTimer",
                            17, "box_buff" , 60,
                            { 
                              {0.5, "AddMapNpcByPosName", 1994, 1, 59},
                              {0.5, "AddDropBuffByPosName", "1000|30;1001|15;1002|15;1003|15;1004|15;1005|10;1", }
                            },
                        }; 
                        {"AddRandTypeSetTimer",
                            18, "box_buff" , 60,
                            { 
                              {0.5, "AddMapNpcByPosName", 1994, 1, 59},
                              {0.5, "AddDropBuffByPosName", "1000|30;1001|15;1002|15;1003|15;1004|15;1005|10;1", }
                            },
                        }; 
                        {"AddRandTypeSetTimer",
                            19, "box_buff" , 60,
                            { 
                              {0.5, "AddMapNpcByPosName", 1994, 1, 59},
                              {0.5, "AddDropBuffByPosName", "1000|30;1001|15;1002|15;1003|15;1004|15;1005|10;1", }
                            },
                        }; 
                        {"AddRandTypeSetTimer",
                            20, "box_buff" , 60,
                            { 
                              {0.5, "AddMapNpcByPosName", 1994, 1, 59},
                              {0.5, "AddDropBuffByPosName", "1000|30;1001|15;1002|15;1003|15;1004|15;1005|10;1", }
                            },
                        }; 
                        {"AddRandTypeSetTimer",
                            21, "box_buff" , 60,
                            { 
                              {0.5, "AddMapNpcByPosName", 1994, 1, 59},
                              {0.5, "AddDropBuffByPosName", "1000|30;1001|15;1002|15;1003|15;1004|15;1005|10;1", }
                            },
                        }; 
                        {"AddRandTypeSetTimer",
                            22, "box_buff" , 60,
                            { 
                              {0.5, "AddMapNpcByPosName", 1994, 1, 59},
                              {0.5, "AddDropBuffByPosName", "1000|30;1001|15;1002|15;1003|15;1004|15;1005|10;1", }
                            },
                        }; 
                        {"AddRandTypeSetTimer",
                            23, "box_buff" , 60,
                            { 
                              {0.5, "AddMapNpcByPosName", 1994, 1, 59},
                              {0.5, "AddDropBuffByPosName", "1000|30;1001|15;1002|15;1003|15;1004|15;1005|10;1", }
                            },
                        }; 
                        {"AddRandTypeSetTimer",
                            24, "box_buff" , 60,
                            { 
                              {0.5, "AddMapNpcByPosName", 1994, 1, 59},
                              {0.5, "AddDropBuffByPosName", "1000|30;1001|15;1002|15;1003|15;1004|15;1005|10;1", }
                            },
                        }; 
                        {"AddRandTypeSetTimer",
                            25, "box_buff" , 60,
                            { 
                              {0.5, "AddMapNpcByPosName", 1994, 1, 59},
                              {0.5, "AddDropBuffByPosName", "1000|30;1001|15;1002|15;1003|15;1004|15;1005|10;1", }
                            },
                        }; 
                        
                        
                    };

            [10]   = {
                        --同步一下客户端时间
                        { "SynGameTime",};

                        --第一阶段10秒刷出：商人*2
                        {"OnWorldNotify", "神秘商人现身幻境，据说专卖一些幻境中特有之物（可通过地图查看出现区域）"};
                        {"OnAddSingleRoomNpc", 1987, 50 + 5*60 + 90}; --添加单房间npc，npcId, 存活时间
                        {"OnAddSingleRoomNpc", 1987, 50 + 5*60 + 90};
                     };
            [50]   = {

                        --1-1房间陷阱
                        { "AddActiveCastSkill", 24, 
                            {
                                --先预警
                                { 2*15, {
                                        {3160, 1, 2610,20774},
                                        {3160, 1, 3583,20757},
                                        {3160, 1, 2615,19801},
                                        {3160, 1, 3562,19793},
                                        },
                                }, 
                                --第1个喷水
                                { 5,    {
                                        {3189, 1, 2610,20774},
                                        {3189, 1, 3583,20757},
                                        {3189, 1, 2615,19801},
                                        {3189, 1, 3562,19793},
                                        },
                                }, 

                                --先预警
                                { 2*15, {
                                        {3160, 1, 3096,20320},
                                        {3160, 1, 2555,20323},
                                        {3160, 1, 3742,20307},
                                        },
                                }, 
                                --第2个喷水
                                { 5,    {
                                        {3189, 1, 3096,20320},
                                        {3189, 1, 2555,20323},
                                        {3189, 1, 3742,20307},
                                        },
                                }, 

                                { 2*15, {
                                        {3160, 1, 3105,20917},
                                        {3160, 1, 3093,20323},
                                        {3160, 1, 3093,19714},
                                        },
                                }, 
                                --第3个喷水
                                { 5,    {
                                        {3189, 1, 3105,20917},
                                        {3189, 1, 3093,20323},
                                        {3189, 1, 3093,19714},
                                        },
                                }, 

                                --先预警
                                { 2*15, {
                                        {3160, 1, 2610,20774},
                                        {3160, 1, 3583,20757},
                                        {3160, 1, 2615,19801},
                                        {3160, 1, 3562,19793},
                                        },
                                }, 
                                --第1个喷水
                                { 5,    {
                                        {3189, 1, 2610,20774},
                                        {3189, 1, 3583,20757},
                                        {3189, 1, 2615,19801},
                                        {3189, 1, 3562,19793},
                                        },
                                }, 

                                --先预警
                                { 2*15, {
                                        {3160, 1, 3096,20320},
                                        {3160, 1, 2555,20323},
                                        {3160, 1, 3742,20307},
                                        },
                                }, 
                                --第2个喷水
                                { 5,    {
                                        {3189, 1, 3096,20320},
                                        {3189, 1, 2555,20323},
                                        {3189, 1, 3742,20307},
                                        },
                                }, 

                                { 2*15, {
                                        {3160, 1, 3105,20917},
                                        {3160, 1, 3093,20323},
                                        {3160, 1, 3093,19714},
                                        },
                                }, 
                                --第3个喷水
                                {70*15, {
                                        {3189, 1, 3105,20917},
                                        {3189, 1, 3093,20323},
                                        {3189, 1, 3093,19714},
                                        },
                                }, 


                            }, 
                        };

                        --1-2房间陷阱
                        { "AddActiveCastSkill", 25, 
                            {
                                --先警示2秒
                                { 2*15, {
                                          {3160, 1, 7466,20281},
                                        },
                                }, 
                                --第1次毒雾
                                { 4*15, {
                                          {3185, 1, 7466,20281},
                                        },
                                }, 

                                --先警示2秒
                                { 2*15, {
                                          {3160, 1, 7466,20281},
                                        },
                                }, 
                                --第2次毒雾
                                { 4*15, {
                                          {3185, 1, 7466,20281},
                                        },
                                }, 

                                --先警示2秒
                                { 2*15, {
                                          {3160, 1, 7466,20281},
                                        },
                                }, 
                                --第3次毒雾
                                { 70*15, {
                                          {3185, 1, 7466,20281},
                                        },
                                }, 
                            }, 
                        };

                        --2-1房间陷阱
                        { "AddActiveCastSkill", 23, 
                            {
                                --第一排预警
                                { 2*15, {
                                        {3160, 1, 2345,16587},
                                        {3160, 1, 2941,16591},
                                        {3160, 1, 3448,16598},
                                        },
                                }, 
                                --第一排喷水
                                { 5,   {
                                        {3189, 1, 2345,16587},
                                        {3189, 1, 2941,16591},
                                        {3189, 1, 3448,16598},
                                        },
                                }, 

                                --第二排预警
                                { 2*15, {
                                        {3160, 1, 2345,16077},
                                        {3160, 1, 2959,16063},
                                        {3160, 1, 3506,16067},
                                        },
                                }, 
                                --第二排喷水
                                { 5,    {
                                        {3189, 1, 2345,16077},
                                        {3189, 1, 2959,16063},
                                        {3189, 1, 3506,16067},
                                        },
                                }, 

                                --第三排预警
                                { 2*15, {
                                        {3160, 1, 2373,15605},
                                        {3160, 1, 2959,15584},
                                        {3160, 1, 3496,15591},
                                        },
                                }, 
                                --第三排喷水
                                { 5,    {
                                        {3189, 1, 2373,15605},
                                        {3189, 1, 2959,15584},
                                        {3189, 1, 3496,15591},
                                        },
                                }, 

                                --第一排预警
                                { 2*15, {
                                        {3160, 1, 2345,16587},
                                        {3160, 1, 2941,16591},
                                        {3160, 1, 3448,16598},
                                        },
                                }, 
                                --第一排喷水
                                { 5,    {
                                        {3189, 1, 2345,16587},
                                        {3189, 1, 2941,16591},
                                        {3189, 1, 3448,16598},
                                        },
                                }, 

                                --第二排预警
                                { 2*15, {
                                        {3160, 1, 2345,16077},
                                        {3160, 1, 2959,16063},
                                        {3160, 1, 3506,16067},
                                        },
                                }, 
                                --第二排喷水
                                { 5,    {
                                        {3189, 1, 2345,16077},
                                        {3189, 1, 2959,16063},
                                        {3189, 1, 3506,16067},
                                        },
                                }, 

                                --第三排预警
                                { 2*15, {
                                        {3160, 1, 2373,15605},
                                        {3160, 1, 2959,15584},
                                        {3160, 1, 3496,15591},
                                        },
                                }, 
                                --第三排喷水
                                {70*15, {
                                        {3189, 1, 2373,15605},
                                        {3189, 1, 2959,15584},
                                        {3189, 1, 3496,15591},
                                        },
                                }, 

                            }, 
                        };

                        --2-5房间陷阱
                        { "AddActiveCastSkill", 13, 
                            {
                                --先警示2秒
                                { 2*15, {
                                          {3160, 1, 21798,16220},
                                        },
                                }, 
                                --第1次毒雾
                                { 4*15, {
                                          {3185, 1, 21798,16220},
                                        },
                                }, 

                                --先警示2秒
                                { 2*15, {
                                          {3160, 1, 21798,16220},
                                        },
                                }, 
                                --第2次毒雾
                                { 4*15, {
                                          {3185, 1, 21798,16220},
                                        },
                                }, 

                                --先警示2秒
                                { 2*15, {
                                          {3160, 1, 21798,16220},
                                        },
                                }, 
                                --第3次毒雾
                                { 70*15, {
                                          {3185, 1, 21798,16220},
                                        },
                                }, 
                            }, 
                        };

                        --3-1房间陷阱
                        { "AddActiveCastSkill", 22, 
                            {
                                --第1秒
                                { 15, {
                                        {3160, 1, 2373,15605},
                                      },
                                }, 
                                { 5,  {
                                        --1号喷水
                                        {3189, 1, 2373,15605},
                                      },
                                }, 

                                --第2秒
                                { 15, {
                                        {3160, 1, 2592,12141},
                                      },
                                }, 
                                { 5,  {
                                        --2号喷水
                                        {3189, 1, 2592,12141},
                                      },
                                }, 

                                --第3秒
                                { 15, {
                                        {3160, 1, 3427,12606},
                                        {3160, 1, 3400,11646},
                                      },
                                }, 
                                { 5,  {
                                        --3、4号喷水
                                        {3189, 1, 3427,12606},
                                        {3189, 1, 3400,11646},
                                      },
                                }, 

                                --第4秒
                                { 15, {
                                        {3160, 1, 3400,11646},
                                        {3160, 1, 2829,12605},
                                      },
                                }, 
                                { 5,  {
                                        --4、5号喷水
                                        {3189, 1, 3400,11646},
                                        {3189, 1, 2829,12605},
                                      },
                                }, 

                                --第5秒
                                { 15, {
                                        {3160, 1, 3103,12134},
                                        {3160, 1, 2829,12605},
                                        {3160, 1, 2780,11679},
                                      },
                                }, 
                                { 5,  {
                                        --5、6、1号喷水
                                        {3189, 1, 3103,12134},
                                        {3189, 1, 2829,12605},
                                        {3189, 1, 2780,11679},
                                      },
                                }, 

                                --第6秒
                                { 15, {
                                        {3160, 1, 2592,12141},
                                        {3160, 1, 2780,11679},
                                        {3160, 1, 3612,12080},
                                      },
                                }, 
                                { 5,  {
                                        --6、7、2号喷水
                                        {3189, 1, 2592,12141},
                                        {3189, 1, 2780,11679},
                                        {3189, 1, 3612,12080},
                                      },
                                }, 

                                --第7秒
                                { 15, {
                                        {3160, 1, 3103,12134},
                                        {3160, 1, 3427,12606},
                                        {3160, 1, 3612,12080},
                                      },
                                }, 
                                { 5,  {
                                        --7、1、3号喷水
                                        {3189, 1, 3103,12134},
                                        {3189, 1, 3427,12606},
                                        {3189, 1, 3612,12080},
                                      },
                                }, 

                                --第8秒
                                { 15, {
                                        {3160, 1, 2592,12141},
                                        {3160, 1, 3400,11646},
                                      },
                                }, 
                                { 5,  {
                                        --2、4号喷水
                                        {3189, 1, 2592,12141},
                                        {3189, 1, 3400,11646},
                                      },
                                }, 

                                --第9秒
                                { 15, {
                                        {3160, 1, 3427,12606},
                                        {3160, 1, 2829,12605},
                                      },
                                }, 
                                { 5,  {
                                        --3、5号喷水
                                        {3189, 1, 3427,12606},
                                        {3189, 1, 2829,12605},
                                      },
                                }, 

                                --第10秒
                                { 15, {
                                        {3160, 1, 2780,11679},
                                      },
                                }, 
                                { 5,  {
                                        --6号喷水
                                        {3189, 1, 2780,11679},
                                      },
                                }, 

                                --第11秒
                                { 15, {
                                        {3160, 1, 3612,12080},
                                      },
                                }, 
                                { 70*15,  {
                                        --7号喷水
                                        {3189, 1, 3612,12080},
                                      },
                                }, 

                            }, 
                        };

                        --3-5房间陷阱
                        { "AddActiveCastSkill", 14, 
                            {
                                --先警示2秒
                                { 2*15, {
                                        {3160, 1, 21769,12082},
                                        },
                                }, 
                                --第1次毒雾
                                { 4*15, {
                                        {3185, 1, 21769,12082},
                                        },
                                }, 

                                --先警示2秒
                                { 2*15, {
                                        {3160, 1, 21769,12082},
                                        },
                                }, 
                                --第2次毒雾
                                { 4*15, {
                                        {3185, 1, 21769,12082},
                                        },
                                }, 

                                --先警示2秒
                                { 2*15, {
                                        {3160, 1, 21769,12082},
                                        },
                                }, 
                                --第3次毒雾
                                { 70*15,{
                                        {3185, 1, 21769,12082},
                                        },
                                }, 
                            }, 
                        };

                        --4-5房间陷阱
                        { "AddActiveCastSkill", 15, 
                            {
                                --先警示2秒
                                { 2*15, {
                                        {3160, 1, 22131,7366},
                                        },
                                }, 

                                --第1次毒雾
                                { 4*15, {
                                        {3185, 1, 22131,7366},
                                        },
                                }, 

                                --先警示2秒
                                { 2*15, {
                                        {3160, 1, 22131,7366},
                                        },
                                }, 

                                --第2次毒雾
                                { 4*15, {
                                        {3185, 1, 22131,7366},
                                        },
                                }, 

                                --先警示2秒
                                { 2*15, {
                                        {3160, 1, 22131,7366},
                                        },
                                }, 

                                --第3次毒雾
                                { 70*15, {
                                          {3185, 1, 22131,7366},
                                       },
                                }, 
                            }, 
                        };

                        --指定位置添加沿路径行走的npc 
                        --1-3房间陷阱
                        {"AddAutoHideWalkPathNpc", 10, 2117, 80, "1_3_skill_A_1", 14*15, 70*15 }; --房间号，npcId，等级 ,路径 ,存活帧，增加间隔帧(从删除后算)
                        {"AddAutoHideWalkPathNpc", 10, 2117, 80, "1_3_skill_A_2", 14*15, 70*15 };
                        {"AddAutoHideWalkPathNpc", 10, 2117, 80, "1_3_skill_A_3", 14*15, 70*15 };
                        {"AddAutoHideWalkPathNpc", 10, 2117, 80, "1_3_skill_A_4", 14*15, 70*15 };
                        {"AddAutoHideWalkPathNpc", 10, 2117, 80, "1_3_skill_A_5", 14*15, 70*15 };
 
                        --1-4房间陷阱
                        {"AddAutoHideWalkPathNpc", 11, 2117, 80, "1_4_skill_A_1", 14*15, 70*15 }; 
                        {"AddAutoHideWalkPathNpc", 11, 2117, 80, "1_4_skill_A_2", 14*15, 70*15 };
                        {"AddAutoHideWalkPathNpc", 11, 2117, 80, "1_4_skill_A_3", 14*15, 70*15 };
                        {"AddAutoHideWalkPathNpc", 11, 2117, 80, "1_4_skill_A_4", 14*15, 70*15 };
                        {"AddAutoHideWalkPathNpc", 11, 2117, 80, "1_4_skill_A_5", 14*15, 70*15 };

                        --1-5房间陷阱
                        {"AddAutoHideWalkPathNpc", 12, 2117, 80, "1_5_skill_A_1", 14*15, 70*15 }; 
                        {"AddAutoHideWalkPathNpc", 12, 2117, 80, "1_5_skill_A_2", 14*15, 70*15 };
                        {"AddAutoHideWalkPathNpc", 12, 2117, 80, "1_5_skill_A_3", 14*15, 70*15 };
                        {"AddAutoHideWalkPathNpc", 12, 2117, 80, "1_5_skill_A_4", 14*15, 70*15 };
                        {"AddAutoHideWalkPathNpc", 12, 2117, 80, "1_5_skill_A_5", 14*15, 70*15 };

                        --2-2房间陷阱
                        { "AddActiveCastSkill", 9,
                            {
                                { 4*15, {                       
                                        {3170, 1, 7446,16050},
                                        },
                                }, 
                                { 4*15, {                       
                                        {3170, 1, 7446,16050},
                                        },
                                }, 
                                { 70*15,   {
                                        {3170, 1, 7446,16050},
                                        },
                                }, 
                            }, 
                        };

                        --2-3房间陷阱
                        { "AddActiveCastSkill", 2, 
                            {
                                { 4*15, {                       
                                        {3172, 1, 12009,16068},
                                        },
                                }, 
                                { 4*15, {                       
                                        {3172, 1, 12009,16068},
                                        },
                                }, 
                                { 70*15,   {
                                        {3172, 1, 12009,16068},
                                        },
                                }, 
                            }, 
                        };

                        --2-4房间陷阱
                        { "AddActiveCastSkill", 3, 
                            {
                                { 4*15, {                       
                                        {3174, 1, 16905,16080},
                                        },
                                }, 
                                { 4*15, {                       
                                        {3174, 1, 16905,16080},
                                        },
                                }, 
                                { 70*15,  {
                                        {3174, 1, 16905,16080},
                                        },
                                }, 
                            }, 
                        };

                        --3-2房间陷阱
                        { "AddActiveCastSkill", 8, 
                            {
                                { 4*15, {                       
                                        {3176, 1, 7382,11998},
                                        },
                                }, 
                                { 4*15, {                       
                                        {3176, 1, 7382,11998},
                                        },
                                }, 
                                { 70*15,  {
                                        {3176, 1, 7382,11998},
                                        },
                                }, 
                            }, 
                        };

                        --3-4房间陷阱
                        { "AddActiveCastSkill", 4, 
                            {
                                { 4*15, {                       
                                        {3178, 1, 17185,11881},
                                        },
                                }, 
                                { 4*15, {                       
                                        {3178, 1, 17185,11881},
                                        },
                                }, 
                                { 70*15,  {
                                        {3178, 1, 17185,11881},
                                        },
                                }, 
                            }, 
                        };

                        --4-1房间陷阱
                        { "AddActiveCastSkill", 21, 
                            {
                                --先警示2秒
                                { 2*15, {
                                        {3160, 1, 3036,8081},
                                        },
                                }, 
                                --第1次刀光
                                { 4*15, {
                                        {3187, 1, 3036,8081},
                                        },
                                }, 

                                --先警示2秒
                                { 2*15, {
                                        {3160, 1, 3036,8081},
                                        },
                                }, 
                                --第2次刀光
                                { 4*15, {
                                        {3187, 1, 3036,8081},
                                        },
                                }, 

                                --先警示2秒
                                { 2*15, {
                                        {3160, 1, 3036,8081},
                                        },
                                }, 
                                --第3次刀光
                                { 70*15,{
                                        {3187, 1, 3036,8081},
                                        },
                                }, 
                            }, 
                        };

                        --4-2房间陷阱
                        { "AddActiveCastSkill", 7, 
                            {
                                { 4*15, {                       
                                        {3170, 1, 7358,7546},
                                        },
                                }, 
                                { 4*15, {                       
                                        {3170, 1, 7358,7546},
                                        },
                                }, 
                                { 70*15,  {
                                        {3170, 1, 7358,7546},
                                        },
                                }, 
                            }, 
                        };

                        --4-3房间陷阱
                        { "AddActiveCastSkill", 6, 
                            {
                                { 4*15, {                       
                                        {3176, 1, 12023,7407},
                                        },
                                }, 
                                { 4*15, {                       
                                        {3176, 1, 12023,7407},
                                        },
                                }, 
                                { 70*15,{
                                        {3176, 1, 12023,7407},
                                        },
                                }, 
                            }, 
                        };

                        --4-4房间陷阱
                        { "AddActiveCastSkill", 5, 
                            {
                                { 4*15, {                       
                                        {3174, 1, 16932,7415},
                                        },
                                }, 
                                { 4*15, {                       
                                        {3174, 1, 16932,7415},
                                        },
                                }, 
                                { 70*15,  {
                                        {3174, 1, 16932,7415},
                                        },
                                }, 
                            }, 
                        };

                        --5-1房间陷阱
                        { "AddActiveCastSkill", 20, 
                            {
                                --先警示2秒
                                { 2*15, {
                                        {3160, 1, 3053,4009},
                                        },
                                }, 
                                --第1次刀光
                                { 4*15, {
                                        {3187, 1, 3053,4009},
                                        },
                                }, 

                                --先警示2秒
                                { 2*15, {
                                        {3160, 1, 3053,4009},
                                        },
                                }, 
                                --第2次刀光
                                { 4*15, {
                                        {3187, 1, 3053,4009},
                                        },
                                }, 

                                --先警示2秒
                                { 2*15, {
                                        {3160, 1, 3053,4009},
                                        },
                                }, 
                                --第3次刀光
                                { 70*15,{
                                        {3187, 1, 3053,4009},
                                        },
                                }, 
                            }, 
                        };

                        --5-2房间陷阱
                        { "AddActiveCastSkill", 19, --执行函数，房间号
                            {
                                --第一排落雷
                                { 2*15, {                       --多少帧执行下一个
                                        {3157, 1, 7300,3298},  --技能ID，技能等级，技能释放坐标
                                        {3157, 1, 6726,3319}, 
                                        {3157, 1, 7885,3319},

                                        {3160, 1, 7300,3298},
                                        {3160, 1, 6726,3319},
                                        {3160, 1, 7885,3319},
                                        },
                                }, 
                                --第二排落雷
                                { 2*15, {
                                        {3157, 1, 6466,2963}, 
                                        {3157, 1, 6983,2958}, 
                                        {3157, 1, 7502,2958},
                                        {3157, 1, 8011,2974},

                                        {3160, 1, 6466,2963},
                                        {3160, 1, 6983,2958},
                                        {3160, 1, 7502,2958},
                                        {3160, 1, 8011,2974},
                                        },
                                }, 
                                --第三排落雷
                                { 2*15, {
                                        {3157, 1, 6187,2588},
                                        {3157, 1, 6726,2578},
                                        {3157, 1, 7280,2575},
                                        {3157, 1, 7837,2588},

                                        {3160, 1, 6187,2588},
                                        {3160, 1, 6726,2578},
                                        {3160, 1, 7280,2575},
                                        {3160, 1, 7837,2588},
                                        },
                                }, 
                                --第四排落雷
                                { 2*15, {
                                        {3157, 1, 7743,2163}, 
                                        {3157, 1, 6436,2141}, 
                                        {3157, 1, 7039,2141},

                                        {3160, 1, 7743,2163}, 
                                        {3160, 1, 6436,2141}, 
                                        {3160, 1, 7039,2141},
                                        },
                                }, 

                                -------------
                                 --第一排落雷
                                { 2*15, {
                                        {3157, 1, 7300,3298},
                                        {3157, 1, 6726,3319}, 
                                        {3157, 1, 7885,3319},

                                        {3160, 1, 7300,3298},
                                        {3160, 1, 6726,3319},
                                        {3160, 1, 7885,3319},
                                        },
                                }, 
                                --第二排落雷
                                { 2*15, {
                                        {3157, 1, 6466,2963}, 
                                        {3157, 1, 6983,2958}, 
                                        {3157, 1, 7502,2958},
                                        {3157, 1, 8011,2974},

                                        {3160, 1, 6466,2963},
                                        {3160, 1, 6983,2958},
                                        {3160, 1, 7502,2958},
                                        {3160, 1, 8011,2974},
                                        },
                                }, 
                                --第三排落雷
                                { 2*15, {
                                        {3157, 1, 6187,2588},
                                        {3157, 1, 6726,2578},
                                        {3157, 1, 7280,2575},
                                        {3157, 1, 7837,2588},

                                        {3160, 1, 6187,2588},
                                        {3160, 1, 6726,2578},
                                        {3160, 1, 7280,2575},
                                        {3160, 1, 7837,2588},
                                        },
                                }, 
                                --第四排落雷
                                { 70*15,   {
                                        {3157, 1, 7743,2163}, 
                                        {3157, 1, 6436,2141}, 
                                        {3157, 1, 7039,2141},

                                        {3160, 1, 7743,2163}, 
                                        {3160, 1, 6436,2141}, 
                                        {3160, 1, 7039,2141},
                                        },
                                }, 
                            }, 
                        };

                        --5-3房间陷阱
                        { "AddActiveCastSkill", 18, 
                            {
                                { 15,   {--1
                                        --1号雷，第1次
                                        {3157, 1, 11710,2258},
                                        {3160, 1, 11710,2258},
                                        },
                                },
                                { 15,   {--2
                                        --2号雷，第1次
                                        {3157, 1, 12010,3350},
                                        {3160, 1, 12010,3350},
                                        },
                                },
                                { 15,   {--3
                                        --1号雷，第2次
                                        {3157, 1, 11710,2258},
                                        {3160, 1, 11710,2258},
                                        --3号雷，第1次
                                        {3157, 1, 12932,2778},
                                        {3160, 1, 12932,2778},
                                        },
                                },
                                { 15,   {--4
                                        --2号雷，第2次
                                        {3157, 1, 12010,3350},
                                        {3160, 1, 12010,3350},
                                        --4号雷，第1次
                                        {3157, 1, 11649,2844},
                                        {3160, 1, 11649,2844},
                                        },
                                },
                                { 15,   {--5
                                        --1号雷，第3次
                                        {3157, 1, 11710,2258},
                                        {3160, 1, 11710,2258},
                                        --3号雷，第2次
                                        {3157, 1, 12932,2778},
                                        {3160, 1, 12932,2778},
                                        --5号雷，第1次
                                        {3157, 1, 12814,2237},
                                        {3160, 1, 12814,2237},
                                        },
                                },
                                { 15,   {--6
                                        --2号雷，第3次
                                        {3157, 1, 12010,3350},
                                        {3160, 1, 12010,3350},
                                        --4号雷，第2次
                                        {3157, 1, 11649,2844},
                                        {3160, 1, 11649,2844},
                                        --6号雷，第1次
                                        {3157, 1, 12834,3295},
                                        {3160, 1, 12834,3295},
                                        },
                                },
                                { 15,   {--7
                                        --3号雷，第3次
                                        {3157, 1, 12932,2778},
                                        {3160, 1, 12932,2778},
                                        --5号雷，第2次
                                        {3157, 1, 12814,2237},
                                        {3160, 1, 12814,2237},
                                        --7号雷，第1次
                                        {3157, 1, 12275,2427},
                                        {3160, 1, 12275,2427},
                                        },
                                },
                                { 15,   {--8
                                        --4号雷，第3次
                                        {3157, 1, 11649,2844},
                                        {3160, 1, 11649,2844},
                                        --6号雷，第2次
                                        {3157, 1, 12834,3295},
                                        {3160, 1, 12834,3295},
                                        --8号雷，第1次
                                        {3157, 1, 12382,3000},
                                        {3160, 1, 12382,3000},
                                        },
                                },
                                { 15,  {--9
                                        --5号雷，第3次
                                        {3157, 1, 12814,2237},
                                        {3160, 1, 12814,2237},
                                        --7号雷，第2次
                                        {3157, 1, 12275,2427},
                                        {3160, 1, 12275,2427},
                                        },
                                },
                                { 15,   {--10
                                        --6号雷，第3次
                                        {3157, 1, 12834,3295},
                                        {3160, 1, 12834,3295},
                                        --8号雷，第2次
                                        {3157, 1, 12382,3000},
                                        {3160, 1, 12382,3000},
                                        },
                                },
                                { 15,   {--11
                                        --7号雷，第3次
                                        {3157, 1, 12275,2427},
                                        {3160, 1, 12275,2427},
                                        },
                                },
                                { 70*15,   {--12
                                        --8号雷，第3次
                                        {3157, 1, 12382,3000},
                                        {3160, 1, 12382,3000},
                                        },
                                },

                            }, 
                        };


                        --5-4房间陷阱
                        { "AddActiveCastSkill", 17, 
                            {
                                --第1次落雷
                                { 2*15, {
                                        {3157, 1, 17859,2223},
                                        {3157, 1, 16864,2245}, 
                                        {3157, 1, 16867,3168},
                                        {3157, 1, 17875,3159},

                                        {3160, 1, 17859,2223},
                                        {3160, 1, 16864,2245}, 
                                        {3160, 1, 16867,3168},
                                        {3160, 1, 17875,3159},
                                        },
                                }, 

                                --第2次落雷
                                { 2*15, {

                                        {3157, 1, 17368,3161},
                                        {3157, 1, 17368,2157}, 
                                        {3157, 1, 17368,2635},

                                        {3160, 1, 17368,3161},
                                        {3160, 1, 17368,2157}, 
                                        {3160, 1, 17368,2635},
                                        },
                                }, 

                                --第3次落雷
                                { 2*15, {
                                        {3157, 1, 16833,2692},
                                        {3157, 1, 17381,2688}, 
                                        {3157, 1, 17881,2670},

                                        {3160, 1, 16833,2692},
                                        {3160, 1, 17381,2688}, 
                                        {3160, 1, 17881,2670},
                                        },
                                }, 

                                --第1次落雷
                                { 2*15, {
                                        {3157, 1, 17859,2223},
                                        {3157, 1, 16864,2245}, 
                                        {3157, 1, 16867,3168},
                                        {3157, 1, 17875,3159},

                                        {3160, 1, 17859,2223},
                                        {3160, 1, 16864,2245}, 
                                        {3160, 1, 16867,3168},
                                        {3160, 1, 17875,3159},
                                        },
                                }, 

                                --第2次落雷
                                { 2*15, {

                                        {3157, 1, 17368,3161},
                                        {3157, 1, 17368,2157}, 
                                        {3157, 1, 17368,2635},

                                        {3160, 1, 17368,3161},
                                        {3160, 1, 17368,2157}, 
                                        {3160, 1, 17368,2635},
                                        },
                                }, 

                                --第3次落雷
                                { 70*15,   {
                                        {3157, 1, 16833,2692},
                                        {3157, 1, 17381,2688}, 
                                        {3157, 1, 17881,2670},

                                        {3160, 1, 16833,2692},
                                        {3160, 1, 17381,2688}, 
                                        {3160, 1, 17881,2670},
                                        },
                                }, 
                            }, 
                        };

                        --5-5房间陷阱
                        { "AddActiveCastSkill", 16, 
                            {
                                --先警示2秒
                                { 2*15, {
                                        {3160, 1, 22307,2681},
                                        },
                                }, 
                                --第1次刀光
                                { 4*15, {
                                        {3187, 1, 22307,2681},
                                        },
                                }, 

                                --先警示2秒
                                { 2*15, {
                                        {3160, 1, 22307,2681},
                                        },
                                }, 
                                --第2次刀光
                                { 4*15, {
                                        {3187, 1, 22307,2681},
                                        },
                                }, 

                                --先警示2秒
                                { 2*15, {
                                        {3160, 1, 22307,2681},
                                        },
                                }, 
                                --第3次刀光
                                { 70*15,{
                                        {3187, 1, 22307,2681},
                                        },
                                }, 
                            }, 
                        };
 
                    };


            [2*60] = {
                        --同步一下客户端时间
                        { "SynGameTime",};
                     };

            [3*60] = {
                        --同步一下客户端时间
                        { "SynGameTime",};

                        --第一阶段3分钟刷出：幻兽·寒玉鹿王、幻兽·大地狼王、幻兽·白眉猴王
                        {"OnWorldNotify", "幻境中出现了心魔幻兽、心魔幻象（可通过地图查看出现区域）"};
                        {"OnAddSingleRoomNpc", 2102, 3*60}; 
                        {"OnAddSingleRoomNpc", 2103, 3*60}; 
                        {"OnAddSingleRoomNpc", 2104, 3*60}; 

                        --第一阶段3分钟刷出：幻象*3
                        {"OnAddSingleRoomNpc", 2101, 3*60}; 
                        {"OnAddSingleRoomNpc", 2101, 3*60}; 
                        {"OnAddSingleRoomNpc", 2101, 3*60}; 
                    };
            [5*60+50] = {
                        --最后1分钟提前10秒同步一下时间
                        { "SynGameTime",};
                     };
        };

        [3] =
        {
             --第一个休息阶段的第30s执行的函数
            [60] = { 
                        { "ReadyCloseRoom",  "", "tbRandomCloseRoomState1"};  --关最外层8个房间
                        { "SynGameTime",};
                    }; 

            [80] = {
                        --休息阶段剩余10秒时同步一下时间
                        { "SynGameTime",};
                     };
        };

        --第二个战斗阶段
        [4] =
        {
            [10]   = {
                        --同步一下客户端时间
                        { "SynGameTime",};

                        --第二阶段10秒刷出：商人*2
                        {"OnWorldNotify", "神秘商人现身幻境，据说专卖一些幻境中特有之物（可通过地图查看出现区域）"};
                        {"OnAddSingleRoomNpc", 1987, 50 + 5*60 + 90};
                        {"OnAddSingleRoomNpc", 1987, 50 + 5*60 + 90};
                     };

            [2*60] = {
                        --同步一下客户端时间
                        { "SynGameTime",};
                     };

            [3*60] = {
                        --同步一下客户端时间
                        { "SynGameTime",};

                        --第二阶段3分钟刷出：幻兽·奔焰豹王、幻兽·九尾狐王、幻兽·双首异兽
                        {"OnWorldNotify", "幻境中出现了心魔幻兽、心魔幻象（可通过地图查看出现区域）"};
                        {"OnAddSingleRoomNpc", 2105, 3*60}; 
                        {"OnAddSingleRoomNpc", 2106, 3*60}; 
                        {"OnAddSingleRoomNpc", 2107, 3*60}; 

                        --第二阶段3分钟刷出：幻兽·紫背鳄皇（BOSS)
                        {"OnAddSingleRoomNpc", 2111, 3*60}; 

                        --第二阶段3分钟刷出：幻象*3
                        {"OnAddSingleRoomNpc", 2101, 3*60}; 
                        {"OnAddSingleRoomNpc", 2101, 3*60}; 
                        {"OnAddSingleRoomNpc", 2101, 3*60}; 
                    };

            [5*60+50] = {
                        --最后1分钟提前10秒同步一下时间
                        { "SynGameTime",};
                     };
        };

        [5] = 
        {
            [60] = { 
                        { "ReadyCloseRoom",  "tbRoomIndex1",};  --关最外层全部房间
                        { "SynGameTime",};
                    }; 

            [80] = {
                        --休息阶段剩余10秒时同步一下时间
                        { "SynGameTime",};
                     };
        };

        --第三个战斗阶段
        [6] =
        {
            [10]   = {
                        --同步一下客户端时间
                        { "SynGameTime",};

                        --第三阶段10秒刷出：商人*2
                        {"OnWorldNotify", "神秘商人现身幻境，据说专卖一些幻境中特有之物（可通过地图查看出现区域）"};
                        {"OnAddSingleRoomNpc", 1987, 50 + 5*60 + 90};
                        {"OnAddSingleRoomNpc", 1987, 50 + 5*60 + 90};
                     };

            [2*60] = {
                        --同步一下客户端时间
                        { "SynGameTime",};
                     };

            [3*60] = {
                        --同步一下客户端时间
                        { "SynGameTime",};
                        
                        --第三阶段3分钟刷出：幻兽·定海金刚、幻兽·金翅鹏皇、幻兽·银角犀皇
                        {"OnWorldNotify", "幻境中出现了心魔幻兽、心魔幻象（可通过地图查看出现区域）"};
                        {"OnAddSingleRoomNpc", 2108, 3*60}; 
                        {"OnAddSingleRoomNpc", 2109, 3*60}; 
                        {"OnAddSingleRoomNpc", 2110, 3*60}; 

                        --第三阶段3分钟刷出：幻兽·撼天熊皇（BOSS)
                        {"OnAddSingleRoomNpc", 2112, 3*60}; 

                        --第三阶段3分钟刷出：幻象*3
                        {"OnAddSingleRoomNpc", 2101, 3*60}; 
                        {"OnAddSingleRoomNpc", 2101, 3*60}; 
                        {"OnAddSingleRoomNpc", 2101, 3*60}; 
                    };

            [5*60+50] = {
                        --最后1分钟提前10秒同步一下时间
                        { "SynGameTime",};
                     };
        };

        [7] = 
        {
            [60] = { 
                        { "ReadyCloseRoom",  "tbRoomIndex2",};  --关最外层全部房间
                        { "SynGameTime",};
                   }; 

            [80] = {
                        --休息阶段剩余10秒时同步一下时间
                        { "SynGameTime",};
                     };
        };

        [8] = 
        {
            [1] = { 
                        { "SynGameTime",};

                        {"AddRandPosBuffSet", "1000|30;1001|15;1002|15;1003|15;1004|15;1005|10;1", 1, {"last_buff_1", "last_buff_2", "last_buff_3", "last_buff_4"}, {1,1} };--点集里刷随机buff，buff，房间号，点集，随机个数--TODO 配置检查
                   }; 

            [61] = { 
                        { "SynGameTime",};

                        {"AddRandPosBuffSet", "1000|30;1001|15;1002|15;1003|15;1004|15;1005|10;1", 1, {"last_buff_1", "last_buff_2", "last_buff_3", "last_buff_4"}, {1,1} };
                   }; 

            [121] = { 
                        { "SynGameTime",};

                        {"AddRandPosBuffSet", "1000|30;1001|15;1002|15;1003|15;1004|15;1005|10;1", 1, {"last_buff_1", "last_buff_2", "last_buff_3", "last_buff_4"}, {1,1} };
                   }; 

            [181] = { 
                        { "SynGameTime",};

                        {"AddRandPosBuffSet", "1000|30;1001|15;1002|15;1003|15;1004|15;1005|10;1", 1, {"last_buff_1", "last_buff_2", "last_buff_3", "last_buff_4"}, {1,1} };
                   }; 
        };
};