
StrConfig:Add(
{
	--大地图当前地图
	['map101'] = '<font color="#dc2f2f" size="14">(可PK区域)</font>',
	['map102'] = '<font color="#65c47e" size="14">(安全区域)</font>',
	['map103'] = '当前坐标：%s,%s',
	['map104'] = '（%s）',
	['map105'] = '%s级',
	['map106'] = '',
	['map107'] = '目标地点无法到达',
	['map108'] = '该坐标不存在，无法寻路',
	['map109'] = '该坐标不可到达，无法寻路',
	['map110'] = "%s<font color='#29cc00'>(%s)</font>",
	['map111'] = "%s<font color='#29cc00'>(%s级)</font>",
	['map112'] = "队长",
	['map113'] = "队友",
	['map114'] = "帮主",
	['map115'] = "帮派成员",
	['map116'] = "%s %s(等级%s)\n坐标:%s, %s", -- 职位，名字，等级，x, y
	['map117'] = "黄金挂机点",
	['map118'] = "安全挂机点",
	['map119'] = "双击进行寻路",
	['map120'] = "<font color='%s'>%s(%s级)</font>",
	['map121'] = "请输入坐标",
	['map122'] = "遗迹战旗<br/>扛起战旗的帮派每3秒可增加1积分。<br/>击杀扛旗玩家，战旗将掉落在原地，可被其他人扛起",
	--大地图世界地图
	['map201'] = [[<font color='#d2a930' size='18'>%s</font>  %s
<font color='#d5b772' size='14'>进入等级：</font><font color='#00ff00' size='14'>%s级</font>
<font color='#d5b772' size='14'>怪物等级：</font><font color='#00ff00' size='14'>%s</font>
%s]],
	['map202'] = '传送需要%s元宝，您库存不足', --点击传送
	['map203'] = '您已经在这个地图上了', --点击传送
	['map204'] = '战斗状态，无法传送', --点击传送
	['map205'] = '等级不足，无法传送该地图场景', --点击传送
	['map206'] = '目标场景不可传送', --点击传送
	['map207'] = '当前场景不可传送', --点击传送
	['map208'] = '立即传送需要花费：%s元宝，是否确认传送？', --点击传送
	['map209'] = '您的角色等级不足，该地图尚未解封', 
	['map210'] = '<font color="#cc0000">您的角色等级不足【%s】，该地图尚未解封</font>', 
	['map211'] = '当前场景无法前往', 
	['map212'] = '元宝不足', 
	['map213'] = '徒步前往', 
	['map214'] = '<font color="#a0a0a0" size="14">%s：%s</font>', 
	['map215'] = '您已在附近了，无需传送', 
	['map216'] = '当前状态无法传送回城', 
	['map217'] = '继续传送', 
 
	['map218'] = "死亡状态，无法传送",
	['map219'] = "技能施放中，无法传送",
	['map220'] = "采集中，无法传送",
	['map221'] = "切换地图中，无法传送",
	['map222'] = "传送中，请稍后再试",
	['map223'] = "换线中，请稍后再试",
	['map224'] = "变身状态，无法传送",
	['map225'] = "打坐状态切换中，无法传送",
	['map226'] = "骑乘状态切换中，无法传送",

	-- 地图tips
	['map301'] = 'BOSS', 
	['map302'] = '普通BOSS', 
	['map303'] = '世界BOSS', 
	['map304'] = '副本BOSS', 
	['map305'] = '精英', 
	['map306'] = '小怪', 
	['map307'] = "下次刷新：", 
	['map308'] = "BOSS掉落：", 
	['map309'] = "精英掉落：", 


	-- 飞鞋tips
	['map401'] = '可传送至目标所在地\n（黄金VIP1免费传送）', 
	['map402'] = [[可传送至目标所在地（黄金VIP1免费传送）
剩余免费次数：<font color="#29cc00">%s</font>  %s
传送道具数量：<font color="#29cc00">%s</font>]] ,
	['map403'] = '（每小时恢复1次）', 

	['map501'] = '当前等级不足，无法传送', 
	['map502'] = '当前境界不足，无法传送', 
}
);