
local tb    = {
    partnercard_huzhu_tw = --护主2S-不动如山阵
    {
		enhance_final_damage_p={{{1,1},{2,1},{4,2},{10,4},{16,6},{20,10},{25,12},{30,16}}},
		skill_statetime={{{1,-1},{20,-1}}},
    },
    partnercard_huzhu_em = --护主2S-傲寒不灭体
    {
		enhance_final_damage_p={{{1,1},{2,1},{4,2},{10,4},{16,6},{20,10},{25,12},{30,16}}},
		skill_statetime={{{1,-1},{20,-1}}},
    },
    partnercard_huzhu_xy = --护主2S-踏月摘星步
    {
		enhance_final_damage_p={{{1,1},{2,1},{4,2},{10,4},{16,6},{20,10},{25,12},{30,16}}},
		skill_statetime={{{1,-1},{20,-1}}},
    },
    partnercard_huzhu_th = --护主2S-红鸾牵丝手
    {
		enhance_final_damage_p={{{1,1},{2,1},{4,2},{10,4},{16,6},{20,10},{25,12},{30,16}}},
		skill_statetime={{{1,-1},{20,-1}}},
    },
    partnercard_huzhu_wd = --护主2S-一川镇海诀
    {
		enhance_final_damage_p={{{1,1},{2,1},{4,2},{10,4},{16,6},{20,10},{25,12},{30,16}}},
		skill_statetime={{{1,-1},{20,-1}}},
    },
    partnercard_huzhu_tr = --护主2S-天火琉璃步
    {
		enhance_final_damage_p={{{1,1},{2,1},{4,2},{10,4},{16,6},{20,10},{25,12},{30,16}}},
		skill_statetime={{{1,-1},{20,-1}}},
    },
    partnercard_huzhu_sl = --护主2S-混元金刚体
    {
		enhance_final_damage_p={{{1,1},{2,1},{4,2},{10,4},{16,6},{20,10},{25,12},{30,16}}},
		skill_statetime={{{1,-1},{20,-1}}},
    },
    partnercard_huzhu_cy = --护主2S-流风回雪舞
    {
		enhance_final_damage_p={{{1,1},{2,1},{4,2},{10,4},{16,6},{20,10},{25,12},{30,16}}},
		skill_statetime={{{1,-1},{20,-1}}},
    },
    partnercard_huzhu_wudu = --护主2S-七巧玲珑步
    {
		enhance_final_damage_p={{{1,1},{2,1},{4,2},{10,4},{16,6},{20,10},{25,12},{30,16}}},
		skill_statetime={{{1,-1},{20,-1}}},
    },
    partnercard_huzhu_kl = --护主2S-搬山填海劲
    {
		enhance_final_damage_p={{{1,1},{2,1},{4,2},{10,4},{16,6},{20,10},{25,12},{30,16}}},
		skill_statetime={{{1,-1},{20,-1}}},
    },
    partnercard_huzhu_tm = --护主2S-天罗千机步
    {
		enhance_final_damage_p={{{1,1},{2,1},{4,2},{10,4},{16,6},{20,10},{25,12},{30,16}}},
		skill_statetime={{{1,-1},{20,-1}}},
    },
    partnercard_huzhu_gb = --护主2S-八荒炎龙劲
    {
		enhance_final_damage_p={{{1,1},{2,1},{4,2},{10,4},{16,6},{20,10},{25,12},{30,16}}},
		skill_statetime={{{1,-1},{20,-1}}},
    },
    partnercard_huzhu_tw2 = --护主2S-不动如山阵
    {
		defense_p={{{1,4},{2,8},{4,20},{10,28},{16,36},{20,52},{25,64},{30,80}}},
		skill_statetime={{{1,-1},{20,-1}}},
    },
    partnercard_huzhu_em2 = --护主2S-傲寒不灭体
    {
		weaken_deadlystrike_damage_p={{{1,4},{2,8},{4,12},{10,16},{16,24},{20,32},{25,40},{30,48}}},
		skill_statetime={{{1,-1},{20,-1}}},
    },
    partnercard_huzhu_xy2 = --护主2S-踏月摘星步
    {
		deadlystrike_p={{{1,4},{2,8},{4,20},{10,28},{16,36},{20,52},{25,64},{30,80}}},
		skill_statetime={{{1,-1},{20,-1}}},
    },
    partnercard_huzhu_th2 = --护主2S-红鸾牵丝手
    {
		ignore_defense_v={{{1,16},{2,64},{4,160},{10,240},{16,320},{20,416},{25,512},{30,640}}},
		skill_statetime={{{1,-1},{20,-1}}},
    },
    partnercard_3s_jin = --护主3S-浮屠鎏金体
    {
        energy_v={{{1,6},{2,24},{4,60},{10,90},{16,120},{20,156},{25,192},{30,240}}},
        add_seriesstate_time_v={{{1,4},{2,16},{4,40},{10,60},{16,80},{20,104},{25,128},{30,160}}},
        lifemax_v={{{1,120},{2,480},{4,1200},{10,1800},{16,2400},{20,3120},{25,3840},{30,4800}}},
        skill_statetime={{{1,-1},{20,-1}}},
    },
    partnercard_3s_mu = --护主3S-森罗万象步
    {
		strength_v={{{1,6},{2,24},{4,60},{10,90},{16,120},{20,156},{25,192},{30,240}}},
		resist_allseriesstate_time_v={{{1,4},{2,16},{4,40},{10,60},{16,80},{20,104},{25,128},{30,160}}},
		basic_damage_v={
			[1]={{1,6},{2,24},{4,60},{10,90},{16,120},{20,156},{25,192},{30,240}},
			[3]={{1,6},{2,24},{4,60},{10,90},{16,120},{20,156},{25,192},{30,240}}
			},
		skill_statetime={{{1,-1},{20,-1}}},
    },
    partnercard_3s_shui = --护主3S-瀚海无涯诀
    {
		vitality_v={{{1,6},{2,24},{4,60},{10,90},{16,120},{20,156},{25,192},{30,240}}},
		resist_allseriesstate_rate_v={{{1,4},{2,16},{4,40},{10,60},{16,80},{20,104},{25,128},{30,160}}},
		all_series_resist_v={{{1,3},{2,12},{4,30},{10,45},{16,60},{20,78},{25,96},{30,120}}},
		skill_statetime={{{1,-1},{20,-1}}},
    },
    partnercard_3s_huo = --护主3S-修罗焚狱劲
    {
		energy_v={{{1,6},{2,24},{4,60},{10,90},{16,120},{20,156},{25,192},{30,240}}},
		add_seriesstate_time_v={{{1,4},{2,16},{4,40},{10,60},{16,80},{20,104},{25,128},{30,160}}},
		lifemax_v={{{1,120},{2,480},{4,1200},{10,1800},{16,2400},{20,3120},{25,3840},{30,4800}}},
		skill_statetime={{{1,-1},{20,-1}}},
    },
    partnercard_3s_tu = --护主3S-至尊囚天手
    {
		dexterity_v={{{1,6},{2,24},{4,60},{10,90},{16,120},{20,156},{25,192},{30,240}}},
		add_seriesstate_rate_v={{{1,4},{2,16},{4,40},{10,60},{16,80},{20,104},{25,128},{30,160}}},
		deadlystrike_v={{{1,6},{2,24},{4,60},{10,90},{16,120},{20,156},{25,192},{30,240}}},
		skill_statetime={{{1,-1},{20,-1}}},
    },
}

FightSkill:AddMagicData(tb)