

module("AffixConfig", package.seeall)

local Affix = {
	{1, "生命", "base_hp|baseLife", 1, },
	{2, "物理攻击", "base_physical_attack|basePhyAtt", 1, },
	{3, "法术攻击", "base_magic_attack|baseMagAtt", 1, },
	{4, "物防", "base_physical_defend|basePhyDef", 1, },
	{5, "法防", "base_magic_defend|baseMagDef", 1, },
	{6, "统帅", "base_command", 2, },
	{7, "武力", "base_strength", 2, },
	{8, "智力", "base_intelligence", 2, },
	{9, "攻击", "base_general_attack|baseGenAtt", 1, },
	{10, "必防", "必防", 1, },
	{11, "生命", "生命", 3, },
	{12, "物攻", "", 3, },
	{13, "法攻", "", 3, },
	{14, "物防", "物防", 3, },
	{15, "法防", "法防", 3, },
	{16, "统帅", "统帅", 3, },
	{17, "武力", "武力", 3, },
	{18, "智力", "智力", 3, },
	{19, "攻击", "攻击", 3, },
	{20, "必防", "必防", 3, },
	{21, "命中率", "命中率", 3, },
	{22, "物理伤害", "物理伤害", 3, },
	{23, "法术伤害", "法术伤害", 3, },
	{24, "物理免伤", "物理免伤", 3, },
	{25, "法术免伤", "法术免伤", 3, },
	{26, "暴击率", "暴击率", 3, },
	{27, "格挡率", "格挡率", 3, },
	{28, "闪避率", "闪避率", 3, },
	{29, "最终伤害", "base_damage", 1, },
	{30, "最终免伤", "base_ignore_damage", 1, },
	{31, "属性1", "属性1", 1, },
	{32, "属性1", "属性1", 1, },
	{33, "属性1", "属性1", 1, },
	{34, "属性1", "属性1", 1, },
	{35, "属性1", "属性1", 1, },
	{36, "属性1", "属性1", 1, },
	{37, "属性1", "属性1", 1, },
	{38, "属性1", "属性1", 1, },
	{39, "属性1", "属性1", 1, },
	{40, "属性1", "属性1", 1, },
	{41, "属性1", "属性1", 1, },
	{42, "属性1", "属性1", 1, },
	{43, "属性1", "属性1", 1, },
	{44, "属性1", "属性1", 1, },
	{45, "属性1", "属性1", 1, },
	{46, "属性1", "属性1", 1, },
	{47, "属性1", "属性1", 1, },
	{48, "属性1", "属性1", 1, },
	{49, "初始怒气", "初始怒气", 1, },
	{50, "属性1", "属性1", 1, },
	{51, "最终生命", "最终生命", 1, },
	{52, "属性1", "属性1", 1, },
	{53, "属性1", "属性1", 1, },
	{54, "属性1", "属性1", 1, },
	{55, "属性1", "属性1", 1, },
	{56, "属性1", "属性1", 1, },
	{57, "属性1", "属性1", 1, },
	{58, "普通攻击伤害", "普通攻击伤害", 3, },
	{59, "普通攻击免伤", "普通攻击免伤", 3, },
	{60, "怒气攻击伤害", "怒气攻击伤害", 3, },
	{61, "怒气攻击免伤", "怒气攻击免伤", 3, },
	{62, "治疗率", "治疗率", 3, },
	{63, "被治疗率", "被治疗率", 3, },
	{64, "属性1", "属性1", 1, },
	{65, "属性1", "属性1", 1, },
	{66, "属性1", "属性1", 1, },
	{67, "破魏", "破魏", 3, },
	{68, "破蜀", "破蜀", 3, },
	{69, "破吴", "破吴", 3, },
	{70, "破群", "破群", 3, },
	{71, "抗魏", "抗魏", 3, },
	{72, "抗蜀", "抗蜀", 3, },
	{73, "抗吴", "抗吴", 3, },
	{74, "抗群", "抗群", 3, },
	{75, "暴击倍数", "暴击倍数", 3, },
	{76, "抗暴", "抗暴", 3, },
	{77, "破挡", "破挡", 3, },
	{78, "系统调整攻击倍率", "系统调整攻击倍率", 3, },
	{79, "系统调整防御倍率", "系统调整防御倍率", 3, },
	{80, "物理穿透", "物理穿透", 1, },
	{81, "法术穿透", "法术穿透", 1, },
	{82, "物理抗性", "物理抗性", 1, },
	{83, "法术抗性", "法术抗性", 1, },
	{84, "治疗值", "治疗值", 1, },
	{85, "被治疗值", "被治疗值", 1, },
	{86, "灼烧伤害", "灼烧伤害", 1, },
	{87, "中毒伤害", "中毒伤害", 1, },
	{88, "灼烧免伤", "灼烧免伤", 1, },
	{89, "中毒免伤", "中毒免伤", 1, },
}

--[[
	@des:	根据属性字段名称得到属性id
--]]
function getAffixIdByDesString( p_affixString )
	for k,v in pairs(Affix) do
		local names = string.split(v[3], "|")
		for i=1,#names do
			if(names[i] == p_affixString) then

				return tonumber(v[1])
			end
		end
	end
	return 0
end





