
StrConfig:Add(
{
	--物品装备
	['tips1'] = '需要等级：%s',
	['tips2'] = '职业限制：%s',
	['tips3'] = 'Ctrl+左键将物品发送至聊天窗口',
	['tips4'] = '出售物品',
	['tips5'] = '（%s个）%s银两',
	['tips6'] = '不可出售',
	['tips7'] = '冷却时间：%s秒',
	['tips8'] = '获取方式：',
	['tips11'] = '基础属性：',  --adder：houxudong date：2016/7/18  reason:装备tips二级标签
	['tips12'] = '神铸属性：',
	['tips13'] = '洗炼属性：',
	['tips14'] = '测试ID：',
	['tips15'] = '宝石属性：',
	['tips16'] = '套装属性：',
	['tips17'] = '神武属性：',
	['tips18'] = '新神铸属性：',
	['tips19'] = '戒指属性',
	['tips20'] = "套装属性",
	
	['tips9'] = "今日已使用<font color='#65c47e'>  %s/%s</font>",
	['tips10'] = "一生已使用<font color='#65c47e'>  %s/%s</font>",
	
	['tips50'] = "<font color='#e59607' size='16'>    银两获得途径</font><br/><img width='15' height='15' vspace='-2' src='img://resfile/icon/rulePoint.png'/><p><font size='14'>从日常活动,任务中获得</font></p><img width='15' height='15' vspace='-2' src='img://resfile/icon/rulePoint.png'/><p><font size='14'>从副本中获得</font></p>",
	
	--基础物品的奖励tips
	['tips100'] = '经验：%s',
	['tips101'] = '银两：%s',
	['tips102'] = '银两：%s',
	['tips103'] = '元宝：%s',
	['tips104'] = '绑元：%s',
	['tips105'] = '修为：%s',
	['tips106'] = '荣誉：%s',
	['tips107'] = '帮派贡献：%s',
	['tips108'] = '帮派活跃度：%s',
	['tips109'] = '境界经验：%s',
	['tips110'] = '弟子经验：%s',
	['tips111'] = '灵值：%s',
	['tips112'] = '帮派贡献值：%s',
	['tips113'] = '功勋：%s',
	['tips114'] = '积分：%s',
	['tips115'] = '精元：%s',


	--世界地图地域tips
	['tips200'] = '怪物等级：%s',
	['tips201'] = '普通小怪',
	['tips202'] = '%s级',
	['tips203'] = '%s (%s级)',
	['tips204'] = ' (可PK区域)',
	['tips205'] = ' (安全区域)',
	['tips206'] = '进入等级：%s级',
	['tips207'] = '%s[%s]',
	
	--buffTips
	['tips300'] = "时",
	["tips301"] = '分',
	['tips302'] = '秒',
	['tips303'] = '永久有效',
	['tips304'] = "<font color='#dcdcdc'>剩余时间：%s</font>",

	--队友头像tips
	['tips401'] = [[<font color='#d89743'>%s</font>
等级：<font color='#ffffff'>%s</font>
职业：<font color='#ffffff'>%s</font>
帮派：<font color='#ffffff'>%s</font>
位置：<font color='#ffffff'>%s线  %s</font>]],
	
	--怪物头像查看按钮tips
	['tips601'] = "无归属",
	['tips602'] = "最后一刀归属",
	['tips603'] = "伤害排名",
	['tips604'] = "第一刀归属",
	
	--技能Tips
	['tips701'] = "技能升级条件",
	['tips702'] = "技能开启条件",
	['tips703'] = "%s:%s（已达成）",
	['tips704'] = "%s:%s（未达成）",
	['tips705'] = "点击技能图标可打开技能升级界面",
	
	--时装
	['tips801'] = "时装武器",
	['tips802'] = "时装衣服",
	['tips803'] = "时装头",
	['tips804'] = "需求等级：无限制",
	['tips805'] = "职业限制：无限制",
	['tips806'] = "基础属性",
	['tips807'] = "%s（%s/%s）",
	['tips808'] = "3件：%s",
	['tips809'] = "剩余时间：%s小时%s分%s秒",

	-- 帮派仓库
	['tips901'] = "存入获得贡献： ",
	['tips902'] = "取出需要贡献值：",

	-- 灵兽印记
	['tips1101'] = "灵宝已满级",
	['tips1102'] = "灵宝经验：",
	['tips1103'] = "本级属性：",
	['tips1104'] = "下级属性：",
	['tips1105'] = "满级属性：",
	['tips1106'] = "Ctrl+鼠标左键发送至聊天框",
	['tips1107'] = "高级灵宝兑换材料，可通过寻宝获得",
	['tips1108'] = "(满级 %s)",

	-- 目标锁定按钮tips
	['tips1201'] = "点击解除锁定目标",
	['tips1202'] = "点击锁定目标",
	
	['tips1301'] = "%s（%s阶）",
	['tips1302'] = "阶战翼",
	['tips1303'] = "剩余时间:%s小时%s分%s秒",
	['tips1304'] = "已到期",
	['tips1305'] = "全身升星总等级达到",
	['tips1306'] = "(%s/%s)已激活",
	['tips1307'] = "(%s/%s)未激活",
	['tips1308'] = "激活属性：",
	['tips1309'] = "全身装备升级到%s级",
	['tips1310'] = "全身卓越属性数量",
	['tips1311'] = "双击直接使用，将附加属性添加至自身附加属性库内。",
	['tips1312'] = "可在[打造-附加]功能内进行查看。",
	['tips1313'] = "<font color='#e59607'>冷却时间：</font><font color='#00ff00'>%s</font>秒",
	['tips1314'] = "物品使用次数:%s/%s",
	['tips1315'] = "今日使用次数:%s/%s",
	['tips1316'] = "全身宝石总等级到%s级",
	['tips1317'] = "<font color='#ff6c00'>神铸  </font>",
	['tips1318'] = "·超越",
	['tips1319'] = "·无双",
	['tips1320'] = "·无双",
	['tips1321'] = "阶",
	['tips1322'] = "穿戴条件:<font color='#cc0000'>不可穿戴</font>",
	['tips1323'] = "不限制",
	['tips1324'] = "需要%s：%s",
	['tips1325'] = "灵兽等阶：%s",
	['tips1326'] = "灵兽坐骑等阶：%s",
	['tips1327'] = "坐骑等阶：%s",
	['tips1328'] = "强化",
	['tips1329'] = "升星",
	['tips1330'] = "未绑定",
	['tips1331'] = "已绑定",
	['tips1332'] = "（追%s）",
	['tips1333'] = "随机获得神铸属性",
	['tips1334'] = "随机获得%s条附加属性",
	['tips1335'] = "「空槽」 可附加 （通过打造-附加进行操作）",
	['tips1336'] = "未激活",
	['tips1337'] = "%s（%s/%s）           详情查看卓越套装界面",
	['tips1338'] = "%s件效果：",
	['tips1339'] = "%s（%s/%s）    稀有套装",
	['tips1340'] = "装备后属性对比：",
	['tips1341'] = "【神】",
	['tips1342'] = "套装升级+",
	
	['tips1343'] = "+%s",
	['tips1344'] = "<font color='#00ff00'>强化  +%s</font>",
	['tips1345'] = "灵阵等阶：%s",
	
	['tips1346'] = "骑战等阶：%s",
	['tips1347'] = "神灵等阶：%s",
	['tips1348'] = "需要%s：%s",
	['tips1349'] = "全身洗炼总等级到%s级",
	['tips1350'] = "", --穿戴中
	['tips1351'] = "", --未穿戴
	['tips1352'] = "装备评分：%s",
	['tips1353'] = "穿戴限制：%s",
	
	['tips1370'] = "装备%s",

	['tips1380'] = "达到%s级后激活",
	['tips1381'] = "%s级加成",
	
	['tips1382'] = "不限制",
	['tips1383'] = "一转",
	['tips1384'] = "二转",
	['tips1385'] = "三转",
	['tips1386'] = "四转",
	['tips1387'] = "五转",

	['tips1401'] = "%s件效果：增加基础属性%s%%",


	['tips1501'] = "一阶",
	['tips1502'] = "二阶",
	['tips1503'] = "三阶",
	['tips1504'] = "四阶",
	['tips1505'] = "五阶",
	['tips1506'] = "六阶",
	['tips1507'] = "七阶",
	['tips1508'] = "八阶",
	['tips1509'] = "九阶",
	['tips1510'] = "十阶",
	['tips1511'] = "十一阶",
	['tips1512'] = "十二阶",
	['tips1513'] = "十三阶",
	['tips1514'] = "十四阶",
	['tips1515'] = "十五阶",

	--1600~1799预留 从1600+一个数得来
	['tips1603'] = "坐骑等阶",
	['tips1608'] = "玉佩等阶",
	['tips1609'] = "宝甲等阶",
	['tips1610'] = "神兵等阶",
	['tips1611'] = "法宝等阶",
}
)