Lang = Lang or {}
Lang.GuildWelComeLang =
{
	[1] = "欢迎新人加入!",
	[2] = "欢迎加入我们的行会大家庭!",
	[3] = "新人入行会,大家热烈欢迎!",
	[4] = "新人入行会,掌声欢迎!",
	[5] = "兄弟们,王城一定是我们的!抢城抢钱抢女人!",
	[6] = "兄弟们,带上新人,抢怪抢经验去!谁敢拦我们?",
	[7] = "欢迎加入咱们行会,以后杀怪,抢BOSS,玩活动,过副本,大家就组起了!",
	[8] = "行会是我家,兴盛靠大家!大家要一起捐献金币,共同提升行会等级,共同享受行会属性!",
	[9] = "行会拥有仓库,可将你多余的装备或者物品放进去,供给其他玩家领取使用,互敬互爱!",
	[10] = "王城城主可在行会面板上随时领取相当丰厚的可交易的金币税收哦!",
	[11] = "王城城主可以领取超丰厚的元宝奖励啊!我们要占领王城！",
	--[12] = "掌门啊,副掌门，咱们啥时候去土城城主那里开启行会美女护送啊！我要经验升级！",
	[12] = "告诉大家哦：行会仓库可以让会长他们把好东西放进去,咱们兄弟姐妹谁需要了再去领",
	--[14] = "行会仓库在哪里？在王城皇宫里面!找行政官员就可以了",
	--[15] = "王城每天晚上20:15分会刷出王城守卫BOSS,掌门赶紧带领我们去打BOSS抢装备,顺便拿下王城!",
	--[16] = "大家听我说:据说报名攻城的行会,在攻城期间只要攻入王城皇宫内,每隔一段时间会获得经验奖励哦",
	--[17] = "荣誉神殿是一个传说!占领王城后可以开启荣誉神殿.在神殿可持续获得经验及荣誉奖励,还可以打荣誉将军获取奖励!",
	--[18] = "龙影坛据说有10个精英守卫镇守着,我也从来没打到第10波,后面还会不会有更强大的啊?",
	--[19] = "占领王城后,22:10分王城皇后会从王城自动出发至土城城主,安全护送至城主处,咱们可以获得大量行会资金和荣誉奖励",
}