

---@classdef record_dead_battle_info
local record_dead_battle_info = {}
  
record_dead_battle_info.id = 0 --id  
record_dead_battle_info.floor = 0 --层数  
record_dead_battle_info.monster_image = 0 --怪物形象  
record_dead_battle_info.name = "" --怪物名称  
record_dead_battle_info.name2 = "" --怪物姓名2  
record_dead_battle_info.success_directions = "" --过关条件描述  
record_dead_battle_info.talk = "" --气泡内对话  
record_dead_battle_info.sucesss_talk = "" --战斗胜利后描述  
record_dead_battle_info.fail_talk = "" --战斗失败后描述  
record_dead_battle_info.monster_id_1 = 0 --难度1怪物ID  
record_dead_battle_info.monster_fight_1 = 0 --难度1战斗力  
record_dead_battle_info.monster_id_2 = 0 --难度2怪物id  
record_dead_battle_info.monster_fight_2 = 0 --难度2战斗力  
record_dead_battle_info.monster_id_3 = 0 --难度3怪物id  
record_dead_battle_info.monster_fight_3 = 0 --难度3战斗力  
record_dead_battle_info.success_type = 0 --战斗胜利条件类型  
record_dead_battle_info.success_value = 0 --战斗胜利条件类型值  
record_dead_battle_info.coins_1 = 0 --难度1通关奖励（银币）  
record_dead_battle_info.tower_score_1 = 0 --难度1通关奖励（积分）  
record_dead_battle_info.coins_2 = 0 --难度2通关奖励（银币）  
record_dead_battle_info.tower_score_2 = 0 --难度2通关奖励（积分）  
record_dead_battle_info.coins_3 = 0 --难度3通关奖励（银币）  
record_dead_battle_info.tower_score_3 = 0 --难度3通关奖励（积分）  
record_dead_battle_info.group_id = 0 --关联奖励组id  
record_dead_battle_info.type_star_1 = 0 --第1档次奖励星数  
record_dead_battle_info.type_award_1 = 0 --第1档次奖励  
record_dead_battle_info.type_star_2 = 0 --第2档次奖励星数  
record_dead_battle_info.type_award_2 = 0 --第2档次奖励  
record_dead_battle_info.type_star_3 = 0 --第3档次奖励星数  
record_dead_battle_info.type_award_3 = 0 --第3档次奖励  
record_dead_battle_info.map_id = 0 --所属地图ID


dead_battle_info = {
   _data = {
    [1] = {1,1,14034,"第1关","潘凤","敌方全灭","想通过我这关，必须消灭我们所有人！","恭喜将军达成过关条件：消灭对方全体武将，胜利过关！","未能消灭对方全体武将，过关失败，请再接再厉！",3000,5160,3001,5848,3002,6536,0,0,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [2] = {2,2,11034,"第2关","王朗","敌方全灭","想通过我这关，必须消灭我们所有人！","恭喜将军达成过关条件：消灭对方全体武将，胜利过关！","未能消灭对方全体武将，过关失败，请再接再厉！",3003,11088,3004,13200,3005,15312,0,0,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [3] = {3,3,14039,"第3关","汉献帝","敌方全灭","想通过我这关，必须消灭我们所有人！","恭喜将军达成过关条件：消灭对方全体武将，胜利过关！","未能消灭对方全体武将，过关失败，请再接再厉！",3006,14256,3007,19450,3008,24755,0,0,2000,100,4000,200,6000,300,1,3,3,6,6,9,9,31001,},
    [4] = {4,4,11042,"第4关","辛宪英","在6回合内获胜","想要在6回合内击败我？没那么简单！","恭喜将军达成过关条件：六回合内全灭对方，胜利过关！","未能在六回合内全灭对方，过关失败，请再接再厉！",3009,18999,3010,25908,3011,35408,1,6,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [5] = {5,5,11025,"第5关","曹昂","在6回合内获胜","想要在6回合内击败我？没那么简单！","恭喜将军达成过关条件：六回合内全灭对方，胜利过关！","未能在六回合内全灭对方，过关失败，请再接再厉！",3012,25420,3013,37222,3014,60122,1,6,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [6] = {6,6,11014,"第6关","乐进","在6回合内获胜","想要在6回合内击败我？没那么简单！","恭喜将军达成过关条件：六回合内全灭对方，胜利过关！","未能在六回合内全灭对方，过关失败，请再接再厉！",3015,33339,3016,58713,3017,89300,1,6,2000,100,4000,200,6000,300,2,3,12,6,15,9,18,31001,},
    [7] = {7,7,14047,"第7关","霍峻","我方总血量高于50%","如果总生命值低于50%，你便输了！","恭喜将军达成过关条件：我方剩余血量高于总血量的50%，胜利过关！","我方剩余血量小于总血量的50%，过关失败，请再接再厉！",3018,38997,3019,72036,3020,118826,3,50,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [8] = {8,8,13033,"第8关","吴国太","我方总血量高于50%","如果总生命值低于50%，你便输了！","恭喜将军达成过关条件：我方剩余血量高于总血量的50%，胜利过关！","我方剩余血量小于总血量的50%，过关失败，请再接再厉！",3021,57103,3022,106739,3023,157571,3,50,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [9] = {9,9,13017,"第9关","徐盛","我方总血量高于50%","如果总生命值低于50%，你便输了！","恭喜将军达成过关条件：我方剩余血量高于总血量的50%，胜利过关！","我方剩余血量小于总血量的50%，过关失败，请再接再厉！",3024,74130,3025,139174,3026,225390,3,50,2000,100,4000,200,6000,300,3,3,21,6,24,9,27,31001,},
    [10] = {10,10,14045,"第10关","伊籍","我方死亡不超过2人","死亡超过2人，你便输了，准备好了吗！","恭喜将军达成过关条件：我方死亡人数不超过2人，胜利过关！","我方死亡人数超过2人，过关失败，请再接再厉！",3027,84340,3028,152295,3029,266871,2,2,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [11] = {11,11,12024,"第11关","鲍三娘","我方死亡不超过2人","死亡超过2人，你便输了，准备好了吗！","恭喜将军达成过关条件：我方死亡人数不超过2人，胜利过关！","我方死亡人数超过2人，过关失败，请再接再厉！",3030,115262,3031,206623,3032,381634,2,2,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [12] = {12,12,12007,"第12关","魏延","我方死亡不超过2人","死亡超过2人，你便输了，准备好了吗！","恭喜将军达成过关条件：我方死亡人数不超过2人，胜利过关！","我方死亡人数超过2人，过关失败，请再接再厉！",3033,142072,3034,268948,3035,495016,2,2,2000,100,4000,200,6000,300,4,3,30,6,33,9,36,31001,},
    [13] = {13,13,11034,"第13关","王朗","我方总血量高于70%","如果总生命值低于70%，你便输了！","恭喜将军达成过关条件：我方剩余血量高于总血量的70%，胜利过关！","我方剩余血量小于总血量的70%，过关失败，请再接再厉！",3036,149017,3037,320400,3038,573361,3,70,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [14] = {14,14,11020,"第14关","曹丕","我方总血量高于70%","如果总生命值低于70%，你便输了！","恭喜将军达成过关条件：我方剩余血量高于总血量的70%，胜利过关！","我方剩余血量小于总血量的70%，过关失败，请再接再厉！",3039,191665,3040,405123,3041,717263,3,70,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [15] = {15,15,11006,"第15关","张辽","我方总血量高于70%","如果总生命值低于70%，你便输了！","恭喜将军达成过关条件：我方剩余血量高于总血量的70%，胜利过关！","我方剩余血量小于总血量的70%，过关失败，请再接再厉！",3042,233869,3043,503255,3044,938842,3,70,2000,100,4000,200,6000,300,5,3,39,6,42,9,45,31001,},
    [16] = {16,16,13032,"第16关","诸葛恪","我方死亡不超过1人","死亡超过1人，你便输了，准备好了吗！","恭喜将军达成过关条件：我方死亡人数不超过1人，胜利过关！","我方死亡人数超过1人，过关失败，请再接再厉！",3045,249719,3046,562189,3047,973874,2,1,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [17] = {17,17,13010,"第17关","甘宁","我方死亡不超过1人","死亡超过1人，你便输了，准备好了吗！","恭喜将军达成过关条件：我方死亡人数不超过1人，胜利过关！","我方死亡人数超过1人，过关失败，请再接再厉！",3048,307371,3049,682535,3050,1241610,2,1,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [18] = {18,18,13012,"第18关","孙尚香","我方死亡不超过1人","死亡超过1人，你便输了，准备好了吗！","恭喜将军达成过关条件：我方死亡人数不超过1人，胜利过关！","我方死亡人数超过1人，过关失败，请再接再厉！",3051,399535,3052,871003,3053,1489518,2,1,2000,100,4000,200,6000,300,6,3,48,6,51,9,54,31001,},
    [19] = {19,19,12027,"第19关","廖化","在5回合内获胜","想要在5回合内击败我？没那么简单！","恭喜将军达成过关条件：五回合内全灭对方，胜利过关！","未能在五回合内全灭对方，过关失败，请再接再厉！",3054,412299,3055,883630,3056,1578185,1,5,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [20] = {20,20,12016,"第20关","徐庶","在5回合内获胜","想要在5回合内击败我？没那么简单！","恭喜将军达成过关条件：五回合内全灭对方，胜利过关！","未能在五回合内全灭对方，过关失败，请再接再厉！",3057,492509,3058,1050591,3059,1875628,1,5,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [21] = {21,21,12009,"第21关","诸葛亮","在5回合内获胜","想要在5回合内击败我？没那么简单！","恭喜将军达成过关条件：五回合内全灭对方，胜利过关！","未能在五回合内全灭对方，过关失败，请再接再厉！",3060,651203,3061,1372548,3062,2436107,1,5,2000,100,4000,200,6000,300,7,3,57,6,60,9,63,31001,},
    [22] = {22,22,14037,"第22关","伏皇后","我方全体存活","必须零伤亡击败我，才算你们胜利！","恭喜将军达成过关条件：零死亡全灭对方，胜利过关！","我方有武将死亡，未能全体存活，过关失败，请再接再厉！",3063,621206,3064,1292557,3065,2279042,2,0,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [23] = {23,23,14010,"第23关","高顺","我方全体存活","必须零伤亡击败我，才算你们胜利！","恭喜将军达成过关条件：零死亡全灭对方，胜利过关！","我方有武将死亡，未能全体存活，过关失败，请再接再厉！",3066,726449,3067,1585859,3068,2777711,2,0,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [24] = {24,24,14015,"第24关","卢植","我方全体存活","必须零伤亡击败我，才算你们胜利！","恭喜将军达成过关条件：零死亡全灭对方，胜利过关！","我方有武将死亡，未能全体存活，过关失败，请再接再厉！",3069,892794,3070,1837492,3071,3219923,2,0,2000,100,4000,200,6000,300,8,3,66,6,69,9,72,31001,},
    [25] = {25,25,13014,"第25关","小乔","我方总血量高于70%","如果总生命值低于70%，你便输了！","恭喜将军达成过关条件：我方剩余血量高于总血量的70%，胜利过关！","我方剩余血量小于总血量的70%，过关失败，请再接再厉！",3072,882417,3073,1802978,3074,3273467,3,70,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [26] = {26,26,13015,"第26关","周泰","我方总血量高于70%","如果总生命值低于70%，你便输了！","恭喜将军达成过关条件：我方剩余血量高于总血量的70%，胜利过关！","我方剩余血量小于总血量的70%，过关失败，请再接再厉！",3075,1021502,3076,2183105,3077,3795419,3,70,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [27] = {27,27,13007,"第27关","周瑜","我方总血量高于70%","如果总生命值低于70%，你便输了！","恭喜将军达成过关条件：我方剩余血量高于总血量的70%，胜利过关！","我方剩余血量小于总血量的70%，过关失败，请再接再厉！",3078,1300636,3079,2788603,3080,5061263,3,70,2000,100,4000,200,6000,300,9,3,75,6,78,9,81,31001,},
    [28] = {28,28,11003,"第28关","曹仁","在5回合内获胜","想要在5回合内击败我？没那么简单！","恭喜将军达成过关条件：五回合内全灭对方，胜利过关！","未能在五回合内全灭对方，过关失败，请再接再厉！",3081,1200417,3082,2524247,3083,4356260,1,5,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [29] = {29,29,11017,"第29关","典韦","在5回合内获胜","想要在5回合内击败我？没那么简单！","恭喜将军达成过关条件：五回合内全灭对方，胜利过关！","未能在五回合内全灭对方，过关失败，请再接再厉！",3084,1373906,3085,2889537,3086,5176129,1,5,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [30] = {30,30,11002,"第30关","曹操","在5回合内获胜","想要在5回合内击败我？没那么简单！","恭喜将军达成过关条件：五回合内全灭对方，胜利过关！","未能在五回合内全灭对方，过关失败，请再接再厉！",3087,1735886,3088,3667037,3089,6592805,1,5,2000,100,4000,200,6000,300,10,3,84,6,87,9,90,31001,},
    [31] = {31,31,14003,"第31关","左慈","我方总血量高于70%","如果总生命值低于70%，你便输了！","恭喜将军达成过关条件：我方剩余血量高于总血量的70%，胜利过关！","我方剩余血量小于总血量的70%，过关失败，请再接再厉！",3090,1582315,3091,3283824,3092,5837450,3,70,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [32] = {32,32,14013,"第32关","颜良","我方总血量高于70%","如果总生命值低于70%，你便输了！","恭喜将军达成过关条件：我方剩余血量高于总血量的70%，胜利过关！","我方剩余血量小于总血量的70%，过关失败，请再接再厉！",3093,1798006,3094,3733642,3095,6646776,3,70,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [33] = {33,33,14005,"第33关","吕布","我方总血量高于70%","如果总生命值低于70%，你便输了！","恭喜将军达成过关条件：我方剩余血量高于总血量的70%，胜利过关！","我方剩余血量小于总血量的70%，过关失败，请再接再厉！",3096,2258866,3097,4903274,3098,8707570,3,70,2000,100,4000,200,6000,300,11,3,93,6,96,9,99,31001,},
    [34] = {34,34,12013,"第34关","马良","在4回合内获胜","想要在4回合内击败我？没那么简单！","恭喜将军达成过关条件：四回合内全灭对方，胜利过关！","未能在四回合内全灭对方，过关失败，请再接再厉！",3099,2032915,3100,4177845,3101,7382722,1,4,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [35] = {35,35,12011,"第35关","法正","在4回合内获胜","想要在4回合内击败我？没那么简单！","恭喜将军达成过关条件：四回合内全灭对方，胜利过关！","未能在四回合内全灭对方，过关失败，请再接再厉！",3102,2294894,3103,4723589,3104,8623950,1,4,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [36] = {36,36,12003,"第36关","关羽","在4回合内获胜","想要在4回合内击败我？没那么简单！","恭喜将军达成过关条件：四回合内全灭对方，胜利过关！","未能在四回合内全灭对方，过关失败，请再接再厉！",3105,2626496,3106,5492866,3107,9609461,1,4,2000,100,4000,200,6000,300,12,3,102,6,105,9,108,31001,},
    [37] = {37,37,11019,"第37关","庞德","我方全体存活","必须零伤亡击败我，才算你们胜利！","恭喜将军达成过关条件：零死亡全灭对方，胜利过关！","我方有武将死亡，未能全体存活，过关失败，请再接再厉！",3108,2780973,3109,5617343,3110,10154338,2,0,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [38] = {38,38,11011,"第38关","司马懿","我方全体存活","必须零伤亡击败我，才算你们胜利！","恭喜将军达成过关条件：零死亡全灭对方，胜利过关！","我方有武将死亡，未能全体存活，过关失败，请再接再厉！",3111,3324477,3112,6253169,3113,11417608,2,0,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [39] = {39,39,11002,"第39关","曹操","我方全体存活","必须零伤亡击败我，才算你们胜利！","恭喜将军达成过关条件：零死亡全灭对方，胜利过关！","我方有武将死亡，未能全体存活，过关失败，请再接再厉！",3114,3936612,3115,7156538,3116,12783439,2,0,2000,100,4000,200,6000,300,13,3,111,6,114,9,117,31001,},
    [40] = {40,40,12012,"第40关","姜维","我方总血量高于70%","如果总生命值低于70%，你便输了！","恭喜将军达成过关条件：我方剩余血量高于总血量的70%，胜利过关！","我方剩余血量小于总血量的70%，过关失败，请再接再厉！",3117,4259594,3118,7832862,3119,13388923,3,70,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [41] = {41,41,12004,"第41关","张飞","我方总血量高于70%","如果总生命值低于70%，你便输了！","恭喜将军达成过关条件：我方剩余血量高于总血量的70%，胜利过关！","我方剩余血量小于总血量的70%，过关失败，请再接再厉！",3120,4953151,3121,9328729,3122,14800316,3,70,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [42] = {42,42,12009,"第42关","诸葛亮","我方总血量高于70%","如果总生命值低于70%，你便输了！","恭喜将军达成过关条件：我方剩余血量高于总血量的70%，胜利过关！","我方剩余血量小于总血量的70%，过关失败，请再接再厉！",3123,6114750,3124,11243097,3125,17660307,3,70,2000,100,4000,200,6000,300,14,3,120,6,123,9,126,31001,},
    [43] = {43,43,13012,"第43关","孙尚香","在4回合内获胜","想要在4回合内击败我？没那么简单！","恭喜将军达成过关条件：四回合内全灭对方，胜利过关！","未能在四回合内全灭对方，过关失败，请再接再厉！",3126,7225314,3127,12631307,3128,20475684,1,4,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [44] = {44,44,13004,"第44关","孙策","在4回合内获胜","想要在4回合内击败我？没那么简单！","恭喜将军达成过关条件：四回合内全灭对方，胜利过关！","未能在四回合内全灭对方，过关失败，请再接再厉！",3129,8235339,3130,14112367,3131,23591311,1,4,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [45] = {45,45,13007,"第45关","周瑜","在4回合内获胜","想要在4回合内击败我？没那么简单！","恭喜将军达成过关条件：四回合内全灭对方，胜利过关！","未能在四回合内全灭对方，过关失败，请再接再厉！",3132,9057035,3133,15482986,3134,27778950,1,4,2000,100,4000,200,6000,300,15,3,129,6,132,9,135,31001,},
    [46] = {46,46,14010,"第46关","高顺","我方总血量高于70%","如果总生命值低于70%，你便输了！","恭喜将军达成过关条件：我方剩余血量高于总血量的70%，胜利过关！","我方剩余血量小于总血量的70%，过关失败，请再接再厉！",3135,11068231,3136,17671378,3137,32920529,3,70,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [47] = {47,47,14015,"第47关","卢植","我方总血量高于70%","如果总生命值低于70%，你便输了！","恭喜将军达成过关条件：我方剩余血量高于总血量的70%，胜利过关！","我方剩余血量小于总血量的70%，过关失败，请再接再厉！",3138,12436002,3139,19754030,3140,37356011,3,70,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [48] = {48,48,14005,"第48关","吕布","我方总血量高于70%","如果总生命值低于70%，你便输了！","恭喜将军达成过关条件：我方剩余血量高于总血量的70%，胜利过关！","我方剩余血量小于总血量的70%，过关失败，请再接再厉！",3141,13914023,3142,22502309,3143,41857880,3,70,2000,100,4000,200,6000,300,16,3,138,6,141,9,144,31001,},
    [49] = {49,49,11003,"第49关","曹仁","在4回合内获胜","想要在4回合内击败我？没那么简单！","恭喜将军达成过关条件：四回合内全灭对方，胜利过关！","未能在四回合内全灭对方，过关失败，请再接再厉！",3144,15583705,3145,25202586,3146,46880825,1,4,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [50] = {50,50,110043,"第50关","夏侯惇","在4回合内获胜","想要在4回合内击败我？没那么简单！","恭喜将军达成过关条件：四回合内全灭对方，胜利过关！","未能在四回合内全灭对方，过关失败，请再接再厉！",3147,17453749,3148,28226896,3149,52506524,1,4,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [51] = {51,51,110063,"第51关","张辽","在4回合内获胜","想要在4回合内击败我？没那么简单！","恭喜将军达成过关条件：四回合内全灭对方，胜利过关！","未能在四回合内全灭对方，过关失败，请再接再厉！",3150,19548198,3151,31614123,3152,58807306,1,4,2000,100,4000,200,6000,300,17,3,147,6,150,9,153,31001,},
    [52] = {52,52,12004,"第52关","张飞","我方全体存活","必须零伤亡击败我，才算你们胜利！","恭喜将军达成过关条件：零死亡全灭对方，胜利过关！","我方有武将死亡，未能全体存活，过关失败，请再接再厉！",3153,21893981,3154,35407817,3155,65864182,2,0,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [53] = {53,53,120053,"第53关","马超","我方全体存活","必须零伤亡击败我，才算你们胜利！","恭喜将军达成过关条件：零死亡全灭对方，胜利过关！","我方有武将死亡，未能全体存活，过关失败，请再接再厉！",3156,24521258,3157,39656755,3158,73767883,2,0,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [54] = {54,54,120013,"第54关","赵云","我方全体存活","必须零伤亡击败我，才算你们胜利！","恭喜将军达成过关条件：零死亡全灭对方，胜利过关！","我方有武将死亡，未能全体存活，过关失败，请再接再厉！",3159,27463808,3160,44415565,3161,82620028,2,0,2000,100,4000,200,6000,300,18,3,156,6,159,9,162,31001,},
    [55] = {55,55,13001,"第55关","大乔","我方总血量高于70%","如果总生命值低于70%，你便输了！","恭喜将军达成过关条件：我方剩余血量高于总血量的70%，胜利过关！","我方剩余血量小于总血量的70%，过关失败，请再接再厉！",3162,30759464,3163,49745432,3164,92534431,3,70,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [56] = {56,56,13005,"第56关","孙权","我方总血量高于70%","如果总生命值低于70%，你便输了！","恭喜将军达成过关条件：我方剩余血量高于总血量的70%，胜利过关！","我方剩余血量小于总血量的70%，过关失败，请再接再厉！",3165,34450599,3166,55714883,3167,103638562,3,70,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [57] = {57,57,130083,"第57关","吕蒙","我方总血量高于70%","如果总生命值低于70%，你便输了！","恭喜将军达成过关条件：我方剩余血量高于总血量的70%，胜利过关！","我方剩余血量小于总血量的70%，过关失败，请再接再厉！",3168,38584670,3169,62400668,3170,116075189,3,70,2000,100,4000,200,6000,300,19,3,165,6,168,9,171,31001,},
    [58] = {58,58,14006,"第58关","袁绍","在4回合内获胜","想要在4回合内击败我？没那么简单！","恭喜将军达成过关条件：四回合内全灭对方，胜利过关！","未能在四回合内全灭对方，过关失败，请再接再厉！",3171,43214830,3172,69888748,3173,130004211,1,4,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [59] = {59,59,140153,"第59关","卢植","在4回合内获胜","想要在4回合内击败我？没那么简单！","恭喜将军达成过关条件：四回合内全灭对方，胜利过关！","未能在四回合内全灭对方，过关失败，请再接再厉！",3174,48400609,3175,78275397,3176,145604716,1,4,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [60] = {60,60,140193,"第60关","张角","在4回合内获胜","想要在4回合内击败我？没那么简单！","恭喜将军达成过关条件：四回合内全灭对方，胜利过关！","未能在四回合内全灭对方，过关失败，请再接再厉！",3177,54208682,3178,87668444,3179,163077281,1,4,2000,100,4000,200,6000,300,20,3,174,6,177,9,180,31001,},
    [61] = {61,61,110113,"第61关","司马懿","我方全体存活","必须零伤亡击败我，才算你们胜利！","恭喜将军达成过关条件：零死亡全灭对方，胜利过关！","我方有武将死亡，未能全体存活，过关失败，请再接再厉！",3180,60713723,3181,98188657,3182,182646554,2,0,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [62] = {62,62,110022,"第62关","曹操","我方全体存活","必须零伤亡击败我，才算你们胜利！","恭喜将军达成过关条件：零死亡全灭对方，胜利过关！","我方有武将死亡，未能全体存活，过关失败，请再接再厉！",3183,67999369,3184,109971295,3185,204564140,2,0,2000,100,4000,200,6000,300,0,3,0,6,0,9,0,31001,},
    [63] = {63,63,110072,"第63关","荀彧","我方全体存活","必须零伤亡击败我，才算你们胜利！","恭喜将军达成过关条件：零死亡全灭对方，胜利过关！","我方有武将死亡，未能全体存活，过关失败，请再接再厉！",3186,76159293,3187,123167850,3188,229111836,2,0,2000,100,4000,200,6000,300,21,3,183,6,186,9,189,31001,},
    }
}



local __index_id = {
    [1] = 1,
    [10] = 10,
    [11] = 11,
    [12] = 12,
    [13] = 13,
    [14] = 14,
    [15] = 15,
    [16] = 16,
    [17] = 17,
    [18] = 18,
    [19] = 19,
    [2] = 2,
    [20] = 20,
    [21] = 21,
    [22] = 22,
    [23] = 23,
    [24] = 24,
    [25] = 25,
    [26] = 26,
    [27] = 27,
    [28] = 28,
    [29] = 29,
    [3] = 3,
    [30] = 30,
    [31] = 31,
    [32] = 32,
    [33] = 33,
    [34] = 34,
    [35] = 35,
    [36] = 36,
    [37] = 37,
    [38] = 38,
    [39] = 39,
    [4] = 4,
    [40] = 40,
    [41] = 41,
    [42] = 42,
    [43] = 43,
    [44] = 44,
    [45] = 45,
    [46] = 46,
    [47] = 47,
    [48] = 48,
    [49] = 49,
    [5] = 5,
    [50] = 50,
    [51] = 51,
    [52] = 52,
    [53] = 53,
    [54] = 54,
    [55] = 55,
    [56] = 56,
    [57] = 57,
    [58] = 58,
    [59] = 59,
    [6] = 6,
    [60] = 60,
    [61] = 61,
    [62] = 62,
    [63] = 63,
    [7] = 7,
    [8] = 8,
    [9] = 9,

}

local __key_map = {
  id = 1,
  floor = 2,
  monster_image = 3,
  name = 4,
  name2 = 5,
  success_directions = 6,
  talk = 7,
  sucesss_talk = 8,
  fail_talk = 9,
  monster_id_1 = 10,
  monster_fight_1 = 11,
  monster_id_2 = 12,
  monster_fight_2 = 13,
  monster_id_3 = 14,
  monster_fight_3 = 15,
  success_type = 16,
  success_value = 17,
  coins_1 = 18,
  tower_score_1 = 19,
  coins_2 = 20,
  tower_score_2 = 21,
  coins_3 = 22,
  tower_score_3 = 23,
  group_id = 24,
  type_star_1 = 25,
  type_award_1 = 26,
  type_star_2 = 27,
  type_award_2 = 28,
  type_star_3 = 29,
  type_award_3 = 30,
  map_id = 31,

}



local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_dead_battle_info")
        
        
        return t._raw[__key_map[k]]
    end
}


function dead_battle_info.getLength()
    return #dead_battle_info._data
end



function dead_battle_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_dead_battle_info
function dead_battle_info.indexOf(index)
    if index == nil then
        return nil
    end
    
    return setmetatable({_raw = dead_battle_info._data[index]}, m)
    
end

---
--@return @class record_dead_battle_info
function dead_battle_info.get(id)
    
    return dead_battle_info.indexOf(__index_id[id])
        
end



function dead_battle_info.set(id, key, value)
    local record = dead_battle_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function dead_battle_info.get_index_data()
    return __index_id
end