local record_dungeon_chapter_info = {}

record_dungeon_chapter_info.id = 0 --章节ID
record_dungeon_chapter_info.name = "" --章节名称
record_dungeon_chapter_info.premise_id = 0 --前置章节
record_dungeon_chapter_info.level = 0 --等级限制
record_dungeon_chapter_info.star = 0 --章节总星数
record_dungeon_chapter_info.image = 0 --城池icon
record_dungeon_chapter_info.map = 0 --地图资源链接
record_dungeon_chapter_info.copperbox_star = 0 --铜宝箱所需星数
record_dungeon_chapter_info.silverbox_star = 0 --银宝箱所需星数
record_dungeon_chapter_info.goldbox_star = 0 --金宝箱所需星数
record_dungeon_chapter_info.copperbox_id = 0 --铜宝箱掉落库ID
record_dungeon_chapter_info.silverbox_id = 0 --银宝箱掉落库ID
record_dungeon_chapter_info.goldbox_id = 0 --金宝箱掉落库ID
record_dungeon_chapter_info.direction = "" --字幕描述
record_dungeon_chapter_info.story_id = 0 --武将传id


dungeon_chapter_info = {
	_data = {
	[1] = {1,"妖精世界",0,1,15,9,1,10,13,15,23000,23002,23003,"新手训练家，少年离开家乡展开旅程，劲敌成基友，旅行开始。",0,},
	[2] = {2,"海洋漂流",1,1,18,7,2,6,12,18,23001,23002,23003,"新手训练家，展开旅程，收货老司机——女少虫圭禾中子。",0,},
	[3] = {3,"洛阳之战",2,1,18,6,3,6,12,18,23004,23005,23006,"建安四年秋，十常侍祸乱汉室宫廷，少年奋发而起，单枪匹马，平定叛乱。",0,},
	[4] = {4,"力战虎牢关",3,1,24,3,4,8,16,24,23004,23005,23006,"建安四年冬，少年过虎牢关，顷刻间胜华雄，解十八路诸侯之危，誉满天下。",0,},
	[5] = {5,"火烧洛阳",4,1,30,5,13,10,20,30,23007,23008,23009,"建安五年春，少年入洛阳，逢江东孙坚，大战三百合而胜之，英气逼人。",0,},
	[6] = {6,"诸侯攻长安",5,1,30,8,9,10,20,30,23007,23008,23009,"建安五年夏，少年挑战袁氏，轻取袁术，再胜袁绍，意气风发。",0,},
	[7] = {7,"襄阳战刘表",6,1,30,5,6,10,20,30,23010,23011,23012,"建安五年秋，少年匹马入荆州，胜黄祖刘表荆州群雄，威震荆襄九郡。",0,},
	[8] = {8,"大闹凤仪亭",7,1,30,7,7,10,20,30,23010,23011,23012,"建安五年冬，少年再入长安，挑战天下第一英雄吕布，见天下第一美人貂蝉。",1,},
	[9] = {9,"讨伐董卓上",8,1,30,8,12,10,20,30,23013,23014,23015,"建安六年春，少年应群雄邀请，征伐董卓，连战皆胜，锋芒直指长安。",2,},
	[10] = {10,"讨伐董卓下",9,1,30,8,12,10,20,30,23013,23014,23015,"建安六年夏，少年锐不可当，败李傕郭汜，挑董卓于马下，普天同庆。",3,},
	[11] = {11,"徐州之战上",10,1,30,5,13,10,20,30,23016,23017,23018,"建安六年秋，曹操攻徐州，少年助陶谦守城，比武胜陶谦诸将，众人惊叹。",4,},
	[12] = {12,"徐州之战中",11,1,30,5,13,10,20,30,23016,23017,23018,"建安六年冬，少年与孔融、田楷、太史慈援军比武多次获胜，获得无数赞誉。",5,},
	[13] = {13,"徐州之战下",12,1,30,5,13,10,20,30,23019,23020,23021,"建安七年春，少年力挽狂澜，于徐州大败夏侯惇典韦诸猛将，徐州之围顺势而解。",6,},
	[14] = {14,"帝临许都上",13,1,30,8,9,10,20,30,23019,23020,23021,"建安七年夏，中原乱起，少年再入中原，击退李傕郭汜叛军，救大汉天子平安。",7,},
	[15] = {15,"帝临许都中",14,1,30,8,9,10,20,30,23022,23023,23024,"建安七年秋，少年护送大汉天子前往许都，期间结识杨奉、徐晃等人，成为好友。",8,},
	[16] = {16,"帝临许都下",15,1,30,8,9,10,20,30,23022,23023,23024,"建安七年冬，少年与曹操约战于洛阳，苦战而胜曹操，佩服曹操之志向，将天子相托。",9,},
	[17] = {17,"战宛城",16,1,30,3,11,10,20,30,23025,23026,23027,"建安八年春，少年前往宛城，挑战北地枪王张绣，连战数场，枪王认少年为知己。",10,},
	[18] = {18,"水淹下邳上",17,1,30,2,10,10,20,30,23025,23026,23027,"建安八年夏，吕布作乱下邳，少年往约战之，连战皆胜，锐不可当。",11,},
	[19] = {19,"水淹下邳下",18,1,30,2,10,10,20,30,23028,23029,23030,"建安八年秋，少年用郭嘉之计，水淹下邳，擒获吕布，送天下第一英雄末路。",12,},
	[20] = {20,"青梅煮酒",19,1,30,7,7,10,20,30,23028,23029,23030,"建安八年冬，曹操刘备青梅煮酒，论天下英雄，少年挑战刘备，刘备自叹不如。",13,},
	[21] = {21,"刘备脱困上",20,1,30,5,6,10,20,30,23031,23032,23033,"建安九年春，少年助刘备脱逃，期间败郭嘉、程昱，曹操怒而追击。",14,},
	[22] = {22,"刘备脱困下",21,1,30,5,6,10,20,30,23031,23032,23033,"建安九年夏，少年败许褚、车胄，智斗荀彧，成功助刘备脱逃，被刘备赞为少年豪杰。",15,},
	[23] = {23,"袁术之死",22,1,30,9,5,10,20,30,23034,23035,23036,"建安九年秋，袁术兵犯徐州，少年斩杀纪灵，击败袁术，袁术恼羞成怒吐血而亡。",16,},
	[24] = {24,"黎阳之战上",23,1,30,2,11,10,20,30,23034,23035,23036,"建安九年冬，少年挑战袁绍、曹操两军豪杰，击败袁军荀谌、陈琳，袁军惶恐。",17,},
	[25] = {25,"黎阳之战下",24,1,30,2,11,10,20,30,23037,23038,23039,"建安十年春，少年入曹营战李典、曹仁，曹军溃散，天下震惊。",18,},
	[26] = {26,"小沛之战",25,1,30,1,14,10,20,30,23037,23038,23039,"建安十年夏，少年助刘备守小沛，对战曹军大将，先后击败夏侯惇、张辽，曹军胆寒。",19,},
	[27] = {27,"白马之围上",26,1,30,2,11,10,20,30,23040,23041,23042,"建安十年秋，少年助关羽大战袁军，先后斩杀颜良、文丑两员袁绍大将，威震天下。",20,},
	[28] = {28,"白马之围下",27,1,30,2,11,10,20,30,23040,23041,23042,"建安十年冬，少年欲救出关羽，先后打败魏续、徐晃，使曹军几近溃散。",21,},
	[29] = {29,"过五关上",28,1,30,3,13,10,20,30,23043,23044,23045,"建安十一年春，少年同关羽逃离曹营，期间杀卞喜、韩福，并助关羽收服廖化。",22,},
	[30] = {30,"过五关下",29,1,30,3,13,10,20,30,23043,23044,23045,"建安十一年夏，历经艰险少年与关羽逃离曹营，两人心心相惜，相互约战，天地风云变色。",23,},
	[31] = {31,"古城相聚",30,1,30,6,8,10,20,30,23046,23047,23048,"建安十一年秋，少年协关羽成功与刘备汇合，并挑战赵云，一番龙争虎斗，惹来群雄相顾。",24,},
	[32] = {32,"孙策之死",31,1,30,9,5,10,20,30,23046,23047,23048,"建安十一年冬，少年前往江东见孙策，遭遇神秘道人于吉行刺孙策，少年大展神威，击退于吉。",25,},
	[33] = {33,"掌控江东上",32,1,30,2,14,10,20,30,23049,23050,23051,"建安十二年春，孙策伤重去世，江东局势混乱，少年挑战张昭、周瑜，并助周瑜整顿江东。",26,},
	[34] = {34,"掌控江东下",33,1,30,2,14,10,20,30,23049,23050,23051,"建安十二年夏，少年智斗顾雍、诸葛瑾、鲁肃，挑战孙权，并助孙权掌控江东。",27,},
	[35] = {35,"官渡之战上",34,1,30,9,12,10,20,30,23052,23053,23054,"建安十二年秋，袁绍与曹操双方大军官渡大战，少年入曹营战许攸、曹操，使曹操怒火冲天",28,},
	[36] = {36,"官渡之战中",35,1,30,9,12,10,20,30,23052,23053,23054,"建安十二年冬，少年与曹操和好，并挑战袁绍大军，先后败高览、田丰、沮授等数员大将。",29,},
	[37] = {37,"官渡之战下",36,1,30,9,12,10,20,30,23055,23056,23057,"建安十三年春，少年败袁绍与官渡，救曹操与危难之中，曹操赞其天下神骏尽归少年。",30,},
	[38] = {38,"水淹冀州上",37,1,30,2,10,10,20,30,23055,23056,23057,"建安十三年夏，少年入河北，战袁绍大将郭图、辛评，败袁绍长子袁谭，袁军气势低迷。",31,},
	[39] = {39,"水淹冀州中",38,1,30,2,10,10,20,30,23058,23059,23060,"建安十三年秋，少年败谋士逢纪、大将审配，战袁绍继承人袁尚，使其惊惧溃逃。",32,},
	[40] = {40,"水淹冀州下",39,1,30,2,10,10,20,30,23058,23059,23060,"建安十三年冬，曹操率军进攻袁绍残军，少年挑战张辽、陈琳，曹丕，并结识甄姬。",33,},
	[41] = {41,"马跃檀溪上",40,1,30,9,6,10,20,30,23061,23062,23063,"建安十四年春，江夏叛乱，少年助刘备斩杀张武、陈孙，平息叛乱。刘备感恩戴德。",34,},
	[42] = {42,"马跃檀溪中",41,1,30,9,6,10,20,30,23061,23062,23063,"建安十四年夏，刘备送千里马的卢给刘表，遭蔡夫人与其子刘琮诬陷，少年出面调解矛盾。",35,},
	[43] = {43,"马跃檀溪下",42,1,30,9,6,10,20,30,23064,23065,23066,"建安十四年秋，蔡夫人与其弟蔡瑁伏兵刺杀刘备，少年大展雄威，斩杀敌军，救出刘备。",36,},
	[44] = {44,"凤雏卧龙",43,1,30,4,7,10,20,30,23064,23065,23066,"建安十四年冬，少年与水镜先生论天下英雄，听闻凤雏卧龙，心生向往，决心前往挑战。",37,},
	[45] = {45,"新野之战",44,1,30,5,11,10,20,30,23067,23068,23069,"建安十五年春，曹军进攻新野，少年单挑李典、曹仁，连战皆胜，曹军惊惧溃逃。",38,},
	[46] = {46,"三顾茅庐",45,1,30,4,7,10,20,30,23067,23068,23069,"建安十五年夏，少年与刘备三顾茅庐，结识卧龙孔明，三人彻夜长谈，相互引为知己。",39,},
	[47] = {47,"讨伐黄祖上",46,1,30,2,10,10,20,30,23070,23071,23072,"建安十五年秋，少年入江东，逢吕蒙、黄祖大战，少年大展神威，击败黄祖，救出吕蒙。",40,},
	[48] = {48,"讨伐黄祖下",47,1,30,2,10,10,20,30,23070,23071,23072,"建安十五年秋，少年与孙策相会，劝其接收降将甘宁，并出手击杀黄祖，使孙策得报杀父大仇。",41,},
	[49] = {49,"上屋抽梯",48,1,30,1,14,10,20,30,23073,23074,23075,"建安十五年冬，蔡夫人欲杀刘表长子刘琦，少年助刘琦设计诸葛亮，上屋抽梯，逼其出计救人。",42,},
	[50] = {50,"火烧博望坡",49,1,30,6,13,10,20,30,23073,23074,23075,"建安十六年春，曹军再攻新野，少年用诸葛亮之计，单挑夏侯惇，火烧博望坡，曹军溃逃千里。",43,},
	[51] = {51,"曹操斩孔融",50,1,30,8,9,10,20,30,23076,23077,23078,"建安十六年夏，少年入曹营探听消息，逢曹操欲杀孔融，少年大展雄姿击败曹操，曹操胆寒而退。",44,},
	[52] = {52,"刘表之死",51,1,30,6,8,10,20,30,23076,23077,23078,"建安十六年秋，刘表病亡，蔡瑁篡改遗嘱让刘琮继位，少年大展神威击退蔡瑁，获得刘琦感激。",45,},
	[53] = {53,"攻占荆州上",52,1,30,3,12,10,20,30,23079,23080,23081,"建安十六年冬，曹操率大军进攻荆州，少年锐不可当，击溃曹军，掩护刘备与百姓逃亡。",46,},
	[54] = {54,"攻占荆州中",53,1,30,3,12,10,20,30,23079,23080,23081,"建安十七年春，少年雄姿勃发，战曹洪、许褚，并用诸葛亮之计火烧新野，烧得曹军惊惧溃逃。",47,},
	[55] = {55,"攻占荆州下",54,1,30,3,12,10,20,30,23082,23083,23084,"建安十七年夏，荆州投降，于禁奉曹操之令杀蔡夫人与刘琮，少年与于禁大战，将其击退。",48,},
	[56] = {56,"七进七出上",55,1,30,5,13,10,20,30,23082,23083,23084,"建安十七年秋，数十万曹军围追刘备，少年孤军深入，斩杀曹军，救出简雍、糜竺与刘备。",49,},
	[57] = {57,"七进七出中",56,1,30,5,13,10,20,30,23085,23086,23087,"建安十七年冬，刘备妻儿失陷曹营，少年大战雄威，再入曹军，救出赵云与刘禅，赵云感激万分。",50,},
	[58] = {58,"七进七出下",57,1,30,5,13,10,20,30,23085,23086,23087,"建安十八年春，面对曹军围攻，少年怡然不惧，斩夏侯恩、钟绅、败大将张郃，最终成功脱围。",51,},
	[59] = {59,"大闹长坂坡",58,1,30,9,11,10,20,30,23088,23089,23090,"建安十八年夏，曹军步步紧逼，少年长坂坡一声怒吼，吓得曹军止步，成功掩护张飞、刘备撤退。",52,},
	[60] = {60,"舌战群儒上",59,1,30,1,14,10,20,30,23088,23089,23090,"建安十八年秋，曹操实力强大，鲁肃密约刘备以图联合，少年与诸葛亮出使江东，以期共抗曹军。",53,},
	[61] = {61,"舌战群儒下",60,1,30,1,14,10,20,30,23091,23092,23093,"建安十八年冬，江东群儒围攻少年，少年与诸葛亮二人舌战群儒，最终说服孙权，达成联合。",54,},
	[62] = {62,"铜雀锁二乔",61,1,30,8,9,10,20,30,23091,23092,23093,"建安十九年春，少年与诸葛亮设计，以铜雀锁二乔之预激怒周瑜，使其加入抗曹大业。",55,},
	[63] = {63,"蒋干盗书上",62,1,30,5,5,10,20,30,23094,23095,23096,"建安十九年夏，曹军进攻江东，蒋干奉命出使江东，少年智谋卓越，巧设反间计，骗蒋干盗书。",56,},
	[64] = {64,"蒋干盗书下",63,1,30,5,5,10,20,30,23094,23095,23096,"建安十九年秋，曹操中反间计，杀水军统领蔡瑁、张允，少年与周瑜趁机进攻，大败曹军。",57,},
	[65] = {65,"草船借箭",64,1,30,2,6,10,20,30,23097,23098,23099,"建安十九年冬，江东缺箭，少年巧设计谋，船竖草人进攻曹军，骗得曹军射击，轻易得到十万箭支。",58,},
	[66] = {66,"苦肉计上",65,1,30,1,14,10,20,30,23097,23098,23099,"建安二十年春，少年夜入曹营，败蔡中、蔡和、识破荀攸、曹操诡计。",59,},
	[67] = {67,"苦肉计下",66,1,30,1,14,10,20,30,23100,23101,23102,"建安二十年春，周瑜施展苦肉计，少年慧眼识破，协助黄盖骗曹操。",60,},
	[68] = {68,"火烧赤壁上",67,1,30,9,12,10,20,30,23100,23101,23102,"建安二十年夏，少年巧设连环计，骗蒋干引荐庞统，再让庞统骗曹操以铁链锁船。",61,},
	[69] = {69,"火烧赤壁中",68,1,30,9,12,10,20,30,23103,23104,23105,"建安二十年秋，曹操宴请群臣，少年孤军深入，战程昱、败文聘，曹操胆寒溃逃。",62,},
	[70] = {70,"火烧赤壁下",69,1,30,9,12,10,20,30,23103,23104,23105,"建安二十年冬，少年助诸葛亮施法借东风，火烧赤壁曹军死伤惨重，孙刘联手大败曹操。",63,},
	[71] = {71,"华容道上",70,1,30,2,6,10,20,30,23106,23107,23108,"建安二十一年春，曹操大败，少年与东吴各将一路追击，曹操与残军狼狈奔逃。",64,},
	[72] = {72,"华容道中",71,1,30,2,6,10,20,30,23106,23107,23108,"建安二十一年春，关羽自请出战被诸葛亮拒绝，少年作保，携手关羽追杀曹操。",65,},
	[73] = {73,"华容道下",72,1,30,2,6,10,20,30,23109,23110,23111,"建安二十一年春，少年拦截曹操，曹操哭诉旧情，感动关羽，最终在关羽坚持下释放曹操。",66,},
	[74] = {74,"南郡之战上",73,1,30,6,8,10,20,30,23109,23110,23111,"建安二十一年夏，周瑜鲁肃会刘备，相互唇枪舌剑，最终少年作证，相互攻打南郡。",67,},
	[75] = {75,"南郡之战中",74,1,30,6,8,10,20,30,23112,23113,23114,"建安二十一年夏，周瑜率军攻打南郡，误中曹仁埋伏，危机关头，为少年救出，周瑜羞愧难当。",68,},
	[76] = {76,"南郡之战下",75,1,30,6,8,10,20,30,23112,23113,23114,"建安二十一年夏，周瑜假死骗曹仁，少年鹤蚌相争渔翁得利，携手刘备攻下南郡。",69,},
	[77] = {77,"荆南四郡上",76,1,30,8,11,10,20,30,23115,23116,23117,"建安二十一年秋，少年大展神威，助刘备军攻下零陵，太守刘度惊恐投降，归附刘备。",70,},
	[78] = {78,"荆南四郡中",77,1,30,8,11,10,20,30,23115,23116,23117,"建安二十一年秋，少年锐不可当，助赵云攻占贵阳，帮张飞打下武陵，神勇无敌，众将拜服。",71,},
	[79] = {79,"荆南四郡下",78,1,30,8,11,10,20,30,23118,23119,23120,"建安二十一年秋，少年战黄忠，杀韩玄，助关羽攻占长沙。",72,},
	[80] = {80,"兵败合肥",79,1,30,5,13,10,20,30,23118,23119,23120,"建安二十一年冬，孙权误中张辽奸计， 兵败合淝，危机关头少年出手，万军之中救下孙权。",73,},
	[81] = {81,"讨荆州",80,1,30,8,9,10,20,30,23121,23122,23123,"建安二十二年春，刘琦病逝，鲁肃讨荆州，少年与诸葛亮联手忽悠鲁肃，让其无功而回。",74,},
	[82] = {82,"锦囊妙计",81,1,30,9,6,10,20,30,23121,23122,23123,"建安二十二年夏，周瑜设计向刘备说亲，诸葛亮识破奸计，少年出面护刘备入东吴。",75,},
	[83] = {83,"刘备娶亲上",82,1,30,7,7,10,20,30,23124,23125,23126,"建安二十二年秋，少年与刘备入东吴，大张旗鼓说招亲，巧计破奸计。让孙权尴尬之极。",76,},
	[84] = {84,"刘备娶亲中",83,1,30,7,7,10,20,30,23124,23125,23126,"建安二十二年秋，吴国太甘露寺宴请刘备，少年巧破孙权伏军，助刘备入住国太府。",77,},
	[85] = {85,"刘备娶亲下",84,1,30,7,7,10,20,30,23127,23128,23129,"建安二十二年秋，少年神威大发，击败孙权周瑜追军，助刘备孙尚香逃回荆州。",78,},
	[86] = {86,"大宴铜雀台",85,1,30,1,14,10,20,30,23127,23128,23129,"建安二十二年冬，少年与曹操同宴铜雀台，与曹植对诗，与曹休对战，获众将赞誉。",79,},
	[87] = {87,"周瑜之死上",86,1,30,3,12,10,20,30,23130,23131,23132,"建安二十三年春，鲁肃再讨荆州，少年巧言驳鲁肃，助刘备破除周瑜奸计。刘备感激不尽。",80,},
	[88] = {88,"周瑜之死下",87,1,30,3,12,10,20,30,23130,23131,23132,"建安二十三年春，少年英勇无畏，诱周瑜入刘备陷阱，东吴军大败而归，周瑜吐血归天。",81,},
	[89] = {89,"凤雏庞统",88,1,30,2,6,10,20,30,23133,23134,23135,"建安二十三年春，少年孤身入东吴，与庞统重逢，招凤雏入刘备帐下。从此凤雏卧龙是一家。",82,},
	[90] = {90,"马腾之死上",89,1,30,8,9,10,20,30,23133,23134,23135,"建安二十四年夏，少年入西凉，与马腾一见如故称兄弟，随马腾同入许昌会曹操。",83,},
	[91] = {91,"马腾之死下",90,1,30,8,9,10,20,30,23136,23137,23138,"建安二十四年夏，曹操出兵攻马腾，少年浴血厮杀敌万军，最终成功脱围。",84,},
	[92] = {92,"渭水之战上",91,1,30,5,12,10,20,30,23136,23137,23138,"建安二十四年秋，少年助马超杀曹操，施巧计战钟繇，攻破长安。马超敬佩万分。",85,},
	[93] = {93,"渭水之战中",92,1,30,5,12,10,20,30,23139,23140,23141,"建安二十四年秋，少年巧施激将计，激怒魏将曹洪出关迎战，轻松将其击溃，助马超取得潼关。",86,},
	[94] = {94,"渭水之战下",93,1,30,5,12,10,20,30,23139,23140,23141,"建安二十四年秋，曹操施反间计，诱马超与韩遂反目，少年屡劝马超不听，最终离其而去。",87,},
	[95] = {95,"张松献图上",94,1,30,3,13,10,20,30,23142,23143,23144,"建安二十四年冬，少年与益州牧刘璋结识，适逢张鲁攻益州，少年帮其向曹操说合，攻打汉中",88,},
	[96] = {96,"张松献图中",95,1,30,3,13,10,20,30,23142,23143,23144,"建安二十四年冬，张松见曹操，遭杨修、曹操为难，少年劝其找刘备帮忙，张松感激不尽。",89,},
	[97] = {97,"张松献图下",96,1,30,3,13,10,20,30,23145,23146,23147,"建安二十四年冬，少年劝刘备攻西川，并引荐张松，受刘备仁德感染，张松献图献策。",90,},
	[98] = {98,"刘备入川上",97,1,30,6,11,10,20,30,23145,23146,23147,"建安二十五年春，少年与张松做内应，最终说服刘璋，让其不顾众臣反对，迎刘备入川。",91,},
	[99] = {99,"刘备入川下",98,1,30,6,11,10,20,30,23148,23149,23150,"建安二十五年春，刘备入益州，刘璋盛情接待，双方部将暗中交手，少年从中凯旋，化解危机。",92,},
	[100] = {100,"截江夺斗",99,1,30,2,10,10,20,30,23148,23149,23150,"建安二十五年夏，孙权设计，骗孙尚香带阿斗回江东，少年大展神威，击溃江东军，夺回阿斗。",93,},
	[101] = {101,"迁都建业",100,1,30,5,11,10,20,30,23151,23152,23153,"建安二十五年秋，少年入江东，发现孙权迁都建业，于是协助吕蒙在濡须修建城池，以保孙刘联合。",94,},
	[102] = {102,"荀彧之死",101,1,30,8,9,10,20,30,23151,23152,23153,"建安二十五年冬，少年入曹营，发现曹操欲封魏王，荀彧阻止不果服毒自尽，少年为其惋惜。",95,},
	[103] = {103,"濡须之战",102,1,30,4,6,10,20,30,23154,23155,23156,"建安二十六年春，曹操攻建业，孙权阻曹兵与濡须，少年大展神威，助孙权击退曹兵。",96,},
	[104] = {104,"攻占涪水关",103,1,30,3,12,10,20,30,23154,23155,23156,"建安二十六年夏，刘备借兵不果，与刘璋决裂，刘璋手下行刺刘备，少年击杀刺客，助刘备夺取涪水关",97,},
	[105] = {105,"黄魏争功上",104,1,30,6,13,10,20,30,23157,23158,23159,"建安二十六年秋，刘璋派人守雒城，黄忠、魏延争相出战，少年受刘备之邀，协助二人攻城。",98,},
	[106] = {106,"黄魏争功下",105,1,30,6,13,10,20,30,23157,23158,23159,"建安二十六年冬，魏延贪功冒进，遭冷苞埋伏袭击，少年大展神威，擒拿冷苞，救出彭羕。",99,},
	[107] = {107,"庞统之死",106,1,30,2,10,10,20,30,23160,23161,23162,"建安二十七年春，刘备率军攻雒城，遭张任设伏，战乱中庞统战死，少年大展神威，救出刘备。",100,},
	[108] = {108,"攻打雒城上",107,1,30,5,11,10,20,30,23160,23161,23162,"建安二十七年夏，诸葛亮与张飞兵分二路增援刘备，少年机智过人，协助张飞攻下巴郡，降服守将严颜。",101,},
	[109] = {109,"攻打雒城下",108,1,30,5,11,10,20,30,23163,23164,23165,"建安二十七年秋，少年大展神威，危机之中救出刘备，并大施巧计诱敌深入，擒拿张任，攻陷雒城。",102,},
	[110] = {110,"刘璋求援",109,1,30,1,8,10,20,30,23163,23164,23165,"建安二十七年冬，少年潜入成都，探听刘璋求援张鲁之机密，决心尾随信使前往汉中，破坏求援。",103,},
	[111] = {111,"马超来援上",110,1,30,4,6,10,20,30,23166,23167,23168,"建安二十八年春，少年前往汉中，路途遇马超，协助他攻下翼城，并在曹军围攻时救其性命。",104,},
	[112] = {112,"马超来援下",111,1,30,4,6,10,20,30,23166,23167,23168,"建安二十八年夏，少年入汉中，发现马超归附张鲁，张鲁派其攻打刘备，决定设计招降马超。",105,},
	[113] = {113,"智降马超上",112,1,30,6,12,10,20,30,23169,23170,23171,"建安二十八年秋，少年回雒城，大展神威败李严，占绵竹，受刘备委托，暗助张飞战马超。",106,},
	[114] = {114,"智降马超中",113,1,30,6,12,10,20,30,23169,23170,23171,"建安二十八年冬，张飞鲁莽，先遭马岱围攻，后被马超击败，少年武功盖世，败马岱退马超，二救张飞。",107,},
	[115] = {115,"智降马超下",114,1,30,6,12,10,20,30,23172,23173,23174,"建安二十九年春，少年聪慧无双，与诸葛亮设计买通杨松，向张鲁诬陷马超造反，智降马超。",108,},
	[116] = {116,"攻占成都",115,1,30,1,8,10,20,30,23172,23173,23174,"建安二十九年夏，刘璋投降，刘备占领成都，少年劝刘备分发田地给百姓，并严酷刑法，治理西川。",109,},
	[117] = {117,"单刀赴会上",116,1,30,2,11,10,20,30,23175,23176,23177,"建安二十九年秋，诸葛瑾讨荆州，刘备让他向关羽讨还，关羽怒骂责回，少年回荆州，助关羽应对孙权。",110,},
	[118] = {118,"单刀赴会下",117,1,30,2,11,10,20,30,23175,23176,23177,"建安二十九年冬，鲁肃宴请关羽，暗中设伏抓关羽，少年随同赴宴，勇猛无双反抓鲁肃，助关羽安全返荆州。",111,},
	[119] = {119,"伏皇后之死",118,1,30,8,9,10,20,30,23178,23179,23180,"建安三十年春，少年入曹营，探听到伏皇后与其父伏完预谋起兵，曹操发现，怒杀伏皇后，灭伏家满门。",112,},
	[120] = {120,"攻占汉中",119,1,30,3,12,10,20,30,23178,23179,23180,"建安三十年夏，曹操攻汉中，杨松背叛张鲁开城投降，潜伏曹营的少年回归西川，将消息带给刘备。",113,},
	[121] = {121,"逍遥津之战",120,1,30,9,13,10,20,30,23181,23182,23183,"建安三十年秋，刘备割三郡让孙权攻合肥，少年随孙权交战曹军，屡立战功，并从张辽伏击中救其性命。",114,},
	[122] = {122,"敬请期待",121,1,0,0,0,10,20,30,0,0,0,"0",115,},
	}
}

local __index_id = {
	[1] = 1,
	[2] = 2,
	[3] = 3,
	[4] = 4,
	[5] = 5,
	[6] = 6,
	[7] = 7,
	[8] = 8,
	[9] = 9,
	[10] = 10,
	[11] = 11,
	[12] = 12,
	[13] = 13,
	[14] = 14,
	[15] = 15,
	[16] = 16,
	[17] = 17,
	[18] = 18,
	[19] = 19,
	[20] = 20,
	[21] = 21,
	[22] = 22,
	[23] = 23,
	[24] = 24,
	[25] = 25,
	[26] = 26,
	[27] = 27,
	[28] = 28,
	[29] = 29,
	[30] = 30,
	[31] = 31,
	[32] = 32,
	[33] = 33,
	[34] = 34,
	[35] = 35,
	[36] = 36,
	[37] = 37,
	[38] = 38,
	[39] = 39,
	[40] = 40,
	[41] = 41,
	[42] = 42,
	[43] = 43,
	[44] = 44,
	[45] = 45,
	[46] = 46,
	[47] = 47,
	[48] = 48,
	[49] = 49,
	[50] = 50,
	[51] = 51,
	[52] = 52,
	[53] = 53,
	[54] = 54,
	[55] = 55,
	[56] = 56,
	[57] = 57,
	[58] = 58,
	[59] = 59,
	[60] = 60,
	[61] = 61,
	[62] = 62,
	[63] = 63,
	[64] = 64,
	[65] = 65,
	[66] = 66,
	[67] = 67,
	[68] = 68,
	[69] = 69,
	[70] = 70,
	[71] = 71,
	[72] = 72,
	[73] = 73,
	[74] = 74,
	[75] = 75,
	[76] = 76,
	[77] = 77,
	[78] = 78,
	[79] = 79,
	[80] = 80,
	[81] = 81,
	[82] = 82,
	[83] = 83,
	[84] = 84,
	[85] = 85,
	[86] = 86,
	[87] = 87,
	[88] = 88,
	[89] = 89,
	[90] = 90,
	[91] = 91,
	[92] = 92,
	[93] = 93,
	[94] = 94,
	[95] = 95,
	[96] = 96,
	[97] = 97,
	[98] = 98,
	[99] = 99,
	[100] = 100,
	[101] = 101,
	[102] = 102,
	[103] = 103,
	[104] = 104,
	[105] = 105,
	[106] = 106,
	[107] = 107,
	[108] = 108,
	[109] = 109,
	[110] = 110,
	[111] = 111,
	[112] = 112,
	[113] = 113,
	[114] = 114,
	[115] = 115,
	[116] = 116,
	[117] = 117,
	[118] = 118,
	[119] = 119,
	[120] = 120,
	[121] = 121,
	[122] = 122,
}

local __key_map = {
	id = 1,
	name = 2,
	premise_id = 3,
	level = 4,
	star = 5,
	image = 6,
	map = 7,
	copperbox_star = 8,
	silverbox_star = 9,
	goldbox_star = 10,
	copperbox_id = 11,
	silverbox_id = 12,
	goldbox_id = 13,
	direction = 14,
	story_id = 15,
}

local m = {
	__index = function(t,k)
		if k == "toObject"then
			return function()
				local o = {}
				for key, v in pairs (__key_map) do
					o[key] = t._raw[v]
				end
				return o
			end
		end

		assert(__key_map[k], "cannot find ".. k .. " in record_dungeon_chapter_info")
		return t._raw[__key_map[k]]
	end
}

function dungeon_chapter_info.getLength()
	return #dungeon_chapter_info._data
end

function dungeon_chapter_info.hasKey(k)
	if __key_map[k] == nil then
		return false
	else
		return true
	end
end

function dungeon_chapter_info.indexOf(index)
	if index == nil then
		return nil
	end
	return setmetatable({_raw = dungeon_chapter_info._data[index]}, m)
end

function dungeon_chapter_info.get(id)
	return dungeon_chapter_info.indexOf(__index_id[id])
end

function dungeon_chapter_info.set(id, key, value)
	local record = dungeon_chapter_info.get(id)
	if record then
		local keyIndex = __key_map[key]
		if keyIndex then
			record._raw[keyIndex] = value
		end
	end
end

function dungeon_chapter_info.get_index_data()
    return __index_id
end

