

---@classdef record_equipment_skill_info
local record_equipment_skill_info = {}
  
record_equipment_skill_info.id = 0 --id  
record_equipment_skill_info.name = "" --技能名  
record_equipment_skill_info.open_type = 0 --激活类型  
record_equipment_skill_info.open_value = 0 --激活类型值  
record_equipment_skill_info.attribute_type = 0 --增加属性类型  
record_equipment_skill_info.attribute_value = 0 --增加属性类型值  
record_equipment_skill_info.directions = "" --描述


equipment_skill_info = {
   _data = {
    [1] = {101,"神兵锋锐",1,16,6,2000,"攻击+2000（精炼至16阶开启）",},
    [2] = {102,"神兵激怒",1,21,19,1,"初始怒气+1（精炼至21阶开启）",},
    [3] = {103,"致命一击Ⅰ",1,26,0,0,"每次攻击时，有2%几率造成双倍伤害（精炼至26阶开启）",},
    [4] = {104,"致命一击Ⅱ",1,31,0,0,"造成双倍伤害几率提升至5%（精炼至31阶开启）",},
    [5] = {105,"致命一击Ⅲ",1,35,0,0,"造成双倍伤害几率提升至10%（精炼至35阶开启）",},
    [6] = {106,"神兵锋锐",1,39,6,2000,"攻击+2000（精炼至39阶开启）",},
    [7] = {107,"神兵锋锐",1,42,6,2000,"攻击+2000（精炼至42阶开启）",},
    [8] = {108,"神兵锋锐",1,45,6,2000,"攻击+2000（精炼至45阶开启）",},
    [9] = {109,"神兵锋锐",1,48,6,2000,"攻击+2000（精炼至48阶开启）",},
    [10] = {110,"神兵锋锐",1,50,6,2000,"攻击+2000（精炼至50阶开启）",},
    [11] = {201,"神兵健体",1,16,5,16000,"生命+16000（精炼至16阶开启）",},
    [12] = {202,"神兵健体",1,21,5,16000,"生命+16000（精炼至21阶开启）",},
    [13] = {203,"生命之光Ⅰ",1,26,0,0,"每次受到攻击时，有30%几率恢复自身2%的生命（精炼至26阶开启）",},
    [14] = {204,"生命之光Ⅱ",1,31,0,0,"恢复生命比例提升至5%，触发几率保持不变（精炼至31阶开启）",},
    [15] = {205,"生命之光Ⅲ",1,35,0,0,"恢复生命比例提升至10%，触发几率保持不变（精炼至35阶开启）",},
    [16] = {206,"神兵健体",1,39,5,16000,"生命+16000（精炼至39阶开启）",},
    [17] = {207,"神兵健体",1,42,5,16000,"生命+16000（精炼至42阶开启）",},
    [18] = {208,"神兵健体",1,45,5,16000,"生命+16000（精炼至45阶开启）",},
    [19] = {209,"神兵健体",1,48,5,16000,"生命+16000（精炼至48阶开启）",},
    [20] = {210,"神兵健体",1,50,5,16000,"生命+16000（精炼至50阶开启）",},
    [21] = {301,"神兵庇护",1,16,4,1600,"法防+1600（精炼至16阶开启）",},
    [22] = {302,"神兵庇护",1,21,4,1600,"法防+1600（精炼至21阶开启）",},
    [23] = {303,"法术反伤Ⅰ",1,26,0,0,"每次受到法术攻击时，有50%几率反弹5%的伤害（精炼至26阶开启）",},
    [24] = {304,"法术反伤Ⅱ",1,31,0,0,"反弹的伤害提升至10%，触发几率不变（精炼至31阶开启）",},
    [25] = {305,"法术反伤Ⅲ",1,35,0,0,"反弹的伤害提升至20%，触发几率不变（精炼至35阶开启）",},
    [26] = {306,"神兵庇护",1,39,4,1600,"法防+1600（精炼至39阶开启）",},
    [27] = {307,"神兵庇护",1,42,4,1600,"法防+1600（精炼至42阶开启）",},
    [28] = {308,"神兵庇护",1,45,4,1600,"法防+1600（精炼至45阶开启）",},
    [29] = {309,"神兵庇护",1,48,4,1600,"法防+1600（精炼至48阶开启）",},
    [30] = {310,"神兵庇护",1,50,4,1600,"法防+1600（精炼至50阶开启）",},
    [31] = {401,"神兵铁壁",1,16,3,1600,"物防+1600（精炼至16阶开启）",},
    [32] = {402,"神兵铁壁",1,21,3,1600,"物防+1600（精炼至21阶开启）",},
    [33] = {403,"物理反伤Ⅰ",1,26,0,0,"每次受到物理攻击时，有50%几率反弹5%的伤害（精炼至26阶开启）",},
    [34] = {404,"物理反伤Ⅱ",1,31,0,0,"反弹的物理伤害提升至10%，触发几率不变（精炼至31阶开启）",},
    [35] = {405,"物理反伤Ⅲ",1,35,0,0,"反弹的物理伤害提升至20%，触发几率不变（精炼至35阶开启）",},
    [36] = {406,"神兵铁壁",1,39,3,1600,"物防+1600（精炼至39阶开启）",},
    [37] = {407,"神兵铁壁",1,42,3,1600,"物防+1600（精炼至42阶开启）",},
    [38] = {408,"神兵铁壁",1,45,3,1600,"物防+1600（精炼至45阶开启）",},
    [39] = {409,"神兵铁壁",1,48,3,1600,"物防+1600（精炼至48阶开启）",},
    [40] = {410,"神兵铁壁",1,50,3,1600,"物防+1600（精炼至50阶开启）",},
    [41] = {501,"秘宝锋锐",2,5,6,1460,"攻击+1460（精炼至5阶开启）",},
    [42] = {502,"秘宝锋锐",2,8,6,1460,"攻击+1460（精炼至8阶开启）",},
    [43] = {503,"秘宝锋锐",2,10,6,1460,"攻击+1460（精炼至10阶开启）",},
    [44] = {504,"神兵卸甲Ⅲ",2,12,0,0,"每次攻击时，有10%几率无视目标35%防御（精炼至12阶开启）",},
    [45] = {505,"秘宝锋锐",2,14,6,1460,"攻击+1460（精炼至14阶开启）",},
    [46] = {506,"神兵卸甲Ⅳ",2,16,0,0,"无视目标35%防御的几率提升至20%（精炼至16阶开启）",},
    [47] = {507,"秘宝锋锐",2,18,6,1460,"攻击+1460（精炼至18阶开启）",},
    [48] = {508,"神兵卸甲Ⅴ",2,20,0,0,"无视目标35%防御的几率提升至30%（精炼至20阶开启）",},
    [49] = {601,"秘宝健体",2,5,5,14600,"生命+14600（精炼至5阶开启）",},
    [50] = {602,"秘宝健体",2,8,5,14600,"生命+14600（精炼至8阶开启）",},
    [51] = {603,"秘宝健体",2,10,5,14600,"生命+14600（精炼至10阶开启）",},
    [52] = {604,"噬魂饮血Ⅲ",2,12,0,0,"每次攻击时，有10%几率触发吸血，将造成伤害的2%转换为自身生命（精炼至12阶开启）",},
    [53] = {605,"秘宝健体",2,14,5,14600,"生命+14600（精炼至14阶开启）",},
    [54] = {606,"噬魂饮血Ⅳ",2,16,0,0,"吸血比例提升至5%，触发几率不变（精炼至16阶开启）",},
    [55] = {607,"秘宝健体",2,18,5,14600,"生命+14600（精炼至18阶开启）",},
    [56] = {608,"噬魂饮血Ⅴ",2,20,0,0,"吸血比例提升至10%，触发几率不变（精炼至20阶开启）",},
    [57] = {111,"金兵锐利",1,16,6,4000,"攻击+4000（精炼至16阶开启）",},
    [58] = {112,"金兵狂怒",1,21,19,2,"初始怒气+2（精炼至21阶开启）",},
    [59] = {113,"金兵暴击Ⅰ",1,26,0,0,"每次攻击时，有4%几率造成双倍伤害（精炼至26阶开启）",},
    [60] = {114,"金兵暴击Ⅱ",1,31,0,0,"造成双倍伤害几率提升至10%（精炼至31阶开启）",},
    [61] = {115,"金兵暴击Ⅲ",1,35,0,0,"造成双倍伤害几率提升至20%（精炼至35阶开启）",},
    [62] = {116,"金兵锐利",1,39,6,4000,"攻击+4000（精炼至39阶开启）",},
    [63] = {117,"金兵锐利",1,42,6,4000,"攻击+4000（精炼至42阶开启）",},
    [64] = {118,"金兵锐利",1,45,6,4000,"攻击+4000（精炼至45阶开启）",},
    [65] = {119,"金兵锐利",1,48,6,4000,"攻击+4000（精炼至48阶开启）",},
    [66] = {120,"金兵锐利",1,50,6,4000,"攻击+4000（精炼至50阶开启）",},
    [67] = {211,"金兵血脉",1,16,5,32000,"生命+32000（精炼至16阶开启）",},
    [68] = {212,"金兵血脉",1,21,5,32000,"生命+32000（精炼至21阶开启）",},
    [69] = {213,"生命之光Ⅰ",1,26,0,0,"每次受到攻击时，有30%几率恢复自身8%的生命（精炼至26阶开启）",},
    [70] = {214,"生命之光Ⅱ",1,31,0,0,"恢复生命比例提升至20%，触发几率保持不变（精炼至31阶开启）",},
    [71] = {215,"生命之光Ⅲ",1,35,0,0,"恢复生命比例提升至40%，触发几率保持不变（精炼至35阶开启）",},
    [72] = {216,"金兵血脉",1,39,5,32000,"生命+32000（精炼至39阶开启）",},
    [73] = {217,"金兵血脉",1,42,5,32000,"生命+32000（精炼至42阶开启）",},
    [74] = {218,"金兵血脉",1,45,5,32000,"生命+32000（精炼至45阶开启）",},
    [75] = {219,"金兵血脉",1,48,5,32000,"生命+32000（精炼至48阶开启）",},
    [76] = {220,"金兵血脉",1,50,5,32000,"生命+32000（精炼至50阶开启）",},
    [77] = {311,"金兵灿烂",1,16,4,3200,"法防+3200（精炼至16阶开启）",},
    [78] = {312,"金兵灿烂",1,21,4,3200,"法防+3200（精炼至21阶开启）",},
    [79] = {313,"法术反伤Ⅰ",1,26,0,0,"每次受到法术攻击时，有50%几率反弹10%的伤害（精炼至26阶开启）",},
    [80] = {314,"法术反伤Ⅱ",1,31,0,0,"反弹的伤害提升至20%，触发几率不变（精炼至31阶开启）",},
    [81] = {315,"法术反伤Ⅲ",1,35,0,0,"反弹的伤害提升至40%，触发几率不变（精炼至35阶开启）",},
    [82] = {316,"金兵灿烂",1,39,4,3200,"法防+3200（精炼至39阶开启）",},
    [83] = {317,"金兵灿烂",1,42,4,3200,"法防+3200（精炼至42阶开启）",},
    [84] = {318,"金兵灿烂",1,45,4,3200,"法防+3200（精炼至45阶开启）",},
    [85] = {319,"金兵灿烂",1,48,4,3200,"法防+3200（精炼至48阶开启）",},
    [86] = {320,"金兵灿烂",1,50,4,3200,"法防+3200（精炼至50阶开启）",},
    [87] = {411,"金兵顽石",1,16,3,3200,"物防+3200（精炼至16阶开启）",},
    [88] = {412,"金兵顽石",1,21,3,3200,"物防+3200（精炼至21阶开启）",},
    [89] = {413,"物理反伤Ⅰ",1,26,0,0,"每次受到物理攻击时，有50%几率反弹10%的伤害（精炼至26阶开启）",},
    [90] = {414,"物理反伤Ⅱ",1,31,0,0,"反弹的物理伤害提升至20%，触发几率不变（精炼至31阶开启）",},
    [91] = {415,"物理反伤Ⅲ",1,35,0,0,"反弹的物理伤害提升至40%，触发几率不变（精炼至35阶开启）",},
    [92] = {416,"金兵顽石",1,39,3,3200,"物防+3200（精炼至39阶开启）",},
    [93] = {417,"金兵顽石",1,42,3,3200,"物防+3200（精炼至42阶开启）",},
    [94] = {418,"金兵顽石",1,45,3,3200,"物防+3200（精炼至45阶开启）",},
    [95] = {419,"金兵顽石",1,48,3,3200,"物防+3200（精炼至48阶开启）",},
    [96] = {420,"金兵顽石",1,50,3,3200,"物防+3200（精炼至50阶开启）",},
    }
}



local __index_id = {
    [101] = 1,
    [102] = 2,
    [103] = 3,
    [104] = 4,
    [105] = 5,
    [106] = 6,
    [107] = 7,
    [108] = 8,
    [109] = 9,
    [110] = 10,
    [201] = 11,
    [202] = 12,
    [203] = 13,
    [204] = 14,
    [205] = 15,
    [206] = 16,
    [207] = 17,
    [208] = 18,
    [209] = 19,
    [210] = 20,
    [301] = 21,
    [302] = 22,
    [303] = 23,
    [304] = 24,
    [305] = 25,
    [306] = 26,
    [307] = 27,
    [308] = 28,
    [309] = 29,
    [310] = 30,
    [401] = 31,
    [402] = 32,
    [403] = 33,
    [404] = 34,
    [405] = 35,
    [406] = 36,
    [407] = 37,
    [408] = 38,
    [409] = 39,
    [410] = 40,
    [501] = 41,
    [502] = 42,
    [503] = 43,
    [504] = 44,
    [505] = 45,
    [506] = 46,
    [507] = 47,
    [508] = 48,
    [601] = 49,
    [602] = 50,
    [603] = 51,
    [604] = 52,
    [605] = 53,
    [606] = 54,
    [607] = 55,
    [608] = 56,
    [111] = 57,
    [112] = 58,
    [113] = 59,
    [114] = 60,
    [115] = 61,
    [116] = 62,
    [117] = 63,
    [118] = 64,
    [119] = 65,
    [120] = 66,
    [211] = 67,
    [212] = 68,
    [213] = 69,
    [214] = 70,
    [215] = 71,
    [216] = 72,
    [217] = 73,
    [218] = 74,
    [219] = 75,
    [220] = 76,
    [311] = 77,
    [312] = 78,
    [313] = 79,
    [314] = 80,
    [315] = 81,
    [316] = 82,
    [317] = 83,
    [318] = 84,
    [319] = 85,
    [320] = 86,
    [411] = 87,
    [412] = 88,
    [413] = 89,
    [414] = 90,
    [415] = 91,
    [416] = 92,
    [417] = 93,
    [418] = 94,
    [419] = 95,
    [420] = 96,
}

local __key_map = {
  id = 1,
  name = 2,
  open_type = 3,
  open_value = 4,
  attribute_type = 5,
  attribute_value = 6,
  directions = 7,

}



local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_equipment_skill_info")
        
        
        return t._raw[__key_map[k]]
    end
}


function equipment_skill_info.getLength()
    return #equipment_skill_info._data
end



function equipment_skill_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_equipment_skill_info
function equipment_skill_info.indexOf(index)
    if index == nil then
        return nil
    end
    
    return setmetatable({_raw = equipment_skill_info._data[index]}, m)
    
end

---
--@return @class record_equipment_skill_info
function equipment_skill_info.get(id)
    
    return equipment_skill_info.indexOf(__index_id[id])
        
end



function equipment_skill_info.set(id, key, value)
    local record = equipment_skill_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function equipment_skill_info.get_index_data()
    return __index_id
end