

---@classdef record_expansion_dungeon_stage_info
local record_expansion_dungeon_stage_info = {}
  
record_expansion_dungeon_stage_info.id = 0 --编号  
record_expansion_dungeon_stage_info.chapter_id = 0 --所属章节ID  
record_expansion_dungeon_stage_info.name = "" --关卡名称  
record_expansion_dungeon_stage_info.index = 0 --关卡编号  
record_expansion_dungeon_stage_info.icon = 0 --怪物头像  
record_expansion_dungeon_stage_info.image = 0 --怪物形象  
record_expansion_dungeon_stage_info.quality = 0 --怪物品质  
record_expansion_dungeon_stage_info.dungeonbattle_map = 0 --战斗背景图  
record_expansion_dungeon_stage_info.monster_team_id = 0 --怪物组ID  
record_expansion_dungeon_stage_info.pre_id = 0 --前置关卡ID  
record_expansion_dungeon_stage_info.expend_type = 0 --挑战消耗类型  
record_expansion_dungeon_stage_info.expend_value = 0 --挑战消耗类型值  
record_expansion_dungeon_stage_info.expend_size = 0 --挑战消耗数量  
record_expansion_dungeon_stage_info.target_type_1 = 0 --目标1类型  
record_expansion_dungeon_stage_info.target_value_1 = 0 --目标1类型值  
record_expansion_dungeon_stage_info.target_description_1 = "" --目标1描述  
record_expansion_dungeon_stage_info.sucesss_talk_1 = "" --目标1达成描述  
record_expansion_dungeon_stage_info.reward_type_1 = 0 --目标1奖励类型  
record_expansion_dungeon_stage_info.reward_value_1 = 0 --目标1奖励类型值  
record_expansion_dungeon_stage_info.reward_size_1 = 0 --目标1奖励数量  
record_expansion_dungeon_stage_info.target_type_2 = 0 --目标2类型  
record_expansion_dungeon_stage_info.target_value_2 = 0 --目标2类型值  
record_expansion_dungeon_stage_info.target_description_2 = "" --目标2描述  
record_expansion_dungeon_stage_info.sucesss_talk_2 = "" --目标2达成描述  
record_expansion_dungeon_stage_info.reward_type_2 = 0 --目标2奖励类型  
record_expansion_dungeon_stage_info.reward_value_2 = 0 --目标2奖励类型值  
record_expansion_dungeon_stage_info.reward_size_2 = 0 --目标2奖励数量  
record_expansion_dungeon_stage_info.target_type_3 = 0 --目标3类型  
record_expansion_dungeon_stage_info.target_value_3 = 0 --目标3类型值  
record_expansion_dungeon_stage_info.target_description_3 = "" --目标3描述  
record_expansion_dungeon_stage_info.sucesss_talk_3 = "" --目标3达成描述  
record_expansion_dungeon_stage_info.reward_type_3 = 0 --目标3奖励类型  
record_expansion_dungeon_stage_info.reward_value_3 = 0 --目标3奖励类型值  
record_expansion_dungeon_stage_info.reward_size_3 = 0 --目标3奖励数量


expansion_dungeon_stage_info = {
   _data = {
    [1] = {1,1,"李傕",1,14041,14041,3,31014,80001,0,7,0,10,0,0,"全灭对方","消灭对方全体武将",1,0,200000,1,5,"5回合内全灭对方","在5回合内消灭对方全体武将",3,13,50,2,0,"我方全体存活","我方全体存活",3,6,200,},
    [2] = {2,1,"郭汜",2,14010,14010,3,31014,80002,1,7,0,10,0,0,"全灭对方","消灭对方全体武将",1,0,200000,1,5,"5回合内全灭对方","在5回合内消灭对方全体武将",3,13,50,2,0,"我方全体存活","我方全体存活",3,6,200,},
    [3] = {3,1,"何进",3,14038,14038,3,31014,80003,2,7,0,10,0,0,"全灭对方","消灭对方全体武将",1,0,200000,1,5,"5回合内全灭对方","在5回合内消灭对方全体武将",3,13,50,2,0,"我方全体存活","我方全体存活",3,6,200,},
    [4] = {4,1,"袁绍",4,14006,14006,3,31014,80004,3,7,0,10,0,0,"全灭对方","消灭对方全体武将",1,0,200000,1,5,"5回合内全灭对方","在5回合内消灭对方全体武将",3,13,50,2,0,"我方全体存活","我方全体存活",3,6,200,},
    [5] = {5,1,"华雄",5,14017,14017,4,31014,80005,4,7,0,10,0,0,"全灭对方","消灭对方全体武将",1,0,200000,1,5,"5回合内全灭对方","在5回合内消灭对方全体武将",3,13,50,2,0,"我方全体存活","我方全体存活",3,6,200,},
    [6] = {6,1,"貂蝉",6,14007,14007,4,31014,80006,5,7,0,10,0,0,"全灭对方","消灭对方全体武将",1,0,200000,1,5,"5回合内全灭对方","在5回合内消灭对方全体武将",3,13,50,2,0,"我方全体存活","我方全体存活",3,6,200,},
    [7] = {7,1,"吕布",7,14005,14005,4,31014,80007,6,7,0,10,0,0,"全灭对方","消灭对方全体武将",1,0,200000,1,5,"5回合内全灭对方","在5回合内消灭对方全体武将",3,13,50,2,0,"我方全体存活","我方全体存活",3,6,200,},
    [8] = {8,1,"董卓",8,14016,14016,4,31014,80008,7,7,0,10,0,0,"全灭对方","消灭对方全体武将",1,0,200000,1,5,"5回合内全灭对方","在5回合内消灭对方全体武将",3,13,50,2,0,"我方全体存活","我方全体存活",3,6,200,},
    [9] = {9,2,"徐晃",1,11015,11015,4,31013,80009,8,7,0,15,0,0,"全灭对方","消灭对方全体武将",1,0,300000,1,5,"5回合内全灭对方","在5回合内消灭对方全体武将",3,18,200,2,0,"我方全体存活","我方全体存活",3,14,60,},
    [10] = {10,2,"典韦",2,11017,11017,4,31013,80010,9,7,0,15,0,0,"全灭对方","消灭对方全体武将",1,0,300000,1,5,"5回合内全灭对方","在5回合内消灭对方全体武将",3,18,200,2,0,"我方全体存活","我方全体存活",3,14,60,},
    [11] = {11,2,"袁绍",3,14006,14006,4,31013,80011,10,7,0,15,0,0,"全灭对方","消灭对方全体武将",1,0,300000,1,5,"5回合内全灭对方","在5回合内消灭对方全体武将",3,18,200,2,0,"我方全体存活","我方全体存活",3,14,60,},
    [12] = {12,2,"张飞",4,12004,12004,5,31013,80012,11,7,0,15,0,0,"全灭对方","消灭对方全体武将",1,0,300000,1,5,"5回合内全灭对方","在5回合内消灭对方全体武将",3,18,200,2,0,"我方全体存活","我方全体存活",3,14,60,},
    [13] = {13,2,"马超",5,12005,12005,5,31013,80013,12,7,0,15,0,0,"全灭对方","消灭对方全体武将",1,0,300000,1,5,"5回合内全灭对方","在5回合内消灭对方全体武将",3,18,200,2,0,"我方全体存活","我方全体存活",3,14,60,},
    [14] = {14,2,"郭嘉",6,11001,11001,5,31013,80014,13,7,0,15,0,0,"全灭对方","消灭对方全体武将",1,0,300000,1,5,"5回合内全灭对方","在5回合内消灭对方全体武将",3,18,200,2,0,"我方全体存活","我方全体存活",3,14,60,},
    [15] = {15,2,"曹操",7,11002,11002,5,31013,80015,14,7,0,15,0,0,"全灭对方","消灭对方全体武将",1,0,300000,1,5,"5回合内全灭对方","在5回合内消灭对方全体武将",3,18,200,2,0,"我方全体存活","我方全体存活",3,14,60,},
    [16] = {16,2,"许褚",8,11016,11016,5,31013,80016,15,7,0,15,0,0,"全灭对方","消灭对方全体武将",1,0,300000,1,5,"5回合内全灭对方","在5回合内消灭对方全体武将",3,18,200,2,0,"我方全体存活","我方全体存活",3,14,60,},
    [17] = {17,3,"甘夫人",1,12039,12039,5,31011,80017,16,7,0,20,0,0,"全灭对方","消灭对方全体武将",1,0,400000,3,50,"我方总血量高于50%","我方总血量高于50%",3,60,400,2,0,"我方全体存活","我方全体存活",23,0,600,},
    [18] = {18,3,"公孙瓒",2,14002,14002,5,31011,80018,17,7,0,20,0,0,"全灭对方","消灭对方全体武将",1,0,400000,3,50,"我方总血量高于50%","我方总血量高于50%",3,60,400,2,0,"我方全体存活","我方全体存活",23,0,600,},
    [19] = {19,3,"刘禅",3,12032,12032,5,31011,80019,18,7,0,20,0,0,"全灭对方","消灭对方全体武将",1,0,400000,3,50,"我方总血量高于50%","我方总血量高于50%",3,60,400,2,0,"我方全体存活","我方全体存活",23,0,600,},
    [20] = {20,3,"关羽",4,12003,12003,5,31011,80020,19,7,0,20,0,0,"全灭对方","消灭对方全体武将",1,0,400000,3,50,"我方总血量高于50%","我方总血量高于50%",3,60,400,2,0,"我方全体存活","我方全体存活",23,0,600,},
    [21] = {21,3,"诸葛亮",5,12009,12009,5,31011,80021,20,7,0,20,0,0,"全灭对方","消灭对方全体武将",1,0,400000,3,50,"我方总血量高于50%","我方总血量高于50%",3,60,400,2,0,"我方全体存活","我方全体存活",23,0,600,},
    [22] = {22,3,"曹操",6,11002,11002,5,31011,80022,21,7,0,20,0,0,"全灭对方","消灭对方全体武将",1,0,400000,3,50,"我方总血量高于50%","我方总血量高于50%",3,60,400,2,0,"我方全体存活","我方全体存活",23,0,600,},
    [23] = {23,3,"刘备",7,12008,12008,5,31011,80023,22,7,0,20,0,0,"全灭对方","消灭对方全体武将",1,0,400000,3,50,"我方总血量高于50%","我方总血量高于50%",3,60,400,2,0,"我方全体存活","我方全体存活",23,0,600,},
    [24] = {24,3,"赵云",8,12001,12001,5,31011,80024,23,7,0,20,0,0,"全灭对方","消灭对方全体武将",1,0,400000,3,50,"我方总血量高于50%","我方总血量高于50%",3,60,400,2,0,"我方全体存活","我方全体存活",23,0,600,},
    [25] = {25,4,"孔融",1,14036,14036,5,31010,80025,24,7,0,25,0,0,"全灭对方","消灭对方全体武将",1,0,500000,3,70,"我方总血量高于70%","我方总血量高于70%",3,297,2,2,0,"我方全体存活","我方全体存活",34,0,100,},
    [26] = {26,4,"黄盖",2,13016,13016,5,31010,80026,25,7,0,25,0,0,"全灭对方","消灭对方全体武将",1,0,500000,3,70,"我方总血量高于70%","我方总血量高于70%",3,297,2,2,0,"我方全体存活","我方全体存活",34,0,100,},
    [27] = {27,4,"周瑜",3,13007,13007,5,31010,80027,26,7,0,25,0,0,"全灭对方","消灭对方全体武将",1,0,500000,3,70,"我方总血量高于70%","我方总血量高于70%",3,297,2,2,0,"我方全体存活","我方全体存活",34,0,100,},
    [28] = {28,4,"刘备",4,12008,12008,5,31010,80028,27,7,0,25,0,0,"全灭对方","消灭对方全体武将",1,0,500000,3,70,"我方总血量高于70%","我方总血量高于70%",3,297,2,2,0,"我方全体存活","我方全体存活",34,0,100,},
    [29] = {29,4,"孙策",5,13004,13004,5,31010,80029,28,7,0,25,0,0,"全灭对方","消灭对方全体武将",1,0,500000,3,70,"我方总血量高于70%","我方总血量高于70%",3,297,2,2,0,"我方全体存活","我方全体存活",34,0,100,},
    [30] = {30,4,"孙坚",6,13003,13003,5,31010,80030,29,7,0,25,0,0,"全灭对方","消灭对方全体武将",1,0,500000,3,70,"我方总血量高于70%","我方总血量高于70%",3,297,2,2,0,"我方全体存活","我方全体存活",34,0,100,},
    [31] = {31,4,"孙权",7,13005,13005,5,31010,80031,30,7,0,25,0,0,"全灭对方","消灭对方全体武将",1,0,500000,3,70,"我方总血量高于70%","我方总血量高于70%",3,297,2,2,0,"我方全体存活","我方全体存活",34,0,100,},
    [32] = {32,4,"太史慈",8,13006,13006,5,31010,80032,31,7,0,25,0,0,"全灭对方","消灭对方全体武将",1,0,500000,3,70,"我方总血量高于70%","我方总血量高于70%",3,297,2,2,0,"我方全体存活","我方全体存活",34,0,100,},
    [33] = {33,5,"丁原",1,11034,11034,5,31008,80033,32,7,0,25,0,0,"全灭对方","消灭对方全体武将",1,0,600000,1,4,"4回合内全灭对方","在4回合内消灭对方全体武将",3,200,20,2,0,"我方全体存活","我方全体存活",29,0,600,},
    [34] = {34,5,"李儒",2,14020,14020,5,31008,80034,33,7,0,25,0,0,"全灭对方","消灭对方全体武将",1,0,600000,1,4,"4回合内全灭对方","在4回合内消灭对方全体武将",3,200,20,2,0,"我方全体存活","我方全体存活",29,0,600,},
    [35] = {35,5,"王允",3,14029,14029,5,31008,80035,34,7,0,25,0,0,"全灭对方","消灭对方全体武将",1,0,600000,1,4,"4回合内全灭对方","在4回合内消灭对方全体武将",3,200,20,2,0,"我方全体存活","我方全体存活",29,0,600,},
    [36] = {36,5,"高顺",4,14010,14010,5,31008,80036,35,7,0,25,0,0,"全灭对方","消灭对方全体武将",1,0,600000,1,4,"4回合内全灭对方","在4回合内消灭对方全体武将",3,200,20,2,0,"我方全体存活","我方全体存活",29,0,600,},
    [37] = {37,5,"陈宫",5,14001,14001,5,31008,80037,36,7,0,25,0,0,"全灭对方","消灭对方全体武将",1,0,600000,1,4,"4回合内全灭对方","在4回合内消灭对方全体武将",3,200,20,2,0,"我方全体存活","我方全体存活",29,0,600,},
    [38] = {38,5,"董卓",6,14016,14016,5,31008,80038,37,7,0,25,0,0,"全灭对方","消灭对方全体武将",1,0,600000,1,4,"4回合内全灭对方","在4回合内消灭对方全体武将",3,200,20,2,0,"我方全体存活","我方全体存活",29,0,600,},
    [39] = {39,5,"貂蝉",7,14007,14007,5,31008,80039,38,7,0,25,0,0,"全灭对方","消灭对方全体武将",1,0,600000,1,4,"4回合内全灭对方","在4回合内消灭对方全体武将",3,200,20,2,0,"我方全体存活","我方全体存活",29,0,600,},
    [40] = {40,5,"吕布",8,14005,14005,5,31008,80040,39,7,0,25,0,0,"全灭对方","消灭对方全体武将",1,0,600000,1,4,"4回合内全灭对方","在4回合内消灭对方全体武将",3,200,20,2,0,"我方全体存活","我方全体存活",29,0,600,},
    [41] = {41,6,"许褚",1,11016,11016,5,31014,80041,40,7,0,30,0,0,"全灭对方","消灭对方全体武将",1,0,1000000,1,4,"4回合内全灭对方","在4回合内消灭对方全体武将",3,295,2,2,0,"我方全体存活","我方全体存活",34,0,200,},
    [42] = {42,6,"马腾",2,12031,12031,5,31014,80042,41,7,0,30,0,0,"全灭对方","消灭对方全体武将",1,0,1000000,1,4,"4回合内全灭对方","在4回合内消灭对方全体武将",3,295,2,2,0,"我方全体存活","我方全体存活",34,0,200,},
    [43] = {43,6,"韩遂",3,14030,14030,5,31014,80043,42,7,0,30,0,0,"全灭对方","消灭对方全体武将",1,0,1000000,1,4,"4回合内全灭对方","在4回合内消灭对方全体武将",3,295,2,2,0,"我方全体存活","我方全体存活",34,0,200,},
    [44] = {44,6,"曹操",4,11002,11002,5,31014,80044,43,7,0,30,0,0,"全灭对方","消灭对方全体武将",1,0,1000000,1,4,"4回合内全灭对方","在4回合内消灭对方全体武将",3,295,2,2,0,"我方全体存活","我方全体存活",34,0,200,},
    [45] = {45,6,"诸葛亮",5,12009,12009,5,31014,80045,44,7,0,30,0,0,"全灭对方","消灭对方全体武将",1,0,1000000,1,4,"4回合内全灭对方","在4回合内消灭对方全体武将",3,295,2,2,0,"我方全体存活","我方全体存活",34,0,200,},
    [46] = {46,6,"张飞",6,12004,12004,5,31014,80046,45,7,0,30,0,0,"全灭对方","消灭对方全体武将",1,0,1000000,1,4,"4回合内全灭对方","在4回合内消灭对方全体武将",3,295,2,2,0,"我方全体存活","我方全体存活",34,0,200,},
    [47] = {47,6,"刘备",7,12008,12008,5,31014,80047,46,7,0,30,0,0,"全灭对方","消灭对方全体武将",1,0,1000000,1,4,"4回合内全灭对方","在4回合内消灭对方全体武将",3,295,2,2,0,"我方全体存活","我方全体存活",34,0,200,},
    [48] = {48,6,"马超",8,12005,12005,5,31014,80048,47,7,0,30,0,0,"全灭对方","消灭对方全体武将",1,0,1000000,1,4,"4回合内全灭对方","在4回合内消灭对方全体武将",3,295,2,2,0,"我方全体存活","我方全体存活",34,0,200,},
    [49] = {49,7,"袁术",1,14027,14027,5,31013,80049,48,7,0,30,0,0,"全灭对方","消灭对方全体武将",1,0,1200000,3,70,"我方总血量高于70%","我方总血量高于70%",3,275,4,2,0,"我方全体存活","我方全体存活",13,0,800,},
    [50] = {50,7,"甘宁",2,13010,13010,5,31013,80050,49,7,0,30,0,0,"全灭对方","消灭对方全体武将",1,0,1200000,3,70,"我方总血量高于70%","我方总血量高于70%",3,275,4,2,0,"我方全体存活","我方全体存活",13,0,800,},
    [51] = {51,7,"周瑜",3,13007,13007,5,31013,80051,50,7,0,30,0,0,"全灭对方","消灭对方全体武将",1,0,1200000,3,70,"我方总血量高于70%","我方总血量高于70%",3,275,4,2,0,"我方全体存活","我方全体存活",13,0,800,},
    [52] = {52,7,"太史慈",4,13006,13006,5,31013,80052,51,7,0,30,0,0,"全灭对方","消灭对方全体武将",1,0,1200000,3,70,"我方总血量高于70%","我方总血量高于70%",3,275,4,2,0,"我方全体存活","我方全体存活",13,0,800,},
    [53] = {53,7,"曹操",5,11002,11002,5,31013,80053,52,7,0,30,0,0,"全灭对方","消灭对方全体武将",1,0,1200000,3,70,"我方总血量高于70%","我方总血量高于70%",3,275,4,2,0,"我方全体存活","我方全体存活",13,0,800,},
    [54] = {54,7,"孙坚",6,13003,13003,6,31013,80054,53,7,0,30,0,0,"全灭对方","消灭对方全体武将",1,0,1200000,3,70,"我方总血量高于70%","我方总血量高于70%",3,275,4,2,0,"我方全体存活","我方全体存活",13,0,800,},
    [55] = {55,7,"孙权",7,13005,13005,6,31013,80055,54,7,0,30,0,0,"全灭对方","消灭对方全体武将",1,0,1200000,3,70,"我方总血量高于70%","我方总血量高于70%",3,275,4,2,0,"我方全体存活","我方全体存活",13,0,800,},
    [56] = {56,7,"孙策",8,13004,13004,6,31013,80056,55,7,0,30,0,0,"全灭对方","消灭对方全体武将",1,0,1200000,3,70,"我方总血量高于70%","我方总血量高于70%",3,275,4,2,0,"我方全体存活","我方全体存活",13,0,800,},
    [57] = {57,8,"周仓",1,12041,12041,5,31008,80057,56,7,0,35,0,0,"全灭对方","消灭对方全体武将",1,0,1600000,1,4,"4回合内全灭对方","在4回合内消灭对方全体武将",3,295,2,2,0,"我方全体存活","我方全体存活",34,0,300,},
    [58] = {58,8,"关索",2,12021,12021,5,31008,80058,57,7,0,35,0,0,"全灭对方","消灭对方全体武将",1,0,1600000,1,4,"4回合内全灭对方","在4回合内消灭对方全体武将",3,295,2,2,0,"我方全体存活","我方全体存活",34,0,300,},
    [59] = {59,8,"关平",3,12020,12020,5,31008,80059,58,7,0,35,0,0,"全灭对方","消灭对方全体武将",1,0,1600000,1,4,"4回合内全灭对方","在4回合内消灭对方全体武将",3,295,2,2,0,"我方全体存活","我方全体存活",34,0,300,},
    [60] = {60,8,"关兴",4,12017,12017,5,31008,80060,59,7,0,35,0,0,"全灭对方","消灭对方全体武将",1,0,1600000,1,4,"4回合内全灭对方","在4回合内消灭对方全体武将",3,295,2,2,0,"我方全体存活","我方全体存活",34,0,300,},
    [61] = {61,8,"诸葛亮",5,12009,12009,6,31008,80061,60,7,0,35,0,0,"全灭对方","消灭对方全体武将",1,0,1600000,1,4,"4回合内全灭对方","在4回合内消灭对方全体武将",3,295,2,2,0,"我方全体存活","我方全体存活",34,0,300,},
    [62] = {62,8,"张飞",6,12004,12004,6,31008,80062,61,7,0,35,0,0,"全灭对方","消灭对方全体武将",1,0,1600000,1,4,"4回合内全灭对方","在4回合内消灭对方全体武将",3,295,2,2,0,"我方全体存活","我方全体存活",34,0,300,},
    [63] = {63,8,"刘备",7,12008,12008,6,31008,80063,62,7,0,35,0,0,"全灭对方","消灭对方全体武将",1,0,1600000,1,4,"4回合内全灭对方","在4回合内消灭对方全体武将",3,295,2,2,0,"我方全体存活","我方全体存活",34,0,300,},
    [64] = {64,8,"关羽",8,12003,12003,6,31008,80064,63,7,0,35,0,0,"全灭对方","消灭对方全体武将",1,0,1600000,1,4,"4回合内全灭对方","在4回合内消灭对方全体武将",3,295,2,2,0,"我方全体存活","我方全体存活",34,0,300,},
    }
}



local __index_id = {
    [1] = 1,
    [10] = 10,
    [11] = 11,
    [12] = 12,
    [13] = 13,
    [14] = 14,
    [15] = 15,
    [16] = 16,
    [17] = 17,
    [18] = 18,
    [19] = 19,
    [2] = 2,
    [20] = 20,
    [21] = 21,
    [22] = 22,
    [23] = 23,
    [24] = 24,
    [25] = 25,
    [26] = 26,
    [27] = 27,
    [28] = 28,
    [29] = 29,
    [3] = 3,
    [30] = 30,
    [31] = 31,
    [32] = 32,
    [33] = 33,
    [34] = 34,
    [35] = 35,
    [36] = 36,
    [37] = 37,
    [38] = 38,
    [39] = 39,
    [4] = 4,
    [40] = 40,
    [41] = 41,
    [42] = 42,
    [43] = 43,
    [44] = 44,
    [45] = 45,
    [46] = 46,
    [47] = 47,
    [48] = 48,
    [49] = 49,
    [5] = 5,
    [50] = 50,
    [51] = 51,
    [52] = 52,
    [53] = 53,
    [54] = 54,
    [55] = 55,
    [56] = 56,
    [57] = 57,
    [58] = 58,
    [59] = 59,
    [6] = 6,
    [60] = 60,
    [61] = 61,
    [62] = 62,
    [63] = 63,
    [64] = 64,
    [7] = 7,
    [8] = 8,
    [9] = 9,

}

local __key_map = {
  id = 1,
  chapter_id = 2,
  name = 3,
  index = 4,
  icon = 5,
  image = 6,
  quality = 7,
  dungeonbattle_map = 8,
  monster_team_id = 9,
  pre_id = 10,
  expend_type = 11,
  expend_value = 12,
  expend_size = 13,
  target_type_1 = 14,
  target_value_1 = 15,
  target_description_1 = 16,
  sucesss_talk_1 = 17,
  reward_type_1 = 18,
  reward_value_1 = 19,
  reward_size_1 = 20,
  target_type_2 = 21,
  target_value_2 = 22,
  target_description_2 = 23,
  sucesss_talk_2 = 24,
  reward_type_2 = 25,
  reward_value_2 = 26,
  reward_size_2 = 27,
  target_type_3 = 28,
  target_value_3 = 29,
  target_description_3 = 30,
  sucesss_talk_3 = 31,
  reward_type_3 = 32,
  reward_value_3 = 33,
  reward_size_3 = 34,

}



local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_expansion_dungeon_stage_info")
        
        
        return t._raw[__key_map[k]]
    end
}


function expansion_dungeon_stage_info.getLength()
    return #expansion_dungeon_stage_info._data
end



function expansion_dungeon_stage_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_expansion_dungeon_stage_info
function expansion_dungeon_stage_info.indexOf(index)
    if index == nil then
        return nil
    end
    
    return setmetatable({_raw = expansion_dungeon_stage_info._data[index]}, m)
    
end

---
--@return @class record_expansion_dungeon_stage_info
function expansion_dungeon_stage_info.get(id)
    
    return expansion_dungeon_stage_info.indexOf(__index_id[id])
        
end



function expansion_dungeon_stage_info.set(id, key, value)
    local record = expansion_dungeon_stage_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function expansion_dungeon_stage_info.get_index_data()
    return __index_id
end