

---@classdef record_function_level_info
local record_function_level_info = {}
  
record_function_level_info.id = 0 --id  
record_function_level_info.function_id = 0 --功能id  
record_function_level_info.level = 0 --开启等级  
record_function_level_info.vip_level = 0 --开启VIP等级  
record_function_level_info.icon = 0 --图标  
record_function_level_info.name = "" --名字  
record_function_level_info.directions = "" --描述  
record_function_level_info.comment = "" --此处为未到等级的提示文字  
record_function_level_info.step_id = 0 --新手引导步数


function_level_info = {
   _data = {
    [1] = {1,1,28,0,103,"名将副本","打名将副本，可获得大量元宝奖励！","将军,28级才可以进名将副本哟，请努力提升等级再来吧！",0,},
    [2] = {2,2,10,0,117,"竞技场","竞技战胜其他玩家，可获得突破石。","将军,10级才开放竞技场哟，请努力提升等级再来吧！",901,},
    [3] = {3,3,15,0,117,"夺宝","抢夺宝物，可提升武将伤害百分比。","将军,15级才开放夺宝哟，请努力提升等级再来吧！",1901,},
    [4] = {4,4,22,0,117,"三国无双","三国无双，可获得紫色橙色装备！","将军,22级才能进三国无双副本哟，请努力提升等级再来吧！",1401,},
    [5] = {5,5,1,0,105,"武将升级","升级可提升武将基础攻防生命属性！","将军,1级才开放武将升级哟，请努力提升等级再来吧！",0,},
    [6] = {6,6,1,0,105,"武将突破","突破可获得武将高级战斗天赋！","将军,1级才开放武将突破哟，请努力提升等级再来吧！",0,},
    [7] = {7,7,1,0,106,"装备强化","强化可提升装备基础攻防生命属性！","将军,1级才开放装备强化哟，请努力提升等级再来吧！",0,},
    [8] = {8,8,1,0,111,"神将商店","神将商店出售紫色橙色武将。","将军,1级才开放神将商店哟，请努力提升等级再来吧！",0,},
    [9] = {9,9,1,0,103,"扫荡","扫荡残敌，可以快速得经验升级。","将军,1级才开放扫荡功能哟，请努力提升等级再来吧！",0,},
    [10] = {10,10,2,0,108,"第2阵位","快去【阵容】派上新的武将吧！","将军,2级才开放第二个武将位，请努力提升等级再来吧！",0,},
    [11] = {11,10,3,0,108,"第3阵位","快去【阵容】派上新的武将吧！","将军,3级才开放第三个武将位，请努力提升等级再来吧！",0,},
    [12] = {12,10,9,0,108,"第4阵位","快去【阵容】派上新的武将吧！","将军,9级才开放第四个武将位，请努力提升等级再来吧！",0,},
    [13] = {13,10,16,0,108,"第5阵位","快去【阵容】派上新的武将吧！","将军,16级才开放第五个武将位，请努力提升等级再来吧！",0,},
    [14] = {14,10,25,0,108,"第6阵位","快去【阵容】派上新的武将吧！","将军,25级才开放第六个武将位，请努力提升等级再来吧！",0,},
    [15] = {15,11,15,0,109,"宝物强化","强化可提升宝物的百分比属性。","将军,15级才开放宝物强化，请努力提升等级再来吧！",0,},
    [16] = {16,12,40,0,109,"宝物精炼","精炼可增加宝物的百分比属性！","将军,40级才开放宝物精炼，请努力提升等级再来吧！",0,},
    [17] = {17,13,30,0,106,"装备精炼","精炼可增加装备的百分比属性！","将军,30级才开放装备精炼，请努力提升等级再来吧！",2101,},
    [18] = {18,14,35,0,105,"武将天命","天命可提升武将的技能等级！","将军,35级才开放武将天命，请努力提升等级再来吧！",0,},
    [19] = {19,15,10,0,105,"武将培养","培养可提升武将的一级属性！","将军,10级才开放武将培养，请努力提升等级再来吧！",0,},
    [20] = {20,16,35,0,117,"围剿叛军","围剿叛军，可获得大量银两和经验卡！","将军,35级才开放围剿叛军功能，请努力提升等级再来吧！",0,},
    [21] = {21,17,1,0,110,"战斗倍数切换","可切换1倍与2倍战斗速度！","将军,5级才开放开启2倍速战斗，请努力提升等级再来吧！",0,},
    [22] = {22,17,1,1,110,"3倍速战斗","开启3倍速战斗！","将军,达到25级或VIP1开启3倍速战斗！",0,},
    [23] = {23,18,30,0,108,"援军位置开放","快去上阵援军，给武将凑齐缘分吧！","将军,30级才开放第一个小伙伴位置，请努力提升等级再来吧！",0,},
    [24] = {24,19,35,0,108,"援军位置开放","快去上阵援军，给武将凑齐缘分吧！","将军,35级才开放第二个小伙伴位置，请努力提升等级再来吧！",0,},
    [25] = {25,20,40,0,108,"援军位置开放","快去上阵援军，给武将凑齐缘分吧！","将军,40级才开放第三个小伙伴位置，请努力提升等级再来吧！",0,},
    [26] = {26,21,45,0,108,"援军位置开放","快去上阵援军，给武将凑齐缘分吧！","将军,45级才开放第四个小伙伴位置，请努力提升等级再来吧！",0,},
    [27] = {27,22,50,0,108,"援军位置开放","快去上阵援军，给武将凑齐缘分吧！","将军,50级才开放第五个小伙伴位置，请努力提升等级再来吧！",0,},
    [28] = {28,23,55,0,108,"援军位置开放","快去上阵援军，给武将凑齐缘分吧！","将军,55级才开放第六个小伙伴位置，请努力提升等级再来吧！",0,},
    [29] = {29,24,26,0,103,"日常副本","每天可以获得大量资源！","将军,26级才可以进日常副本哟，请努力提升等级再来吧！",801,},
    [30] = {30,25,20,0,112,"聊天系统","聊天系统开启，快去和援军一起玩耍吧！","将军,20级才开放聊天系统，我们提高点等级再来吧！",0,},
    [31] = {31,26,10,0,106,"强化5次","加快提升能力吧！装备可以一次强化五次了！","将军,10级才开放强化5次功能，我们提高点等级再来吧！",0,},
    [32] = {32,27,13,0,119,"三国志命星","三国志命星开启，用残卷点亮星宿吧！","将军,13级才开放三国志命星，我们提高点等级再来吧！",1300,},
    [33] = {33,28,40,0,121,"阵营招募","阵营招募开启，快去招募专一阵营的武将吧！","将军，40级开放阵营招募，要努力提升等级哦！",0,},
    [34] = {34,29,20,0,135,"名人堂","快去看看本服的名人风采吧！","将军，20级开放名人堂功能，要努力提升等级哦！",0,},
    [35] = {35,30,32,0,117,"领地攻讨","攻占新领地，每日巡逻获得大量资源！","将军，32级开放领地攻讨功能，要努力提升等级哦！",0,},
    [36] = {36,31,25,0,133,"漫画","开放漫画功能！","将军，25级开放看漫画的功能，要努力提升等级哦！",0,},
    [37] = {37,32,38,0,132,"军团","开启军团！","将军，38级开放军团功能，要努力提升等级哦！",0,},
    [38] = {38,33,38,0,134,"时装","开启主角时装功能！","将军，38级开放主角时装功能，要努力提升等级哦！",0,},
    [39] = {39,34,38,3,117,"夺宝5次","开启夺宝5次功能！","将军，达到38级或VIP3开启夺宝5次功能！",0,},
    [40] = {40,35,50,0,105,"觉醒","开启觉醒功能！","将军，50级开放觉醒功能，要努力提升等级哦！",0,},
    [41] = {41,36,50,0,115,"觉醒背包","开启觉醒背包功能！","将军，50级开放觉醒背包功能，要努力提升等级哦！",0,},
    [42] = {42,37,50,0,111,"觉醒商店","开启觉醒商店功能！","将军，50级开放觉醒商店功能，要努力提升等级哦！",0,},
    [43] = {43,38,50,0,115,"觉醒道具合成","开启觉醒道具合成功能！","将军，50级开放觉醒道具合成功能，要努力提升等级哦！",0,},
    [44] = {44,39,50,0,103,"精英副本","开启精英副本！","将军，50级开启精英副本，要努力提升等级哦！",0,},
    [45] = {45,40,52,4,117,"3星挑战","三国无双可以快速挑战了！","将军，达到52级或VIP4开启3星挑战！",0,},
    [46] = {46,41,60,0,117,"跨服演武","可以获得红将，红色宝物等稀缺物品！","将军，60级开启跨服演武，要努力提升等级哦！",0,},
    [47] = {47,42,60,0,139,"称号","开启称号！","将军，60级开启称号系统，要努力提升等级哦！",0,},
    [48] = {48,43,50,0,115,"限时挑战","不定期开启，可获得大量资源！","将军，50级开启限时挑战，要努力提升等级哦！",0,},
    [49] = {49,44,55,5,117,"连战五次","开启竞技场连战五次功能！","将军，达到55级或VIP5开启竞技场连战五次！",0,},
    [50] = {50,45,55,5,110,"叛军跳过","开启叛军战斗跳过功能！","将军，达到55级或VIP5开启开启叛军战斗跳过！",0,},
    [51] = {51,46,50,0,103,"精英副本外敌入侵","精英副本外敌入侵，击败获得大量觉醒丹！","将军，50级开启精英副本外敌入侵，要努力提升等级哦！",0,},
    [52] = {52,47,75,0,114,"援军助威","开启援军助威，快去提升援军等级吧！","将军，75级开启援军助威，要努力提升等级哦！",0,},
    [53] = {53,48,60,0,137,"转盘","开启转盘玩法，获得大量资源！","将军，60级开启转盘玩法，要努力提升等级哦！",0,},
    [54] = {54,49,60,0,137,"巡游探宝","开启巡游探宝玩法，获得大量资源！","将军，60级开启巡游探宝玩法，要努力提升等级哦！",0,},
    [55] = {55,50,60,0,137,"富甲天下","开启富甲天下玩法，获得大量资源！","将军，60级开启富甲天下系统，要努力提升等级哦！",0,},
    [56] = {56,51,65,0,151,"夺粮战","开启夺粮战玩法，获取大量声望奖励！","将军，65级开启夺粮战玩法，要努力提升等级哦！",0,},
    [57] = {57,52,65,0,152,"叛军BOSS","开启夺粮战玩法，获取大量战功奖励！","将军，65级开启叛军BOSS玩法，要努力提升等级哦！",0,},
    [58] = {58,53,30,0,114,"推广福利","开启推广福利，快去邀请小伙伴们一起玩耍吧。","将军，30级开启推广奖励，要努力提升等级哦！",0,},
    [59] = {59,54,60,0,134,"时装强化","开启时装强化功能，强化到指定等级，开启主角合击！","将军，60级开启时装强化，要努力提升等级哦！",0,},
    [60] = {60,55,60,0,153,"限时优惠","开启限时优惠，大量折扣资源！","将军，60级开启限时优惠，要努力提升等级哦！",0,},
    [61] = {61,56,70,0,150,"八卦镜","开启八卦镜，可使武将进行变身哦~","将军，70级开启武将变身，要努力提升等级哦！",0,},
    [62] = {62,57,65,0,109,"熔炼","开启熔炼，橙色宝物可熔炼成红色宝物碎片！","将军，65级开启熔炼宝物，要努力提升等级哦！",0,},
    [63] = {63,58,65,0,109,"铸造","开启铸造，橙色宝物可直接铸造成红色宝物！","将军，65级开启宝物铸造，要努力提升等级哦！",0,},
    [64] = {64,59,60,0,121,"将星","开启将星，可获得大量武将碎片！","将军，60级开启将星，要努力提升等级哦！",0,},
    [65] = {65,60,38,0,118,"发送邮件","可以对陌生人发邮件了！","将军，38级开启对陌生人发邮件了，要努力提升等级哦！",0,},
    [66] = {66,61,80,6,154,"一键夺宝","开启一键夺宝功能！","将军，达到80级或者VIP6开启一键夺宝！",0,},
    [67] = {67,62,75,0,105,"材料卡牌增加","每次可升级的材料卡牌扩展至10张！","将军，75级开启10材料卡牌升级，要努力提升等级哦！",0,},
    [68] = {68,63,1,0,105,"VIP头像框","开启VIP头像框，VIP等级提升可更换头像框。","将军，等级1级才开放VIP头像框，要努力提升等级哦！",0,},
    [69] = {69,64,70,0,117,"百战沙场","可以获得战宠碎片、战宠积分！","将军，70级开启百战沙场，要努力提升等级哦！",0,},
    [70] = {70,65,70,0,157,"战宠背包","可以上阵炫酷战宠了！","将军，70级开启战宠功能，要努力提升等级哦！",0,},
    [71] = {71,66,70,0,158,"战宠商店","可以开启战宠商店，购买战宠碎片及战宠养成资源！","将军，70级开启战宠商店，要努力提升等级哦！",0,},
    [72] = {72,67,70,0,157,"战宠分解","可以开启战宠分解，将战宠分解成兽魂！","将军，70级开启战宠分解，要努力提升等级哦！",0,},
    [73] = {73,68,70,0,157,"战宠重生","可以开启战宠重生，将战宠重生成碎片并返还养成资源！","将军，70级开启战宠重生，要努力提升等级哦！",0,},
    [74] = {74,69,70,0,157,"战宠升级","可以开启战宠升级，提升战宠属性！","将军，70级开启战宠升级，要努力提升等级哦！",0,},
    [75] = {75,70,70,0,157,"战宠升星","可以开启战宠升星，提升战宠属性！","将军，70级开启战宠升星，要努力提升等级哦！",0,},
    [76] = {76,71,70,0,157,"战宠神炼","可以开启战宠神炼，提升战宠属性！","将军，70级开启战宠神炼，要努力提升等级哦！",0,},
    [77] = {77,72,80,0,106,"装备升星","可以开启装备升星，提升装备属性！","将军，80级开启装备升星，要努力提升等级哦！",0,},
    [78] = {78,73,60,0,137,"奇门八卦","开启奇门八卦玩法，获得大量资源！","将军，60级开启奇门八卦玩法，要努力提升等级哦！",0,},
    [79] = {79,74,75,0,160,"决战赤壁","开启决战赤壁，获得大量稀有资源！","将军，75级开启决战赤壁，要努力提升等级哦！",0,},
    [80] = {80,75,65,0,159,"道具合成","开启道具合成，合成高阶道具","将军，65级开启道具合成功能，要努力提升等级哦！",0,},
    [81] = {82,77,20,0,114,"手机绑定","绑定手机，即可拿到丰厚奖励！","将军，20级开放手机绑定功能，要努力提升等级哦！",0,},
    [82] = {83,78,75,0,157,"战宠护佑","可以装备1个护佑宠物，提升武将属性！","将军，75级可以装备1个护佑宠物，要努力提升等级哦！",0,},
    [83] = {84,78,80,0,157,"战宠护佑","可以装备2个护佑宠物，提升武将属性！","将军，80级可以装备2个护佑宠物，要努力提升等级哦！",0,},
    [84] = {85,78,85,0,157,"战宠护佑","可以装备3个护佑宠物，提升武将属性！","将军，85级可以装备3个护佑宠物，要努力提升等级哦！",0,},
    [85] = {86,78,90,0,157,"战宠护佑","可以装备4个护佑宠物，提升武将属性！","将军，90级可以装备4个护佑宠物，要努力提升等级哦！",0,},
    [86] = {87,78,95,0,157,"战宠护佑","可以装备5个护佑宠物，提升武将属性！","将军，95级可以装备5个护佑宠物，要努力提升等级哦！",0,},
    [87] = {88,78,100,0,157,"战宠护佑","可以装备6个护佑宠物，提升武将属性！","将军，100级可以装备6个护佑宠物，要努力提升等级哦！",0,},
    [88] = {89,79,90,0,105,"武将化神","化神可以提升武将资质，橙将可以进阶为红将！","将军，90级开启武将化神，要努力提升等级哦！",0,},
    [89] = {90,80,65,0,154,"激战虎牢关","开启激战虎牢关，参与跨服组队大对决！","将军，65级开启激战虎牢关功能，要努力提升等级哦！",0,},
    [90] = {91,81,80,0,105,"一键合成觉醒道具","当觉醒道具材料充分时，可进行一键合成！","将军，80级开启一键合成觉醒道具，要努力提升等级哦！",0,},
    [91] = {92,82,90,0,105,"跨阵营八卦镜","可以通过八卦镜跨阵营转化武将！","将军，90级开启跨阵营武将八卦镜，要努力提升等级哦！",0,},
    [92] = {93,83,50,0,138,"觉醒道具标记","可以在商店标记需要的觉醒道具！","将军，50级开启觉醒道具标记功能，要努力提升等级哦！",0,},
    [93] = {94,84,85,0,106,"一键精炼/神炼","在装备精炼和宠物神炼界面可进行一键精炼/神炼","将军，85级开启一键精炼/神炼功能，要努力提升等级哦！",0,},
    [94] = {95,85,40,0,133,"角色改名","对角色名不满意？可以进行改名啦！","将军，40级开启角色改名功能，要努力提升等级哦！",0,},
    [95] = {96,86,60,0,137,"充值翻牌","开启充值翻牌玩法，获得大量资源！","将军，60级开启充值翻牌玩法，要努力提升等级哦！",0,},
    [96] = {97,88,55,0,164,"将灵","将灵激活灵阵图，获得大量属性！","将军，55级开启将灵玩法，要努力提升等级哦！",0,},
    [97] = {98,87,25,0,120,"周VIP礼包","可购买每周限定的周VIP礼包。","将军，25级开启每周VIP礼包，要努力提升等级哦！",0,},
    [98] = {99,89,110,0,150,"红将变身","可以通过八卦镜转化红色武将！","将军，110级开红将变身，要努力提升等级哦！",0,},
    [99] = {100,90,75,0,117,"三星扫荡","三国无双自动扫荡至历史最高三星关卡！","将军，75级开启三星扫荡，要努力提升等级哦！",0,},
    [100] = {101,91,50,0,165,"招财符","开启招财符玩法，获得大量资源！","将军，50级开启招财符，要努力提升等级哦！",0,},
    }
}



local __index_id = {
    [1] = 1,
    [10] = 10,
    [100] = 99,
    [101] = 100,
    [11] = 11,
    [12] = 12,
    [13] = 13,
    [14] = 14,
    [15] = 15,
    [16] = 16,
    [17] = 17,
    [18] = 18,
    [19] = 19,
    [2] = 2,
    [20] = 20,
    [21] = 21,
    [22] = 22,
    [23] = 23,
    [24] = 24,
    [25] = 25,
    [26] = 26,
    [27] = 27,
    [28] = 28,
    [29] = 29,
    [3] = 3,
    [30] = 30,
    [31] = 31,
    [32] = 32,
    [33] = 33,
    [34] = 34,
    [35] = 35,
    [36] = 36,
    [37] = 37,
    [38] = 38,
    [39] = 39,
    [4] = 4,
    [40] = 40,
    [41] = 41,
    [42] = 42,
    [43] = 43,
    [44] = 44,
    [45] = 45,
    [46] = 46,
    [47] = 47,
    [48] = 48,
    [49] = 49,
    [5] = 5,
    [50] = 50,
    [51] = 51,
    [52] = 52,
    [53] = 53,
    [54] = 54,
    [55] = 55,
    [56] = 56,
    [57] = 57,
    [58] = 58,
    [59] = 59,
    [6] = 6,
    [60] = 60,
    [61] = 61,
    [62] = 62,
    [63] = 63,
    [64] = 64,
    [65] = 65,
    [66] = 66,
    [67] = 67,
    [68] = 68,
    [69] = 69,
    [7] = 7,
    [70] = 70,
    [71] = 71,
    [72] = 72,
    [73] = 73,
    [74] = 74,
    [75] = 75,
    [76] = 76,
    [77] = 77,
    [78] = 78,
    [79] = 79,
    [8] = 8,
    [80] = 80,
    [82] = 81,
    [83] = 82,
    [84] = 83,
    [85] = 84,
    [86] = 85,
    [87] = 86,
    [88] = 87,
    [89] = 88,
    [9] = 9,
    [90] = 89,
    [91] = 90,
    [92] = 91,
    [93] = 92,
    [94] = 93,
    [95] = 94,
    [96] = 95,
    [97] = 96,
    [98] = 97,
    [99] = 98,

}

local __key_map = {
  id = 1,
  function_id = 2,
  level = 3,
  vip_level = 4,
  icon = 5,
  name = 6,
  directions = 7,
  comment = 8,
  step_id = 9,

}



local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_function_level_info")
        
        
        return t._raw[__key_map[k]]
    end
}


function function_level_info.getLength()
    return #function_level_info._data
end



function function_level_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_function_level_info
function function_level_info.indexOf(index)
    if index == nil then
        return nil
    end
    
    return setmetatable({_raw = function_level_info._data[index]}, m)
    
end

---
--@return @class record_function_level_info
function function_level_info.get(id)
    
    return function_level_info.indexOf(__index_id[id])
        
end



function function_level_info.set(id, key, value)
    local record = function_level_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function function_level_info.get_index_data()
    return __index_id
end