

---@classdef record_hard_dungeon_chapter_info
local record_hard_dungeon_chapter_info = {}
  
record_hard_dungeon_chapter_info.id = 0 --章节ID  
record_hard_dungeon_chapter_info.name = "" --章节名称  
record_hard_dungeon_chapter_info.premise_id = 0 --前置章节  
record_hard_dungeon_chapter_info.level = 0 --等级限制  
record_hard_dungeon_chapter_info.star = 0 --章节总星数  
record_hard_dungeon_chapter_info.image = 0 --城池icon  
record_hard_dungeon_chapter_info.map = 0 --地图资源链接  
record_hard_dungeon_chapter_info.copperbox_star = 0 --铜宝箱所需星数  
record_hard_dungeon_chapter_info.silverbox_star = 0 --银宝箱所需星数  
record_hard_dungeon_chapter_info.goldbox_star = 0 --金宝箱所需星数  
record_hard_dungeon_chapter_info.copperbox_id = 0 --铜宝箱掉落库ID  
record_hard_dungeon_chapter_info.silverbox_id = 0 --银宝箱掉落库ID  
record_hard_dungeon_chapter_info.goldbox_id = 0 --金宝箱掉落库ID  
record_hard_dungeon_chapter_info.text = "" --精英暴动怪物气泡文字  
record_hard_dungeon_chapter_info.riot_map = "" --精英暴动战斗地图


hard_dungeon_chapter_info = {
   _data = {
    [1] = {1,"追袭西凉军",0,1,12,9,1,4,8,12,52001,52002,52003,"废物，一个小屁孩都拦不住，居然还要我来救人！",31013,},
    [2] = {2,"大战黄巾贼",1,1,12,7,4,4,8,12,52001,52002,52003,"来吧，信奉我太平道，来生保富贵，幸福万万年。",31007,},
    [3] = {3,"洛阳之战",2,1,12,6,5,4,8,12,52004,52005,52006,"居然敢攻击大将军，看我将你碎尸万段！",31002,},
    [4] = {4,"力战虎牢关",3,1,12,3,9,4,8,12,52004,52005,52006,"该死的华雄，每次都要我出手救人，养你何用！",31012,},
    [5] = {5,"火烧洛阳",4,1,12,5,10,4,8,12,52007,52008,52009,"文台休慌，我来救你！",31007,},
    [6] = {6,"诸侯攻长安",5,1,12,8,6,4,8,12,52007,52008,52009,"长安城是我的，谁也不许抢。",31012,},
    [7] = {7,"襄阳战刘表",6,1,12,5,3,4,8,12,52010,52011,52012,"谁敢欺负我老公，我就跟谁拼命！",31003,},
    [8] = {8,"大闹凤仪亭",7,1,12,7,4,4,8,12,52010,52011,52012,"乖女儿委屈了，看为父如何消灭来敌，为你报仇。",31007,},
    [9] = {9,"讨伐董卓上",8,1,12,8,9,4,8,12,52013,52014,52015,"居然敢打我岳丈，小子受死！",31002,},
    [10] = {10,"讨伐董卓下",9,1,12,8,9,4,8,12,52013,52014,52015,"区区一个小屁孩，也敢在我牛某人面前嚣张。",31002,},
    [11] = {11,"徐州之战上",10,1,12,5,10,4,8,12,52016,52017,52018,"徐州我刘备守定了！",31014,},
    [12] = {12,"徐州之战中",11,1,12,5,10,4,8,12,52016,52017,52018,"子义你速去救援徐州，敌人由我来击退。",31014,},
    [13] = {13,"徐州之战下",12,1,12,5,10,4,8,12,52019,52020,52021,"居然敢伤我军师，给我去死！",31014,},
    [14] = {14,"帝临许都上",13,1,12,8,6,4,8,12,52019,52020,52021,"贾诩不能有失，汉室未来全倚重他了。",31002,},
    [15] = {15,"帝临许都中",14,1,12,8,6,4,8,12,52022,52023,52024,"国舅不用担心，让我吉平助你一臂之力。",31002,},
    [16] = {16,"帝临许都下",15,1,12,8,6,4,8,12,52022,52023,52024,"刘玄德救驾来迟，恳请陛下恕罪。",31002,},
    [17] = {17,"战宛城",16,1,12,3,8,4,8,12,52025,52026,52027,"早就料到会有人来袭击张绣，贾诩在此已等候多时。",31000,},
    [18] = {18,"水淹下邳上",17,1,12,2,7,4,8,12,52025,52026,52027,"吕布还没死，魏续怎能先亡。",31012,},
    [19] = {19,"水淹下邳下",18,1,12,2,7,4,8,12,52028,52029,52030,"谁也不许杀吕布，他是我的！",31012,},
    [20] = {20,"青梅煮酒",19,1,12,7,4,4,8,12,52028,52029,52030,"休得伤我大哥，看我青龙偃月刀！",31007,},
    [21] = {21,"刘备脱困上",20,1,12,5,3,4,8,12,52031,52032,52033,"小屁孩，胆敢攻击丞相军队，给我受死。",31003,},
    [22] = {22,"刘备脱困下",21,1,12,5,3,4,8,12,52031,52032,52033,"想伤文若兄，先过我这关再说。",31003,},
    [23] = {23,"袁术之死",22,1,12,9,1,4,8,12,52034,52035,52036,"休得伤我叔叔，贼人看招！",31003,},
    [24] = {24,"黎阳之战上",23,1,12,2,8,4,8,12,52034,52035,52036,"这天下必将是我袁绍的！",31014,},
    [25] = {25,"黎阳之战下",24,1,12,2,8,4,8,12,52037,52038,52039,"看到我出场，你还不跪下受死！",31014,},
    [26] = {26,"小沛之战",25,1,12,1,11,4,8,12,52037,52038,52039,"给我杀，绝对不能放过来敌。",31013,},
    [27] = {27,"白马之围上",26,1,12,2,8,4,8,12,52040,52041,52042,"小屁孩居然也敢嚣张，给我死吧。",31000,},
    [28] = {28,"白马之围下",27,1,12,2,8,4,8,12,52040,52041,52042,"让我关云长来取你小命。",31000,},
    [29] = {29,"过五关上",28,1,12,3,10,4,8,12,52043,52044,52045,"廖将军莫慌，我奉关将军之令，前来增援。",31014,},
    [30] = {30,"过五关下",29,1,12,3,10,4,8,12,52043,52044,52045,"二弟坚持住，让我来斩杀来敌！",31014,},
    [31] = {31,"古城相聚",30,1,12,6,8,4,8,12,52046,52047,52048,"子龙你太弱了，看我关某如何杀敌！",31008,},
    [32] = {32,"孙策之死",31,1,12,9,5,4,8,12,52046,52047,52048,"休得伤我兄长！",31013,},
    [33] = {33,"掌控江东上",32,1,12,2,8,4,8,12,52049,52050,52051,"公瑾莫慌，我奉主公之令，前来增援。",31013,},
    [34] = {34,"掌控江东下",33,1,12,2,8,4,8,12,52049,52050,52051,"弟弟不要怕，看你大哥我斩杀来敌！",31013,},
    [35] = {35,"官渡之战上",34,1,12,9,5,4,8,12,52052,52053,52054,"想伤我家主公，先过我这关再说。",31000,},
    [36] = {36,"官渡之战中",35,1,12,9,5,4,8,12,52052,52053,52054,"居然敢伤我军师，给我去死！",31000,},
    [37] = {37,"官渡之战下",36,1,12,9,5,4,8,12,52055,52056,52057,"谁敢欺负我兄弟，受死！",31000,},
    [38] = {38,"水淹冀州上",37,1,12,2,10,4,8,12,52055,52056,52057,"主公莫慌，臣郭图来救你了！",31012,},
    [39] = {39,"水淹冀州中",38,1,12,2,10,4,8,12,52058,52059,52060,"休得伤我主公！",31012,},
    [40] = {40,"水淹冀州下",39,1,12,2,10,4,8,12,52058,52059,52060,"大胆狂徒，胆敢伤害我的爱妻，给我受死！",31012,},
    [41] = {41,"马跃檀溪上",40,1,12,9,6,4,8,12,52061,52062,52063,"夫君快走，小蔡蔡帮你抵挡片刻！",31011,},
    [42] = {42,"马跃檀溪中",41,1,12,9,6,4,8,12,52061,52062,52063,"刘琮，你我兄弟虽有嫌隙，但终是骨肉，快走！",31011,},
    [43] = {43,"马跃檀溪下",42,1,12,9,6,4,8,12,52064,52065,52066,"若无伊籍，备已丧命，特来报恩！",31011,},
    [44] = {44,"凤雏卧龙",43,1,12,4,7,4,8,12,52064,52065,52066,"徐元直速走，山人自有妙计！",31007,},
    [45] = {45,"新野之战",44,1,12,5,11,4,8,12,52067,52068,52069,"能破我曹子孝的八门金锁，某求再战！",31014,},
    [46] = {46,"三顾茅庐",45,1,12,4,7,4,8,12,52067,52068,52069,"军师少歇，待子龙为您破敌！",31007,},
    [47] = {47,"讨伐黄祖上",46,1,12,2,10,4,8,12,52070,52071,52072,"黄祖，你我杀父之仇，怎能让你死的这么轻松！",31012,},
    [48] = {48,"讨伐黄祖下",47,1,12,2,10,4,8,12,52070,52071,52072,"兴霸快走，孤的大业还需你来开创！",31010,},
    [49] = {49,"上屋抽梯",48,1,12,1,8,4,8,12,52073,52074,52075,"刘琦，你终是我大哥，荆州已经没有了，不能再没有你！",31008,},
    [50] = {50,"火烧博望坡",49,1,12,6,11,4,8,12,52073,52074,52075,"元让，下不为例！待孤破此危局！",31014,},
    [51] = {51,"敬请期待",50,1,0,0,0,4,8,12,0,0,0,"0",0,},
    }
}



local __index_id = {
    [1] = 1,
    [10] = 10,
    [11] = 11,
    [12] = 12,
    [13] = 13,
    [14] = 14,
    [15] = 15,
    [16] = 16,
    [17] = 17,
    [18] = 18,
    [19] = 19,
    [2] = 2,
    [20] = 20,
    [21] = 21,
    [22] = 22,
    [23] = 23,
    [24] = 24,
    [25] = 25,
    [26] = 26,
    [27] = 27,
    [28] = 28,
    [29] = 29,
    [3] = 3,
    [30] = 30,
    [31] = 31,
    [32] = 32,
    [33] = 33,
    [34] = 34,
    [35] = 35,
    [36] = 36,
    [37] = 37,
    [38] = 38,
    [39] = 39,
    [4] = 4,
    [40] = 40,
    [41] = 41,
    [42] = 42,
    [43] = 43,
    [44] = 44,
    [45] = 45,
    [46] = 46,
    [47] = 47,
    [48] = 48,
    [49] = 49,
    [5] = 5,
    [50] = 50,
    [51] = 51,
    [6] = 6,
    [7] = 7,
    [8] = 8,
    [9] = 9,

}

local __key_map = {
  id = 1,
  name = 2,
  premise_id = 3,
  level = 4,
  star = 5,
  image = 6,
  map = 7,
  copperbox_star = 8,
  silverbox_star = 9,
  goldbox_star = 10,
  copperbox_id = 11,
  silverbox_id = 12,
  goldbox_id = 13,
  text = 14,
  riot_map = 15,

}



local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_hard_dungeon_chapter_info")
        
        
        return t._raw[__key_map[k]]
    end
}


function hard_dungeon_chapter_info.getLength()
    return #hard_dungeon_chapter_info._data
end



function hard_dungeon_chapter_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_hard_dungeon_chapter_info
function hard_dungeon_chapter_info.indexOf(index)
    if index == nil then
        return nil
    end
    
    return setmetatable({_raw = hard_dungeon_chapter_info._data[index]}, m)
    
end

---
--@return @class record_hard_dungeon_chapter_info
function hard_dungeon_chapter_info.get(id)
    
    return hard_dungeon_chapter_info.indexOf(__index_id[id])
        
end



function hard_dungeon_chapter_info.set(id, key, value)
    local record = hard_dungeon_chapter_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function hard_dungeon_chapter_info.get_index_data()
    return __index_id
end