

---@classdef record_item_awaken_info
local record_item_awaken_info = {}
  
record_item_awaken_info.id = 0 --道具编号  
record_item_awaken_info.name = "" --道具名  
record_item_awaken_info.icon = "" --道具icon  
record_item_awaken_info.comment = "" --道具描述  
record_item_awaken_info.quality = 0 --道具品质  
record_item_awaken_info.str_type_1 = 0 --加成属性类型1  
record_item_awaken_info.str_value_1 = 0 --加成属性类型值1  
record_item_awaken_info.str_type_2 = 0 --加成属性类型2  
record_item_awaken_info.str_value_2 = 0 --加成属性类型值2  
record_item_awaken_info.str_type_3 = 0 --加成属性类型3  
record_item_awaken_info.str_value_3 = 0 --加成属性类型值3  
record_item_awaken_info.compose_id = 0 --合成表id  
record_item_awaken_info.price_type = 0 --出售价格类型  
record_item_awaken_info.price = 0 --出售价格类型值  
record_item_awaken_info.is_drop = 0 --是否可模糊掉落  
record_item_awaken_info.gm = 0 --gm后台是否可发放  
record_item_awaken_info.relife_value = 0 --回收返还


item_awaken_info = {
   _data = {
    [1] = {111,"青铜项链","icon/awaken/111.png","用青铜打造的首饰，廉价是它唯一优点。",1,5,216,6,36,21,11,0,11,5,1,1,5,},
    [2] = {112,"香囊","icon/awaken/112.png","塞满了干枯花朵的小布袋，上面绣了一些简单花纹",1,5,216,6,36,21,11,0,11,5,1,1,5,},
    [3] = {113,"求子囊","icon/awaken/113.png","从道观中求来的香囊，据说能增加生子几率。",1,5,216,6,36,21,11,0,11,5,1,1,5,},
    [4] = {114,"白玉耳坠","icon/awaken/114.png","由白玉雕琢而成的耳坠，上面雕有一些简单花纹",1,5,216,6,36,21,11,0,11,5,1,1,5,},
    [5] = {121,"木盆","icon/awaken/121.png","粗木打造的盆子，普通家庭通常用来洗脚。",1,5,271,6,22,21,14,0,11,5,1,1,5,},
    [6] = {122,"瓷碗","icon/awaken/122.png","最便宜的粗瓷大碗，一般茶馆随处可见。",1,5,271,6,22,21,14,0,11,5,1,1,5,},
    [7] = {123,"铜熏炉","icon/awaken/123.png","青铜制成的熏炉，老人用来烤火的道具。",1,5,271,6,22,21,14,0,11,5,1,1,5,},
    [8] = {124,"漆耳杯","icon/awaken/124.png","制作较为精美的漆耳酒杯，一般只出现在筵席上。",1,5,271,6,22,21,14,0,11,5,1,1,5,},
    [9] = {131,"拨浪鼓","icon/awaken/131.png","小孩子的玩具，左右晃动能发出叮咚的声响。",1,5,240,6,30,21,12,0,11,5,1,1,5,},
    [10] = {132,"算盘","icon/awaken/132.png","通体由木头制成，是一种用来算账的物品。",1,5,240,6,30,21,12,0,11,5,1,1,5,},
    [11] = {133,"铜镜","icon/awaken/133.png","通体以青铜雕琢而成，普通妇女用来妆扮自己的必需品。",1,5,240,6,30,21,12,0,11,5,1,1,5,},
    [12] = {134,"虎头鞋","icon/awaken/134.png","给小孩子穿的童鞋，因鞋头绣成虎头模样而得名。",1,5,240,6,30,21,12,0,11,5,1,1,5,},
    [13] = {211,"黄玉璧","icon/awaken/211.png","通体由黄玉雕琢而成的腰饰，美观大方。",2,5,383,6,64,21,19,2111,11,14,1,1,14,},
    [14] = {212,"护身囊","icon/awaken/212.png","从道观中求来的香囊，能保护自身不为鬼魅所伤。",2,5,383,6,64,21,19,2121,11,14,1,1,14,},
    [15] = {213,"青玉环","icon/awaken/213.png","青玉雕琢而成的玉环，入手温润。",2,5,383,6,64,21,19,2131,11,14,1,1,14,},
    [16] = {214,"姻缘囊","icon/awaken/214.png","从道观中求来的香囊，据说能增加姻缘缘分",2,5,383,6,64,21,19,2141,11,14,1,1,14,},
    [17] = {221,"琉璃酒杯","icon/awaken/221.png","以琉璃制成的酒杯，外面绘有花纹，精致小巧。",2,5,481,6,40,21,24,2211,11,14,1,1,14,},
    [18] = {222,"夜光杯","icon/awaken/222.png","使用琢玉制成的酒杯，在夜色下会放出淡淡绿光，故名。",2,5,481,6,40,21,24,2221,11,14,1,1,14,},
    [19] = {223,"琉璃壶","icon/awaken/223.png","由琉璃制成的酒壶，外面绘制花纹，十分漂亮。",2,5,481,6,40,21,24,2231,11,14,1,1,14,},
    [20] = {224,"鎏金酒杯","icon/awaken/224.png","一种三脚竖立的酒杯，以青铜锻造，外镀黄金。",2,5,481,6,40,21,24,2241,11,14,1,1,14,},
    [21] = {231,"狼毫笔","icon/awaken/231.png","取狼尾之毛制成的毛笔，既可用于书写，也可用于绘画。",2,5,426,6,53,21,21,2311,11,14,1,1,14,},
    [22] = {232,"孔明灯","icon/awaken/232.png","又叫天灯，传说为孔明发明，本用做传递军事信息，后人用来祈福祈愿、故又名许愿灯",2,5,426,6,53,21,21,2321,11,14,1,1,14,},
    [23] = {233,"蹴鞠","icon/awaken/233.png","一种历史悠久的体育运动，类似足球，球体用皮革鞣制缝合而成。",2,5,426,6,53,21,21,2331,11,14,1,1,14,},
    [24] = {234,"胡笳","icon/awaken/234.png","一种少数名族乐器，外形似箫，声音圆润、深沉。",2,5,426,6,53,21,21,2341,11,14,1,1,14,},
    [25] = {311,"点翠耳坠","icon/awaken/311.png","白银制成的耳坠，坠子形若花瓣，以点翠手法镀以蓝色颜料，使之颜色艳丽。",3,5,550,6,92,21,27,3111,11,76,1,1,76,},
    [26] = {312,"檀木佛珠","icon/awaken/312.png","檀木制成的名贵佛珠，常作为寺院主持的身份象征。",3,5,550,6,92,21,27,3121,11,76,1,1,76,},
    [27] = {313,"君子佩","icon/awaken/313.png","以白玉制成的玉佩，佩戴后风采翩翩，是读书人必备的饰物。",3,5,550,6,92,21,27,3131,11,76,1,1,76,},
    [28] = {321,"青羊方尊","icon/awaken/321.png","四面带有羊头雕像的青铜方尊，是一种祭天所用的礼器。",3,5,690,6,57,21,35,3211,11,76,1,1,76,},
    [29] = {322,"青铜犀尊","icon/awaken/322.png","通体由青铜制成的酒尊，外形酷似犀牛。",3,5,690,6,57,21,35,3221,11,76,1,1,76,},
    [30] = {323,"云纹鼎","icon/awaken/323.png","外表雕刻云纹图案的鼎器，用作祭祖时焚香而用。",3,5,690,6,57,21,35,3231,11,76,1,1,76,},
    [31] = {331,"九连环","icon/awaken/331.png","一种流传于民间的智力玩具，用九个圆环相连成串，以解开为胜。",3,5,612,6,77,21,31,3311,11,76,1,1,76,},
    [32] = {332,"犀皮战鼓","icon/awaken/332.png","用犀牛皮蒙制的战鼓，敲打起来鼓声震天、气势激昂。",3,5,612,6,77,21,31,3321,11,76,1,1,76,},
    [33] = {333,"琵琶","icon/awaken/333.png","一种历史悠久的弹拨乐器，拨动时能发出悦耳的碰击声。",3,5,612,6,77,21,31,3331,11,76,1,1,76,},
    [34] = {411,"七情束","icon/awaken/411.png","金丝为线穿明珠而束，名为七情束，意喻束住七情六欲，静心养生。",4,5,717,6,120,21,36,4111,11,344,1,1,344,},
    [35] = {412,"黄金发簪","icon/awaken/412.png","较为名贵的发饰，通体用黄金制成，上面镶有细碎红玉。",4,5,717,6,120,21,36,4121,11,344,1,1,344,},
    [36] = {413,"青玉宝簪","icon/awaken/413.png","黄金杂白银制成的发簪，簪头镶以白玉珠花，十分漂亮。",4,5,717,6,120,21,36,4131,11,344,1,1,344,},
    [37] = {421,"玄武鼎","icon/awaken/421.png","造型似玄武的青铜大鼎，外面刻有祭文。是一种祭祀的礼器",4,5,901,6,74,21,45,4211,11,344,1,1,344,},
    [38] = {422,"双龙酒樽","icon/awaken/422.png","以青铜锻造，以黄金装饰，壶两侧把手各雕以蛟龙，外观精美。",4,5,901,6,74,21,45,4221,11,344,1,1,344,},
    [39] = {423,"巨象方尊","icon/awaken/423.png","大象造型的青铜方尊，常用来作为祠庙内的祭天礼器。",4,5,901,6,74,21,45,4231,11,344,1,1,344,},
    [40] = {431,"长生镜","icon/awaken/431.png","整体以青铜雕琢而成，镜背有八卦、经文等装饰，意喻祈求长生。",4,5,799,6,100,21,40,4311,11,344,1,1,344,},
    [41] = {432,"焦尾琴","icon/awaken/432.png","传闻为蔡邕所制，琴音优美，因琴尾端有被焚烧的黑印，故名。",4,5,799,6,100,21,40,4321,11,344,1,1,344,},
    [42] = {433,"鲁班锁","icon/awaken/433.png","相传由春秋末期到战国初期的鲁班发明，是一种设计精巧的机关玩具。",4,5,799,6,100,21,40,4331,11,344,1,1,344,},
    [43] = {511,"朱雀佩","icon/awaken/511.png","使用上等碧玉制造的玉佩，外观为朱雀造型，寓意鸿图展翅。",5,5,884,6,148,21,44,5111,11,1214,1,1,1214,},
    [44] = {512,"繁星结","icon/awaken/512.png","黄金制成的项链，串上多颗夜明珠，月光之下流光闪烁，如同夜空繁星。",5,5,884,6,148,21,44,5121,11,1214,1,1,1214,},
    [45] = {513,"蝶仙恋","icon/awaken/513.png","以黄金软银制成的项链，链坠造型为一只翩翩蝴蝶，异常精美。",5,5,884,6,148,21,44,5131,11,1214,1,1,1214,},
    [46] = {521,"白虎铜尊","icon/awaken/521.png","商朝用来祭祀的青铜器，白虎是四神兽之一，主刀兵，以白虎为器，以驱邪魔。",5,5,1110,6,92,21,56,5211,11,1214,1,1,1214,},
    [47] = {522,"青鸾爵","icon/awaken/522.png","造型为青鸾的酒杯，皇家贵族方能使用的名贵酒器。",5,5,1110,6,92,21,56,5221,11,1214,1,1,1214,},
    [48] = {523,"玉雕犀角杯","icon/awaken/523.png","通体以犀角雕刻，外面镶雕精美花纹，造型华美，入手温润。",5,5,1110,6,92,21,56,5231,11,1214,1,1,1214,},
    [49] = {531,"玄武砚","icon/awaken/531.png","由黑玉精心打造的砚台，外形雕琢为神兽玄武造型，上面装饰着宝石。",5,5,984,6,123,21,49,5311,11,1214,1,1,1214,},
    [50] = {532,"绿绮琴","icon/awaken/532.png","名家打造的珍贵乐器，通体幽绿，表面有绿色藤蔓缠于琴上，故名绿绮",5,5,984,6,123,21,49,5321,11,1214,1,1,1214,},
    [51] = {533,"羽人兽文镜 ","icon/awaken/533.png","做工精美的铜镜，背面刻有上古神话人物，栩栩如生，造型华美。",5,5,984,6,123,21,49,5331,11,1214,1,1,1214,},
    [52] = {611,"翡翠流金珠","icon/awaken/611.png","皇家妃嫔所使用的名贵发饰，以明珠滚金液，镶翡翠而成，造型富贵华美。",6,5,1052,6,176,21,53,6111,11,4914,1,1,4914,},
    [53] = {612,"韵流苏步摇","icon/awaken/612.png","皇家贵族女子使用的饰品，通体以黄金制造，上缀珠玉，晶莹辉耀，富丽堂皇。",6,5,1052,6,176,21,53,6121,11,4914,1,1,4914,},
    [54] = {613,"金镶玉镯","icon/awaken/613.png","出自名家之手，以用上品羊脂玉制成玉镯，外镶金丝珍珠点缀，华美异常。",6,5,1052,6,176,21,53,6131,11,4914,1,1,4914,},
    [55] = {621,"兽面纹身鼎","icon/awaken/621.png","上古流传下来的名贵青铜器，大鼎四面有鬼面浮雕，周围刻纹理经文，常用作祭祀上古黄帝",6,5,1320,6,109,21,66,6211,11,4914,1,1,4914,},
    [56] = {622,"红玉合卺杯","icon/awaken/622.png","由皇宫流出的宝物，通体由红玉与黄金制成，据说是皇帝大婚时的酒器。",6,5,1320,6,109,21,66,6221,11,4914,1,1,4914,},
    [57] = {623,"流光金樽","icon/awaken/623.png","出自名家之手的华美酒器，酒水入内倒映明月，流光四溢，仿佛倒入的不是酒水，而是月光。",6,5,1320,6,109,21,66,6231,11,4914,1,1,4914,},
    [58] = {631,"乾日编钟","icon/awaken/631.png","用于祭祀天地先祖大典时使用的乐器，外形精美，音质雄浑壮阔。",6,5,1171,6,146,21,59,6311,11,4914,1,1,4914,},
    [59] = {632,"和氏璧","icon/awaken/632.png","传自秦朝的名贵宝玉，在它流传的历史长河中，无数贵族豪强为争夺它而发生争斗厮杀，",6,5,1171,6,146,21,59,6321,11,4914,1,1,4914,},
    [60] = {633,"鎏金圣人像","icon/awaken/633.png","供奉与祖庙祠堂的名贵雕像，通体以黄金珠玉制就，栩栩如生。",6,5,1171,6,146,21,59,6331,11,4914,1,1,4914,},
    }
}



local __index_id = {
    [111] = 1,
    [112] = 2,
    [113] = 3,
    [114] = 4,
    [121] = 5,
    [122] = 6,
    [123] = 7,
    [124] = 8,
    [131] = 9,
    [132] = 10,
    [133] = 11,
    [134] = 12,
    [211] = 13,
    [212] = 14,
    [213] = 15,
    [214] = 16,
    [221] = 17,
    [222] = 18,
    [223] = 19,
    [224] = 20,
    [231] = 21,
    [232] = 22,
    [233] = 23,
    [234] = 24,
    [311] = 25,
    [312] = 26,
    [313] = 27,
    [321] = 28,
    [322] = 29,
    [323] = 30,
    [331] = 31,
    [332] = 32,
    [333] = 33,
    [411] = 34,
    [412] = 35,
    [413] = 36,
    [421] = 37,
    [422] = 38,
    [423] = 39,
    [431] = 40,
    [432] = 41,
    [433] = 42,
    [511] = 43,
    [512] = 44,
    [513] = 45,
    [521] = 46,
    [522] = 47,
    [523] = 48,
    [531] = 49,
    [532] = 50,
    [533] = 51,
    [611] = 52,
    [612] = 53,
    [613] = 54,
    [621] = 55,
    [622] = 56,
    [623] = 57,
    [631] = 58,
    [632] = 59,
    [633] = 60,

}

local __key_map = {
  id = 1,
  name = 2,
  icon = 3,
  comment = 4,
  quality = 5,
  str_type_1 = 6,
  str_value_1 = 7,
  str_type_2 = 8,
  str_value_2 = 9,
  str_type_3 = 10,
  str_value_3 = 11,
  compose_id = 12,
  price_type = 13,
  price = 14,
  is_drop = 15,
  gm = 16,
  relife_value = 17,

}



local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_item_awaken_info")
        
        
        return t._raw[__key_map[k]]
    end
}


function item_awaken_info.getLength()
    return #item_awaken_info._data
end



function item_awaken_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_item_awaken_info
function item_awaken_info.indexOf(index)
    if index == nil then
        return nil
    end
    
    return setmetatable({_raw = item_awaken_info._data[index]}, m)
    
end

---
--@return @class record_item_awaken_info
function item_awaken_info.get(id)
    
    return item_awaken_info.indexOf(__index_id[id])
        
end



function item_awaken_info.set(id, key, value)
    local record = item_awaken_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function item_awaken_info.get_index_data()
    return __index_id
end