

---@classdef record_ksoul_info
local record_ksoul_info = {}
  
record_ksoul_info.id = 0 --将灵id  
record_ksoul_info.name = "" --将灵名称  
record_ksoul_info.name2 = "" --灵阵图中名称  
record_ksoul_info.quality = 0 --将灵品质  
record_ksoul_info.ksoul_camp = 0 --将灵阵营  
record_ksoul_info.res_id = 0 --将灵图标id  
record_ksoul_info.directions = "" --将灵描述  
record_ksoul_info.ksoul_point = 0 --分解可得灵玉  
record_ksoul_info.gm = 0 --GM后台是否可发


ksoul_info = {
   _data = {
    [1] = {1,"将灵·曹操","曹操",6,1,11002,"宁教我负天下人，休教天下人负我！",2000,1,},
    [2] = {2,"将灵·荀彧","荀彧",6,1,11007,"为丞相出谋划策，终于看到中原一统的希望。",2000,1,},
    [3] = {3,"将灵·关羽","关羽",6,2,12003,"你死了别忘记我的名字，我就是关云长！",2000,1,},
    [4] = {4,"将灵·诸葛亮","诸葛亮",6,2,12009,"亮略施小计，烧你八十三万大军！",2000,1,},
    [5] = {5,"将灵·孙坚","孙坚",6,3,13003,"董卓，成为我刀上的血锈吧！！",2000,1,},
    [6] = {6,"将灵·周瑜","周瑜",6,3,13007,"既生瑜，何生亮？",2000,1,},
    [7] = {7,"将灵·吕布","吕布",6,4,14005,"我有赤兔马和方天画戟，天下何人敢敌？",2000,1,},
    [8] = {8,"将灵·左慈","左慈",6,4,14003,"乱世中高官富贵皆难保全，切不可贪图荣华！",2000,1,},
    [9] = {9,"将灵·曹仁","曹仁",5,1,11003,"看我略施小计，杀那周瑜小儿。",300,1,},
    [10] = {10,"将灵·夏侯惇","夏侯惇",5,1,11004,"独眼之后，杀敌反而更给力了，哈哈！",300,1,},
    [11] = {11,"将灵·夏侯渊","夏侯渊",5,1,11005,"我的军队三日行五百里，六日千里！",300,1,},
    [12] = {12,"将灵·张辽","张辽",5,1,11006,"逍遥津这一战，孙权小儿你可胆寒？",300,1,},
    [13] = {13,"将灵·郭嘉","郭嘉",5,1,11001,"再给我十年生命，我助丞相一统天下！",300,1,},
    [14] = {14,"将灵·贾诩","贾诩",5,1,11009,"哭喊吧，哀求吧，挣扎吧，然后……你去死吧！",300,1,},
    [15] = {15,"将灵·司马懿","司马懿",5,1,11011,"不知兵法的凡夫俗子，你不懂司马懿！！",300,1,},
    [16] = {16,"将灵·张郃","张郃",5,1,11012,"敌人越强，越能衬托出我的强大。",300,1,},
    [17] = {17,"将灵·乐进","乐进",5,1,11014,"好寂寞，没有更好的对手么了……",300,1,},
    [18] = {18,"将灵·张飞","张飞",5,2,12004,"俺乃燕人张翼德是也，谁敢与俺大战三百回合",300,1,},
    [19] = {19,"将灵·赵云","赵云",5,2,12001,"常山赵子龙来也，吃我一枪！",300,1,},
    [20] = {20,"将灵·马超","马超",5,2,12005,"西凉马孟起在此，你且放马过来受死！",300,1,},
    [21] = {21,"将灵·黄忠","黄忠",5,2,12006,"黄忠虽老，还能吃十斤肉，开千石弓！",300,1,},
    [22] = {22,"将灵·魏延","魏延",5,2,12007,"谁敢杀我？谁敢杀我？谁敢杀我？",300,1,},
    [23] = {23,"将灵·刘备","刘备",5,2,12008,"备一生谨记：要以德服人，以德服人啊！",300,1,},
    [24] = {24,"将灵·庞统","庞统",5,2,12010,"终有一日，凤雏定会九天，清鸣于云中",300,1,},
    [25] = {25,"将灵·姜维","姜维",5,2,12012,"先帝之志，丞相之托，我一日不敢忘记！",300,1,},
    [26] = {26,"将灵·徐庶","徐庶",5,2,12016,"水无常势，兵无常形。我的实力你不懂！",300,1,},
    [27] = {27,"将灵·孙策","孙策",5,3,13004,"能粉碎这乱世的，只有我孙策啊！",300,1,},
    [28] = {28,"将灵·孙权","孙权",5,3,13005,"阻我大业者，便是神佛，也要他灰飞烟灭！",300,1,},
    [29] = {29,"将灵·太史慈","太史慈",5,3,13006,"大丈夫，当带三尺之剑，立不世之功。",300,1,},
    [30] = {30,"将灵·鲁肃","鲁肃",5,3,13002,"孙刘联合，是我这辈子最得意的成就！",300,1,},
    [31] = {31,"将灵·吕蒙","吕蒙",5,3,13008,"士别三日，当刮目相看。",300,1,},
    [32] = {32,"将灵·陆逊","陆逊",5,3,13009,"关羽骄傲自大，必被我所败！",300,1,},
    [33] = {33,"将灵·甘宁","甘宁",5,3,13010,"斩将夺旗，舍我其谁？水声火舞，甘宁参上！",300,1,},
    [34] = {34,"将灵·大乔","大乔",5,3,13001,"我要动真格的了！绝对~绝对不轻饶你！",300,1,},
    [35] = {35,"将灵·小乔","小乔",5,3,13014,"周郎，妾身来助你一臂之力！",300,1,},
    [36] = {36,"将灵·袁绍","袁绍",5,4,14006,"我袁氏四世三公，门生遍天下……",300,1,},
    [37] = {37,"将灵·貂蝉","貂蝉",5,4,14007,"奉先将军真伟丈夫也，臣妾愿以身相许！",300,1,},
    [38] = {38,"将灵·于吉","于吉",5,4,14009,"看了我的书，包你日后成就帝王大业！",300,1,},
    [39] = {39,"将灵·卢植","卢植",5,4,14015,"董卓乃豺狼也，引他入京，必要吃人。",300,1,},
    [40] = {40,"将灵·董卓","董卓",5,4,14016,"西凉儿郎们，随我进洛阳抢钱抢粮抢女人。",300,1,},
    [41] = {41,"将灵·华雄","华雄",5,4,14017,"关羽，酒凉啦！",300,1,},
    [42] = {42,"将灵·公孙瓒","公孙瓒",5,4,14002,"我已加高城墙十丈，看他袁绍如何来犯！",300,1,},
    [43] = {43,"将灵·华佗","华佗",5,4,14018,"关将军刮骨疗毒，面不改色，真伟丈夫也！",300,1,},
    [44] = {44,"将灵·张角","张角",5,4,14019,"苍天已死，黄天当立！",300,1,},
    [45] = {45,"将灵·荀攸","荀攸",4,1,11008,"绝世奇策在此，天下谁与争锋！",50,1,},
    [46] = {46,"将灵·程昱","程昱",4,1,11010,"让烈阳照耀我的仕途吧！",50,1,},
    [47] = {47,"将灵·于禁","于禁",4,1,11013,"中原诸将，谁的刀能比我更快？",50,1,},
    [48] = {48,"将灵·徐晃","徐晃",4,1,11015,"我徐公明的大斧之下，不斩无名之鬼。",50,1,},
    [49] = {49,"将灵·许褚","许褚",4,1,11016,"魏国各军，某麾下的虎卫军战力第一！",50,1,},
    [50] = {50,"将灵·典韦","典韦",4,1,11017,"看我三步之内，取你小命！",50,1,},
    [51] = {51,"将灵·甄姬","甄姬",4,1,11018,"曹子建，你可知我心系何人？",50,1,},
    [52] = {52,"将灵·庞德","庞德",4,1,11019,"看我神箭，将关羽射下马来！",50,1,},
    [53] = {53,"将灵·曹丕","曹丕",4,1,11020,"这取代汉室的帝星，不是我又能是谁？",50,1,},
    [54] = {54,"将灵·法正","法正",4,2,12011,"惹我的，必将十倍奉还！",50,1,},
    [55] = {55,"将灵·马良","马良",4,2,12013,"下智伐人，上智攻心。你的伎俩，我已全数识破。",50,1,},
    [56] = {56,"将灵·夏侯涓","夏侯涓",4,2,12014,"执子之手，与子携老。",50,1,},
    [57] = {57,"将灵·黄月英","黄月英",4,2,12015,"孔明大人，这样可以算帮到您了吗？",50,1,},
    [58] = {58,"将灵·关兴","关兴",4,2,12017,"战斗，是我生命的一部分！",50,1,},
    [59] = {59,"将灵·张苞","张苞",4,2,12018,"你的首级，借给我耍耍？",50,1,},
    [60] = {60,"将灵·孟获","孟获",4,2,12019,"看我南蛮藤甲军杀你个片甲不留！",50,1,},
    [61] = {61,"将灵·祝融","祝融",4,2,12002,"与我南蛮勇士比，北人真是弱不禁风啊！",50,1,},
    [62] = {62,"将灵·程普","程普",4,3,13011,"程普虽老，但老当益壮，不输年轻人！",50,1,},
    [63] = {63,"将灵·孙尚香","孙尚香",4,3,13012,"尚香虽是女儿身，却也巾帼不让须眉。",50,1,},
    [64] = {64,"将灵·步练师","步练师",4,3,13013,"夫君莫急，且听臣妾一曲。",50,1,},
    [65] = {65,"将灵·周泰","周泰",4,3,13015,"大丈夫，当带三尺之剑，立不世之功！",50,1,},
    [66] = {66,"将灵·黄盖","黄盖",4,3,13016,"有种你就鞭挞我吧 ，周瑜小儿！",50,1,},
    [67] = {67,"将灵·徐盛","徐盛",4,3,13017,"大军在此！汝等休想前进一步！",50,1,},
    [68] = {68,"将灵·张昭","张昭",4,3,13018,"陛下以恩待臣，张昭以此躯报陛下之恩。",50,1,},
    [69] = {69,"将灵·张纮","张纮",4,3,13019,"江东已历三世，我当为死谏之臣！",50,1,},
    [70] = {70,"将灵·蔡文姬","蔡文姬",4,4,14008,"翩翩吹我衣，萧萧入我耳。",50,1,},
    [71] = {71,"将灵·高顺","高顺",4,4,14010,"我陷阵营攻无不克，战无不胜。",50,1,},
    [72] = {72,"将灵·陈宫","陈宫",4,4,14001,"曹操此人，必为奸雄而祸害天下。",50,1,},
    [73] = {73,"将灵·田丰","田丰",4,4,14011,"袁绍愚夫，不听我言，现在知道错了吧！",50,1,},
    [74] = {74,"将灵·沮授","沮授",4,4,14012,"哪怕河北全境陷落，我也不会投降曹贼。",50,1,},
    [75] = {75,"将灵·颜良","颜良",4,4,14013,"吾乃河北上将颜良是也，快来与我等决一死战！",50,1,},
    [76] = {76,"将灵·文丑","文丑",4,4,14014,"吾乃河北上将文丑是也，快来与我等决一死战！",50,1,},
    }
}



local __index_id = {
    [1] = 1,
    [10] = 10,
    [11] = 11,
    [12] = 12,
    [13] = 13,
    [14] = 14,
    [15] = 15,
    [16] = 16,
    [17] = 17,
    [18] = 18,
    [19] = 19,
    [2] = 2,
    [20] = 20,
    [21] = 21,
    [22] = 22,
    [23] = 23,
    [24] = 24,
    [25] = 25,
    [26] = 26,
    [27] = 27,
    [28] = 28,
    [29] = 29,
    [3] = 3,
    [30] = 30,
    [31] = 31,
    [32] = 32,
    [33] = 33,
    [34] = 34,
    [35] = 35,
    [36] = 36,
    [37] = 37,
    [38] = 38,
    [39] = 39,
    [4] = 4,
    [40] = 40,
    [41] = 41,
    [42] = 42,
    [43] = 43,
    [44] = 44,
    [45] = 45,
    [46] = 46,
    [47] = 47,
    [48] = 48,
    [49] = 49,
    [5] = 5,
    [50] = 50,
    [51] = 51,
    [52] = 52,
    [53] = 53,
    [54] = 54,
    [55] = 55,
    [56] = 56,
    [57] = 57,
    [58] = 58,
    [59] = 59,
    [6] = 6,
    [60] = 60,
    [61] = 61,
    [62] = 62,
    [63] = 63,
    [64] = 64,
    [65] = 65,
    [66] = 66,
    [67] = 67,
    [68] = 68,
    [69] = 69,
    [7] = 7,
    [70] = 70,
    [71] = 71,
    [72] = 72,
    [73] = 73,
    [74] = 74,
    [75] = 75,
    [76] = 76,
    [8] = 8,
    [9] = 9,

}

local __key_map = {
  id = 1,
  name = 2,
  name2 = 3,
  quality = 4,
  ksoul_camp = 5,
  res_id = 6,
  directions = 7,
  ksoul_point = 8,
  gm = 9,

}



local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_ksoul_info")
        
        
        return t._raw[__key_map[k]]
    end
}


function ksoul_info.getLength()
    return #ksoul_info._data
end



function ksoul_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_ksoul_info
function ksoul_info.indexOf(index)
    if index == nil then
        return nil
    end
    
    return setmetatable({_raw = ksoul_info._data[index]}, m)
    
end

---
--@return @class record_ksoul_info
function ksoul_info.get(id)
    
    return ksoul_info.indexOf(__index_id[id])
        
end



function ksoul_info.set(id, key, value)
    local record = ksoul_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function ksoul_info.get_index_data()
    return __index_id
end