

---@classdef record_ksoul_dungeon_info
local record_ksoul_dungeon_info = {}
  
record_ksoul_dungeon_info.id = 0 --副本id  
record_ksoul_dungeon_info.name = "" --关卡名称  
record_ksoul_dungeon_info.quality = 0 --关卡品质  
record_ksoul_dungeon_info.res_id = 0 --关卡形象  
record_ksoul_dungeon_info.talk = "" --气泡内容  
record_ksoul_dungeon_info.dungeon_pro = 0 --刷新权值  
record_ksoul_dungeon_info.monster_team = 0 --怪物组ID  
record_ksoul_dungeon_info.ksoul_point = 0 --奖励灵玉（必掉）  
record_ksoul_dungeon_info.ksoul_id1 = 0 --奖励将灵1  
record_ksoul_dungeon_info.ksoul_size1 = 0 --奖励数量1  
record_ksoul_dungeon_info.ksoul_pro1 = 0 --奖励1概率


ksoul_dungeon_info = {
   _data = {
    [1] = {1,"曹操",6,11002,"宁教我负天下人，休教天下人负我！",37,45001,400,1,1,10000,},
    [2] = {2,"荀彧",6,11007,"为丞相出谋划策，终于看到中原一统的希望。",37,45002,400,2,1,10000,},
    [3] = {3,"关羽",6,12003,"你死了别忘记我的名字，我就是关云长！",37,45003,400,3,1,10000,},
    [4] = {4,"诸葛亮",6,12009,"亮略施小计，烧你八十三万大军！",37,45004,400,4,1,10000,},
    [5] = {5,"孙坚",6,13003,"董卓，成为我刀上的血锈吧！！",37,45005,400,5,1,10000,},
    [6] = {6,"周瑜",6,13007,"既生瑜，何生亮？",37,45006,400,6,1,10000,},
    [7] = {7,"吕布",6,14005,"我有赤兔马和方天画戟，天下何人敢敌？",37,45007,400,7,1,10000,},
    [8] = {8,"左慈",6,14003,"乱世中高官富贵皆难保全，切不可贪图荣华！",37,45008,400,8,1,10000,},
    [9] = {9,"曹仁",5,11003,"看我略施小计，杀那周瑜小儿。",89,45009,60,9,1,10000,},
    [10] = {10,"夏侯惇",5,11004,"独眼之后，杀敌反而更给力了，哈哈！",89,45010,60,10,1,10000,},
    [11] = {11,"夏侯渊",5,11005,"我的军队三日行五百里，六日千里！",89,45011,60,11,1,10000,},
    [12] = {12,"张辽",5,11006,"逍遥津这一战，孙权小儿你可胆寒？",89,45012,60,12,1,10000,},
    [13] = {13,"郭嘉",5,11001,"再给我十年生命，我助丞相一统天下！",89,45013,60,13,1,10000,},
    [14] = {14,"贾诩",5,11009,"哭喊吧，哀求吧，挣扎吧，然后……你去死吧！",89,45014,60,14,1,10000,},
    [15] = {15,"司马懿",5,11011,"不知兵法的凡夫俗子，你不懂司马懿！！",89,45015,60,15,1,10000,},
    [16] = {16,"张郃",5,11012,"敌人越强，越能衬托出我的强大。",89,45016,60,16,1,10000,},
    [17] = {17,"乐进",5,11014,"好寂寞，没有更好的对手么了……",89,45017,60,17,1,10000,},
    [18] = {18,"张飞",5,12004,"俺乃燕人张翼德是也，谁敢与俺大战三百回合",89,45018,60,18,1,10000,},
    [19] = {19,"赵云",5,12001,"常山赵子龙来也，吃我一枪！",89,45019,60,19,1,10000,},
    [20] = {20,"马超",5,12005,"西凉马孟起在此，你且放马过来受死！",89,45020,60,20,1,10000,},
    [21] = {21,"黄忠",5,12006,"黄忠虽老，还能吃十斤肉，开千石弓！",89,45021,60,21,1,10000,},
    [22] = {22,"魏延",5,12007,"谁敢杀我？谁敢杀我？谁敢杀我？",89,45022,60,22,1,10000,},
    [23] = {23,"刘备",5,12008,"备一生谨记：要以德服人，以德服人啊！",89,45023,60,23,1,10000,},
    [24] = {24,"庞统",5,12010,"终有一日，凤雏定会九天，清鸣于云中",89,45024,60,24,1,10000,},
    [25] = {25,"姜维",5,12012,"先帝之志，丞相之托，我一日不敢忘记！",89,45025,60,25,1,10000,},
    [26] = {26,"徐庶",5,12016,"水无常势，兵无常形。我的实力你不懂！",89,45026,60,26,1,10000,},
    [27] = {27,"孙策",5,13004,"能粉碎这乱世的，只有我孙策啊！",89,45027,60,27,1,10000,},
    [28] = {28,"孙权",5,13005,"阻我大业者，便是神佛，也要他灰飞烟灭！",89,45028,60,28,1,10000,},
    [29] = {29,"太史慈",5,13006,"大丈夫，当带三尺之剑，立不世之功。",89,45029,60,29,1,10000,},
    [30] = {30,"鲁肃",5,13002,"孙刘联合，是我这辈子最得意的成就！",89,45030,60,30,1,10000,},
    [31] = {31,"吕蒙",5,13008,"士别三日，当刮目相看。",89,45031,60,31,1,10000,},
    [32] = {32,"陆逊",5,13009,"关羽骄傲自大，必被我所败！",89,45032,60,32,1,10000,},
    [33] = {33,"甘宁",5,13010,"斩将夺旗，舍我其谁？水声火舞，甘宁参上！",89,45033,60,33,1,10000,},
    [34] = {34,"大乔",5,13001,"我要动真格的了！绝对~绝对不轻饶你！",89,45034,60,34,1,10000,},
    [35] = {35,"小乔",5,13014,"周郎，妾身来助你一臂之力！",89,45035,60,35,1,10000,},
    [36] = {36,"袁绍",5,14006,"我袁氏四世三公，门生遍天下……",89,45036,60,36,1,10000,},
    [37] = {37,"貂蝉",5,14007,"奉先将军真伟丈夫也，臣妾愿以身相许！",89,45037,60,37,1,10000,},
    [38] = {38,"于吉",5,14009,"看了我的书，包你日后成就帝王大业！",89,45038,60,38,1,10000,},
    [39] = {39,"卢植",5,14015,"董卓乃豺狼也，引他入京，必要吃人。",89,45039,60,39,1,10000,},
    [40] = {40,"董卓",5,14016,"西凉儿郎们，随我进洛阳抢钱抢粮抢女人。",89,45040,60,40,1,10000,},
    [41] = {41,"华雄",5,14017,"关羽，酒凉啦！",89,45041,60,41,1,10000,},
    [42] = {42,"公孙瓒",5,14002,"我已加高城墙十丈，看他袁绍如何来犯！",89,45042,60,42,1,10000,},
    [43] = {43,"华佗",5,14018,"关将军刮骨疗毒，面不改色，真伟丈夫也！",89,45043,60,43,1,10000,},
    [44] = {44,"张角",5,14019,"苍天已死，黄天当立！",89,45044,60,44,1,10000,},
    [45] = {45,"荀攸",4,11008,"绝世奇策在此，天下谁与争锋！",204,45045,10,45,1,10000,},
    [46] = {46,"程昱",4,11010,"让烈阳照耀我的仕途吧！",204,45046,10,46,1,10000,},
    [47] = {47,"于禁",4,11013,"中原诸将，谁的刀能比我更快？",204,45047,10,47,1,10000,},
    [48] = {48,"徐晃",4,11015,"我徐公明的大斧之下，不斩无名之鬼。",204,45048,10,48,1,10000,},
    [49] = {49,"许褚",4,11016,"魏国各军，某麾下的虎卫军战力第一！",203,45049,10,49,1,10000,},
    [50] = {50,"典韦",4,11017,"看我三步之内，取你小命！",203,45050,10,50,1,10000,},
    [51] = {51,"甄姬",4,11018,"曹子建，你可知我心系何人？",203,45051,10,51,1,10000,},
    [52] = {52,"庞德",4,11019,"看我神箭，将关羽射下马来！",203,45052,10,52,1,10000,},
    [53] = {53,"曹丕",4,11020,"这取代汉室的帝星，不是我又能是谁？",203,45053,10,53,1,10000,},
    [54] = {54,"法正",4,12011,"惹我的，必将十倍奉还！",203,45054,10,54,1,10000,},
    [55] = {55,"马良",4,12013,"下智伐人，上智攻心。你的伎俩，我已全数识破。",203,45055,10,55,1,10000,},
    [56] = {56,"夏侯涓",4,12014,"执子之手，与子携老。",203,45056,10,56,1,10000,},
    [57] = {57,"黄月英",4,12015,"孔明大人，这样可以算帮到您了吗？",203,45057,10,57,1,10000,},
    [58] = {58,"关兴",4,12017,"战斗，是我生命的一部分！",203,45058,10,58,1,10000,},
    [59] = {59,"张苞",4,12018,"你的首级，借给我耍耍？",203,45059,10,59,1,10000,},
    [60] = {60,"孟获",4,12019,"看我南蛮藤甲军杀你个片甲不留！",203,45060,10,60,1,10000,},
    [61] = {61,"祝融",4,12002,"与我南蛮勇士比，北人真是弱不禁风啊！",203,45061,10,61,1,10000,},
    [62] = {62,"程普",4,13011,"程普虽老，但老当益壮，不输年轻人！",203,45062,10,62,1,10000,},
    [63] = {63,"孙尚香",4,13012,"尚香虽是女儿身，却也巾帼不让须眉。",203,45063,10,63,1,10000,},
    [64] = {64,"步练师",4,13013,"夫君莫急，且听臣妾一曲。",203,45064,10,64,1,10000,},
    [65] = {65,"周泰",4,13015,"大丈夫，当带三尺之剑，立不世之功！",203,45065,10,65,1,10000,},
    [66] = {66,"黄盖",4,13016,"有种你就鞭挞我吧 ，周瑜小儿！",203,45066,10,66,1,10000,},
    [67] = {67,"徐盛",4,13017,"大军在此！汝等休想前进一步！",203,45067,10,67,1,10000,},
    [68] = {68,"张昭",4,13018,"陛下以恩待臣，张昭以此躯报陛下之恩。",203,45068,10,68,1,10000,},
    [69] = {69,"张纮",4,13019,"江东已历三世，我当为死谏之臣！",203,45069,10,69,1,10000,},
    [70] = {70,"蔡文姬",4,14008,"翩翩吹我衣，萧萧入我耳。",203,45070,10,70,1,10000,},
    [71] = {71,"高顺",4,14010,"我陷阵营攻无不克，战无不胜。",203,45071,10,71,1,10000,},
    [72] = {72,"陈宫",4,14001,"曹操此人，必为奸雄而祸害天下。",203,45072,10,72,1,10000,},
    [73] = {73,"田丰",4,14011,"袁绍愚夫，不听我言，现在知道错了吧！",203,45073,10,73,1,10000,},
    [74] = {74,"沮授",4,14012,"哪怕河北全境陷落，我也不会投降曹贼。",203,45074,10,74,1,10000,},
    [75] = {75,"颜良",4,14013,"吾乃河北上将颜良是也，快来与我等决一死战！",203,45075,10,75,1,10000,},
    [76] = {76,"文丑",4,14014,"吾乃河北上将文丑是也，快来与我等决一死战！",203,45076,10,76,1,10000,},
    }
}



local __index_id = {
    [1] = 1,
    [10] = 10,
    [11] = 11,
    [12] = 12,
    [13] = 13,
    [14] = 14,
    [15] = 15,
    [16] = 16,
    [17] = 17,
    [18] = 18,
    [19] = 19,
    [2] = 2,
    [20] = 20,
    [21] = 21,
    [22] = 22,
    [23] = 23,
    [24] = 24,
    [25] = 25,
    [26] = 26,
    [27] = 27,
    [28] = 28,
    [29] = 29,
    [3] = 3,
    [30] = 30,
    [31] = 31,
    [32] = 32,
    [33] = 33,
    [34] = 34,
    [35] = 35,
    [36] = 36,
    [37] = 37,
    [38] = 38,
    [39] = 39,
    [4] = 4,
    [40] = 40,
    [41] = 41,
    [42] = 42,
    [43] = 43,
    [44] = 44,
    [45] = 45,
    [46] = 46,
    [47] = 47,
    [48] = 48,
    [49] = 49,
    [5] = 5,
    [50] = 50,
    [51] = 51,
    [52] = 52,
    [53] = 53,
    [54] = 54,
    [55] = 55,
    [56] = 56,
    [57] = 57,
    [58] = 58,
    [59] = 59,
    [6] = 6,
    [60] = 60,
    [61] = 61,
    [62] = 62,
    [63] = 63,
    [64] = 64,
    [65] = 65,
    [66] = 66,
    [67] = 67,
    [68] = 68,
    [69] = 69,
    [7] = 7,
    [70] = 70,
    [71] = 71,
    [72] = 72,
    [73] = 73,
    [74] = 74,
    [75] = 75,
    [76] = 76,
    [8] = 8,
    [9] = 9,

}

local __key_map = {
  id = 1,
  name = 2,
  quality = 3,
  res_id = 4,
  talk = 5,
  dungeon_pro = 6,
  monster_team = 7,
  ksoul_point = 8,
  ksoul_id1 = 9,
  ksoul_size1 = 10,
  ksoul_pro1 = 11,

}



local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_ksoul_dungeon_info")
        
        
        return t._raw[__key_map[k]]
    end
}


function ksoul_dungeon_info.getLength()
    return #ksoul_dungeon_info._data
end



function ksoul_dungeon_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_ksoul_dungeon_info
function ksoul_dungeon_info.indexOf(index)
    if index == nil then
        return nil
    end
    
    return setmetatable({_raw = ksoul_dungeon_info._data[index]}, m)
    
end

---
--@return @class record_ksoul_dungeon_info
function ksoul_dungeon_info.get(id)
    
    return ksoul_dungeon_info.indexOf(__index_id[id])
        
end



function ksoul_dungeon_info.set(id, key, value)
    local record = ksoul_dungeon_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function ksoul_dungeon_info.get_index_data()
    return __index_id
end