

---@classdef record_sanguozhi_info
local record_sanguozhi_info = {}
  
record_sanguozhi_info.id = 0 --编号  
record_sanguozhi_info.award_type = 0 --奖励类型  
record_sanguozhi_info.belongs = 0 --所属  
record_sanguozhi_info.req1 = 0 --需求条件1  
record_sanguozhi_info.req2 = 0 --需求条件2  
record_sanguozhi_info.req3 = 0 --需求条件3  
record_sanguozhi_info.req4 = 0 --需求条件4  
record_sanguozhi_info.req5 = 0 --需求条件5  
record_sanguozhi_info.attack_add = 0 --攻击加成  
record_sanguozhi_info.physical_defence_add = 0 --物防加成  
record_sanguozhi_info.magical_defence_add = 0 --法防加成  
record_sanguozhi_info.health_add = 0 --生命加成  
record_sanguozhi_info.award1_type = 0 --奖励1类型  
record_sanguozhi_info.award1_value = 0 --奖励1类型值  
record_sanguozhi_info.award1_num = 0 --奖励1数量  
record_sanguozhi_info.award2_type = 0 --奖励2类型  
record_sanguozhi_info.award2_value = 0 --奖励2类型值  
record_sanguozhi_info.award2_num = 0 --奖励2数量  
record_sanguozhi_info.award3_type = 0 --奖励3类型  
record_sanguozhi_info.award3_value = 0 --奖励3类型值  
record_sanguozhi_info.award3_num = 0 --奖励3数量  
record_sanguozhi_info.award4_type = 0 --奖励4类型  
record_sanguozhi_info.award4_value = 0 --奖励4类型值  
record_sanguozhi_info.award4_num = 0 --奖励4数量  
record_sanguozhi_info.award5_type = 0 --奖励5类型  
record_sanguozhi_info.award5_value = 0 --奖励5类型值  
record_sanguozhi_info.award5_num = 0 --奖励5数量  
record_sanguozhi_info.icon = 0 --图标信息  
record_sanguozhi_info.title = "" --奖励标题


sanguozhi_info = {
   _data = {
    [1] = {1,1,0,1,0,0,0,0,0,0,0,0,1,0,20000,13,0,30,3,6,50,0,0,0,0,0,0,13014,"貂蝉传",},
    [2] = {2,1,0,2,0,0,0,0,0,0,0,0,1,0,20000,13,0,30,3,6,50,0,0,0,0,0,0,14029,"王允传",},
    [3] = {3,1,0,3,0,0,0,0,0,0,0,0,1,0,20000,13,0,30,3,6,50,0,0,0,0,0,0,14016,"董卓传",},
    [4] = {4,1,0,4,0,0,0,0,0,0,0,0,1,0,25000,13,0,50,3,6,50,0,0,0,0,0,0,14029,"陶谦传",},
    [5] = {5,1,0,5,0,0,0,0,0,0,0,0,1,0,25000,13,0,50,3,6,50,0,0,0,0,0,0,13006,"太史慈传",},
    [6] = {6,1,0,6,0,0,0,0,0,0,0,0,1,0,25000,13,0,50,3,6,50,0,0,0,0,0,0,11001,"郭嘉传",},
    [7] = {7,1,0,7,0,0,0,0,0,0,0,0,1,0,30000,13,0,70,3,6,50,0,0,0,0,0,0,11009,"贾诩传",},
    [8] = {8,1,0,8,0,0,0,0,0,0,0,0,1,0,30000,13,0,70,3,6,50,0,0,0,0,0,0,12044,"董承传",},
    [9] = {9,1,0,9,0,0,0,0,0,0,0,0,1,0,30000,13,0,70,3,6,50,0,0,0,0,0,0,14039,"汉献帝传",},
    [10] = {10,1,0,10,0,0,0,0,0,0,0,0,1,0,35000,13,0,90,3,6,50,0,0,0,0,0,0,11023,"张绣传",},
    [11] = {11,1,0,11,0,0,0,0,0,0,0,0,1,0,35000,13,0,90,3,6,50,0,0,0,0,0,0,11048,"魏续传",},
    [12] = {12,1,0,12,0,0,0,0,0,0,0,0,1,0,35000,13,0,90,3,6,50,0,0,0,0,0,0,14005,"吕布传",},
    [13] = {13,1,0,13,0,0,0,0,0,0,0,0,1,0,40000,13,0,110,3,6,50,0,0,0,0,0,0,12008,"刘备传",},
    [14] = {14,1,0,14,0,0,0,0,0,0,0,0,1,0,40000,13,0,110,3,6,50,0,0,0,0,0,0,11010,"程昱传",},
    [15] = {15,1,0,15,0,0,0,0,0,0,0,0,1,0,40000,13,0,110,3,6,50,0,0,0,0,0,0,11007,"荀彧传",},
    [16] = {16,1,0,16,0,0,0,0,0,0,0,0,1,0,45000,13,0,130,3,6,50,0,0,0,0,0,0,14027,"袁术传",},
    [17] = {17,1,0,17,0,0,0,0,0,0,0,0,1,0,45000,13,0,130,3,6,50,0,0,0,0,0,0,11034,"陈琳传",},
    [18] = {18,1,0,18,0,0,0,0,0,0,0,0,1,0,45000,13,0,130,3,6,50,0,0,0,0,0,0,11003,"曹仁传",},
    [19] = {19,1,0,19,0,0,0,0,0,0,0,0,1,0,50000,13,0,150,3,6,50,0,0,0,0,0,0,11006,"张辽传",},
    [20] = {20,1,0,20,0,0,0,0,0,0,0,0,1,0,50000,13,0,150,3,6,50,0,0,0,0,0,0,14014,"文丑传",},
    [21] = {21,1,0,21,0,0,0,0,0,0,0,0,1,0,50000,13,0,150,3,6,50,0,0,0,0,0,0,11015,"徐晃传",},
    [22] = {22,1,0,22,0,0,0,0,0,0,0,0,1,0,55000,13,0,170,3,6,50,0,0,0,0,0,0,12027,"廖化传",},
    [23] = {23,1,0,23,0,0,0,0,0,0,0,0,1,0,55000,13,0,170,3,6,50,0,0,0,0,0,0,12003,"关羽传",},
    [24] = {24,1,0,24,0,0,0,0,0,0,0,0,1,0,55000,13,0,170,3,6,50,0,0,0,0,0,0,12001,"赵云传",},
    [25] = {25,1,0,25,0,0,0,0,0,0,0,0,1,0,60000,13,0,190,3,6,50,0,0,0,0,0,0,13004,"孙策传",},
    [26] = {26,1,0,26,0,0,0,0,0,0,0,0,1,0,60000,13,0,190,3,6,50,0,0,0,0,0,0,13002,"周瑜传",},
    [27] = {27,1,0,27,0,0,0,0,0,0,0,0,1,0,60000,13,0,190,3,6,50,0,0,0,0,0,0,13005,"孙权传",},
    [28] = {28,1,0,28,0,0,0,0,0,0,0,0,1,0,65000,13,0,210,3,6,50,0,0,0,0,0,0,11002,"曹操传",},
    [29] = {29,1,0,29,0,0,0,0,0,0,0,0,1,0,65000,13,0,210,3,6,50,0,0,0,0,0,0,14012,"沮授传",},
    [30] = {30,1,0,30,0,0,0,0,0,0,0,0,1,0,65000,13,0,210,3,6,50,0,0,0,0,0,0,14043,"审配传",},
    [31] = {31,1,0,31,0,0,0,0,0,0,0,0,1,0,70000,13,0,230,3,6,50,0,0,0,0,0,0,13017,"袁谭传",},
    [32] = {32,1,0,32,0,0,0,0,0,0,0,0,1,0,70000,13,0,230,3,6,50,0,0,0,0,0,0,14012,"袁尚传",},
    [33] = {33,1,0,33,0,0,0,0,0,0,0,0,1,0,70000,13,0,230,3,6,50,0,0,0,0,0,0,11018,"甄姬传",},
    [34] = {1001,2,1,1001,0,0,0,0,0,0,0,2000,1,0,50000,13,0,100,3,6,50,0,0,0,0,0,0,1,"连环计",},
    [35] = {1002,2,1,1002,0,0,0,0,160,0,0,0,1,0,75000,13,0,150,3,6,50,0,0,0,0,0,0,4,"三让徐州",},
    [36] = {1003,2,1,1003,0,0,0,0,0,100,100,0,1,0,100000,13,0,200,3,6,50,0,0,0,0,0,0,5,"挟天子令诸侯",},
    [37] = {1004,2,1,1004,0,0,0,0,0,0,0,2000,1,0,125000,13,0,250,3,6,50,0,0,0,0,0,0,2,"吕布之死",},
    [38] = {1005,2,1,1005,0,0,0,0,160,0,0,0,1,0,150000,13,0,300,3,6,50,0,0,0,0,0,0,3,"青梅煮酒",},
    [39] = {1006,2,1,1006,0,0,0,0,0,100,100,0,1,0,175000,13,0,350,3,6,50,0,0,0,0,0,0,6,"黎阳之战",},
    [40] = {1007,2,1,1007,0,0,0,0,0,0,0,2000,1,0,200000,13,0,400,3,6,50,0,0,0,0,0,0,6,"白马之围",},
    [41] = {1008,2,1,1008,0,0,0,0,160,0,0,0,1,0,225000,13,0,450,3,6,50,0,0,0,0,0,0,6,"千里走单骑",},
    [42] = {1009,2,1,1009,0,0,0,0,0,100,100,0,1,0,250000,13,0,500,3,6,50,0,0,0,0,0,0,6,"孙权掌江东",},
    [43] = {1010,2,1,1010,0,0,0,0,0,0,0,2000,1,0,275000,13,0,550,3,6,50,0,0,0,0,0,0,6,"官渡之战",},
    [44] = {1011,2,1,1011,0,0,0,0,160,0,0,0,1,0,300000,13,0,600,3,6,50,0,0,0,0,0,0,6,"河北之战",},
    }
}



local __index_id = {
    [1] = 1,
    [10] = 10,
    [1001] = 34,
    [1002] = 35,
    [1003] = 36,
    [1004] = 37,
    [1005] = 38,
    [1006] = 39,
    [1007] = 40,
    [1008] = 41,
    [1009] = 42,
    [1010] = 43,
    [1011] = 44,
    [11] = 11,
    [12] = 12,
    [13] = 13,
    [14] = 14,
    [15] = 15,
    [16] = 16,
    [17] = 17,
    [18] = 18,
    [19] = 19,
    [2] = 2,
    [20] = 20,
    [21] = 21,
    [22] = 22,
    [23] = 23,
    [24] = 24,
    [25] = 25,
    [26] = 26,
    [27] = 27,
    [28] = 28,
    [29] = 29,
    [3] = 3,
    [30] = 30,
    [31] = 31,
    [32] = 32,
    [33] = 33,
    [4] = 4,
    [5] = 5,
    [6] = 6,
    [7] = 7,
    [8] = 8,
    [9] = 9,

}

local __key_map = {
  id = 1,
  award_type = 2,
  belongs = 3,
  req1 = 4,
  req2 = 5,
  req3 = 6,
  req4 = 7,
  req5 = 8,
  attack_add = 9,
  physical_defence_add = 10,
  magical_defence_add = 11,
  health_add = 12,
  award1_type = 13,
  award1_value = 14,
  award1_num = 15,
  award2_type = 16,
  award2_value = 17,
  award2_num = 18,
  award3_type = 19,
  award3_value = 20,
  award3_num = 21,
  award4_type = 22,
  award4_value = 23,
  award4_num = 24,
  award5_type = 25,
  award5_value = 26,
  award5_num = 27,
  icon = 28,
  title = 29,

}



local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_sanguozhi_info")
        
        
        return t._raw[__key_map[k]]
    end
}


function sanguozhi_info.getLength()
    return #sanguozhi_info._data
end



function sanguozhi_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_sanguozhi_info
function sanguozhi_info.indexOf(index)
    if index == nil then
        return nil
    end
    
    return setmetatable({_raw = sanguozhi_info._data[index]}, m)
    
end

---
--@return @class record_sanguozhi_info
function sanguozhi_info.get(id)
    
    return sanguozhi_info.indexOf(__index_id[id])
        
end



function sanguozhi_info.set(id, key, value)
    local record = sanguozhi_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function sanguozhi_info.get_index_data()
    return __index_id
end