

---@classdef record_special_holiday_info
local record_special_holiday_info = {}
  
record_special_holiday_info.id = 0 --任务id  
record_special_holiday_info.tags = 0 --任务页签  
record_special_holiday_info.directions = "" --任务描述  
record_special_holiday_info.limit_time = 0 --任务时间  
record_special_holiday_info.arrange = 0 --显示顺序  
record_special_holiday_info.start_time = 0 --开始时间  
record_special_holiday_info.end_time = 0 --结束时间  
record_special_holiday_info.task_type = 0 --任务类型  
record_special_holiday_info.task_value1 = 0 --任务类型值1  
record_special_holiday_info.task_value2 = 0 --任务类型值2  
record_special_holiday_info.task_value3 = 0 --任务类型值3  
record_special_holiday_info.type_1 = 0 --奖励类型1  
record_special_holiday_info.value_1 = 0 --奖励类型值1  
record_special_holiday_info.size_1 = 0 --奖励数量1  
record_special_holiday_info.type_2 = 0 --奖励类型2  
record_special_holiday_info.value_2 = 0 --奖励类型值2  
record_special_holiday_info.size_2 = 0 --奖励数量2  
record_special_holiday_info.type_3 = 0 --奖励类型3  
record_special_holiday_info.value_3 = 0 --奖励类型值3  
record_special_holiday_info.size_3 = 0 --奖励数量3  
record_special_holiday_info.type_4 = 0 --奖励类型4  
record_special_holiday_info.value_4 = 0 --奖励类型值4  
record_special_holiday_info.size_4 = 0 --奖励数量4


special_holiday_info = {
   _data = {
    [1] = {170,1,"12.11登录可领取",1,69,1449763200,1449849600,43,1,0,0,2,0,300,3,22,2,3,303,30,0,0,0,},
    [2] = {171,1,"12.12登录可领取",1,70,1449849600,1449936000,43,1,0,0,2,0,300,3,13,20,3,303,30,0,0,0,},
    [3] = {172,1,"12.13登录可领取",1,71,1449936000,1450022400,43,1,0,0,2,0,300,3,18,100,3,303,30,0,0,0,},
    [4] = {173,1,"单笔充值6元",1,72,1449763200,1450022400,1,6,6,6,3,13,8,3,304,1,0,0,0,0,0,0,},
    [5] = {174,1,"单笔充值30元",1,73,1449763200,1450022400,1,30,6,30,3,18,188,3,304,2,0,0,0,0,0,0,},
    [6] = {175,1,"单笔充值50元",1,74,1449763200,1450022400,1,50,6,50,3,13,68,3,304,3,0,0,0,0,0,0,},
    [7] = {176,1,"单笔充值128元",1,75,1449763200,1450022400,1,128,6,128,3,18,588,3,304,8,0,0,0,0,0,0,},
    [8] = {177,1,"单笔充值288元",1,76,1449763200,1450022400,1,288,6,288,3,13,288,3,304,18,0,0,0,0,0,0,},
    [9] = {178,1,"单笔充值548元",1,77,1449763200,1450022400,1,548,6,548,3,3,30,13,0,3000,3,304,28,0,0,0,},
    [10] = {179,1,"单笔充值648元",1,78,1449763200,1450022400,1,648,6,648,6,50010,40,3,304,36,0,0,0,0,0,0,},
    [11] = {180,2,"活动期间巡游探宝积分到达X（#num1#/X）",1,79,1449763200,1450022400,23,288,0,0,13,0,500,0,0,0,0,0,0,0,0,0,},
    [12] = {181,2,"活动期间巡游探宝积分到达X（#num1#/X）",1,80,1449763200,1450022400,23,388,0,0,3,3,5,0,0,0,0,0,0,0,0,0,},
    [13] = {182,2,"活动期间巡游探宝积分到达X（#num1#/X）",1,81,1449763200,1450022400,23,588,0,0,13,0,800,0,0,0,0,0,0,0,0,0,},
    [14] = {183,2,"活动期间巡游探宝积分到达X（#num1#/X）",1,82,1449763200,1450022400,23,888,0,0,3,3,8,0,0,0,0,0,0,0,0,0,},
    [15] = {184,2,"活动期间巡游探宝积分到达X（#num1#/X）",1,83,1449763200,1450022400,23,1288,0,0,13,0,1200,0,0,0,0,0,0,0,0,0,},
    [16] = {185,2,"活动期间巡游探宝积分到达X（#num1#/X）",1,84,1449763200,1450022400,23,1888,0,0,3,3,12,0,0,0,0,0,0,0,0,0,},
    [17] = {186,2,"活动期间巡游探宝积分到达X（#num1#/X）",1,85,1449763200,1450022400,23,2288,0,0,13,0,1500,0,0,0,0,0,0,0,0,0,},
    [18] = {187,2,"活动期间巡游探宝积分到达X（#num1#/X）",1,86,1449763200,1450022400,23,2888,0,0,3,3,15,0,0,0,0,0,0,0,0,0,},
    [19] = {188,2,"活动期间巡游探宝积分到达X（#num1#/X）",1,87,1449763200,1450022400,23,3888,0,0,13,0,5000,0,0,0,0,0,0,0,0,0,},
    [20] = {189,2,"活动期间巡游探宝积分到达X（#num1#/X）",1,88,1449763200,1450022400,23,5888,0,0,3,186,1,0,0,0,0,0,0,0,0,0,},
    [21] = {190,3,"活动期间三国无双重置X次（#num1#/X）",1,89,1449763200,1450022400,24,3,0,0,16,0,2888,3,303,10,0,0,0,0,0,0,},
    [22] = {191,3,"活动期间三国无双重置X次（#num1#/X）",1,90,1449763200,1450022400,24,5,0,0,16,0,3888,3,303,20,0,0,0,0,0,0,},
    [23] = {192,3,"活动期间三国无双重置X次（#num1#/X）",1,91,1449763200,1450022400,24,8,0,0,16,0,5888,3,303,30,0,0,0,0,0,0,},
    [24] = {193,3,"活动期间三国无双重置X次（#num1#/X）",1,92,1449763200,1450022400,24,10,0,0,16,0,8888,3,303,30,0,0,0,0,0,0,},
    [25] = {194,3,"活动期间三国无双重置X次（#num1#/X）",1,93,1449763200,1450022400,24,12,0,0,16,0,12888,3,303,30,0,0,0,0,0,0,},
    [26] = {195,3,"活动期间夺宝X次（#num1#/X）",1,94,1449763200,1450022400,25,75,0,0,3,18,58,3,303,5,0,0,0,0,0,0,},
    [27] = {196,3,"活动期间夺宝X次（#num1#/X）",1,95,1449763200,1450022400,25,150,0,0,3,18,98,3,303,10,0,0,0,0,0,0,},
    [28] = {197,3,"活动期间夺宝X次（#num1#/X）",1,96,1449763200,1450022400,25,225,0,0,3,18,158,3,303,10,0,0,0,0,0,0,},
    [29] = {198,3,"活动期间夺宝X次（#num1#/X）",1,97,1449763200,1450022400,25,300,0,0,3,4,10,3,303,15,0,0,0,0,0,0,},
    [30] = {199,3,"活动期间夺宝X次（#num1#/X）",1,98,1449763200,1450022400,25,375,0,0,3,18,188,3,303,15,0,0,0,0,0,0,},
    [31] = {200,3,"活动期间夺宝X次（#num1#/X）",1,99,1449763200,1450022400,25,450,0,0,3,4,20,3,303,20,0,0,0,0,0,0,},
    [32] = {201,3,"活动期间夺宝X次（#num1#/X）",1,100,1449763200,1450022400,25,525,0,0,3,18,288,3,303,25,0,0,0,0,0,0,},
    [33] = {202,3,"活动期间夺宝X次（#num1#/X）",1,101,1449763200,1450022400,25,600,0,0,3,18,388,3,303,30,0,0,0,0,0,0,},
    [34] = {203,3,"活动期间夺宝X次（#num1#/X）",1,102,1449763200,1450022400,25,675,0,0,3,18,488,3,303,35,0,0,0,0,0,0,},
    [35] = {204,3,"活动期间夺宝X次（#num1#/X）",1,103,1449763200,1450022400,25,750,0,0,3,18,588,3,303,40,0,0,0,0,0,0,},
    }
}



local __index_id = {
    [170] = 1,
    [171] = 2,
    [172] = 3,
    [173] = 4,
    [174] = 5,
    [175] = 6,
    [176] = 7,
    [177] = 8,
    [178] = 9,
    [179] = 10,
    [180] = 11,
    [181] = 12,
    [182] = 13,
    [183] = 14,
    [184] = 15,
    [185] = 16,
    [186] = 17,
    [187] = 18,
    [188] = 19,
    [189] = 20,
    [190] = 21,
    [191] = 22,
    [192] = 23,
    [193] = 24,
    [194] = 25,
    [195] = 26,
    [196] = 27,
    [197] = 28,
    [198] = 29,
    [199] = 30,
    [200] = 31,
    [201] = 32,
    [202] = 33,
    [203] = 34,
    [204] = 35,

}

local __key_map = {
  id = 1,
  tags = 2,
  directions = 3,
  limit_time = 4,
  arrange = 5,
  start_time = 6,
  end_time = 7,
  task_type = 8,
  task_value1 = 9,
  task_value2 = 10,
  task_value3 = 11,
  type_1 = 12,
  value_1 = 13,
  size_1 = 14,
  type_2 = 15,
  value_2 = 16,
  size_2 = 17,
  type_3 = 18,
  value_3 = 19,
  size_3 = 20,
  type_4 = 21,
  value_4 = 22,
  size_4 = 23,

}



local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_special_holiday_info")
        
        
        return t._raw[__key_map[k]]
    end
}


function special_holiday_info.getLength()
    return #special_holiday_info._data
end



function special_holiday_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_special_holiday_info
function special_holiday_info.indexOf(index)
    if index == nil then
        return nil
    end
    
    return setmetatable({_raw = special_holiday_info._data[index]}, m)
    
end

---
--@return @class record_special_holiday_info
function special_holiday_info.get(id)
    
    return special_holiday_info.indexOf(__index_id[id])
        
end



function special_holiday_info.set(id, key, value)
    local record = special_holiday_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function special_holiday_info.get_index_data()
    return __index_id
end