

---@classdef record_story_talk_info
local record_story_talk_info = {}
  
record_story_talk_info.story_id = 0 --剧情ID  
record_story_talk_info.step = 0 --剧情顺序  
record_story_talk_info.monster_id = 0 --剧情：调用角色  
record_story_talk_info.talk_position = 0 --位置朝向  
record_story_talk_info.substance_boy = "" --对话内容（男）  
record_story_talk_info.substance_girl = "" --对话内容（女）


story_talk_info = {
   _data = {
    [1] = {1,1,19003,1,"<root><text value='多谢主角大人，要不是你及时相救，我就要被贼人带走了' /> <image path='ui/chat/face/44.png'/></root>","",},
    [2] = {1,2,0,2,"<root><text value='没想到会在这遇到你，匈奴贼寇居然如此大胆，入关百里来抢掠' /> <image path='ui/chat/face/8.png'/></root>","<root><text value='没想到会在这儿遇到你，匈奴贼寇居然如此大胆，入关百里来抢掠' /> <image path='ui/chat/face/8.png'/></root>",},
    [3] = {1,3,19003,1,"<root><text value='不好，前方还有一队百姓受了匈奴贼寇掳掠，我们快追！' /> </root>","",},
    [4] = {2,1,19003,1,"<root><text value='文姬无依无靠，将军，请带我回中原吧！' /> <image path='ui/chat/face/14.png'/></root>","",},
    [5] = {2,2,0,2,"<root><text value='好，就让我来保护你吧。' /> <image path='ui/chat/face/33.png'/></root>","<root><text value='好，就让我来保护你吧。' /> <image path='ui/chat/face/33.png'/></root>",},
    [6] = {5,1,19003,1,"<root><text value='关系亲密的武将，可以释放合击大招，威力无穷！' /> </root>","",},
    [7] = {5,2,19003,1,"<root><text value='月英妹妹，让我们来释放合击大招吧！' /> </root>","",},
    [8] = {5,3,19005,2,"<root><text value='好，姐妹同心，合击！' /> </root>","",},
    [9] = {1001,1,19006,1,"<root><text value='子龙将军，可敢接受我刘关张三兄弟的挑战？' /> <image path='ui/chat/face/33.png'/></root>","",},
    [10] = {1001,2,19007,2,"<root><text value='有何不敢？徒儿，让他们见识一下我们的厉害吧！' /> <image path='ui/chat/face/37.png'/></root>","",},
    [11] = {1002,1,19006,1,"<root><text value='赵云将军真是厉害，现在中原战乱，将军可愿意回去平黄巾贼？' /> </root>","",},
    [12] = {1002,2,19007,1,"<root><text value='我正想回中原！徒儿，今天就此别过，后会有期。' /> </root>","",},
    [13] = {1002,3,0,2,"<root><text value='师傅放心，终有一天我会超越你，成为三国之王！' /> <image path='ui/chat/face/33.png'/></root>","<root><text value='师傅放心，终有一天我会超越你，成为三国之王！' /> <image path='ui/chat/face/33.png'/></root>",},
    [14] = {1003,1,0,2,"<root><text value='匈奴兵竟敢来中原抢掠，就让我找几个不长眼的练练手吧。' /> </root>","<root><text value='中原处处战乱，匈奴兵也入关抢掠，就让我找几个不长眼的练练手吧。' /> </root>",},
    [15] = {1003,2,19004,1,"<root><text value='哈哈，这个汉人女子如花似玉，正好抢回去献给单于大人！' /> <image path='ui/chat/face/36.png'/></root>","",},
    [16] = {1003,3,19003,1,"<root><text value='将军，快救救我！小女是南阳人，姓蔡小名文姬。' /> </root>","",},
    [17] = {1003,4,0,2,"<root><text value='放开那个女孩，你们这些匈奴贼子死期到了！' /> <image path='ui/chat/face/8.png'/></root>","<root><text value='放开那个女孩，你们这些匈奴贼子死期到了！' /> <image path='ui/chat/face/8.png'/></root>",},
    [18] = {1004,1,19003,1,"<root><text value='将军，捡起地上的宝箱吧，宝箱里是贼寇的财物。' /> </root>","",},
    [19] = {1005,1,19003,1,"<root><text value='现在让文姬也上阵，加入你的战斗队伍吧！' /> </root>","",},
    [20] = {1006,1,19003,1,"<root><text value='将军，我们速速出发，去解救前面的百姓吧。' /> </root>","",},
    [21] = {1007,1,0,2,"<root><text value='匈奴贼寇真多，可惜碰到了我，他们倒霉的时候到了！' /> <image path='ui/chat/face/53.png'/></root>","<root><text value='匈奴贼寇真多，可惜碰到了我，他们倒霉的时候到了！' /> <image path='ui/chat/face/53.png'/></root>",},
    [22] = {1007,2,19003,1,"<root><text value='这只是小股敌人，匈奴贼寇的大部队还在前方。' /> </root>","",},
    [23] = {1007,3,19003,1,"<root><text value='将军，虽然你武力超强，但我们势单力薄，最好找些人来帮忙。' /> </root>","",},
    [24] = {1007,4,19003,1,"<root><text value='前面有一个集市，我们去看看有没有能人异士能帮忙！' /> </root>","",},
    [25] = {1008,1,19005,1,"<root><text value='小女黄月英，擅长医术，可以助将军阵上疗伤。' /> <image path='ui/chat/face/44.png'/></root>","",},
    [26] = {1008,2,19003,2,"<root><text value='太好了，月英妹妹，赶快上阵加入我们的队伍吧。' /> <image path='ui/chat/face/36.png'/></root>","",},
    [27] = {1009,1,19003,2,"<root><text value='合理调整阵容中武将位置，可以战胜更强的敌人哦。' /> </root>","",},
    [28] = {1010,1,19005,2,"<root><text value='将军，兵贵神速，我们快马疾驰，杀贼寇一个措手不及吧。' /> </root>","",},
    [29] = {1011,1,19003,1,"<root><text value='但是前方的贼寇越来越强，我们需要先加强自身的实力。' /> </root>","",},
    [30] = {1011,2,19005,2,"<root><text value='包裹中的武将卡牌，可用来升级上阵武将，提升武将等级和战力。' /> </root>","",},
    [31] = {1012,1,19003,1,"<root><text value='除了战斗之外，还可以去商城购买稀有的经验龙宝宝用于武将升级。' /> </root>","",},
    [32] = {1013,1,19003,2,"<root><text value='就是这种宝物，用于武将升级可得到大量经验，我们快去试试吧。' /> </root>","",},
    [33] = {1014,1,19003,2,"<root><text value='升级果然让我的战力更强了呢！我已经迫不及待要去战斗了。' /> <image path='ui/chat/face/36.png'/></root>","",},
    [34] = {1015,1,19003,1,"<root><text value='战胜敌人能得到星星，如果星星数量足够，就可领取星星宝箱了哦！' /> </root>","",},
    [35] = {1016,1,19003,1,"<root><text value='星星宝箱中有银两和装备，还会有奇妙的突破石哦。' /> </root>","",},
    [36] = {1016,2,19003,1,"<root><text value='服用突破石，可让武将突破，获得实力大幅提升，开启新战斗天赋！' /> </root>","",},
    [37] = {1017,1,0,2,"<root><text value='突破后果然强大了，攻击增加了120点，浑身都充满了力量！' /> </root>","<root><text value='突破后果然强大了，攻击增加了120点，浑身都充满了力量！' /> </root>",},
    [38] = {1017,2,19003,1,"<root><text value='将军，宝箱中还有一件神兵，穿上它，攻击力就会大幅提升！' /> </root>","",},
    [39] = {1018,1,19003,1,"<root><text value='将军，您的实力提升迅猛，现在可以去挑战名将副本了。' /> </root>","",},
    [40] = {1018,2,19003,1,"<root><text value='名将副本中不仅有大量突破石，还有对应名将的武将碎片产出呢。' /> </root>","",},
    [41] = {1018,3,19003,1,"<root><text value='首次通关名将副本，更有元宝相送，缺元宝的时候就来多转转吧。' /> </root>","",},
    [42] = {1019,1,19003,1,"<root><text value='现在，将军您先挑战一下文姬的名将副本吧。' /> </root>","",},
    [43] = {1020,1,19003,1,"<root><text value='将军，您的实力已经很强了，可以开始争夺天下宝物了！' /> </root>","",},
    [44] = {1020,2,19003,1,"<root><text value='宝物兵符能增加生命，兵书能增加攻击，就让我们去抢一件宝物吧。' /> </root>","",},
    [45] = {1020,3,19003,1,"<root><text value='战斗胜利后能翻牌抽奖，有机会得到元宝、橙色武将、宝物碎片哦。' /> </root>","",},
    [46] = {1021,1,19003,2,"<root><text value='天下英雄都在抢夺这些宝物，将军不抢就没了，所以不要忘记夺宝哦。' /> </root>","",},
    [47] = {1022,1,19003,1,"<root><text value='将军，您已经名震天下，现在可以去挑战三国无双副本了！' /> </root>","",},
    [48] = {1022,2,0,2,"<root><text value='在三国无双副本中战胜敌人，积攒的威名可以购买紫色和橙色装备哦！那出发吧。' /> </root>","",},
    [49] = {1023,1,19003,1,"<root><text value='将军，是时候实现您的伟大志向，挑战天下英雄了！我们去竞技场吧。' /> </root>","",},
    [50] = {1023,2,0,2,"<root><text value='竞技场有非常多的突破石奖励，那么，就让我成为天下第一吧。' /> </root>","",},
    [51] = {1025,1,0,1,"<root><text value='有了称手兵器，攻击力果然突飞猛进，来再多贼寇都能一一斩杀。' /> </root>","<root><text value='有了称手兵器，攻击力果然突飞猛进，来再多贼寇都能一一斩杀。' /> </root>",},
    [52] = {1025,2,19003,2,"<root><text value='将军，那我们就一鼓作气，把这批贼寇消灭干净吧！' /> </root>","",},
    [53] = {2011,1,19003,2,"将军，前面就是黄巾贼大本营，黄巾贼首脑张角就在前方！","",},
    [54] = {2011,2,0,2,"很好，就让他成为我踏上英雄之路的第一块砖石吧！","很好，就让他成为我踏上英雄之路的第一块砖石吧！",},
    [55] = {2011,3,19003,2,"黄巾贼人多，那张角更是妖法惊人，将军千万要小心！","",},
    [56] = {2011,4,0,2,"安心吧文姬，就让这些黄巾贼看看我的厉害！","安心吧文姬，就让这些黄巾贼看看我的厉害！",},
    [57] = {2012,1,10008,1,"呔，哪来的野小子，胆敢闯我黄巾军营！","",},
    [58] = {2012,2,0,2,"赶紧让张角出来，我要和他大战三百回合！","赶紧让张角出来，我要和他大战三百回合！",},
    [59] = {2012,3,10008,1,"狂妄的小子，居然敢直呼天公将军大名，看我一刀劈了你！","",},
    [60] = {2012,4,0,2,"别碍路，给我走开！","别碍路，给我走开！",},
    [61] = {2013,1,10438,1,"我乃黄巾军人公将军张梁，哪来的小贼，胆敢闯我军营！","",},
    [62] = {2013,2,19003,2,"将军小心，这张梁乃张角之弟，擅长太平妖法。","",},
    [63] = {2013,3,0,2,"什么狗屁妖法，我才不会怕！","什么狗屁妖法，我才不会怕！",},
    [64] = {2013,4,10438,1,"看我道法：雷霆闪电，天下太平！","",},
    [65] = {2014,1,10010,1,"混蛋，刚才是你打伤我的弟弟？","",},
    [66] = {2014,2,0,2,"你又是谁？","你又是谁？",},
    [67] = {2014,3,19003,2,"将军，这人是张梁之兄张宝，是个厉害家伙，你千万要小心！","",},
    [68] = {2014,4,0,2,"啊哈，打了小的来大的，没事，来谁我都揍趴下！","啊哈，打了小的来大的，没事，来谁我都揍趴下！",},
    [69] = {2014,5,10010,1,"狂妄的小子，让你尝尝我太平道法的厉害！","",},
    [70] = {2015,1,10012,1,"哼，又一群被朝廷征讨令骗来的送死鬼！","",},
    [71] = {2015,2,0,2,"终于找到你了，张角，为了我的英雄之路，我们决战吧！","终于找到你了，张角，为了我的英雄之路，我们决战吧！",},
    [72] = {2015,3,19003,2,"将军，你这样说不够大气正义，你应该这样说","",},
    [73] = {2015,4,19003,2,"张角，你聚众造反，杀人无数，我家将军要替天行道消灭你！","",},
    [74] = {2015,5,10012,1,"苍天已死，黄天当立， 这个污秽世界就应该得到净化！","",},
    [75] = {2015,6,10012,1,"胆敢挑衅我的小子，让我的灭世雷霆净化你吧！","",},
    [76] = {2021,1,19003,2,"要成为大英雄，就当勇往直前，这次我们就去挑战那何进吧！","",},
    [77] = {2021,2,19003,2,"我们这样私闯皇宫真的好吗，将军……","",},
    [78] = {2021,3,0,2,"别纠结这个了文姬，你看前面浓烟滚滚，我们去看下怎么回事？","别纠结这个了文姬，你看前面浓烟滚滚，我们去看下怎么回事？",},
    [79] = {2021,4,10014,1,"哼， 胆敢闯入皇宫，你们一定是何进那逆贼手下，杀杀杀！","",},
    [80] = {2021,5,0,2,"一群渣渣也敢阻扰我的脚步，给我化为天边流星吧！","一群渣渣也敢阻扰我的脚步，给我化为天边流星吧！",},
    [81] = {2022,1,10019,1,"停步吧，有我陈琳在此，你们不可能再前进了。","",},
    [82] = {2022,2,0,2,"文姬，他是谁？","文姬，他是谁？",},
    [83] = {2022,3,19003,2,"这人是何进的主簿，“建安七子”之一，是个大文学家！","",},
    [84] = {2022,4,0,2,"你走开吧，我不欺负手无缚鸡之力的文人！","你走开吧，我不欺负手无缚鸡之力的文人！",},
    [85] = {2022,5,10019,1,"手无缚鸡之力？哼，就让你看看文人纸上谈兵的杀人之道！","",},
    [86] = {2023,1,0,2,"呼，这陈琳真是厉害，差点就被他击败了。","呼，这陈琳真是厉害，差点就被他击败了。",},
    [87] = {2023,2,19003,2,"不要小瞧文人啊，将军，他们是很厉害的。","",},
    [88] = {2023,3,0,2,"知道了文姬，那么接下来，我们继续朝前出发！","知道了文姬，那么接下来，我们继续朝前出发！",},
    [89] = {2024,1,10024,1,"见到哀家还不下跪，你们这帮贱民胆子不小！","",},
    [90] = {2024,2,0,2,"我是来找何进的，你一个弱女子我不欺负你，赶紧让开！","我是来找何进的，你一个弱女子我不欺负你，赶紧让开！",},
    [91] = {2024,3,19003,2,"将军，不要小看弱女子啊……","",},
    [92] = {2024,4,10024,1,"呵呵，弱女子？让你尝尝哀家鞭子的厉害！","",},
    [93] = {2025,1,0,2,"费劲千辛万苦，终于找到你了。何进，我们决战吧！","费劲千辛万苦，终于找到你了。何进，我们决战吧！",},
    [94] = {2025,2,10027,1,"一群废物，居然连帮贱民都拦不住！","",},
    [95] = {2025,3,10027,1,"最后关头还是得我亲自出手，小子，让你看看我宝刀的厉害！","",},
    [96] = {2026,1,10027,1,"可恶，我怎么可能会输，不行，我要重打一次！","",},
    [97] = {2026,2,0,1,"啰嗦的家伙，你就安静的谢幕吧！","啰嗦的家伙，你就安静的谢幕吧！",},
    [98] = {2031,1,0,2,"击败了何进，我感觉自己离大英雄又进了一步！","击败了何进，我感觉自己离大英雄又进了一步！",},
    [99] = {2031,2,19003,2,"接下来我们去哪呢，将军？","",},
    [100] = {2031,3,0,2,"听说诸侯在打虎牢关，一定有很多架可以打，我们去看看。","听说诸侯在打虎牢关，一定有很多架可以打，我们去看看。",},
    [101] = {2031,4,19003,2,"将军，你可真是个暴力分子啊……","",},
    [102] = {2032,1,10034,1,"这里乃我胡轸把守，小贼止步！","",},
    [103] = {2032,2,0,2,"胡轸？无名小卒吧，我可没听说过。","胡轸？无名小卒吧，我可没听说过。",},
    [104] = {2032,3,10034,1,"无名小卒？我可是凉州豪杰！小子，你成功激怒了我！","",},
    [105] = {2032,4,10034,1,"准备迎接我胡轸的怒火吧！","",},
    [106] = {2033,1,10037,1,"呔，你们是何人，胆敢犯我虎牢关？","",},
    [107] = {2033,2,0,2,"文姬，这个家伙是谁？又是所谓的凉州豪杰吗？","文姬，这个家伙是谁？又是所谓的凉州豪杰吗？",},
    [108] = {2033,3,19003,2,"将军，他叫樊稠，是董卓的部下，一个武力值一般的武将","",},
    [109] = {2033,4,10037,1,"一般？你居然说我武力值一般？现在就让你们看看我的厉害！","",},
    [110] = {2034,1,10037,1,"该…该死，居然被打败了，我怎么会输给你们这帮贱民！","",},
    [111] = {2034,2,10037,1,"今天的撤退是为了明天的进攻，你们等着，我会回来的!","",},
    [112] = {2035,1,10044,1,"小子，别以为打败了前面两个垃圾就可过关！","",},
    [113] = {2035,2,10044,1,"有我张济再此，今天就是你们丧命之时！","",},
    [114] = {2035,3,0,2,"要打架吗？我喜欢，来来来，让我们来战个痛快！","要打架吗？我喜欢，来来来，让我们来战个痛快！",},
    [115] = {2036,1,10047,1,"一群废物，居然连群小毛孩都打不过，看来还得我亲自出马！","",},
    [116] = {2036,2,19003,2,"主人小心，他是虎牢关守将华雄，武力值很高！","",},
    [117] = {2036,3,10047,1,"哼哼，知道我是华雄，那你们也该有下黄泉的觉悟了吧！","",},
    [118] = {2036,4,0,2,"很好，只有高手，才配成为我的对手，战吧，华雄！","很好，只有高手，才配成为我的对手，战吧，华雄！",},
    [119] = {2036,5,10047,1,"狂妄的小辈，给老子去死吧！","",},
    }
}



local __index_story_id_step = {
    ["1001_1"] = 9,
    ["1001_2"] = 10,
    ["1002_1"] = 11,
    ["1002_2"] = 12,
    ["1002_3"] = 13,
    ["1003_1"] = 14,
    ["1003_2"] = 15,
    ["1003_3"] = 16,
    ["1003_4"] = 17,
    ["1004_1"] = 18,
    ["1005_1"] = 19,
    ["1006_1"] = 20,
    ["1007_1"] = 21,
    ["1007_2"] = 22,
    ["1007_3"] = 23,
    ["1007_4"] = 24,
    ["1008_1"] = 25,
    ["1008_2"] = 26,
    ["1009_1"] = 27,
    ["1010_1"] = 28,
    ["1011_1"] = 29,
    ["1011_2"] = 30,
    ["1012_1"] = 31,
    ["1013_1"] = 32,
    ["1014_1"] = 33,
    ["1015_1"] = 34,
    ["1016_1"] = 35,
    ["1016_2"] = 36,
    ["1017_1"] = 37,
    ["1017_2"] = 38,
    ["1018_1"] = 39,
    ["1018_2"] = 40,
    ["1018_3"] = 41,
    ["1019_1"] = 42,
    ["1020_1"] = 43,
    ["1020_2"] = 44,
    ["1020_3"] = 45,
    ["1021_1"] = 46,
    ["1022_1"] = 47,
    ["1022_2"] = 48,
    ["1023_1"] = 49,
    ["1023_2"] = 50,
    ["1025_1"] = 51,
    ["1025_2"] = 52,
    ["1_1"] = 1,
    ["1_2"] = 2,
    ["1_3"] = 3,
    ["2011_1"] = 53,
    ["2011_2"] = 54,
    ["2011_3"] = 55,
    ["2011_4"] = 56,
    ["2012_1"] = 57,
    ["2012_2"] = 58,
    ["2012_3"] = 59,
    ["2012_4"] = 60,
    ["2013_1"] = 61,
    ["2013_2"] = 62,
    ["2013_3"] = 63,
    ["2013_4"] = 64,
    ["2014_1"] = 65,
    ["2014_2"] = 66,
    ["2014_3"] = 67,
    ["2014_4"] = 68,
    ["2014_5"] = 69,
    ["2015_1"] = 70,
    ["2015_2"] = 71,
    ["2015_3"] = 72,
    ["2015_4"] = 73,
    ["2015_5"] = 74,
    ["2015_6"] = 75,
    ["2021_1"] = 76,
    ["2021_2"] = 77,
    ["2021_3"] = 78,
    ["2021_4"] = 79,
    ["2021_5"] = 80,
    ["2022_1"] = 81,
    ["2022_2"] = 82,
    ["2022_3"] = 83,
    ["2022_4"] = 84,
    ["2022_5"] = 85,
    ["2023_1"] = 86,
    ["2023_2"] = 87,
    ["2023_3"] = 88,
    ["2024_1"] = 89,
    ["2024_2"] = 90,
    ["2024_3"] = 91,
    ["2024_4"] = 92,
    ["2025_1"] = 93,
    ["2025_2"] = 94,
    ["2025_3"] = 95,
    ["2026_1"] = 96,
    ["2026_2"] = 97,
    ["2031_1"] = 98,
    ["2031_2"] = 99,
    ["2031_3"] = 100,
    ["2031_4"] = 101,
    ["2032_1"] = 102,
    ["2032_2"] = 103,
    ["2032_3"] = 104,
    ["2032_4"] = 105,
    ["2033_1"] = 106,
    ["2033_2"] = 107,
    ["2033_3"] = 108,
    ["2033_4"] = 109,
    ["2034_1"] = 110,
    ["2034_2"] = 111,
    ["2035_1"] = 112,
    ["2035_2"] = 113,
    ["2035_3"] = 114,
    ["2036_1"] = 115,
    ["2036_2"] = 116,
    ["2036_3"] = 117,
    ["2036_4"] = 118,
    ["2036_5"] = 119,
    ["2_1"] = 4,
    ["2_2"] = 5,
    ["5_1"] = 6,
    ["5_2"] = 7,
    ["5_3"] = 8,

}

local __key_map = {
  story_id = 1,
  step = 2,
  monster_id = 3,
  talk_position = 4,
  substance_boy = 5,
  substance_girl = 6,

}



local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_story_talk_info")
        
        
        return t._raw[__key_map[k]]
    end
}


function story_talk_info.getLength()
    return #story_talk_info._data
end



function story_talk_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_story_talk_info
function story_talk_info.indexOf(index)
    if index == nil then
        return nil
    end
    
    return setmetatable({_raw = story_talk_info._data[index]}, m)
    
end

---
--@return @class record_story_talk_info
function story_talk_info.get(story_id,step)
    
    local k = story_id .. '_' .. step
    return story_talk_info.indexOf(__index_story_id_step[k])
        
end



function story_talk_info.set(story_id,step, key, value)
    local record = story_talk_info.get(story_id,step)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function story_talk_info.get_index_data()
    return __index_story_id_step
end