

---@classdef record_story_dungeon_info
local record_story_dungeon_info = {}
  
record_story_dungeon_info.id = 0 --编号  
record_story_dungeon_info.type = 0 --类型  
record_story_dungeon_info.name = "" --名称  
record_story_dungeon_info.quality = 0 --副本品质  
record_story_dungeon_info.pic = 0 --武将icon/战役图片  
record_story_dungeon_info.json_id = 0 --背景图  
record_story_dungeon_info.prepose_id = 0 --前置武将传  
record_story_dungeon_info.open_req1 = 0 --开放条件1（前置主线副本）  
record_story_dungeon_info.open_req2 = 0 --开放条件2  
record_story_dungeon_info.open_req3 = 0 --开放条件3  
record_story_dungeon_info.open_level = 0 --开放等级  
record_story_dungeon_info.barrier1 = 0 --关卡1  
record_story_dungeon_info.barrier2 = 0 --关卡2  
record_story_dungeon_info.barrier3 = 0 --关卡3  
record_story_dungeon_info.barrier4 = 0 --关卡4  
record_story_dungeon_info.box_drop_id = 0 --关卡5（宝箱）  
record_story_dungeon_info.is_once = 0 --是否只能打一次  
record_story_dungeon_info.direction = "" --武将描述文字


story_dungeon_info = {
   _data = {
    [1] = {1,1,"貂蝉传",3,14007,1,0,84,0,0,1,1,2,3,4,41001,0,"貂蝉，四大美人之一，少有国色天香之美貌，助王允完成连环计，致使吕布和董卓反目，为民除害！",},
    [2] = {2,1,"王允传",4,14029,3,1,97,0,0,1,5,6,7,8,41002,0,"王允，东汉祁县人，少有匡扶汉室大志，施展连环计，瓦解残暴而强大的董卓军阀势力，青史留名。",},
    [3] = {3,1,"董卓传",5,14016,4,2,110,0,0,1,9,10,11,12,41003,0,"董卓，汉末西凉军阀，少年好游侠，曾游历西域，后来控制东汉朝政多年，以凶狠残暴而著称。",},
    [4] = {4,1,"陶谦传",3,14029,2,3,123,0,0,1,13,14,15,16,41004,0,"陶谦，东汉丹阳人，少时即性格刚直有大志，后趁乱世割据徐州，官封徐州牧，溧阳侯，名震天下。",},
    [5] = {5,1,"太史慈传",4,13006,3,4,136,0,0,1,17,18,19,20,41005,0,"太史慈，汉末东莱人，少年有大志，猿臂善射，后归附孙策，成为东吴最顶尖的猛将之一。",},
    [6] = {6,1,"郭嘉传",5,11001,4,5,149,0,0,1,21,22,23,24,41006,0,"郭嘉，字奉孝，三国天才谋士，虽然三十八岁就英年早逝，但遗计定辽东的佳话流传千古。",},
    [7] = {7,1,"贾诩传",3,11009,3,6,162,0,0,1,25,26,27,28,41007,0,"贾诩，字文和，人称毒士，以毒辣的计谋著称于世，帮助曹操一统中原，是曹操最器重的谋士之一。",},
    [8] = {8,1,"董承传",4,12044,5,7,175,0,0,1,29,30,31,32,41008,0,"董承，东汉末年外戚，曾接受汉献帝衣带诏，发起灭杀曹操的运动，虽然失败身亡但忠义传天下。",},
    [9] = {9,1,"汉献帝传",5,14039,2,8,188,0,0,1,33,34,35,36,41009,0,"汉献帝，原名刘协，少时聪慧，先被董卓看中而立为皇帝，后被曹操挟持，当了数十年傀儡皇帝。",},
    [10] = {10,1,"张绣传",3,11023,4,9,201,0,0,1,37,38,39,40,41010,0,"张绣，人称北地枪王，少年时就武功盖世，擅长百鸟朝凤枪，曾经和赵云大战三百回合不分胜负。",},
    [11] = {11,1,"魏续传",4,11048,1,10,214,0,0,1,41,42,43,44,41011,0,"魏续，吕布麾下猛将，武力惊人，年少时曾想要割据一方，后跟随吕布成为汉末知名军阀。",},
    [12] = {12,1,"吕布传",5,14005,5,11,227,0,0,1,45,46,47,48,41012,0,"吕布，字奉先，三国第一猛将，持方天画戟，骑赤兔马，纵横天下数十年，刘关张围攻都打不过他。",},
    [13] = {13,1,"刘备传",3,12008,2,12,240,0,0,1,49,50,51,52,41013,0,"刘备，字玄德，少年时即以仁德著称于世，与曹操对抗多年，终于三分天下，成为蜀汉开国皇帝。",},
    [14] = {14,1,"程昱传",4,11010,2,13,253,0,0,1,53,54,55,56,41014,0,"程昱，字仲德，少年时曾率领乡民击退黄巾进攻，后施展智谋，帮助曹操一统中原，三分天下。",},
    [15] = {15,1,"荀彧传",5,11007,1,14,266,0,0,1,57,58,59,60,41015,0,"荀彧，字文若，年少时即被人称为王佐之才，后辅助曹操一统北方，被曹操赞为“吾之子房！”",},
    [16] = {16,1,"袁术传",3,14027,3,15,279,0,0,1,61,62,63,64,41016,0,"袁术，字公路，少年时以侠气闻名乡里，曾消灭十常侍叛乱，后割据寿春，成为东汉末年一方霸主。",},
    [17] = {17,1,"陈琳传",4,11034,3,16,292,0,0,1,65,66,67,68,41017,0,"陈琳，汉末著名文学家，名列建安七子之一，少年时就文采惊人，长大后辅佐曹操成为一代名臣。",},
    [18] = {18,1,"曹仁传",5,11003,2,17,305,0,0,1,69,70,71,72,41018,0,"曹仁，字子孝，曹操从弟，少年时行为不检，但长大后浪子回头，为魏国立下赫赫战功，封大司马。",},
    [19] = {19,1,"张辽传",3,11006,4,18,318,0,0,1,73,74,75,76,41019,0,"张辽，字文远，少年时武力过人，后辅助曹操征战天下，曾大战逍遥津让东吴丧胆，名列五子良将。",},
    [20] = {20,1,"文丑传",4,14014,5,19,331,0,0,1,77,78,79,80,41020,0,"文丑，汉末名将，勇冠三军，磐河一战力战赵云，打败公孙瓒麾下数将，是袁绍倚重的左膀右臂。",},
    [21] = {21,1,"徐晃传",5,11015,2,20,344,0,0,1,81,82,83,84,41021,0,"徐晃，字公明，少年时善于律己，以治军严谨著称，名列曹魏五子良将，曾击败关羽，威震华夏。",},
    [22] = {22,1,"廖化传",3,12027,1,21,357,0,0,1,85,86,87,88,41022,0,"廖化，字元俭，少年时就果敢刚直，曾辅佐关羽，后以先锋身份跟随诸葛亮北伐，蜀汉名将之一。",},
    [23] = {23,1,"关羽传",4,12003,5,22,370,0,0,1,89,90,91,92,41023,0,"关羽，字云长，曾温酒斩华雄，过五关斩六将，水淹七军……战绩无数，被后世尊称为武圣！",},
    [24] = {24,1,"赵云传",5,12001,5,23,383,0,0,1,93,94,95,96,41024,0,"赵云，字子龙，蜀国五虎大将，勇敢善战，长坂坡一战成名，百万曹军中如入无人之境，天下震惊。",},
    [25] = {25,1,"孙策传",3,13004,3,24,396,0,0,1,97,98,99,100,41025,0,"孙策，字伯符，绰号“小霸王”，年少英俊称孙郎，少年时率部征战，后来割据江东成为一方霸主。",},
    [26] = {26,1,"周瑜传",4,13007,4,25,409,0,0,1,101,102,103,104,41026,0,"周瑜，字公瑾，年少英俊，文武双全，曾率军火烧赤壁，击败曹操八十万大军，一战名传千古。",},
    [27] = {27,1,"孙权传",5,13005,2,26,422,0,0,1,105,106,107,108,41027,0,"孙权，字仲谋，自幼文武双全，继承其兄孙策江东基业，与曹操刘备三国鼎立，成为吴国开国皇帝。",},
    [28] = {28,1,"曹操传",3,11002,4,27,435,0,0,1,109,110,111,112,41028,0,"曹操，字孟德，少时机变警敏，后一统中原，成为曹魏奠基人，他精兵法，善诗歌，文采过人。",},
    [29] = {29,1,"沮授传",4,14012,2,28,448,0,0,1,113,114,115,116,41029,0,"沮授，袁绍帐下谋士，少有大志，擅谋略，曾助袁绍一统河北，后来坚守冀州不降，燕赵壮士典范。",},
    [30] = {30,1,"审配传",5,14043,4,29,461,0,0,1,117,118,119,120,41030,0,"审配，字正南，少年忠烈慷慨，正直不阿，后坚守冀州对抗曹操，城破以后慷慨赴死，名传千古。",},
    [31] = {31,1,"袁谭传",3,13017,3,30,474,0,0,1,121,122,123,124,41031,0,"袁谭，袁绍长子，少年时曾辅助父亲袁绍一统河北，后继承青州，割据一方对抗强大的曹操。",},
    [32] = {32,1,"袁尚传",4,14012,1,31,487,0,0,1,125,126,127,128,41032,0,"袁尚，袁绍次子，年少聪明深得袁绍偏爱，后继承袁绍基业割据冀州，对抗强大的曹操多年。",},
    [33] = {33,1,"甄姬传",5,11018,2,32,500,0,0,1,129,130,131,132,41033,0,"甄姬，人称洛神，是三国时代著名美女，不但容貌艳丽，而且多才多艺，后被尊称为曹魏文昭皇后。",},
    [34] = {34,1,"刘表传",3,14022,2,33,513,0,0,1,133,134,135,136,41045,0,"刘表，字景升，少时即知名于世，与七位贤士同称八俊，后统领荆州，拥兵十万，孙坚即为他所杀。",},
    [35] = {35,1,"刘琮传",4,12045,4,34,526,0,0,1,137,138,139,140,41046,0,"刘琮，刘表次子，刘琦之弟。年少即聪慧过人，英姿俊美，深得刘表喜爱，刘表死后继承荆州牧。",},
    [36] = {36,1,"伊籍传",5,14045,3,35,539,0,0,1,141,142,143,144,41047,0,"伊籍，字机伯，年少即因才智卓越而为刘表看重，刘表病死后转投刘备，与诸葛亮共同编撰《蜀科》",},
    [37] = {37,1,"徐庶传",3,12016,5,36,552,0,0,1,145,146,147,148,41048,0,"徐庶，字元直，为人忠孝、谋略过人，在刘备最困难时投靠了他，并向刘备推荐诸葛亮。",},
    [38] = {38,1,"李典传",4,11021,2,37,565,0,0,1,149,150,151,152,41049,0,"李典，字曼成，为人深明大义，尊敬博学之士，有长者之风，是曹操麾下大将，官至破虏将军。",},
    [39] = {39,1,"诸葛亮传",5,12009,1,38,578,0,0,1,153,154,155,156,41050,0,"诸葛亮，字孔明，蜀汉丞相，一生留下草船借箭、七擒孟获等无数典故，是忠臣与智慧的化身。",},
    [40] = {40,1,"黄祖传",3,14029,2,39,591,0,0,1,157,158,159,160,41051,0,"黄祖，为人勇猛，尤擅水战，曾下令射杀孙坚，因此与东吴结仇，并多次将孙权率领的水军击退。",},
    [41] = {41,1,"甘宁传",4,13010,3,40,604,0,0,1,161,162,163,164,41052,0,"甘宁，字兴霸，少时为非作歹，长大后幡然悔悟，熟读书籍，后投靠孙权帐下，立下无数战功。",},
    [42] = {42,1,"刘琦传",5,12025,5,41,617,0,0,1,165,166,167,168,41053,0,"刘琦，刘表长子，因容貌与刘表相似而深受宠爱，刘表死后他投入刘备麾下，官至荆州刺史。",},
    [43] = {43,1,"夏侯惇传",3,11004,4,42,630,0,0,1,169,170,171,172,41054,0,"夏侯惇，字元让，少时以勇气闻名于乡里。是曹魏开国元勋，多次为曹操镇守后方，功勋卓著。",},
    [44] = {44,1,"孔融传",4,14036,3,43,643,0,0,1,173,174,175,176,41055,0,"孔融，字文举，孔子第19世孙、少有异才，勤奋好学，为东汉文学家、“建安七子”之一。",},
    [45] = {45,1,"蔡瑁传",5,11038,1,44,656,0,0,1,177,178,179,180,41056,0,"蔡瑁，荆州名族，为刘表帐下军师，为协助刘表清剿江南宗贼、平定荆州，立下赫赫战功。",},
    [46] = {46,1,"魏延传",3,12007,4,45,669,0,0,1,181,182,183,184,41057,0,"魏延，字文长，蜀汉名将，深受刘备器重，镇守汉中近十年，之后屡次随诸葛亮北伐，功绩显著。",},
    [47] = {47,1,"许褚传",4,11016,2,46,682,0,0,1,185,186,187,188,41058,0,"许褚，字仲康，自幼高大雄伟，勇力绝人，多次救得曹操性命，深为曹操所喜，言“此吾之樊哙也。",},
    [48] = {48,1,"于禁传",5,11013,5,47,695,0,0,1,189,190,191,192,41059,0,"于禁，字文则，魏国武将。曾于张绣造反时斩杀违纪青州兵，固守营垒，最终救下曹操性命。",},
    [49] = {49,1,"简雍传",3,11034,1,48,708,0,0,1,193,194,195,196,41060,0,"简雍，字宪和，刘备帐下谋士，少时便极擅辩论、议事，刘备围成都时，便是他劝说刘璋投降。",},
    [50] = {50,1,"刘禅传",4,12032,3,49,721,0,0,1,197,198,199,200,41061,0,"小名阿斗。刘备之子，蜀汉皇帝，他拜诸葛亮为相父，支持姜维北伐，一度带来蜀汉走向强盛。",},
    [51] = {51,1,"张郃传",5,11012,2,50,734,0,0,1,201,202,203,204,41062,0,"张郃，原袁绍部下，官渡之战时为曹操招揽。随曹操攻乌桓、破马超、降张鲁，屡建战功。",},
    [52] = {52,1,"张飞传",3,12004,4,51,747,0,0,1,205,206,207,208,41063,0,"张飞，字益德，刘备、关羽结义兄弟，曾在刘备长坂坡败退时负责断后，一声怒吼吓退曹兵。",},
    [53] = {53,1,"鲁肃传",4,13002,1,52,760,0,0,1,209,210,211,212,41064,0,"鲁肃，字子敬，孙权帐下谋士，是他促成孙刘联合，最终火烧赤壁大败曹军，奠定三国鼎立的格局。",},
    [54] = {54,1,"顾雍传",5,13034,3,53,773,0,0,1,213,214,215,216,41065,0,"顾雍，字元叹，东吴重臣、魏晋八君子之一，少时受学与蔡邕，弱冠即任官职，所在之处皆有政绩。",},
    [55] = {55,1,"小乔传",3,13014,5,54,786,0,0,1,217,218,219,220,41066,0,"小乔，东吴名将周瑜之妻夫。与其姐大乔均为绝世美女。曹操也曾垂涎，欲建铜雀台以锁二乔。",},
    [56] = {56,1,"程普传",4,13011,4,55,799,0,0,1,221,222,223,224,41067,0,"程普，字德谋，东吴名将，历仕孙坚、孙策、孙权三任君主，一生功勋卓著，被人们尊称为“程公”",},
    [57] = {57,1,"蒋干传",5,12044,3,56,812,0,0,1,225,226,227,228,41068,0,"蒋干，字子翼，自幼仪容出众，才辩过人，曹操率军攻吴时，他自告奋勇，只身去东吴劝降周瑜。",},
    [58] = {58,1,"毛介传",3,13034,1,57,825,0,0,1,229,230,231,232,41069,0,"毛介，字孝先，才识过人，年少时为县吏，后投曹操，以清廉公正著称，身受曹操赞赏。",},
    [59] = {59,1,"荀攸传",4,11008,5,58,838,0,0,1,233,234,235,236,41070,0,"荀攸，字公达，擅长谋略，行事周密低调，为曹操出谋划策，屡立奇功，是曹操的“谋主”。",},
    [60] = {60,1,"黄盖传",5,13016,2,59,851,0,0,1,237,238,239,240,41071,0,"黄盖，字公覆，东吴名将，赤壁之战时他去曹营诈降，趁机以火攻曹军，是赤壁之战的主要功臣。",},
    [61] = {61,1,"庞统传",3,12010,1,60,864,0,0,1,241,242,243,244,41072,0,"庞统，字士元，号凤雏，刘备手下重要谋士，与诸葛亮同拜为军师中郎将。是赤壁之战功臣之一。",},
    [62] = {62,1,"文聘传",4,11028,4,61,877,0,0,1,245,246,247,248,41073,0,"文聘，字仲业，曹魏名将，为人忠义，作战勇猛，守御荆城时，多次击退关羽进犯，战功赫赫。",},
    [63] = {63,1,"徐盛传",5,13017,5,62,890,0,0,1,249,250,251,252,41074,0,"徐盛，字文向，吴国名将，擅长以少胜多，多次在战局不利时反败为胜，一生立功无数。",},
    [64] = {64,1,"陆逊传",3,13009,2,63,903,0,0,1,253,254,255,256,41200,0,"陆逊，字伯言，著名军事家，历任吴国大都督、上大将军、丞相。在夷陵中击败刘备，一战成名。",},
    [65] = {65,1,"诸葛亮传贰",4,12009,5,64,916,0,0,1,257,258,259,260,41201,0,"诸葛亮，字孔明，蜀汉丞相，一生留下草船借箭、七擒孟获等无数典故，是忠臣与智慧的化身。",},
    [66] = {66,1,"曹操传贰",5,11002,4,65,929,0,0,1,261,262,263,264,41202,0,"曹操，字孟德，少时机变警敏，后一统中原，成为曹魏奠基人，他精兵法，善诗歌，文采过人。",},
    [67] = {67,1,"甘宁传贰",3,13010,2,66,942,0,0,1,265,266,267,268,41203,0,"甘宁，字兴霸，少时为非作歹，长大后幡然悔悟，熟读书籍，后投靠孙权帐下，立下无数战功。",},
    [68] = {68,1,"曹仁传贰",4,11003,5,67,955,0,0,1,269,270,271,272,41204,0,"曹仁，字子孝，曹操从弟，少年时行为不检，但长大后浪子回头，为魏国立下赫赫战功，封大司马。",},
    [69] = {69,1,"赵云传贰",5,12001,1,68,968,0,0,1,273,274,275,276,41205,0,"赵云，字子龙，蜀国五虎大将，勇敢善战，长坂坡一战成名，百万曹军中如入无人之境，天下震惊。",},
    [70] = {70,1,"邢道荣传",3,14034,3,69,981,0,0,1,277,278,279,280,41206,0,"邢道荣，零陵太守刘度部下上将。使一柄开山大斧，有万夫不当之勇。",},
    [71] = {71,1,"巩志传",4,13025,1,70,994,0,0,1,281,282,283,284,41207,0,"巩志，原武陵太守帐下从事，后协助张飞攻占武陵，由此得刘备赏识，成为刘备帐下武陵太守。",},
    [72] = {72,1,"黄忠传",5,12006,2,71,1007,0,0,1,285,286,287,288,41208,0,"黄忠，字汉升，老当益壮的代表，作战勇猛，武艺精湛，曾斩杀曹操帐下名将夏侯渊。",},
    [73] = {73,1,"太史慈传贰",3,13006,4,72,1020,0,0,1,289,290,291,292,41209,0,"太史慈，汉末东莱人，少年有大志，猿臂善射，后跟随孙权一统江东，成为东吴最顶尖的猛将之一。",},
    [74] = {74,1,"鲁肃传贰",4,13002,2,73,1033,0,0,1,293,294,295,296,41210,0,"鲁肃，字子敬，孙权帐下谋士，是他促成孙刘联合，最终火烧赤壁大败曹军，奠定三国鼎立的格局。",},
    [75] = {75,1,"刘备传贰",5,12008,3,74,1046,0,0,1,297,298,299,300,41211,0,"刘备，字玄德，少年时即以仁德著称于世，与曹操对抗多年，终于三分天下，成为蜀汉开国皇帝。",},
    [76] = {76,1,"吴国太传",3,13033,1,75,1059,0,0,1,301,302,303,304,41212,0,"吴国太，孙坚次妻，孙坚正妻武烈皇后之妹，孙尚香之母。",},
    [77] = {77,1,"孙尚香传",4,13012,5,76,1072,0,0,1,305,306,307,308,41213,0,"孙尚香，吴太祖大皇帝孙权之妹，刘备之妻。才智敏捷，性格刚强，有其诸兄之风。",},
    [78] = {78,1,"程普传贰",5,13011,3,77,1085,0,0,1,309,310,311,312,41214,0,"程普，字德谋，东吴名将，历仕孙坚、孙策、孙权三任君主，一生功勋卓著，被人们尊称为“程公”",},
    [79] = {79,1,"程昱传贰",3,11010,1,78,1098,0,0,1,313,314,315,316,41215,0,"程昱，字仲德，少年时曾率领乡民击退黄巾进攻，后施展智谋，帮助曹操一统中原，三分天下。",},
    [80] = {80,1,"关羽传贰",4,12003,5,79,1111,0,0,1,317,318,319,320,41216,0,"关羽，字云长，曾温酒斩华雄，过五关斩六将，水淹七军……战绩无数，被后世尊称为武圣！",},
    [81] = {81,1,"周瑜传贰",5,13007,2,80,1124,0,0,1,321,322,323,324,41217,0,"周瑜，字公瑾，年少英俊，文武双全，曾率军火烧赤壁，击败曹操八十万大军，一战名传千古。",},
    [82] = {82,1,"庞统传贰",3,12010,3,81,1137,0,0,1,325,326,327,328,41218,0,"庞统，字士元，号凤雏，刘备手下重要谋士，与诸葛亮同拜为军师中郎将。是赤壁之战功臣之一。",},
    [83] = {83,1,"马腾传",4,12031,4,82,1150,0,0,1,329,330,331,332,41219,0,"马腾，字寿成，凉州军阀，马超之父，身材高大孔武，作战勇猛，因讨贼功，拜军司马。",},
    [84] = {84,1,"马岱传",5,12042,3,83,1163,0,0,1,333,334,335,336,41220,0,"马岱，马超从弟，蜀汉将领，为人忠心，武艺高强，诸葛亮病逝后，受杨仪派遣斩杀蜀将魏延。",},
    [85] = {85,1,"马超传",3,12005,2,84,1176,0,0,1,337,338,339,340,41221,0,"马超，字孟起，蜀汉名将，绰号“锦马超”，曾大战曹操，反攻陇上，围攻成都，有不减吕布之勇。",},
    [86] = {86,1,"曹洪传",4,11023,3,85,1189,0,0,1,341,342,343,344,41222,0,"曹洪，字子廉，曹操从弟，为人忠心，武力过人，曾舍命献马救曹操，使曹操免于厄难。",},
    [87] = {87,1,"韩遂传",5,14030,2,86,1202,0,0,1,345,346,347,348,41223,0,"韩遂，字文约。凉州军阀，武艺精湛，先后败皇甫嵩、董卓、孙坚等名将，割据一方长达三十余年。",},
    [88] = {88,1,"刘璋传",3,12032,1,87,1215,0,0,1,349,350,351,352,41224,0,"刘璋，字季玉，东汉割据军阀之一，继父亲刘焉担任益州牧，为人忠厚。",},
    [89] = {89,1,"杨修传",4,11032,3,88,1228,0,0,1,353,354,355,356,41225,0,"杨修，字德祖，东汉文学家，为人聪慧，学问渊博，处理事情既快且好，赢得众人称赞。",},
    [90] = {90,1,"张松传",5,12044,5,89,1241,0,0,1,357,358,359,360,41226,0,"张松，字子乔，刘璋部下，有过目不忘，倒背如流之能，曾当场默背曹操兵书，使其震惊。",},
    [91] = {91,1,"孟达传",3,11023,2,90,1254,0,0,1,361,362,363,364,41227,0,"孟达，字子庆，本刘璋属下，先降刘备。后降曹魏，曹丕死后欲归蜀汉，后不幸兵败被杀。",},
    [92] = {92,1,"魏延传贰",4,12007,4,91,1267,0,0,1,365,366,367,368,41228,0,"魏延，字文长，蜀汉名将，深受刘备器重，镇守汉中近十年，之后屡次随诸葛亮北伐，功绩显著。",},
    [93] = {93,1,"张飞传贰",5,12004,5,92,1280,0,0,1,369,370,371,372,41229,0,"张飞，字益德，刘备、关羽结义兄弟，曾在刘备长坂坡败退时负责断后，一声怒吼吓退曹兵。",},
    [94] = {94,1,"吕蒙传",3,13008,1,93,1293,0,0,1,373,374,375,376,41230,0,"吕蒙，字子明，东吴虎威将军，曾趁关羽北伐曹操、荆州空虚时，偷取荆州，使东吴国土面积大增。",},
    [95] = {95,1,"荀彧传贰",4,11007,2,94,1306,0,0,1,377,378,379,380,41231,0,"荀彧，字文若，年少时即被人称为王佐之才，后辅助曹操一统北方，被曹操赞为“吾之子房！”",},
    [96] = {96,1,"许褚传贰",5,11016,4,95,1319,0,0,1,381,382,383,384,41232,0,"许褚，字仲康，自幼高大雄伟，勇力绝人，多次救得曹操性命，深为曹操所喜，言“此吾之樊哙也。",},
    [97] = {97,1,"关平传",3,12020,2,96,1332,0,0,1,385,386,387,388,41233,0,"关平，名将关羽长子，随关羽南征北战，屡立功劳，曾与庞德大战三十回合，不分胜负。",},
    [98] = {98,1,"黄忠传贰",4,12006,1,97,1345,0,0,1,389,390,391,392,41234,0,"黄忠，字汉升，老当益壮的代表，作战勇猛，武艺精湛，曾斩杀曹操帐下名将夏侯渊。",},
    [99] = {99,1,"彭漾传",5,12025,1,98,1358,0,0,1,393,394,395,396,41235,0,"彭漾,字永年，东汉末年官吏。身高八尺，相貌魁梧,因在刘备攻雒城时提醒刘备注意洪水而受其看重。",},
    [100] = {100,1,"庞统传贰",3,12010,5,99,1371,0,0,1,397,398,399,400,41236,0,"庞统，字士元，号凤雏，刘备手下重要谋士，与诸葛亮同拜为军师中郎将。是赤壁之战功臣之一。",},
    [101] = {101,1,"严颜传",4,13020,4,100,1384,0,0,1,401,402,403,404,41237,0,"严颜，蜀汉将领，有万夫莫敌之勇。最初为刘璋部下，后为张飞俘虏。他宁死不屈，让张飞敬为上宾。",},
    [102] = {102,1,"张任传",5,12031,4,101,1397,0,0,1,405,406,407,408,41238,0,"张任，益州牧刘璋属下，自少就胆大勇敢，为人有志向节气。曾在刘备进攻雒城时率军迎战，抵挡刘备多日。",},
    [103] = {103,1,"董和传",3,12026,2,102,1410,0,0,1,409,410,411,412,41239,0,"董和，字幼宰，益州牧刘璋属下，刘备攻蜀时他主张向张鲁借兵，最终引来马超攻刘。",},
    [104] = {104,1,"夏侯渊传",4,11005,3,103,1423,0,0,1,413,414,415,416,41240,0,"夏侯渊，字妙才，魏国名将，作战勇猛刚烈，擅长率骑兵奔袭千里，来去如风，令敌人防不胜防！",},
    [105] = {105,1,"马超传贰",5,12005,3,104,1436,0,0,1,417,418,419,420,41241,0,"马超，字孟起，蜀汉名将，绰号“锦马超”，曾大战曹操，反攻陇上，围攻成都，有不减吕布之勇。",},
    [106] = {106,1,"诸葛亮传叁",3,12009,2,105,1449,0,0,1,421,422,423,424,41242,0,"诸葛亮，字孔明，蜀汉丞相，一生留下草船借箭、七擒孟获等无数典故，是忠臣与智慧的化身。",},
    [107] = {107,1,"张飞传叁",4,12004,2,106,1462,0,0,1,425,426,427,428,41243,0,"张飞，字益德，刘备、关羽结义兄弟，曾在刘备长坂坡败退时负责断后，一声怒吼吓退曹兵。",},
    [108] = {108,1,"李恢传",5,11048,2,107,1475,0,0,1,429,430,431,432,41244,0,"李恢，字德昂，蜀汉将领、官员。跟随诸葛亮讨平南中四郡的叛乱，在平定南战争中立下赫赫战功。",},
    [109] = {109,1,"法正传",3,12011,4,108,1488,0,0,1,433,434,435,436,41245,0,"法正，字孝直，原为刘璋谋士，刘备围成都时劝说刘璋投降，后与刘备进取汉中，献计将大将夏侯渊斩首。",},
    [110] = {110,1,"关羽传叁",4,12003,3,109,1501,0,0,1,437,438,439,440,41246,0,"关羽，字云长，曾温酒斩华雄，过五关斩六将，水淹七军……战绩无数，被后世尊称为武圣！",},
    [111] = {111,1,"鲁肃传叁",5,13002,3,110,1514,0,0,1,441,442,443,444,41247,0,"鲁肃，字子敬，孙权帐下谋士，是他促成孙刘联合，最终火烧赤壁大败曹军，奠定三国鼎立的格局。",},
    [112] = {112,1,"伏皇后传",3,14037,4,111,1527,0,0,1,445,446,447,448,41248,0,"伏皇后，汉献帝之妻，西汉大司徒伏湛八世孙，父亲为学者伏完，为人聪慧贤良，身受献帝喜爱。",},
    [113] = {113,1,"张鲁传",4,14032,2,112,1540,0,0,1,449,450,451,452,41249,0,"张鲁,字公祺,东汉末年汉中军阀，五斗米道第三代天师。在汉中拥有众多信徒，势力雄厚。",},
    [114] = {114,1,"凌统传",5,13023,3,113,1553,0,0,1,453,454,455,456,41250,0,"凌统，字公绩，东吴将领，凌操之子，曾随孙权征讨江夏，斩杀黄祖先锋，为剿灭黄祖立下大功。",},
    [115] = {115,1,"敬请期待",1,0,0,114,0,0,0,1,457,458,459,460,0,0,"0",},
    [116] = {1001,2,"连环计",7,6004,0,0,3,0,0,1,1001,0,0,0,41034,1,"王允将貂蝉同时赠与吕布和董卓，致使两人反目，爆发大战，彻底瓦解董卓军势力。",},
    [117] = {1002,2,"三让徐州",7,6006,0,0,6,0,0,1,1002,0,0,0,41035,1,"曹操率军进攻徐州，为免徐州沦落，徐州牧陶谦三让徐州给刘备，刘备三次不受。",},
    [118] = {1003,2,"挟天子令诸侯",7,6002,0,0,9,0,0,1,1003,0,0,0,41036,1,"李傕、郭汜劫持汉献帝，曹操率军救出，并以献帝名义号令诸侯，从此实力日增。",},
    [119] = {1004,2,"吕布之死",7,6005,0,0,12,0,0,1,1004,0,0,0,41037,1,"曹操与刘备征讨吕布，吕布坚守下邳，曹操用郭嘉之计，水淹下邳城，一举擒获吕布。",},
    [120] = {1005,2,"青梅煮酒",7,6004,0,0,15,0,0,1,1005,0,0,0,41038,1,"曹操宴请刘备，席上称天下英雄唯操与刘备！刘备担心被害，逃离许昌，从此潜龙入海。",},
    [121] = {1006,2,"黎阳之战",7,6003,0,0,18,0,0,1,1006,0,0,0,41039,1,"袁绍派颜良文丑为将，率大军攻打曹操，双方在黎阳对持三个月，发生多场激战……",},
    [122] = {1007,2,"白马之围",7,6001,0,0,21,0,0,1,1007,0,0,0,41040,1,"袁绍派颜良文丑攻打曹操，双方在白马城激战，曹操派关羽斩颜良文丑，解围白马城！",},
    [123] = {1008,2,"千里走单骑",7,6006,0,0,24,0,0,1,1008,0,0,0,41041,1,"关羽护送刘备妻小离开曹营，一路过五关斩六将，历尽千辛万苦，最终与刘备汇合。",},
    [124] = {1009,2,"孙权掌江东",7,6002,0,0,27,0,0,1,1009,0,0,0,41042,1,"许贡门客刺杀孙策，孙策去世，孙权临危受难继承江东，从此励精图治，富国强兵……",},
    [125] = {1010,2,"官渡之战",7,6001,0,0,30,0,0,1,1010,0,0,0,41043,1,"曹操袁绍在官渡大战，曹操用许攸之计，夜袭乌巢袁军粮仓，最终击溃袁绍，统一北方。",},
    [126] = {1011,2,"河北之战",7,6003,0,0,33,0,0,1,1011,0,0,0,41044,1,"官渡之战后，曹操先灭青州袁谭，再灭冀州袁尚，终将河北纳入版图，最终一统中原。",},
    [127] = {1012,2,"马跃檀溪",7,6005,0,0,36,0,0,1,1012,0,0,0,41075,1,"刘备因劝阻刘表废长立幼，被其后妻蔡夫人设计刺杀，危机时他马跃檀溪，得逃大难。",},
    [128] = {1013,2,"三顾茅庐",7,6004,0,0,39,0,0,1,1013,0,0,0,41076,1,"得徐庶推荐，刘备前往隆中，三次拜访诸葛亮所住茅庐，最终成功招揽其为自己效力。",},
    [129] = {1014,2,"讨伐黄祖",7,6003,0,0,42,0,0,1,1014,0,0,0,41077,1,"孙坚为黄祖所杀，为报父仇，孙权领兵伐黄祖，战于大江。黄祖兵败被杀。",},
    [130] = {1015,2,"火烧博望坡",7,6006,0,0,45,0,0,1,1015,0,0,0,41078,1,"夏侯惇率军攻打刘备，双方在博望坡对持，最终诸葛亮火烧博望坡，杀退曹军。",},
    [131] = {1016,2,"攻占荆州",7,6001,0,0,48,0,0,1,1016,0,0,0,41079,1,"曹操率大军进攻荆州，新任荆州牧刘琮在蔡瑁、张允劝说下不战而降，使曹操占据荆州。",},
    [132] = {1017,2,"单骑救主",7,6003,0,0,51,0,0,1,1017,0,0,0,41080,1,"曹操率军进攻刘备，战乱中刘备与妻儿失散，赵云七进七出曹军阵地，救出其子阿斗。",},
    [133] = {1018,2,"舌战群儒",7,6002,0,0,54,0,0,1,1018,0,0,0,41081,1,"诸葛亮为联盟孙权抵抗曹操，遭东吴诸谋士责难，最终他逐一反驳众人，达成联盟。",},
    [134] = {1019,2,"蒋干盗书",7,6004,0,0,57,0,0,1,1019,0,0,0,41082,1,"蒋干奉曹操令去东吴劝降周瑜，结果中周瑜之计，盗得假降书，让曹操误斩蔡瑁、张允。",},
    [135] = {1020,2,"苦肉计",7,6002,0,0,60,0,0,1,1020,0,0,0,41083,1,"黄盖借被周瑜鞭打向曹操投降，曹操信以为真，结果被黄盖火船攻击，导致赤壁大败。",},
    [136] = {1021,2,"火烧赤壁",7,6006,0,0,63,0,0,1,1021,0,0,0,41084,1,"孙权、曹操两军长江对持，周瑜与诸葛亮定下多番计谋，最终火烧赤壁，击溃曹操。",},
    [137] = {1022,2,"败走华容道",7,6003,0,0,66,0,0,1,1022,0,0,0,41085,1,"赤壁之战曹军溃败，曹操从华容道撤退，不料遭诸葛亮伏击，最后关羽念旧情将其放走。",},
    [138] = {1023,2,"南郡之战",7,6006,0,0,69,0,0,1,1023,0,0,0,41086,1,"周瑜率兵攻打南郡，与守将曹仁、曹洪陷入僵持，最终刘备渔翁得利，夺占南郡。",},
    [139] = {1024,2,"荆南四郡",7,6001,0,0,72,0,0,1,1024,0,0,0,41087,1,"刘备征荆南，赵云、张飞、关羽等将先后出手，成功占领武陵、长沙、桂阳、零陵四郡。",},
    [140] = {1025,2,"锦囊妙计",7,6002,0,0,75,0,0,1,1025,0,0,0,41088,1,"周瑜设计诱刘备过江娶亲，以夺荆州，诸葛亮识破奸计，给赵云三道锦囊，以解危机。",},
    [141] = {1026,2,"刘备娶亲",7,6004,0,0,78,0,0,1,1026,0,0,0,41089,1,"刘备用诸葛亮锦囊妙计，成功迎娶孙尚香，并最终逃脱周瑜追杀，成功回到江州。",},
    [142] = {1027,2,"既生瑜何生亮",7,6005,0,0,81,0,0,1,1027,0,0,0,41090,1,"周瑜明取西川实夺荆州，被诸葛亮识破惨遭围攻，最终留下“既生瑜何生亮”之语气死。",},
    [143] = {1028,2,"马腾之死",7,6001,0,0,84,0,0,1,1028,0,0,0,41091,1,"曹操以封官之名令马腾入京，马腾入京后与黄奎欲讨伐曹操，最终事情败露，惨遭围杀。",},
    [144] = {1029,2,"渭水之战",7,6006,0,0,87,0,0,1,1029,0,0,0,41092,1,"马超、韩遂率军攻魏，曹操巧用反间计，最终促使马超、韩遂反目，成功平息叛乱。",},
    [145] = {1030,2,"张松献图",7,6004,0,0,90,0,0,1,1030,0,0,0,41093,1,"张松见曹操，曹操因其丑陋而不予礼遇，张松在归川时受刘备厚待，于是献上西川地图。",},
    [146] = {1031,2,"截江夺斗",7,6005,0,0,93,0,0,1,1031,0,0,0,41094,1,"孙权谎称母亲生病，骗孙尚香带阿斗归吴，船只刚到江心，赵云追上来，将阿斗夺回。",},
    [147] = {1032,2,"濡须之战",7,6006,0,0,96,0,0,1,1032,0,0,0,41095,1,"孙权迁都建业，曹操派军进攻，在濡须遭到吴兵抵挡，交战两月后无果，曹操退兵。",},
    [148] = {1033,2,"黄魏争功",7,6003,0,0,99,0,0,1,1033,0,0,0,41096,1,"刘备攻占涪水关，刘璋派军返攻，为抵挡进攻，刘备派黄忠、魏延进攻雒城。",},
    [149] = {1034,2,"攻打雒城",7,6001,0,0,102,0,0,1,1034,0,0,0,41097,1,"刘备攻刘璋，战至雒城时被守将张任拦阻，庞统战死，后在诸葛亮增援下攻下雒城。",},
    [150] = {1035,2,"马超来援",7,6006,0,0,105,0,0,1,1035,0,0,0,41098,1,"刘备围困成都，刘璋向张鲁求援，适逢马超投靠张鲁，自愿带兵增援刘璋，攻打刘备。",},
    [151] = {1036,2,"智降马超",7,6005,0,0,108,0,0,1,1036,0,0,0,41099,1,"诸葛亮设计买通杨松，污蔑马超谋反，让其三月破敌，马超被迫归降刘备。",},
    [152] = {1037,2,"单刀赴会",7,6004,0,0,111,0,0,1,1037,0,0,0,41100,1,"鲁肃宴请关羽，想趁机挟持他以夺荆州，结果反被关羽单刀挟持，最后只得放走关羽。",},
    [153] = {1038,2,"逍遥津之战",7,6001,0,0,114,0,0,1,1038,0,0,0,41101,1,"孙权趁曹操进攻汉中时偷袭合肥，结果被张辽在逍遥津设伏偷袭，吴军大败溃逃。",},
    }
}



local __index_id = {
    [1] = 1,
    [10] = 10,
    [100] = 100,
    [1001] = 116,
    [1002] = 117,
    [1003] = 118,
    [1004] = 119,
    [1005] = 120,
    [1006] = 121,
    [1007] = 122,
    [1008] = 123,
    [1009] = 124,
    [101] = 101,
    [1010] = 125,
    [1011] = 126,
    [1012] = 127,
    [1013] = 128,
    [1014] = 129,
    [1015] = 130,
    [1016] = 131,
    [1017] = 132,
    [1018] = 133,
    [1019] = 134,
    [102] = 102,
    [1020] = 135,
    [1021] = 136,
    [1022] = 137,
    [1023] = 138,
    [1024] = 139,
    [1025] = 140,
    [1026] = 141,
    [1027] = 142,
    [1028] = 143,
    [1029] = 144,
    [103] = 103,
    [1030] = 145,
    [1031] = 146,
    [1032] = 147,
    [1033] = 148,
    [1034] = 149,
    [1035] = 150,
    [1036] = 151,
    [1037] = 152,
    [1038] = 153,
    [104] = 104,
    [105] = 105,
    [106] = 106,
    [107] = 107,
    [108] = 108,
    [109] = 109,
    [11] = 11,
    [110] = 110,
    [111] = 111,
    [112] = 112,
    [113] = 113,
    [114] = 114,
    [115] = 115,
    [12] = 12,
    [13] = 13,
    [14] = 14,
    [15] = 15,
    [16] = 16,
    [17] = 17,
    [18] = 18,
    [19] = 19,
    [2] = 2,
    [20] = 20,
    [21] = 21,
    [22] = 22,
    [23] = 23,
    [24] = 24,
    [25] = 25,
    [26] = 26,
    [27] = 27,
    [28] = 28,
    [29] = 29,
    [3] = 3,
    [30] = 30,
    [31] = 31,
    [32] = 32,
    [33] = 33,
    [34] = 34,
    [35] = 35,
    [36] = 36,
    [37] = 37,
    [38] = 38,
    [39] = 39,
    [4] = 4,
    [40] = 40,
    [41] = 41,
    [42] = 42,
    [43] = 43,
    [44] = 44,
    [45] = 45,
    [46] = 46,
    [47] = 47,
    [48] = 48,
    [49] = 49,
    [5] = 5,
    [50] = 50,
    [51] = 51,
    [52] = 52,
    [53] = 53,
    [54] = 54,
    [55] = 55,
    [56] = 56,
    [57] = 57,
    [58] = 58,
    [59] = 59,
    [6] = 6,
    [60] = 60,
    [61] = 61,
    [62] = 62,
    [63] = 63,
    [64] = 64,
    [65] = 65,
    [66] = 66,
    [67] = 67,
    [68] = 68,
    [69] = 69,
    [7] = 7,
    [70] = 70,
    [71] = 71,
    [72] = 72,
    [73] = 73,
    [74] = 74,
    [75] = 75,
    [76] = 76,
    [77] = 77,
    [78] = 78,
    [79] = 79,
    [8] = 8,
    [80] = 80,
    [81] = 81,
    [82] = 82,
    [83] = 83,
    [84] = 84,
    [85] = 85,
    [86] = 86,
    [87] = 87,
    [88] = 88,
    [89] = 89,
    [9] = 9,
    [90] = 90,
    [91] = 91,
    [92] = 92,
    [93] = 93,
    [94] = 94,
    [95] = 95,
    [96] = 96,
    [97] = 97,
    [98] = 98,
    [99] = 99,

}

local __key_map = {
  id = 1,
  type = 2,
  name = 3,
  quality = 4,
  pic = 5,
  json_id = 6,
  prepose_id = 7,
  open_req1 = 8,
  open_req2 = 9,
  open_req3 = 10,
  open_level = 11,
  barrier1 = 12,
  barrier2 = 13,
  barrier3 = 14,
  barrier4 = 15,
  box_drop_id = 16,
  is_once = 17,
  direction = 18,

}



local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_story_dungeon_info")
        
        
        return t._raw[__key_map[k]]
    end
}


function story_dungeon_info.getLength()
    return #story_dungeon_info._data
end



function story_dungeon_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_story_dungeon_info
function story_dungeon_info.indexOf(index)
    if index == nil then
        return nil
    end
    
    return setmetatable({_raw = story_dungeon_info._data[index]}, m)
    
end

---
--@return @class record_story_dungeon_info
function story_dungeon_info.get(id)
    
    return story_dungeon_info.indexOf(__index_id[id])
        
end



function story_dungeon_info.set(id, key, value)
    local record = story_dungeon_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function story_dungeon_info.get_index_data()
    return __index_id
end