

---@classdef record_tower_info
local record_tower_info = {}
  
record_tower_info.id = 0 --编号  
record_tower_info.floor = 0 --层数  
record_tower_info.floor_type = 0 --层数类型  
record_tower_info.monster_name = "" --怪物名称  
record_tower_info.monster_image = 0 --怪物形象  
record_tower_info.monster_goupid = 0 --引用怪物组id  
record_tower_info.coins = 0 --通关奖励（银币）  
record_tower_info.tower_score = 0 --通关奖励（积分）  
record_tower_info.success_type = 0 --战斗胜利条件类型  
record_tower_info.success_value = 0 --战斗胜利条件类型值  
record_tower_info.success_name = "" --过关条件名称  
record_tower_info.success_directions = "" --过关条件描述  
record_tower_info.talk = "" --气泡内对话  
record_tower_info.sucesss_talk = "" --战斗胜利后描述  
record_tower_info.fail_talk = "" --战斗失败后描述  
record_tower_info.buff_key = 0 --是否有战场变化  
record_tower_info.tower_buff1 = 0 --战场变化ID1  
record_tower_info.tower_buff2 = 0 --战场变化ID2  
record_tower_info.tower_buff3 = 0 --战场变化ID3  
record_tower_info.tower_buff4 = 0 --战场变化ID4  
record_tower_info.tower_buff5 = 0 --战场变化ID5  
record_tower_info.tower_buff6 = 0 --战场变化ID6  
record_tower_info.tower_buff7 = 0 --战场变化ID7  
record_tower_info.tower_buff8 = 0 --战场变化ID8  
record_tower_info.tower_buff9 = 0 --战场变化ID9  
record_tower_info.tower_buff10 = 0 --战场变化ID10  
record_tower_info.type_1 = 0 --掉落道具1type  
record_tower_info.value_1 = 0 --掉落道具1ID  
record_tower_info.size_1 = 0 --掉落道具1数量  
record_tower_info.type_2 = 0 --掉落道具2type  
record_tower_info.value_2 = 0 --掉落道具2ID  
record_tower_info.size_2 = 0 --掉落道具2数量  
record_tower_info.type_3 = 0 --掉落道具3type  
record_tower_info.value_3 = 0 --掉落道具3ID  
record_tower_info.size_3 = 0 --掉落道具3数量  
record_tower_info.type_4 = 0 --掉落道具4type  
record_tower_info.value_4 = 0 --掉落道具4ID  
record_tower_info.size_4 = 0 --掉落道具4数量  
record_tower_info.show = 0 --是否播报  
record_tower_info.map = 0 --地图


tower_info = {
   _data = {
    [1] = {1,1,1,"高升",14049,3001,600,150,0,0,"新手试炼","全灭敌方","我只能打单体，但杀你还是小菜一碟！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [2] = {2,2,1,"张宝",14025,3002,600,150,0,0,"新手试炼","全灭敌方","我只能打单体，但杀你还是小菜一碟！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [3] = {3,3,1,"张梁",14026,3003,600,150,0,0,"新手试炼","全灭敌方","我只能打单体，但杀你还是小菜一碟！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",1,1000,1001,1002,1003,1004,1005,1006,1007,1008,1009,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [4] = {4,4,1,"于吉",14009,3004,600,150,0,0,"新手试炼","全灭敌方","我只能打单体，但杀你还是小菜一碟！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [5] = {5,5,2,"张角",14019,3005,2000,300,0,0,"新手试炼","全灭敌方","我只能打单体，但杀你还是小菜一碟！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,18,10001,1,18,10006,1,0,0,0,0,0,0,0,31001,},
    [6] = {6,6,1,"卢植",14015,3006,600,150,1,5,"极速试炼","五回合内全灭敌方","我专打前排的，让你看看我的厉害！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",1,1000,1001,1002,1003,1004,1005,1006,1007,1008,1009,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [7] = {7,7,1,"皇甫嵩",14021,3007,600,150,1,5,"极速试炼","五回合内全灭敌方","我专打前排的，让你看看我的厉害！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [8] = {8,8,1,"汉献帝",14039,3008,600,150,1,5,"极速试炼","五回合内全灭敌方","我专打前排的，让你看看我的厉害！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [9] = {9,9,1,"何皇后",14028,3009,600,150,1,5,"极速试炼","五回合内全灭敌方","我专打前排的，让你看看我的厉害！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",1,1000,1001,1002,1003,1004,1005,1006,1007,1008,1009,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [10] = {10,10,2,"何进",14038,3010,2000,300,1,5,"极速试炼","五回合内全灭敌方","我专打前排的，让你看看我的厉害！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,18,10001,1,18,10006,1,0,0,0,0,0,0,0,31001,},
    [11] = {11,11,1,"华雄",14017,3011,600,150,2,1,"防御试炼","我方死亡人数不超过1人","看我隔山打牛，杀你后排！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [12] = {12,12,1,"张济",11048,3012,600,150,2,1,"防御试炼","我方死亡人数不超过1人","看我隔山打牛，杀你后排！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",1,1000,1001,1002,1003,1004,1005,1006,1007,1008,1009,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [13] = {13,13,1,"郭汜",14041,3013,600,150,2,1,"防御试炼","我方死亡人数不超过1人","看我隔山打牛，杀你后排！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [14] = {14,14,1,"李傕",14030,3014,600,150,2,1,"防御试炼","我方死亡人数不超过1人","看我隔山打牛，杀你后排！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [15] = {15,15,2,"董卓",14016,3015,2000,300,2,1,"防御试炼","我方死亡人数不超过1人","看我隔山打牛，杀你后排！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",1,1000,1001,1002,1003,1004,1005,1006,1007,1008,1009,18,10001,1,18,10006,1,0,0,0,0,0,0,0,31001,},
    [16] = {16,16,1,"张辽",11006,3016,600,150,3,40,"暴风试炼","我方剩余血量大于等于总血量的40%","颤抖吧，我可是打全体的！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [17] = {17,17,1,"高顺",14010,3017,600,150,3,40,"暴风试炼","我方剩余血量大于等于总血量的40%","颤抖吧，我可是打全体的！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [18] = {18,18,1,"李肃",12045,3018,600,150,3,40,"暴风试炼","我方剩余血量大于等于总血量的40%","颤抖吧，我可是打全体的！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",1,1000,1001,1002,1003,1004,1005,1006,1007,1008,1009,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [19] = {19,19,1,"陈宫",14001,3019,600,150,3,40,"暴风试炼","我方剩余血量大于等于总血量的40%","颤抖吧，我可是打全体的！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [20] = {20,20,2,"吕布",14005,3020,2000,300,3,40,"暴风试炼","我方剩余血量大于等于总血量的40%","颤抖吧，我可是打全体的！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,18,10001,1,18,10006,1,0,0,0,0,0,0,0,31001,},
    [21] = {21,21,1,"田楷",11023,3021,600,150,1,5,"极速试炼","五回合内全灭敌方","我血和物防高，还会加血，害怕了吧！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",1,1000,1001,1002,1003,1004,1005,1006,1007,1008,1009,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [22] = {22,22,1,"邹丹",14030,3022,600,150,1,5,"极速试炼","五回合内全灭敌方","我血和物防高，还会加血，害怕了吧！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [23] = {23,23,1,"公孙越",11048,3023,600,150,1,5,"极速试炼","五回合内全灭敌方","我血和物防高，还会加血，害怕了吧！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [24] = {24,24,1,"公孙续",13036,3024,600,150,1,5,"极速试炼","五回合内全灭敌方","我血和物防高，还会加血，害怕了吧！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",1,1000,1001,1002,1003,1004,1005,1006,1007,1008,1009,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [25] = {25,25,2,"公孙瓒",14002,3025,2000,300,1,5,"极速试炼","五回合内全灭敌方","我血和物防高，还会加血，害怕了吧！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,18,10001,1,18,10006,1,0,0,0,0,0,0,0,31001,},
    [26] = {26,26,1,"蒯良",14045,3026,600,150,1,5,"极速试炼","五回合内全灭敌方","我血和物防高，还会加血，害怕了吧！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [27] = {27,27,1,"蒯越",11034,3027,600,150,1,5,"极速试炼","五回合内全灭敌方","我血和物防高，还会加血，害怕了吧！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",1,1000,1001,1002,1003,1004,1005,1006,1007,1008,1009,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [28] = {28,28,1,"黄祖",11027,3028,600,150,1,5,"极速试炼","五回合内全灭敌方","我血和物防高，还会加血，害怕了吧！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [29] = {29,29,1,"刘琦",14045,3029,600,150,1,5,"极速试炼","五回合内全灭敌方","我血和物防高，还会加血，害怕了吧！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [30] = {30,30,2,"刘表",14022,3030,2000,300,1,5,"极速试炼","五回合内全灭敌方","我血和物防高，还会加血，害怕了吧！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",1,1000,1001,1002,1003,1004,1005,1006,1007,1008,1009,18,10001,1,18,10006,1,0,0,0,0,0,0,0,31001,},
    [31] = {31,31,1,"纪灵",14030,3031,600,150,2,1,"物防试炼","我方死亡人数不超过1人","我物攻超高，只能打单体，攻击！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [32] = {32,32,1,"李丰",14030,3032,600,150,2,1,"物防试炼","我方死亡人数不超过1人","我物攻超高，专打单列，杀！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [33] = {33,33,1,"张勋",12041,3033,600,150,2,1,"物防试炼","我方死亡人数不超过1人","我物攻超高，专打前排，攻击！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",1,1000,1001,1002,1003,1004,1005,1006,1007,1008,1009,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [34] = {34,34,1,"韩浩",11023,3034,600,150,2,1,"物防试炼","我方死亡人数不超过1人","我物攻超高，专打后排，接招吧！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [35] = {35,35,2,"袁术",14027,3035,2000,300,2,1,"物防试炼","我方死亡人数不超过1人","我不但物攻超高，还打能全体，哈哈，杀！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,18,10002,1,18,10007,1,3,10,1,0,0,0,0,31001,},
    [36] = {36,36,1,"许攸",11029,3036,600,150,2,1,"法防试炼","我方死亡人数不超过1人","我法攻超高，只能单体，杀！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",1,1000,1001,1002,1003,1004,1005,1006,1007,1008,1009,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [37] = {37,37,1,"郭图",13018,3037,600,150,2,1,"法防试炼","我方死亡人数不超过1人","我法攻超高，专打单列，攻击！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [38] = {38,38,1,"田丰",14011,3038,600,150,2,1,"法防试炼","我方死亡人数不超过1人","我法攻超高，专打前排，接招吧！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [39] = {39,39,1,"沮授",14012,3039,600,150,2,1,"法防试炼","我方死亡人数不超过1人","我法攻超高，专打后排，死吧！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",1,1000,1001,1002,1003,1004,1005,1006,1007,1008,1009,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [40] = {40,40,2,"袁绍",14006,3040,2000,300,2,1,"法防试炼","我方死亡人数不超过1人","我不但法攻超高，还能打全体，受死吧！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,18,10002,1,18,10007,1,3,10,1,0,0,0,0,31001,},
    [41] = {41,41,1,"诸葛瑾",13025,3041,600,150,1,5,"物攻试炼","五回合内全灭敌方","我无视法攻，只能打单体，攻击！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [42] = {42,42,1,"陆逊",13009,3042,600,150,1,5,"物攻试炼","五回合内全灭敌方","我无视法攻，专打单列，让你看看我的厉害！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",1,1000,1001,1002,1003,1004,1005,1006,1007,1008,1009,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [43] = {43,43,1,"鲁肃",13002,3043,600,150,1,5,"物攻试炼","五回合内全灭敌方","我无视法攻，专打前排，杀","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [44] = {44,44,1,"周瑜",13007,3044,600,150,1,5,"物攻试炼","五回合内全灭敌方","我无视法攻，专打后排，攻击！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [45] = {45,45,2,"孙权",13005,3045,2000,300,1,5,"物攻试炼","五回合内全灭敌方","我不但无视法攻，还能打全体，接招吧1","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",1,1000,1001,1002,1003,1004,1005,1006,1007,1008,1009,18,10002,1,18,10007,1,3,10,1,0,0,0,0,31001,},
    [46] = {46,46,1,"马超",12005,3046,600,150,1,5,"法攻试炼","五回合内全灭敌方","我无视物攻，只打单体，刺！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [47] = {47,47,1,"赵云",12001,3047,600,150,1,5,"法攻试炼","五回合内全灭敌方","我无视物攻，专门打单列，冲锋！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [48] = {48,48,1,"张飞",12004,3048,600,150,1,5,"法攻试炼","五回合内全灭敌方","我无视物攻，专打你们前排，杀！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",1,1000,1001,1002,1003,1004,1005,1006,1007,1008,1009,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [49] = {49,49,1,"关羽",12003,3049,600,150,1,5,"法攻试炼","五回合内全灭敌方","我无视物攻，专打你们后排，攻击！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [50] = {50,50,2,"刘备",12008,3050,2000,300,1,5,"法攻试炼","五回合内全灭敌方","我不但无视物攻，还能打群体，接招吧！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,18,10003,1,18,10008,1,3,11,1,3,18,1,0,31001,},
    [51] = {51,51,1,"郭嘉",11001,3051,600,150,3,40,"暴风试炼","我方剩余血量大于等于总血量的40%","我每招每势都是群攻，做好受死准备了吗？","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",1,1000,1001,1002,1003,1004,1005,1006,1007,1008,1009,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [52] = {52,52,1,"贾诩",11009,3052,600,150,3,40,"暴风试炼","我方剩余血量大于等于总血量的40%","我每招每势都是群攻，做好受死准备了吗？","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [53] = {53,53,1,"荀彧",11007,3053,600,150,3,40,"暴风试炼","我方剩余血量大于等于总血量的40%","我每招每势都是群攻，做好受死准备了吗？","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [54] = {54,54,1,"荀攸",11008,3054,600,150,3,40,"暴风试炼","我方剩余血量大于等于总血量的40%","我每招每势都是群攻，做好受死准备了吗？","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",1,1000,1001,1002,1003,1004,1005,1006,1007,1008,1009,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [55] = {55,55,2,"曹操",11002,3055,2000,300,3,40,"暴风试炼","我方剩余血量大于等于总血量的40%","我每招每势都是群攻，做好受死准备了吗？","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,18,10003,1,18,10008,1,3,11,1,3,18,1,0,31001,},
    [56] = {56,56,1,"董卓",14016,3056,600,150,4,50,"寂灭试炼","敌方剩余血量小于等于总血量的50%","3回合不能消灭我，你就死定了！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [57] = {57,57,1,"刘备",12008,3057,600,150,4,50,"寂灭试炼","敌方剩余血量小于等于总血量的50%","3回合不能消灭我，你就死定了！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",1,1000,1001,1002,1003,1004,1005,1006,1007,1008,1009,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [58] = {58,58,1,"孙权",13005,3058,600,150,4,50,"寂灭试炼","敌方剩余血量小于等于总血量的50%","3回合不能消灭我，你就死定了！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [59] = {59,59,1,"曹操",11002,3059,600,150,4,50,"寂灭试炼","敌方剩余血量小于等于总血量的50%","3回合不能消灭我，你就死定了！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,31001,},
    [60] = {60,60,2,"吕布",14005,3060,2000,300,4,50,"寂灭试炼","敌方剩余血量小于等于总血量的50%","3回合不能消灭我，你就死定了！","恭喜将军，距离三国之王的目标又近一步，请再接再励吧！","不要气馁将军，请努力强大自己，再来挑战吧！",1,1000,1001,1002,1003,1004,1005,1006,1007,1008,1009,18,10003,1,18,10008,1,3,11,1,3,18,1,0,31001,},
    }
}



local __index_id = {
    [1] = 1,
    [10] = 10,
    [11] = 11,
    [12] = 12,
    [13] = 13,
    [14] = 14,
    [15] = 15,
    [16] = 16,
    [17] = 17,
    [18] = 18,
    [19] = 19,
    [2] = 2,
    [20] = 20,
    [21] = 21,
    [22] = 22,
    [23] = 23,
    [24] = 24,
    [25] = 25,
    [26] = 26,
    [27] = 27,
    [28] = 28,
    [29] = 29,
    [3] = 3,
    [30] = 30,
    [31] = 31,
    [32] = 32,
    [33] = 33,
    [34] = 34,
    [35] = 35,
    [36] = 36,
    [37] = 37,
    [38] = 38,
    [39] = 39,
    [4] = 4,
    [40] = 40,
    [41] = 41,
    [42] = 42,
    [43] = 43,
    [44] = 44,
    [45] = 45,
    [46] = 46,
    [47] = 47,
    [48] = 48,
    [49] = 49,
    [5] = 5,
    [50] = 50,
    [51] = 51,
    [52] = 52,
    [53] = 53,
    [54] = 54,
    [55] = 55,
    [56] = 56,
    [57] = 57,
    [58] = 58,
    [59] = 59,
    [6] = 6,
    [60] = 60,
    [7] = 7,
    [8] = 8,
    [9] = 9,

}

local __key_map = {
  id = 1,
  floor = 2,
  floor_type = 3,
  monster_name = 4,
  monster_image = 5,
  monster_goupid = 6,
  coins = 7,
  tower_score = 8,
  success_type = 9,
  success_value = 10,
  success_name = 11,
  success_directions = 12,
  talk = 13,
  sucesss_talk = 14,
  fail_talk = 15,
  buff_key = 16,
  tower_buff1 = 17,
  tower_buff2 = 18,
  tower_buff3 = 19,
  tower_buff4 = 20,
  tower_buff5 = 21,
  tower_buff6 = 22,
  tower_buff7 = 23,
  tower_buff8 = 24,
  tower_buff9 = 25,
  tower_buff10 = 26,
  type_1 = 27,
  value_1 = 28,
  size_1 = 29,
  type_2 = 30,
  value_2 = 31,
  size_2 = 32,
  type_3 = 33,
  value_3 = 34,
  size_3 = 35,
  type_4 = 36,
  value_4 = 37,
  size_4 = 38,
  show = 39,
  map = 40,

}



local m = { 
    __index = function(t, k) 
        if k == "toObject" then
            return function()  
                local o = {}
                for key, v in pairs (__key_map) do 
                    o[key] = t._raw[v]
                end
                return o
            end 
        end
        
        assert(__key_map[k], "cannot find " .. k .. " in record_tower_info")
        
        
        return t._raw[__key_map[k]]
    end
}


function tower_info.getLength()
    return #tower_info._data
end



function tower_info.hasKey(k)
  if __key_map[k] == nil then
    return false
  else
    return true
  end
end


---
--@return @class record_tower_info
function tower_info.indexOf(index)
    if index == nil then
        return nil
    end
    
    return setmetatable({_raw = tower_info._data[index]}, m)
    
end

---
--@return @class record_tower_info
function tower_info.get(id)
    
    return tower_info.indexOf(__index_id[id])
        
end



function tower_info.set(id, key, value)
    local record = tower_info.get(id)
    if record then
        local keyIndex = __key_map[key]
        if keyIndex then
            record._raw[keyIndex] = value
        end
    end
end




function tower_info.get_index_data()
    return __index_id
end