CLientPreviewFashionCfg = {
	[2] = --幻武
	{
			{item_id = 1492},--魔音贝斯
			{item_id = 1504},--铁军战魂
			{item_id = 1516},--一枝恩爱玫
			{item_id = 1528},--特大网球拍
			{item_id = 1540},--鲨鱼泳圈
			{item_id = 1552},--蜘蛛电刃
			{item_id = 1663},--至尊·龙城之刃


	},
	[1] = --时装
	{
			{item_id = {1484,1488}},--嘻哈乐手(男)
			{item_id = {1496,1500}},--铁血军魂(男)
			{item_id = {1508,1512}},--天长地久(男)
			{item_id = {1520,1524}},--网球王子(男)
			{item_id = {1532,1536}},--沙滩派对(男)
			{item_id = {1544,1548}},--蜘蛛侠(男)
			{item_id = {1664,1665}},--至尊·巅峰霸主(男)

	}
}