-- 龙魂圣城极品预览配置
return {
{id = 3438, bind = 0,},--红色心法(首篇)
{id = 3439, bind = 0,},--红色心法(上篇)
{id = 3440, bind = 0,},--红色心法(中篇)
{id = 3441, bind = 0,},--红色心法(下篇)
{id = 3442, bind = 0,},--红色心法(终篇)
{id = 3433, bind = 0,},--橙色心法(首篇)
{id = 3434, bind = 0,},--橙色心法(上篇)
{id = 3435, bind = 0,},--橙色心法(中篇)
{id = 3436, bind = 0,},--橙色心法(下篇)
{id = 3437, bind = 0,},--橙色心法(终篇)
{id = 3423, bind = 0,},--蓝色心法(首篇)
{id = 3424, bind = 0,},--蓝色心法(上篇)
{id = 3425, bind = 0,},--蓝色心法(中篇)
{id = 3426, bind = 0,},--蓝色心法(下篇)
{id = 3427, bind = 0,},--蓝色心法(终篇)
{id = 3418, bind = 0,},--绿色心法(首篇)
{id = 3419, bind = 0,},--绿色心法(上篇)
{id = 3420, bind = 0,},--绿色心法(中篇)
{id = 3421, bind = 0,},--绿色心法(下篇)
{id = 3422, bind = 0,},--绿色心法(终篇)
{id = 3413, bind = 0,},--白色心法(首篇)
{id = 3414, bind = 0,},--白色心法(上篇)
{id = 3415, bind = 0,},--白色心法(中篇)
{id = 3416, bind = 0,},--白色心法(下篇)
{id = 3417, bind = 0,},--白色心法(终篇)
{id = 3476, bind = 0,},--精羽毛
{id = 3493, bind = 0,},--宝石结晶
{id = 3496, bind = 0,},--龙魂结晶
{id = 3506, bind = 0,},--红装碎片
{id = 3501, bind = 0,},--传世宝钻
{id = 3637, bind = 0,},--1088元宝
{id = 3656, bind = 0,},--1288元宝
{id = 3657, bind = 0,},--1388元宝
{id = 3658, bind = 0,},--1488元宝
{id = 3659, bind = 0,},--1588元宝
{id = 3660, bind = 0,},--1688元宝
{id = 3661, bind = 0,},--1788元宝
{id = 3528, bind = 0,},--1888元宝
{id = 3662, bind = 0,},--1988元宝
{id = 3663, bind = 0,},--2088元宝
{id = 3664, bind = 0,},--2188元宝
{id = 3665, bind = 0,},--2288元宝
{id = 3666, bind = 0,},--2388元宝
{id = 3667, bind = 0,},--2488元宝
{id = 3668, bind = 0,},--2588元宝
{id = 3669, bind = 0,},--2688元宝
{id = 3670, bind = 0,},--2788元宝
{id = 3529, bind = 0,},--2888元宝



}