HaoZHuangTypeListCfg ={
	[1] = 5,   --对应的套装类型ID
	[2] = 6,   --对应的套装类型ID
	[3] = 7,   --对应的套装类型ID
}
HaoZhuangindexByType = 
{
	[27] = 1,
	[28] = 1,
	[29] = 2,
	[30] = 2,
	[31] = 2,
	[32] = 2,
	[33] = 2,
	[34] = 3,
	[35] = 3,
	[36] = 3,
	[37] = 3,
	[38] = 3,
}

HaoZhuangSuitTypeByType = {
	[5] = {27,28}, --豪装类型对应装备类型，麻烦配置下
	[6] = {29,30,31,32,33},
	[7] = {34,35,36,37,38},
}

XingHUnSuitTypeByType = {
	[8] = {0,1,2,3,4,5,6,7,8,9,10,11},
}

ChuangShiSuitSlot = {
	[9] = {18,19,20,21,22,23,24,25,26,27}, -- --用传世槽位来判断
}

NorMalEquipTypeListCfg = {
	[1] =1,
	[2] =2,
	[3] =3,
	[4] =4,
}

NormalListSuitTypeByType ={
	[1] ={1,2}, --套装ID,物品类型
	[2] ={3,4},
	[3] ={5,6},
	[4] ={7,8},
}

--套装类型装备对应的槽位
RexueSuitEquipName = {
	[10] = {10, 11}, --至尊
	[11] = {12,13,14,15}, -- 霸者
	[12] = {45, 46, 47, 48, 49, 50, 51, 52}, --战神
	[13] = {41, 42, 43, 44},
}