-- 物品合成视图配置
return {
	------------------------------------------------------------------------------------------
	--[[合成模板
		[3] = { -- 物品合成类型 在item\itemEnhance\ItemSynthesisConfig里的id
			group_list = { -- 物品合成组
				{name = "60级", list = {1, 2, 3, 4, 5, 6}}, -- name：组名，list：合成id(ItemSynthesisConfig[1].itemList第n个) cond:显示条件，可不填
				{name = "80级", list = {7, 8, 9, 10}},
				{name = "2转", list = {10, 11, 12, 13}},
				{name = "4转", list = {15, 16, 17}},
			},
			bottom_show = { -- 底部背包物品数量显示
				{item_id = 100}, -- 物品id
				{item_id = 100},
			}
			success_play_eff_id = 13, -- 操作成功时播放一下的特效id
		},
	]]
	------------------------------------------------------------------------------------------
--	[3] = { -- 符文
--		group_list = {
--			{name = "60级", list = {1, 2, 3, 4, 5, 6, 7, 8}},
--			{name = "80级", list = {9, 10, 11, 12, 13, 14, 15, 16}},
--			{name = "2转", list = {17, 18, 19, 20, 21, 22, 23, 24}},
--			{name = "4转", list = {25, 26, 27, 28, 29, 30, 31, 32}},
--			{name = "6转", list = {33, 34, 35, 36, 37, 38, 39, 40}, cond = "CondId50"}, --CondId50 条件在runtime\assets\scripts\game\common\cond_def.lua
--			{name = "7转", list = {41, 42, 43, 44, 45, 46, 47, 48}, cond = "CondId50"},
--			{name = "8转", list = {49, 50, 51, 52, 53, 54, 55, 56}, cond = "CondId50"},
--			{name = "9转", list = {57, 58, 59, 60, 61, 62, 63, 64}, cond = "CondId50"},
--			{name = "10转", list = {65, 66, 67, 68, 69, 70, 71, 72}, cond = "CondId50"},
--			{name = "11转", list = {73, 74, 75, 76, 77, 78, 79, 80}, cond = "CondId50"},
--			{name = "12转", list = {81, 82, 83, 84, 85, 86, 87, 88}, cond = "CondId50"},
--		},
--		bottom_show = {
--			{item_id = 3499},
--			{item_id = 3500},
--		},
--		--success_play_eff_id = 13, -- 操作成功时播放一下的特效id
--	},

	------------------------------------------------------------------------------------------
	--[[分解模板
		[4] = {-- 物品合成类型 在item\itemEnhance\ItemSynthesisConfig里的id
			get_item_id = 3468, -- 获取道具item_id
			success_play_eff_id = 6, -- 操作成功时播放一下的特效id
		},
	]]
	------------------------------------------------------------------------------------------
	[4] = { -- 传世分解
		get_item_id = 3468, -- 获取道具item_id
		success_play_eff_id = 6, -- 操作成功时播放一下的特效id
	},
}