--因在EquipTakeOnSynthesisCfg中需要做遍历得到第一个值，干脆独立出来
ReXueGodEquipShow = {
	[41] = 1931,  --装备槽， 默认ID，在没有装备时取这里做显示
	[42] = 1961,  --装备槽， 默认ID，在没有装备时取这里做显示
	[43] = 1991,  --装备槽， 默认ID，在没有装备时取这里做显示
	[44] = 2021,  --装备槽， 默认ID，在没有装备时取这里做显示
	[45] = 1751,  --装备槽， 默认ID，在没有装备时取这里做显示
	[46] = 1781,  --装备槽， 默认ID，在没有装备时取这里做显示
	[47] = 1811,  --装备槽， 默认ID，在没有装备时取这里做显示
	[48] = 1811,  --装备槽， 默认ID，在没有装备时取这里做显示
	[49] = 1841,  --装备槽， 默认ID，在没有装备时取这里做显示
	[50] = 1841,  --装备槽， 默认ID，在没有装备时取这里做显示
	[51] = 1871,  --装备槽， 默认ID，在没有装备时取这里做显示
	[52] = 1901,  --装备槽， 默认ID，在没有装备时取这里做显示
}