local bestMon = {
	{
		drop = "烈火剑法|0|0;冰咆哮|0|0;召唤神兽|0|0;紫碧螺|0|0;龙之手镯|0|0;恶魔铃铛|0|0;骑士手镯|0|0;力量戒指|0|0;绿色项链|0|0;泰坦戒指|0|0;三眼手镯|0|0;灵魂项链|0|0;黑铁头盔|0|0;绑定羽灵印|4|150;绑定羽灵礼包|4|150;羽灵礼包|4|150",
		name = "极品白野猪",
		icon = "mon12(760)",
		minOpenDay = 0,
		minServerState = 0,
		info = [[
它们是红色恶猪的领头者，不知道它们已活了多久。由于更长的寿命，他们比红色恶猪更大的体形和更强的破坏力。

常见于石墓七层以及霸者大厅。
寻路方式：飞鞋-魔王传送-困惑殿堂-传送后小退再次上线会出现在石墓七层；盟重老兵-洞穴传送-石墓洞穴-石墓五层-石墓阵-石墓六层-石墓七层；飞鞋（恶魔老兵）-洞穴传送-封魔矿区-传送员-雷霆之路-右侧第二扇门-霸者大厅]],
		address = "血量：2000"
	},
	{
		drop = "精力水晶|0|0;绑定精力水晶|0|0;绑定羽灵印|4|150;绑定羽灵礼包|4|150;羽灵礼包|4|150",
		name = "极品沃玛卫士",
		icon = "mon16(400)",
		minOpenDay = 0,
		minServerState = 0,
		info = [[
它们保卫着沃玛神殿。他们曾是沃玛教的成员，沃玛教主复活后他们被杀死，死后的尸体变成沃玛战士。

常见于沃玛寺庙。
寻路方式：飞鞋（比奇老兵）-洞穴传送-沃玛森林-传送员-前往沃玛寺庙二层-沃玛寺庙三层]],
		address = "血量：2000"
	},
	{
		drop = "地下组队卷轴|0|0;紫碧螺|0|0;龙之手镯|0|0;恶魔铃铛|0|0;骑士手镯|0|0;力量戒指|0|0;绿色项链|0|0;泰坦戒指|0|0;三眼手镯|0|0;灵魂项链|0|0;黑铁头盔|0|0;绑定羽灵印|4|150;绑定羽灵礼包|4|150;羽灵礼包|4|150",
		name = "极品邪恶钳虫",
		icon = "mon13(400)",
		minOpenDay = 0,
		minServerState = 0,
		info = [[
这种巨大的钳虫在相当长的时期里已经起了变异，不能与普通的钳虫相比。

常见于生死之间。
寻路方式：飞鞋（盟重老兵）-洞穴传送-蜈蚣洞穴-生死之间]],
		address = "血量：2000"
	},
	{
		drop = "祝福油|0|0;紫碧螺|0|0;龙之手镯|0|0;恶魔铃铛|0|0;骑士手镯|0|0;力量戒指|0|0;绿色项链|0|0;泰坦戒指|0|0;三眼手镯|0|0;灵魂项链|0|0;黑铁头盔|0|0;绑定羽灵印|4|150;绑定羽灵礼包|4|150;羽灵礼包|4|150",
		name = "极品祖玛卫士",
		icon = "mon7(920)",
		minOpenDay = 0,
		minServerState = 0,
		info = [[
它们是祖玛教的保卫者，也具有隐藏在雕像中的羊血化身。所以当入侵者靠近时，他们的化身会挥舞着象祖玛雕像那样的巨大锤子。

常见于祖玛寺庙五层、祖玛阁以及祖玛神殿七层大厅。
寻路方式：飞鞋（盟重老兵）-洞穴传送-祖玛洞穴-传送员-祖玛阁-祖玛七层大厅]],
		address = "血量：2000"
	},
	{
		drop = "青铜腰带|0|0;紫绸靴|0|0;绑定羽灵印|4|150;绑定羽灵礼包|4|150;羽灵礼包|4|150",
		name = "极品牛魔将军",
		icon = "mon21(1480)",
		minOpenDay = 0,
		minServerState = 0,
		info = [[
战功显赫的牛魔战士，有这强大坚韧的意志，一直忠心的伴随在牛魔王左右。

常见于牛魔寺庙大厅。
寻路方式：飞鞋（海岛老兵）-洞穴传送-牛魔洞穴-传送员-牛魔寺庙五层-牛魔寺庙六层-牛魔寺庙大厅]],
		address = "血量：2000"
	},
	{
		drop = "青铜腰带|0|0;紫绸靴|0|0;绑定羽灵印|4|150;绑定羽灵礼包|4|150;羽灵礼包|4|150",
		name = "极品牛魔祭司",
		icon = "mon21(2390)",
		minOpenDay = 0,
		minServerState = 0,
		info = [[
牛魔群中擅长精神类魔法的特殊战士，没有其他牛魔那样强健的身躯，但千万不可因此小看它。

常见于牛魔寺庙大厅。
寻路方式：飞鞋（海岛老兵）-洞穴传送-牛魔洞穴-传送员-牛魔寺庙五层-牛魔寺庙六层-牛魔寺庙大厅]],
		address = "血量：2000"
	},
	{
		drop = "烈火剑法|0|0;冰咆哮|0|0;召唤神兽|0|0;井中月|0|0;血饮|0|0;魔杖|0|0;无极棍|0|0",
		name = "白野猪",
		icon = "mon12(760)",
		minOpenDay = 0,
		minServerState = 0,
		info = "白野猪是拥有比红色恶猪更大的体形和更强的破坏力的破坏者。\n\n常见于石墓七层、烈焰殿、雷霆之路、幽冥回廊、纵横道、魔魂殿、炼狱回廊、秘密通道、同心小径以及霸者大厅",
		address = "血量：1000"
	},
	{
		drop = "龙之戒指|0|0;红宝石戒指|0|0;铂金戒指|0|0",
		name = "沃玛卫士",
		icon = "mon16(400)",
		minOpenDay = 0,
		minServerState = 0,
		info = "它们保卫着沃玛神殿。他们曾是沃玛教的成员，沃玛教主复活后他们被杀死，死后的尸体变成沃玛战士。\n\n常见于沃玛寺庙、封魔堡以及未知暗殿",
		address = "血量：1000"
	},
	{
		drop = "炼狱|0|0;魔杖|0|0;银蛇|0|0;祈祷头盔|0|0",
		name = "邪恶钳虫",
		icon = "mon13(400)",
		minOpenDay = 0,
		minServerState = 0,
		info = "这种巨大的钳虫在相当长的时期里已经起了变异，不能与普通的钳虫相比。\n\n常见于地牢、死亡棺材、黑暗地带、一线天以及未知暗殿",
		address = "血量：1000"
	},
	{
		drop = "烈火剑法|0|0;冰咆哮|0|0;召唤神兽|0|0;书页|0|0;绑定书页|0|0;祝福油|0|0;炼狱|0|0;魔杖|0|0;银蛇|0|0;井中月|0|0;血饮|0|0;无极棍|0|0",
		name = "邪恶毒蛇",
		icon = "mon17(1480)",
		minOpenDay = 0,
		minServerState = 0,
		info = "比毒蛇更加邪恶可怕的存在，会隐藏在黑暗中随时发动猛烈攻势。\n\n常见于石墓七层、未知暗殿、魔魂殿、炼狱回廊、幽冥回廊以及秘密通道",
		address = "血量：1100"
	},
	{
		drop = "祝福油|0|0;精力水晶|0|0;绑定精力水晶|0|0",
		name = "钉耙猫王",
		icon = "mon3(2200)",
		minOpenDay = 0,
		minServerState = 0,
		info = "钉耙猫中的王者，如果你小瞧它，那可要小心付出沉痛代价。\n\n常见于白日门",
		address = "血量：1200"
	},
	{
		drop = "祝福油|0|0;精力水晶|0|0;绑定精力水晶|0|0",
		name = "多钩猫王",
		icon = "mon3(1840)",
		minOpenDay = 0,
		minServerState = 0,
		info = "多钩猫中的王者，和钉耙猫王一样统领着自己的部族。\n\n常见于白日门",
		address = "血量：1200"
	},
	{
		drop = "烈火剑法|0|0;冰咆哮|0|0;召唤神兽|0|0;书页|0|0;绑定书页|0|0;炼狱|0|0;魔杖|0|0;井中月|0|0;血饮|0|0;无极棍|0|0",
		name = "虹魔猪卫",
		icon = "mon19(560)",
		minOpenDay = 0,
		minServerState = 0,
		info = "曾经作为一个英雄的贴身护卫，他一直默默的为自己的主人建立信誉，地位以及权利，直至那名英雄堕入了黑暗的深渊，他依然忠心的跟随着堕入黑暗的英雄。\n\n常见于雷霆之路、霸者大厅、幽冥回廊、封魔殿、以及秘密通道中",
		address = "血量：1500"
	},
	{
		drop = "烈火剑法|0|0;冰咆哮|0|0;召唤神兽|0|0;书页|0|0;绑定书页|0|0;炼狱|0|0;魔杖|0|0;银蛇|0|0;井中月|0|0;血饮|0|0;无极棍|0|0",
		name = "虹魔蝎卫",
		icon = "mon19(50)",
		minOpenDay = 0,
		minServerState = 0,
		info = "邪恶蝎蛇的头领，藏匿于封魔谷地下的封魔神殿内，与虹魔猪卫一起追随着虹魔教主。\n\n常见于纵横道、魔魂殿、封魔殿以及秘密通道中",
		address = "血量：2000"
	},
	{
		drop = "烈火剑法|0|0;冰咆哮|0|0;召唤神兽|0|0;裁决之杖|0|0;骨玉权杖|0|0;无极棍|0|0",
		name = "牛魔将军",
		icon = "mon21(1480)",
		minOpenDay = 0,
		minServerState = 0,
		info = "战功显赫的牛魔战士，有这强大坚韧的意志，一直忠心的伴随在牛魔王左右。\n\n常见于牛魔寺庙大厅",
		address = "血量：750"
	},
	{
		drop = "烈火剑法|0|0;冰咆哮|0|0;召唤神兽|0|0;裁决之杖|0|0;骨玉权杖|0|0;无极棍|0|0",
		name = "牛魔祭司",
		icon = "mon21(2390)",
		minOpenDay = 0,
		minServerState = 0,
		info = "牛魔群中擅长精神类魔法的特殊战士，没有其他牛魔那样强健的身躯，但千万不可因此小看它。\n\n常见于牛魔寺庙大厅",
		address = "血量：750"
	},
	{
		drop = "狮子吼|0|0;灭天火|0|0;无极真气|0|0;青铜腰带|0|0;紫绸靴|0|0",
		name = "魔龙力士",
		icon = "mon22(860)",
		minOpenDay = 0,
		minServerState = 0,
		info = "魔龙教主麾下大将，追随魔龙教主征战四方，功勋显赫。\n\n常见于魔龙岭以及魔龙血域",
		address = "血量：6000"
	},
	{
		drop = "狮子吼|0|0;灭天火|0|0;无极真气|0|0",
		name = "魔龙战将",
		icon = "mon22(500)",
		minOpenDay = 0,
		minServerState = 0,
		info = "魔龙教主麾下大将，追随魔龙教主征战四方，功勋显赫。\n\n常见于魔龙血域",
		address = "血量：6000"
	},
	{
		drop = "狮子吼|0|0;灭天火|0|0;无极真气|0|0;青铜腰带|0|0;紫绸靴|0|0",
		name = "魔龙巨蛾",
		icon = "mon22(40)",
		minOpenDay = 0,
		minServerState = 0,
		info = "魔龙教主麾下大将，追随魔龙教主征战四方，功勋显赫。\n\n常见于魔龙血域以及魔龙西郊",
		address = "血量：6000"
	},
	{
		drop = "玄铁石|0|0;绑定玄铁石|0|0;一级鉴定符|0|0;绑定一级鉴定符|0|0;绑定血玉福袋|0|0;绑定强攻福袋|0|0;绑定暴击福袋|0|0;绑定血玉礼盒|0|0;绑定强攻礼盒|0|0;绑定暴击礼盒|0|0;绑定神戒精华|3|130;绑定精华礼包|3|130;绑定精华礼盒|3|130",
		name = "雪域天将",
		icon = "mon26(2110)",
		minOpenDay = 20,
		minServerState = 0,
		info = "雪域冰原的驻守战士，拥有强大的破坏力。\n\n常见于雪域二层以及雪域之眼",
		address = "血量：8000"
	},
	{
		drop = "技能残卷|0|0;绑定技能残卷|0|0;残卷包|0|0;绑定残卷包|0|0;洗炼石|0|0;绑定洗炼石|0|0;绑定1级魂石袋|0|0;2级魂石袋|0|0;兽魂丹|0|0;绑定兽魂丹|0|0",
		name = "素狐战将",
		icon = "mon33(860)",
		minOpenDay = 0,
		minServerState = 1,
		info = "狐月神殿的驻守战士，狐族的魔法精英，具有敏锐的嗅觉，警觉性极高。",
		address = "血量：15000"
	},
	{
		drop = "资质丹|0|0;绑定资质丹|0|0;普通宠物蛋|0|0;中级宠物蛋|0|0",
		name = "宠物邪恶钳虫",
		icon = "mon13(400)",
		minOpenDay = 0,
		minServerState = 2,
		info = "狐月宠物岛的精英战士之一，是战士的天敌。",
		address = "血量：25000"
	},
	{
		drop = "资质丹|0|0;绑定资质丹|0|0;普通宠物蛋|0|0;中级宠物蛋|0|0",
		name = "宠物虹魔猪卫",
		icon = "mon19(560)",
		minOpenDay = 0,
		minServerState = 2,
		info = "狐月宠物岛的精英战士之一，是法师的天敌。",
		address = "血量：25000"
	},
	{
		drop = "资质丹|0|0;绑定资质丹|0|0;普通宠物蛋|0|0;中级宠物蛋|0|0",
		name = "宠物虹魔蝎卫",
		icon = "mon19(50)",
		minOpenDay = 0,
		minServerState = 2,
		info = "狐月宠物岛的精英战士之一，是道士的天敌。",
		address = "血量：25000"
	}
}

return bestMon
