local DrumUnSealCfg = {
	{
		NeedSpringNum = 0,
		NeedMeritNum = 10,
		PropertyStr = "战士神圣伤害=20;法师神圣伤害=12;道士神圣伤害=16",
		NeedDrumLv = 5,
		NeedDiamondLvStr = "",
		AddedPropertyStr = "战士神圣伤害=20;法师神圣伤害=12;道士神圣伤害=16"
	},
	{
		NeedSpringNum = 50,
		NeedMeritNum = 30,
		PropertyStr = "战士神圣伤害=20;法师神圣伤害=12;道士神圣伤害=16;战士强攻伤害=88;法师强攻伤害=88;道士强攻伤害=88;战士敏捷=2;法师敏捷=2;道士敏捷=2",
		NeedDrumLv = 10,
		NeedDiamondLvStr = "强攻宝石=15",
		AddedPropertyStr = "战士强攻伤害=88;法师强攻伤害=88;道士强攻伤害=88;战士敏捷=2;法师敏捷=2;道士敏捷=2"
	},
	{
		NeedSpringNum = 100,
		NeedMeritNum = 50,
		PropertyStr = "战士神圣伤害=70;法师神圣伤害=42;道士神圣伤害=56;战士强攻伤害=88;法师强攻伤害=88;道士强攻伤害=88;战士敏捷=2;法师敏捷=2;道士敏捷=2;战士魔法躲避=1;法师魔法躲避=1;道士魔法躲避=1",
		NeedDrumLv = 15,
		NeedDiamondLvStr = "",
		AddedPropertyStr = "战士神圣伤害=50;法师神圣伤害=30;道士神圣伤害=40;战士魔法躲避=1;法师魔法躲避=1;道士魔法躲避=1"
	},
	{
		NeedSpringNum = 100,
		NeedMeritNum = 50,
		PropertyStr = "战士神圣伤害=70;法师神圣伤害=42;道士神圣伤害=56;战士强攻伤害=88;法师强攻伤害=88;道士强攻伤害=88;战士敏捷=2;法师敏捷=2;道士敏捷=2;战士魔法躲避=1;法师魔法躲避=1;道士魔法躲避=1;战士暴击系数=88;法师暴击系数=88;道士暴击系数=88;战士准确=1;法师准确=1;道士准确=1;战士魔法命中=1;法师魔法命中=1;道士魔法命中=1",
		NeedDrumLv = 20,
		NeedDiamondLvStr = "暴击宝石=25",
		AddedPropertyStr = "战士暴击系数=88;法师暴击系数=88;道士暴击系数=88;战士准确=1;法师准确=1;道士准确=1;战士魔法命中=1;法师魔法命中=1;道士魔法命中=1"
	},
	{
		NeedSpringNum = 200,
		NeedMeritNum = 100,
		PropertyStr = "战士神圣伤害=70;法师神圣伤害=42;道士神圣伤害=56;战士强攻伤害=226;法师强攻伤害=226;道士强攻伤害=226;战士敏捷=2;法师敏捷=2;道士敏捷=2;战士魔法躲避=1;法师魔法躲避=1;道士魔法躲避=1;战士暴击系数=88;法师暴击系数=88;道士暴击系数=88;战士准确=1;法师准确=1;道士准确=1;战士魔法命中=1;法师魔法命中=1;道士魔法命中=1",
		NeedDrumLv = 25,
		NeedDiamondLvStr = "",
		AddedPropertyStr = "战士强攻伤害=138;法师强攻伤害=138;道士强攻伤害=138"
	},
	{
		NeedSpringNum = 250,
		NeedMeritNum = 150,
		PropertyStr = "战士神圣伤害=110;法师神圣伤害=66;道士神圣伤害=88;战士强攻伤害=226;法师强攻伤害=226;道士强攻伤害=226;战士敏捷=2;法师敏捷=2;道士敏捷=2;战士魔法躲避=1;法师魔法躲避=1;道士魔法躲避=1;战士暴击系数=88;法师暴击系数=88;道士暴击系数=88;战士准确=1;法师准确=1;道士准确=1;战士魔法命中=1;法师魔法命中=1;道士魔法命中=1",
		NeedDrumLv = 30,
		NeedDiamondLvStr = "强攻宝石=30",
		AddedPropertyStr = "战士神圣伤害=40;法师神圣伤害=24;道士神圣伤害=32"
	},
	{
		NeedSpringNum = 280,
		NeedMeritNum = 180,
		PropertyStr = "战士神圣伤害=110;法师神圣伤害=66;道士神圣伤害=88;战士强攻伤害=226;法师强攻伤害=226;道士强攻伤害=226;战士敏捷=2;法师敏捷=2;道士敏捷=2;战士魔法躲避=1;法师魔法躲避=1;道士魔法躲避=1;战士暴击系数=276;法师暴击系数=276;道士暴击系数=276;战士准确=1;法师准确=1;道士准确=1;战士魔法命中=1;法师魔法命中=1;道士魔法命中=1",
		NeedDrumLv = 35,
		NeedDiamondLvStr = "",
		AddedPropertyStr = "战士暴击系数=188;法师暴击系数=188;道士暴击系数=188"
	},
	{
		NeedSpringNum = 300,
		NeedMeritNum = 200,
		PropertyStr = "战士神圣伤害=150;法师神圣伤害=90;道士神圣伤害=120;战士强攻伤害=226;法师强攻伤害=226;道士强攻伤害=226;战士敏捷=2;法师敏捷=2;道士敏捷=2;战士魔法躲避=1;法师魔法躲避=1;道士魔法躲避=1;战士暴击系数=276;法师暴击系数=276;道士暴击系数=276;战士准确=1;法师准确=1;道士准确=1;战士魔法命中=1;法师魔法命中=1;道士魔法命中=1",
		NeedDrumLv = 40,
		NeedDiamondLvStr = "暴击宝石=35",
		AddedPropertyStr = "战士神圣伤害=40;法师神圣伤害=24;道士神圣伤害=32"
	},
	{
		NeedSpringNum = 400,
		NeedMeritNum = 250,
		PropertyStr = "战士神圣伤害=210;法师神圣伤害=126;道士神圣伤害=168;战士强攻伤害=226;法师强攻伤害=226;道士强攻伤害=226;战士敏捷=2;法师敏捷=2;道士敏捷=2;战士魔法躲避=1;法师魔法躲避=1;道士魔法躲避=1;战士暴击系数=276;法师暴击系数=276;道士暴击系数=276;战士准确=1;法师准确=1;道士准确=1;战士魔法命中=1;法师魔法命中=1;道士魔法命中=1",
		NeedDrumLv = 45,
		NeedDiamondLvStr = "",
		AddedPropertyStr = "战士神圣伤害=60;法师神圣伤害=36;道士神圣伤害=48"
	},
	{
		NeedSpringNum = 500,
		NeedMeritNum = 300,
		PropertyStr = "战士神圣伤害=290;法师神圣伤害=174;道士神圣伤害=232;战士强攻伤害=226;法师强攻伤害=226;道士强攻伤害=226;战士敏捷=2;法师敏捷=2;道士敏捷=2;战士魔法躲避=1;法师魔法躲避=1;道士魔法躲避=1;战士暴击系数=276;法师暴击系数=276;道士暴击系数=276;战士准确=1;法师准确=1;道士准确=1;战士魔法命中=1;法师魔法命中=1;道士魔法命中=1",
		NeedDrumLv = 50,
		NeedDiamondLvStr = "强攻宝石=40",
		AddedPropertyStr = "战士神圣伤害=80;法师神圣伤害=48;道士神圣伤害=64"
	},
	{
		NeedSpringNum = 300,
		NeedMeritNum = 350,
		PropertyStr = "战士神圣伤害=370;法师神圣伤害=222;道士神圣伤害=296;战士强攻伤害=226;法师强攻伤害=226;道士强攻伤害=226;战士敏捷=2;法师敏捷=2;道士敏捷=2;战士魔法躲避=1;法师魔法躲避=1;道士魔法躲避=1;战士暴击系数=276;法师暴击系数=276;道士暴击系数=276;战士准确=1;法师准确=1;道士准确=1;战士魔法命中=1;法师魔法命中=1;道士魔法命中=1",
		NeedDrumLv = 55,
		NeedDiamondLvStr = "",
		AddedPropertyStr = "战士神圣伤害=80;法师神圣伤害=48;道士神圣伤害=64"
	},
	{
		NeedSpringNum = 300,
		NeedMeritNum = 400,
		PropertyStr = "战士神圣伤害=450;法师神圣伤害=270;道士神圣伤害=360;战士强攻伤害=226;法师强攻伤害=226;道士强攻伤害=226;战士敏捷=2;法师敏捷=2;道士敏捷=2;战士魔法躲避=1;法师魔法躲避=1;道士魔法躲避=1;战士暴击系数=276;法师暴击系数=276;道士暴击系数=276;战士准确=1;法师准确=1;道士准确=1;战士魔法命中=1;法师魔法命中=1;道士魔法命中=1",
		NeedDrumLv = 60,
		NeedDiamondLvStr = "",
		AddedPropertyStr = "战士神圣伤害=80;法师神圣伤害=48;道士神圣伤害=64"
	},
	{
		NeedSpringNum = 300,
		NeedMeritNum = 450,
		PropertyStr = "战士神圣伤害=530;法师神圣伤害=318;道士神圣伤害=424;战士强攻伤害=226;法师强攻伤害=226;道士强攻伤害=226;战士敏捷=2;法师敏捷=2;道士敏捷=2;战士魔法躲避=1;法师魔法躲避=1;道士魔法躲避=1;战士暴击系数=276;法师暴击系数=276;道士暴击系数=276;战士准确=1;法师准确=1;道士准确=1;战士魔法命中=1;法师魔法命中=1;道士魔法命中=1",
		NeedDrumLv = 65,
		NeedDiamondLvStr = "",
		AddedPropertyStr = "战士神圣伤害=80;法师神圣伤害=48;道士神圣伤害=64"
	},
	{
		NeedSpringNum = 300,
		NeedMeritNum = 500,
		PropertyStr = "战士神圣伤害=610;法师神圣伤害=366;道士神圣伤害=488;战士强攻伤害=226;法师强攻伤害=226;道士强攻伤害=226;战士敏捷=2;法师敏捷=2;道士敏捷=2;战士魔法躲避=1;法师魔法躲避=1;道士魔法躲避=1;战士暴击系数=276;法师暴击系数=276;道士暴击系数=276;战士准确=1;法师准确=1;道士准确=1;战士魔法命中=1;法师魔法命中=1;道士魔法命中=1",
		NeedDrumLv = 70,
		NeedDiamondLvStr = "",
		AddedPropertyStr = "战士神圣伤害=80;法师神圣伤害=48;道士神圣伤害=64"
	}
}

return DrumUnSealCfg
