local DrumCfg = {
	{
		UpNeedPlayerLevel = 70,
		PropertyStr = "攻击下限=0;攻击上限=1;魔法下限=0;魔法上限=1;道术下限=0;道术上限=1;战士生命值=5;法师生命值=2;道士生命值=5",
		UpNeedMeritNum = 30,
		Desc = "简单的红色军鼓，小有名气的象征"
	},
	{
		UpNeedPlayerLevel = 80,
		PropertyStr = "攻击下限=1;攻击上限=3;魔法下限=1;魔法上限=3;道术下限=1;道术上限=3;战士生命值=15;法师生命值=6;道士生命值=15",
		UpNeedMeritNum = 60,
		Desc = "简单的红色军鼓，小有名气的象征"
	},
	{
		UpNeedPlayerLevel = 90,
		PropertyStr = "攻击下限=2;攻击上限=6;魔法下限=2;魔法上限=6;道术下限=2;道术上限=6;战士生命值=25;法师生命值=10;道士生命值=25",
		UpNeedMeritNum = 90,
		Desc = "简单的红色军鼓，小有名气的象征"
	},
	{
		UpNeedPlayerLevel = 100,
		PropertyStr = "攻击下限=3;攻击上限=9;魔法下限=3;魔法上限=9;道术下限=3;道术上限=9;战士生命值=40;法师生命值=16;道士生命值=40",
		UpNeedMeritNum = 120,
		Desc = "简单的红色军鼓，小有名气的象征"
	},
	{
		UpNeedPlayerLevel = 109,
		PropertyStr = "攻击下限=4;攻击上限=12;魔法下限=4;魔法上限=12;道术下限=4;道术上限=12;战士生命值=55;法师生命值=22;道士生命值=55",
		UpNeedMeritNum = 160,
		Desc = "简单的红色军鼓，小有名气的象征"
	},
	{
		UpNeedPlayerLevel = 119,
		PropertyStr = "攻击下限=6;攻击上限=15;魔法下限=6;魔法上限=15;道术下限=6;道术上限=15;战士生命值=75;法师生命值=30;道士生命值=75",
		UpNeedMeritNum = 240,
		Desc = "红木制成的军鼓，功勋卓著的象征"
	},
	{
		UpNeedPlayerLevel = 129,
		PropertyStr = "攻击下限=8;攻击上限=18;魔法下限=8;魔法上限=18;道术下限=8;道术上限=18;战士生命值=95;法师生命值=38;道士生命值=95",
		UpNeedMeritNum = 320,
		Desc = "红木制成的军鼓，功勋卓著的象征"
	},
	{
		UpNeedPlayerLevel = 139,
		PropertyStr = "攻击下限=10;攻击上限=21;魔法下限=10;魔法上限=21;道术下限=10;道术上限=21;战士生命值=115;法师生命值=46;道士生命值=115",
		UpNeedMeritNum = 480,
		Desc = "红木制成的军鼓，功勋卓著的象征"
	},
	{
		UpNeedPlayerLevel = 149,
		PropertyStr = "攻击下限=12;攻击上限=24;魔法下限=12;魔法上限=24;道术下限=12;道术上限=24;战士生命值=135;法师生命值=54;道士生命值=135",
		UpNeedMeritNum = 640,
		Desc = "红木制成的军鼓，功勋卓著的象征"
	},
	{
		UpNeedPlayerLevel = 159,
		PropertyStr = "攻击下限=14;攻击上限=27;魔法下限=14;魔法上限=27;道术下限=14;道术上限=27;战士生命值=155;法师生命值=62;道士生命值=155",
		UpNeedMeritNum = 880,
		Desc = "红木制成的军鼓，功勋卓著的象征"
	},
	{
		UpNeedPlayerLevel = 169,
		PropertyStr = "攻击下限=16;攻击上限=31;魔法下限=16;魔法上限=31;道术下限=16;道术上限=31;战士生命值=180;法师生命值=72;道士生命值=180",
		UpNeedMeritNum = 1040,
		Desc = "镶金嵌玉的军鼓，承载着赫赫战功"
	},
	{
		UpNeedPlayerLevel = 179,
		PropertyStr = "攻击下限=18;攻击上限=35;魔法下限=18;魔法上限=35;道术下限=18;道术上限=35;战士生命值=205;法师生命值=82;道士生命值=205",
		UpNeedMeritNum = 1200,
		Desc = "镶金嵌玉的军鼓，承载着赫赫战功"
	},
	{
		UpNeedPlayerLevel = 189,
		PropertyStr = "攻击下限=20;攻击上限=39;魔法下限=20;魔法上限=39;道术下限=20;道术上限=39;战士生命值=230;法师生命值=92;道士生命值=230",
		UpNeedMeritNum = 1360,
		Desc = "镶金嵌玉的军鼓，承载着赫赫战功"
	},
	{
		UpNeedPlayerLevel = 203,
		PropertyStr = "攻击下限=22;攻击上限=43;魔法下限=22;魔法上限=43;道术下限=22;道术上限=43;战士生命值=255;法师生命值=102;道士生命值=255",
		UpNeedMeritNum = 1520,
		Desc = "镶金嵌玉的军鼓，承载着赫赫战功"
	},
	{
		UpNeedPlayerLevel = 218,
		PropertyStr = "攻击下限=24;攻击上限=47;魔法下限=24;魔法上限=47;道术下限=24;道术上限=47;战士生命值=280;法师生命值=112;道士生命值=280",
		UpNeedMeritNum = 1680,
		Desc = "镶金嵌玉的军鼓，承载着赫赫战功"
	},
	{
		UpNeedPlayerLevel = 233,
		PropertyStr = "攻击下限=26;攻击上限=52;魔法下限=26;魔法上限=52;道术下限=26;道术上限=52;战士生命值=310;法师生命值=124;道士生命值=310",
		UpNeedMeritNum = 1840,
		Desc = "金边龙纹的军鼓，彰显着不凡的气息"
	},
	{
		UpNeedPlayerLevel = 248,
		PropertyStr = "攻击下限=28;攻击上限=57;魔法下限=28;魔法上限=57;道术下限=28;道术上限=57;战士生命值=340;法师生命值=136;道士生命值=340",
		UpNeedMeritNum = 2000,
		Desc = "金边龙纹的军鼓，彰显着不凡的气息"
	},
	{
		UpNeedPlayerLevel = 263,
		PropertyStr = "攻击下限=30;攻击上限=62;魔法下限=30;魔法上限=62;道术下限=30;道术上限=62;战士生命值=370;法师生命值=148;道士生命值=370",
		UpNeedMeritNum = 2000,
		Desc = "金边龙纹的军鼓，彰显着不凡的气息"
	},
	{
		UpNeedPlayerLevel = 278,
		PropertyStr = "攻击下限=32;攻击上限=67;魔法下限=32;魔法上限=67;道术下限=32;道术上限=67;战士生命值=400;法师生命值=160;道士生命值=400",
		UpNeedMeritNum = 2000,
		Desc = "金边龙纹的军鼓，彰显着不凡的气息"
	},
	{
		UpNeedPlayerLevel = 293,
		PropertyStr = "攻击下限=34;攻击上限=72;魔法下限=34;魔法上限=72;道术下限=34;道术上限=72;战士生命值=430;法师生命值=172;道士生命值=430",
		UpNeedMeritNum = 2000,
		Desc = "金边龙纹的军鼓，彰显着不凡的气息"
	},
	{
		UpNeedPlayerLevel = 298,
		PropertyStr = "攻击下限=37;攻击上限=78;魔法下限=37;魔法上限=78;道术下限=37;道术上限=78;战士生命值=460;法师生命值=184;道士生命值=460",
		UpNeedMeritNum = 2000,
		Desc = "金边龙纹的军鼓，彰显着不凡的气息"
	},
	{
		UpNeedPlayerLevel = 298,
		PropertyStr = "攻击下限=40;攻击上限=84;魔法下限=40;魔法上限=84;道术下限=40;道术上限=84;战士生命值=490;法师生命值=196;道士生命值=490",
		UpNeedMeritNum = 2000,
		Desc = "金边龙纹的军鼓，彰显着不凡的气息"
	},
	{
		UpNeedPlayerLevel = 302,
		PropertyStr = "攻击下限=43;攻击上限=90;魔法下限=43;魔法上限=90;道术下限=43;道术上限=90;战士生命值=520;法师生命值=208;道士生命值=520",
		UpNeedMeritNum = 2000,
		Desc = "金边龙纹的军鼓，彰显着不凡的气息"
	},
	{
		UpNeedPlayerLevel = 302,
		PropertyStr = "攻击下限=46;攻击上限=96;魔法下限=46;魔法上限=96;道术下限=46;道术上限=96;战士生命值=550;法师生命值=220;道士生命值=550",
		UpNeedMeritNum = 2000,
		Desc = "金边龙纹的军鼓，彰显着不凡的气息"
	},
	{
		UpNeedPlayerLevel = 307,
		PropertyStr = "攻击下限=49;攻击上限=102;魔法下限=49;魔法上限=102;道术下限=49;道术上限=102;战士生命值=580;法师生命值=232;道士生命值=580",
		UpNeedMeritNum = 2000,
		Desc = "金边龙纹的军鼓，彰显着不凡的气息"
	},
	{
		UpNeedPlayerLevel = 312,
		PropertyStr = "攻击下限=52;攻击上限=108;魔法下限=52;魔法上限=108;道术下限=52;道术上限=108;战士生命值=610;法师生命值=244;道士生命值=610",
		UpNeedMeritNum = 2000,
		Desc = "金边龙纹的军鼓，彰显着不凡的气息"
	},
	{
		UpNeedPlayerLevel = 312,
		PropertyStr = "攻击下限=55;攻击上限=114;魔法下限=55;魔法上限=114;道术下限=55;道术上限=114;战士生命值=640;法师生命值=256;道士生命值=640",
		UpNeedMeritNum = 2000,
		Desc = "金边龙纹的军鼓，彰显着不凡的气息"
	},
	{
		UpNeedPlayerLevel = 317,
		PropertyStr = "攻击下限=58;攻击上限=120;魔法下限=58;魔法上限=120;道术下限=58;道术上限=120;战士生命值=670;法师生命值=268;道士生命值=670",
		UpNeedMeritNum = 2000,
		Desc = "金边龙纹的军鼓，彰显着不凡的气息"
	},
	{
		UpNeedPlayerLevel = 317,
		PropertyStr = "攻击下限=61;攻击上限=126;魔法下限=61;魔法上限=126;道术下限=61;道术上限=126;战士生命值=700;法师生命值=280;道士生命值=700",
		UpNeedMeritNum = 2000,
		Desc = "金边龙纹的军鼓，彰显着不凡的气息"
	},
	{
		UpNeedPlayerLevel = 322,
		PropertyStr = "攻击下限=64;攻击上限=132;魔法下限=64;魔法上限=132;道术下限=64;道术上限=132;战士生命值=730;法师生命值=292;道士生命值=730",
		UpNeedMeritNum = 2000,
		Desc = "金边龙纹的军鼓，彰显着不凡的气息"
	},
	{
		UpNeedPlayerLevel = 327,
		PropertyStr = "攻击下限=67;攻击上限=138;魔法下限=67;魔法上限=138;道术下限=67;道术上限=138;战士生命值=760;法师生命值=304;道士生命值=760",
		UpNeedMeritNum = 2000,
		Desc = "金边龙纹的军鼓，彰显着不凡的气息"
	},
	{
		UpNeedPlayerLevel = 327,
		PropertyStr = "攻击下限=70;攻击上限=144;魔法下限=70;魔法上限=144;道术下限=70;道术上限=144;战士生命值=790;法师生命值=316;道士生命值=790",
		UpNeedMeritNum = 2000,
		Desc = "金边龙纹的军鼓，彰显着不凡的气息"
	},
	{
		UpNeedPlayerLevel = 332,
		PropertyStr = "攻击下限=73;攻击上限=150;魔法下限=73;魔法上限=150;道术下限=73;道术上限=150;战士生命值=820;法师生命值=328;道士生命值=820",
		UpNeedMeritNum = 2000,
		Desc = "金边龙纹的军鼓，彰显着不凡的气息"
	},
	{
		UpNeedPlayerLevel = 332,
		PropertyStr = "攻击下限=76;攻击上限=156;魔法下限=76;魔法上限=156;道术下限=76;道术上限=156;战士生命值=850;法师生命值=340;道士生命值=850",
		UpNeedMeritNum = 2000,
		Desc = "金边龙纹的军鼓，彰显着不凡的气息"
	},
	{
		UpNeedPlayerLevel = 337,
		PropertyStr = "攻击下限=79;攻击上限=162;魔法下限=79;魔法上限=162;道术下限=79;道术上限=162;战士生命值=880;法师生命值=352;道士生命值=880",
		UpNeedMeritNum = 2000,
		Desc = "金边龙纹的军鼓，彰显着不凡的气息"
	},
	{
		UpNeedPlayerLevel = 342,
		PropertyStr = "攻击下限=82;攻击上限=168;魔法下限=82;魔法上限=168;道术下限=82;道术上限=168;战士生命值=910;法师生命值=364;道士生命值=910",
		UpNeedMeritNum = 2000,
		Desc = "精金美玉浑然一体的军鼓，透露出高贵的气质"
	},
	{
		UpNeedPlayerLevel = 342,
		PropertyStr = "攻击下限=85;攻击上限=174;魔法下限=85;魔法上限=174;道术下限=85;道术上限=174;战士生命值=940;法师生命值=376;道士生命值=940",
		UpNeedMeritNum = 2000,
		Desc = "精金美玉浑然一体的军鼓，透露出高贵的气质"
	},
	{
		UpNeedPlayerLevel = 347,
		PropertyStr = "攻击下限=88;攻击上限=180;魔法下限=88;魔法上限=180;道术下限=88;道术上限=180;战士生命值=970;法师生命值=388;道士生命值=970",
		UpNeedMeritNum = 2000,
		Desc = "精金美玉浑然一体的军鼓，透露出高贵的气质"
	},
	{
		UpNeedPlayerLevel = 347,
		PropertyStr = "攻击下限=91;攻击上限=186;魔法下限=91;魔法上限=186;道术下限=91;道术上限=186;战士生命值=1000;法师生命值=400;道士生命值=1000",
		UpNeedMeritNum = 2000,
		Desc = "精金美玉浑然一体的军鼓，透露出高贵的气质"
	},
	{
		UpNeedPlayerLevel = 352,
		PropertyStr = "攻击下限=94;攻击上限=192;魔法下限=94;魔法上限=192;道术下限=94;道术上限=192;战士生命值=1030;法师生命值=412;道士生命值=1030",
		UpNeedMeritNum = 2000,
		Desc = "精金美玉浑然一体的军鼓，透露出高贵的气质"
	},
	{
		UpNeedPlayerLevel = 357,
		PropertyStr = "攻击下限=97;攻击上限=198;魔法下限=97;魔法上限=198;道术下限=97;道术上限=198;战士生命值=1060;法师生命值=424;道士生命值=1060",
		UpNeedMeritNum = 2000,
		Desc = "精金美玉浑然一体的军鼓，透露出高贵的气质"
	},
	{
		UpNeedPlayerLevel = 357,
		PropertyStr = "攻击下限=100;攻击上限=204;魔法下限=100;魔法上限=204;道术下限=100;道术上限=204;战士生命值=1090;法师生命值=436;道士生命值=1090",
		UpNeedMeritNum = 2000,
		Desc = "精金美玉浑然一体的军鼓，透露出高贵的气质"
	},
	{
		UpNeedPlayerLevel = 362,
		PropertyStr = "攻击下限=103;攻击上限=210;魔法下限=103;魔法上限=210;道术下限=103;道术上限=210;战士生命值=1120;法师生命值=448;道士生命值=1120",
		UpNeedMeritNum = 2000,
		Desc = "精金美玉浑然一体的军鼓，透露出高贵的气质"
	},
	{
		UpNeedPlayerLevel = 362,
		PropertyStr = "攻击下限=106;攻击上限=216;魔法下限=106;魔法上限=216;道术下限=106;道术上限=216;战士生命值=1150;法师生命值=460;道士生命值=1150",
		UpNeedMeritNum = 2000,
		Desc = "精金美玉浑然一体的军鼓，透露出高贵的气质"
	},
	{
		UpNeedPlayerLevel = 367,
		PropertyStr = "攻击下限=109;攻击上限=222;魔法下限=109;魔法上限=222;道术下限=109;道术上限=222;战士生命值=1180;法师生命值=472;道士生命值=1180",
		UpNeedMeritNum = 2000,
		Desc = "精金美玉浑然一体的军鼓，透露出高贵的气质"
	},
	{
		UpNeedPlayerLevel = 372,
		PropertyStr = "攻击下限=112;攻击上限=228;魔法下限=112;魔法上限=228;道术下限=112;道术上限=228;战士生命值=1210;法师生命值=484;道士生命值=1210",
		UpNeedMeritNum = 2000,
		Desc = "精金美玉浑然一体的军鼓，透露出高贵的气质"
	},
	{
		UpNeedPlayerLevel = 377,
		PropertyStr = "攻击下限=115;攻击上限=234;魔法下限=115;魔法上限=234;道术下限=115;道术上限=234;战士生命值=1240;法师生命值=496;道士生命值=1240",
		UpNeedMeritNum = 2000,
		Desc = "精金美玉浑然一体的军鼓，透露出高贵的气质"
	},
	{
		UpNeedPlayerLevel = 382,
		PropertyStr = "攻击下限=118;攻击上限=240;魔法下限=118;魔法上限=240;道术下限=118;道术上限=240;战士生命值=1270;法师生命值=508;道士生命值=1270",
		UpNeedMeritNum = 2000,
		Desc = "精金美玉浑然一体的军鼓，透露出高贵的气质"
	},
	{
		UpNeedPlayerLevel = 387,
		PropertyStr = "攻击下限=121;攻击上限=246;魔法下限=121;魔法上限=246;道术下限=121;道术上限=246;战士生命值=1300;法师生命值=520;道士生命值=1300",
		UpNeedMeritNum = 2000,
		Desc = "精金美玉浑然一体的军鼓，透露出高贵的气质"
	},
	{
		UpNeedPlayerLevel = 392,
		PropertyStr = "攻击下限=124;攻击上限=252;魔法下限=124;魔法上限=252;道术下限=124;道术上限=252;战士生命值=1330;法师生命值=532;道士生命值=1330",
		UpNeedMeritNum = 2000,
		Desc = "外型宛若黄金战甲的军鼓，彰显着霸者的威风"
	},
	{
		UpNeedPlayerLevel = 397,
		PropertyStr = "攻击下限=127;攻击上限=258;魔法下限=127;魔法上限=258;道术下限=127;道术上限=258;战士生命值=1360;法师生命值=544;道士生命值=1360",
		UpNeedMeritNum = 2500,
		Desc = "外型宛若黄金战甲的军鼓，彰显着霸者的威风"
	},
	{
		UpNeedPlayerLevel = 397,
		PropertyStr = "攻击下限=130;攻击上限=264;魔法下限=130;魔法上限=264;道术下限=130;道术上限=264;战士生命值=1390;法师生命值=556;道士生命值=1390",
		UpNeedMeritNum = 2500,
		Desc = "外型宛若黄金战甲的军鼓，彰显着霸者的威风"
	},
	{
		UpNeedPlayerLevel = 401,
		PropertyStr = "攻击下限=133;攻击上限=270;魔法下限=133;魔法上限=270;道术下限=133;道术上限=270;战士生命值=1420;法师生命值=568;道士生命值=1420",
		UpNeedMeritNum = 2500,
		Desc = "外型宛若黄金战甲的军鼓，彰显着霸者的威风"
	},
	{
		UpNeedPlayerLevel = 401,
		PropertyStr = "攻击下限=136;攻击上限=276;魔法下限=136;魔法上限=276;道术下限=136;道术上限=276;战士生命值=1450;法师生命值=580;道士生命值=1450",
		UpNeedMeritNum = 2500,
		Desc = "外型宛若黄金战甲的军鼓，彰显着霸者的威风"
	},
	{
		UpNeedPlayerLevel = 406,
		PropertyStr = "攻击下限=139;攻击上限=282;魔法下限=139;魔法上限=282;道术下限=139;道术上限=282;战士生命值=1480;法师生命值=592;道士生命值=1480",
		UpNeedMeritNum = 2500,
		Desc = "外型宛若黄金战甲的军鼓，彰显着霸者的威风"
	},
	{
		UpNeedPlayerLevel = 411,
		PropertyStr = "攻击下限=142;攻击上限=288;魔法下限=142;魔法上限=288;道术下限=142;道术上限=288;战士生命值=1510;法师生命值=604;道士生命值=1510",
		UpNeedMeritNum = 2500,
		Desc = "外型宛若黄金战甲的军鼓，彰显着霸者的威风"
	},
	{
		UpNeedPlayerLevel = 411,
		PropertyStr = "攻击下限=145;攻击上限=294;魔法下限=145;魔法上限=294;道术下限=145;道术上限=294;战士生命值=1540;法师生命值=616;道士生命值=1540",
		UpNeedMeritNum = 2500,
		Desc = "外型宛若黄金战甲的军鼓，彰显着霸者的威风"
	},
	{
		UpNeedPlayerLevel = 416,
		PropertyStr = "攻击下限=148;攻击上限=300;魔法下限=148;魔法上限=300;道术下限=148;道术上限=300;战士生命值=1570;法师生命值=628;道士生命值=1570",
		UpNeedMeritNum = 2500,
		Desc = "外型宛若黄金战甲的军鼓，彰显着霸者的威风"
	},
	{
		UpNeedPlayerLevel = 416,
		PropertyStr = "攻击下限=151;攻击上限=306;魔法下限=151;魔法上限=306;道术下限=151;道术上限=306;战士生命值=1600;法师生命值=640;道士生命值=1600",
		UpNeedMeritNum = 2500,
		Desc = "外型宛若黄金战甲的军鼓，彰显着霸者的威风"
	},
	{
		UpNeedPlayerLevel = 421,
		PropertyStr = "攻击下限=154;攻击上限=312;魔法下限=154;魔法上限=312;道术下限=154;道术上限=312;战士生命值=1630;法师生命值=652;道士生命值=1630",
		UpNeedMeritNum = 2500,
		Desc = "外型宛若黄金战甲的军鼓，彰显着霸者的威风"
	},
	{
		UpNeedPlayerLevel = 426,
		PropertyStr = "攻击下限=157;攻击上限=318;魔法下限=157;魔法上限=318;道术下限=157;道术上限=318;战士生命值=1660;法师生命值=664;道士生命值=1660",
		UpNeedMeritNum = 3500,
		Desc = "外型宛若黄金战甲的军鼓，彰显着霸者的威风"
	},
	{
		UpNeedPlayerLevel = 426,
		PropertyStr = "攻击下限=160;攻击上限=324;魔法下限=160;魔法上限=324;道术下限=160;道术上限=324;战士生命值=1690;法师生命值=676;道士生命值=1690",
		UpNeedMeritNum = 3500,
		Desc = "外型宛若黄金战甲的军鼓，彰显着霸者的威风"
	},
	{
		UpNeedPlayerLevel = 431,
		PropertyStr = "攻击下限=163;攻击上限=330;魔法下限=163;魔法上限=330;道术下限=163;道术上限=330;战士生命值=1720;法师生命值=688;道士生命值=1720",
		UpNeedMeritNum = 3500,
		Desc = "外型宛若黄金战甲的军鼓，彰显着霸者的威风"
	},
	{
		UpNeedPlayerLevel = 431,
		PropertyStr = "攻击下限=166;攻击上限=336;魔法下限=166;魔法上限=336;道术下限=166;道术上限=336;战士生命值=1750;法师生命值=700;道士生命值=1750",
		UpNeedMeritNum = 3500,
		Desc = "外型宛若黄金战甲的军鼓，彰显着霸者的威风"
	},
	{
		UpNeedPlayerLevel = 436,
		PropertyStr = "攻击下限=169;攻击上限=342;魔法下限=169;魔法上限=342;道术下限=169;道术上限=342;战士生命值=1780;法师生命值=712;道士生命值=1780",
		UpNeedMeritNum = 3500,
		Desc = "外型宛若黄金战甲的军鼓，彰显着霸者的威风"
	},
	{
		UpNeedPlayerLevel = 441,
		PropertyStr = "攻击下限=172;攻击上限=348;魔法下限=172;魔法上限=348;道术下限=172;道术上限=348;战士生命值=1810;法师生命值=724;道士生命值=1810",
		UpNeedMeritNum = 3500,
		Desc = "外型宛若黄金战甲的军鼓，彰显着霸者的威风"
	},
	{
		UpNeedPlayerLevel = 441,
		PropertyStr = "攻击下限=175;攻击上限=354;魔法下限=175;魔法上限=354;道术下限=175;道术上限=354;战士生命值=1840;法师生命值=736;道士生命值=1840",
		UpNeedMeritNum = 3500,
		Desc = "外型宛若黄金战甲的军鼓，彰显着霸者的威风"
	},
	{
		UpNeedPlayerLevel = 446,
		PropertyStr = "攻击下限=178;攻击上限=360;魔法下限=178;魔法上限=360;道术下限=178;道术上限=360;战士生命值=1870;法师生命值=748;道士生命值=1870",
		UpNeedMeritNum = 3500,
		Desc = "外型宛若黄金战甲的军鼓，彰显着霸者的威风"
	},
	{
		UpNeedPlayerLevel = 446,
		PropertyStr = "攻击下限=181;攻击上限=366;魔法下限=181;魔法上限=366;道术下限=181;道术上限=366;战士生命值=1900;法师生命值=760;道士生命值=1900",
		UpNeedMeritNum = 3500,
		Desc = "外型宛若黄金战甲的军鼓，彰显着霸者的威风"
	},
	{
		UpNeedPlayerLevel = 451,
		PropertyStr = "攻击下限=184;攻击上限=372;魔法下限=184;魔法上限=372;道术下限=184;道术上限=372;战士生命值=1930;法师生命值=772;道士生命值=1930",
		UpNeedMeritNum = 4000,
		Desc = "纯金与红宝石打造的军鼓，彰显出王者的风范"
	}
}

return DrumCfg
