local equipPicIdentifyConfig = {
	{
		NeedOpenDay = 0,
		Name = "装备合成",
		RelevantActs = "无",
		Npc = "庄园-神秘的锻造师",
		Items = "战神碎片|0|0;星王碎片|0|0",
		Disc = "游戏内除了新手级和商店级装备作为前期过渡外，依次提升是沃玛级、祖玛级、赤月级、魔龙级、战神级、星王级。|0|0;在庄园-神秘的锻造师处，可以进行部分装备的合成。包括项链、护腕、戒指、头盔、腰带、靴子这些部位。6个同样的祖玛级装备可以合成对应的赤月级；6个同样的赤月级装备可以合成对应的魔龙级；1个魔龙级装备和5个战神碎片可以合成对应的战神级；1个魔龙级装备和5个星王碎片可以合成对应的星王级。这些合成都是百分百成功的。|0|0;服务器三阶段后，还可以在庄园合成王者级装备。|0|2;合成所需装备和材料主要通过精英怪、世界首领和参与游戏内各种获得，也可以在交易行或者相关角色处购买。|0|0;",
		NeedServerStep = 0,
		Aim = "无"
	},
	{
		NeedOpenDay = 0,
		Name = "武器锻造",
		RelevantActs = "无",
		Npc = "庄园-炼金师",
		Items = "金刚石|0|0",
		Disc = "武器锻造是除了打怪爆出和交易购买之外主要的获得武器途径,武器锻造是随机获得武器的。|0|0;在庄园-炼金师处可使用元宝兑换灵符，使用灵符锻造获得金刚石。在庄园-炼金师处还可以使用金刚石锻造武器，同时也可将不用的武器重新熔炼获得金币或金刚石。|0|0;",
		NeedServerStep = 0,
		Aim = "无"
	},
	{
		NeedOpenDay = 0,
		Name = "装备精炼",
		RelevantActs = "无",
		Npc = "庄园-装备精炼师",
		Items = "沃玛凭证|0|0;祖玛凭证|0|0;铜矿|0|0;铁矿|0|0;银矿|0|0;金矿|0|0;金刚石|0|0;白色绒丝|0|0;金色绒丝|0|0;重装凭证|0|0;二阶精炼石|0|3",
		Disc = "沃玛级以上的武器、项链、护腕、戒指、腰带、头盔、靴子，精炼只需消耗少量的材料却可以提升大量的属性。可以精炼的装备会显示“可精炼”。|0|0;服务器达到一阶段后，祖玛级以上的衣服可以进行精炼，精炼材料主要由六大重装首领爆出。|20|0;装备精炼需要扣除相应的道具，并且有一定几率精炼失败（失败后材料会消失，装备会保留）。精炼过的装备爆出后精炼属性将消失，需要重新精炼。|0|0;服务器达到三阶段后，可对精炼后的魔龙级以上装备进行二阶精炼，新增精炼材料二阶精炼石，可通过部分首领爆出。|0|3;二阶精炼成功后可增加大量属性，精炼后的装备爆出后，所有精炼属性将消失。|0|3;",
		NeedServerStep = 0,
		Aim = "无"
	},
	{
		NeedOpenDay = 0,
		Name = "装备分解",
		RelevantActs = "无",
		Npc = "庄园-回收商人",
		Items = "无",
		Disc = "在庄园-回收商人处可对沃玛级别以上的装备进行分解并获得相应的材料。分解装备获得的沃玛凭证、祖玛凭证、赤月凭证、魔龙凭证、重装凭证可有大用处；而分解战神级、星王级装备还能获得战神碎片、星王碎片以合成更高级的装备。|0|0;如果你想销毁其他普通道具，可以使用背包中“回收商人”按钮，在里面进行回收。|0|0;",
		NeedServerStep = 0,
		Aim = "无"
	},
	{
		NeedOpenDay = 0,
		Name = "宝甲合成",
		RelevantActs = "无",
		Npc = "苍月岛服装店-神秘的裁缝",
		Items = "天魔神甲|0|0;圣战宝甲|0|0;法神披风|0|0;霓裳羽衣|0|0;天尊道袍|0|0;天师长袍|0|0;雷霆战甲(男)|0|0;雷霆战甲(女)|0|0;烈焰魔衣(男)|0|0;烈焰魔衣(女)|0|0;光芒道袍(男)|0|0;光芒道袍(女)|0|0;醉清风|0|0;醉红颜|0|0;沃玛凭证|0|0;祖玛凭证|0|0;灵符|0|0;龙心碎片|0|0;龙心原石|0|0",
		Disc = "游戏中有许多宝甲为英雄们苦苦追寻，包括赤月级重装（天魔神甲、圣战宝甲、法神披风、霓裳羽衣、天尊道袍、天师长袍），雷霆级战衣（雷霆战甲、烈焰魔衣、光芒道袍），以及战神级时装（醉清风、醉红颜）。赤月级重装必须消灭六大衣服点首领，或者参加夺宝活动可以获得。|0|0;苍月岛服装店的神秘的裁缝习得手艺，可将极品重装与沃玛凭证、祖玛凭证以及灵符合成对应职业性别的魔龙级别服装。还能使用龙心碎片合成醉清风、醉红颜。|0|0;",
		NeedServerStep = 0,
		Aim = "魔龙级别服装"
	},
	{
		NeedOpenDay = 0,
		Name = "极品洗练",
		RelevantActs = "无",
		Npc = "庄园-装备精炼师",
		Items = "洗炼石|0|0;绑定洗炼石|0|0",
		Disc = "在庄园-装备精炼师处，可以给装备进行极品洗练。提供消耗材料会随机获得极品属性（不能累加），极品属性的类型和数值都是随机的。|0|0;",
		NeedServerStep = 0,
		Aim = "无"
	},
	{
		NeedOpenDay = 20,
		Name = "武器修炼",
		RelevantActs = "无",
		Npc = "铁匠铺-兵器店老板",
		Items = "黑铁矿石碎片|0|0;玄铁石|0|0;绑定玄铁石|0|0",
		Disc = "在沙巴克铁匠铺的兵器店老板可以帮你的武器进行修炼，修炼武器可以大幅提升属性。|0|0;修炼武器需要金币、黑铁矿石碎片、玄铁石等材料。|0|0;修炼武器失败时有一定几率掉级，不过你可以额外使用保护符，修炼失败也不会降低修炼等级。|0|0;不同档次武器最高的修炼等级不同，符合要求的武器，修炼等级也可以互相传承。|0|0;",
		NeedServerStep = 0,
		Aim = "无"
	},
	{
		NeedOpenDay = 20,
		Name = "装备鉴定",
		RelevantActs = "无",
		Npc = "庄园-装备精炼师",
		Items = "一级鉴定符|0|0;绑定一级鉴定符|0|0",
		Disc = "所有首饰和防具都可以进行装备鉴定，鉴定将随机刷新属性条（最多4条）和属性数值。首饰和防具的刷新属性类别略有不同。|0|0;每次鉴定将刷新和替换现有属性条。|0|0;鉴定属性消耗材料也可以在同类型装备间传承。|0|0;",
		NeedServerStep = 0,
		Aim = "无"
	},
	{
		NeedOpenDay = 0,
		Name = "装备套装",
		RelevantActs = "无",
		Npc = "庄园-装备精炼师",
		Items = "绑定套装激活卷|0|0",
		Disc = "服务器达到2阶段且开服90天时，开启套装激活功能。|0|0;星王及星王以上套装，可进行套装属性激活。|0|0;套装激活后可增加额外套装属性，需穿戴相应或更高级装备后生效。|0|0;套装属性与穿戴件数有关，需求件数为3/6/9件，套装属性可累加。|0|0;同层次套装属性，只生效较高级的一个。|0|0;套装9件属性生效后，可激活特殊外显。|0|0;",
		NeedServerStep = 2,
		Aim = "无"
	},
	{
		NeedOpenDay = 0,
		Name = "装备格强化",
		RelevantActs = "无",
		Npc = "庄园-装备精炼师",
		Items = "绑定炼体符|0|0",
		Disc = "服务器达到3阶段且开服100天时，开启装备格强化功能。|0|0;装备格强化后可增加勇士属性，需穿戴装备后对应装备格属性才能生效。|0|0;装备格强化不会失败，当装备格强化至一定等级时，会增加额外属性，额外属性也需要穿戴对应装备才能生效。|0|0;强化道具可通过装备精炼师购买或参与每日任务-炼体伏魔获得。|0|0;",
		NeedServerStep = 3,
		Aim = "无"
	}
}

return equipPicIdentifyConfig
