local GodWeapon = {
	{
		Request = "玄铁石=0;金币=0;服务器阶段=1;人物等级=0",
		GodWeaponLevel = 0,
		GodWeaponProperty = "攻击下限=0;攻击上限=0;魔法下限=0;魔法上限=0;道术下限=0;道术上限=0;战士生命值=0;法师生命值=0;道士生命值=0",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=1;金币=50000;服务器阶段=1;人物等级=0",
		GodWeaponLevel = 1,
		GodWeaponProperty = "攻击下限=0;攻击上限=0;魔法下限=0;魔法上限=0;道术下限=0;道术上限=0;战士生命值=35;法师生命值=14;道士生命值=35",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=2;金币=50000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 2,
		GodWeaponProperty = "攻击下限=1;攻击上限=2;魔法下限=1;魔法上限=2;道术下限=1;道术上限=2;战士生命值=35;法师生命值=14;道士生命值=35",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=3;金币=60000;服务器阶段=0;人物等级=60",
		GodWeaponLevel = 3,
		GodWeaponProperty = "攻击下限=1;攻击上限=2;魔法下限=1;魔法上限=2;道术下限=1;道术上限=2;战士生命值=70;法师生命值=28;道士生命值=70",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=4;金币=60000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 4,
		GodWeaponProperty = "攻击下限=2;攻击上限=4;魔法下限=2;魔法上限=4;道术下限=2;道术上限=4;战士生命值=70;法师生命值=28;道士生命值=70",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=4;金币=70000;服务器阶段=0;人物等级=0;烈火剑法等级=3;冰咆哮等级=3;召唤神兽等级=3",
		GodWeaponLevel = 5,
		GodWeaponProperty = "攻击下限=2;攻击上限=4;魔法下限=2;魔法上限=4;道术下限=2;道术上限=4;战士生命值=150;法师生命值=60;道士生命值=150",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=4;金币=70000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 6,
		GodWeaponProperty = "攻击下限=3;攻击上限=6;魔法下限=3;魔法上限=6;道术下限=3;道术上限=6;战士生命值=150;法师生命值=60;道士生命值=150",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=5;金币=80000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 7,
		GodWeaponProperty = "攻击下限=3;攻击上限=6;魔法下限=3;魔法上限=6;道术下限=3;道术上限=6;战士生命值=185;法师生命值=74;道士生命值=185",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=5;金币=80000;服务器阶段=0;人物等级=70",
		GodWeaponLevel = 8,
		GodWeaponProperty = "攻击下限=4;攻击上限=8;魔法下限=4;魔法上限=8;道术下限=4;道术上限=8;战士生命值=185;法师生命值=74;道士生命值=185",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=5;金币=90000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 9,
		GodWeaponProperty = "攻击下限=4;攻击上限=8;魔法下限=4;魔法上限=8;道术下限=4;道术上限=8;战士生命值=220;法师生命值=88;道士生命值=220",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=5;金币=90000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 10,
		GodWeaponProperty = "攻击下限=6;攻击上限=12;魔法下限=6;魔法上限=12;道术下限=6;道术上限=12;战士生命值=220;法师生命值=88;道士生命值=220",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=6;金币=100000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 11,
		GodWeaponProperty = "攻击下限=6;攻击上限=12;魔法下限=6;魔法上限=12;道术下限=6;道术上限=12;战士生命值=255;法师生命值=102;道士生命值=255",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=6;金币=100000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 12,
		GodWeaponProperty = "攻击下限=7;攻击上限=14;魔法下限=7;魔法上限=14;道术下限=7;道术上限=14;战士生命值=255;法师生命值=102;道士生命值=255",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=6;金币=110000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 13,
		GodWeaponProperty = "攻击下限=7;攻击上限=14;魔法下限=7;魔法上限=14;道术下限=7;道术上限=14;战士生命值=290;法师生命值=116;道士生命值=290",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=7;金币=110000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 14,
		GodWeaponProperty = "攻击下限=8;攻击上限=16;魔法下限=8;魔法上限=16;道术下限=8;道术上限=16;战士生命值=290;法师生命值=116;道士生命值=290",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=7;金币=120000;服务器阶段=0;人物等级=0;逐日剑法等级=3;流星火雨等级=3;噬血术等级=3",
		GodWeaponLevel = 15,
		GodWeaponProperty = "攻击下限=8;攻击上限=16;魔法下限=8;魔法上限=16;道术下限=8;道术上限=16;战士生命值=370;法师生命值=148;道士生命值=370",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=7;金币=120000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 16,
		GodWeaponProperty = "攻击下限=9;攻击上限=18;魔法下限=9;魔法上限=18;道术下限=9;道术上限=18;战士生命值=370;法师生命值=148;道士生命值=370",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=8;金币=130000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 17,
		GodWeaponProperty = "攻击下限=9;攻击上限=18;魔法下限=9;魔法上限=18;道术下限=9;道术上限=18;战士生命值=405;法师生命值=162;道士生命值=405",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=8;金币=130000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 18,
		GodWeaponProperty = "攻击下限=10;攻击上限=20;魔法下限=10;魔法上限=20;道术下限=10;道术上限=20;战士生命值=405;法师生命值=162;道士生命值=405",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=8;金币=140000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 19,
		GodWeaponProperty = "攻击下限=10;攻击上限=20;魔法下限=10;魔法上限=20;道术下限=10;道术上限=20;战士生命值=440;法师生命值=176;道士生命值=440",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=8;金币=140000;服务器阶段=0;人物等级=90",
		GodWeaponLevel = 20,
		GodWeaponProperty = "攻击下限=12;攻击上限=24;魔法下限=12;魔法上限=24;道术下限=12;道术上限=24;战士生命值=440;法师生命值=176;道士生命值=440",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=10;金币=150000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 21,
		GodWeaponProperty = "攻击下限=12;攻击上限=24;魔法下限=12;魔法上限=24;道术下限=12;道术上限=24;战士生命值=475;法师生命值=190;道士生命值=475",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=10;金币=150000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 22,
		GodWeaponProperty = "攻击下限=13;攻击上限=26;魔法下限=13;魔法上限=26;道术下限=13;道术上限=26;战士生命值=475;法师生命值=190;道士生命值=475",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=12;金币=160000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 23,
		GodWeaponProperty = "攻击下限=13;攻击上限=26;魔法下限=13;魔法上限=26;道术下限=13;道术上限=26;战士生命值=510;法师生命值=204;道士生命值=510",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=12;金币=160000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 24,
		GodWeaponProperty = "攻击下限=14;攻击上限=28;魔法下限=14;魔法上限=28;道术下限=14;道术上限=28;战士生命值=510;法师生命值=204;道士生命值=510",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=14;金币=170000;服务器阶段=0;人物等级=120",
		GodWeaponLevel = 25,
		GodWeaponProperty = "攻击下限=14;攻击上限=28;魔法下限=14;魔法上限=28;道术下限=14;道术上限=28;战士生命值=590;法师生命值=236;道士生命值=590",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=14;金币=170000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 26,
		GodWeaponProperty = "攻击下限=15;攻击上限=30;魔法下限=15;魔法上限=30;道术下限=15;道术上限=30;战士生命值=590;法师生命值=236;道士生命值=590",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=16;金币=180000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 27,
		GodWeaponProperty = "攻击下限=15;攻击上限=30;魔法下限=15;魔法上限=30;道术下限=15;道术上限=30;战士生命值=625;法师生命值=250;道士生命值=625",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=16;金币=180000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 28,
		GodWeaponProperty = "攻击下限=16;攻击上限=32;魔法下限=16;魔法上限=32;道术下限=16;道术上限=32;战士生命值=625;法师生命值=250;道士生命值=625",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=18;金币=190000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 29,
		GodWeaponProperty = "攻击下限=16;攻击上限=32;魔法下限=16;魔法上限=32;道术下限=16;道术上限=32;战士生命值=660;法师生命值=264;道士生命值=660",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=18;金币=190000;服务器阶段=0;人物等级=150",
		GodWeaponLevel = 30,
		GodWeaponProperty = "攻击下限=18;攻击上限=36;魔法下限=18;魔法上限=36;道术下限=18;道术上限=36;战士生命值=660;法师生命值=264;道士生命值=660",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=20;金币=200000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 31,
		GodWeaponProperty = "攻击下限=18;攻击上限=36;魔法下限=18;魔法上限=36;道术下限=18;道术上限=36;战士生命值=695;法师生命值=278;道士生命值=695",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=20;金币=200000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 32,
		GodWeaponProperty = "攻击下限=19;攻击上限=38;魔法下限=19;魔法上限=38;道术下限=19;道术上限=38;战士生命值=695;法师生命值=278;道士生命值=695",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=24;金币=210000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 33,
		GodWeaponProperty = "攻击下限=19;攻击上限=38;魔法下限=19;魔法上限=38;道术下限=19;道术上限=38;战士生命值=730;法师生命值=292;道士生命值=730",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=24;金币=210000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 34,
		GodWeaponProperty = "攻击下限=20;攻击上限=40;魔法下限=20;魔法上限=40;道术下限=20;道术上限=40;战士生命值=730;法师生命值=292;道士生命值=730",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=28;金币=220000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 35,
		GodWeaponProperty = "攻击下限=20;攻击上限=40;魔法下限=20;魔法上限=40;道术下限=20;道术上限=40;战士生命值=810;法师生命值=324;道士生命值=810",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=28;金币=220000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 36,
		GodWeaponProperty = "攻击下限=21;攻击上限=42;魔法下限=21;魔法上限=42;道术下限=21;道术上限=42;战士生命值=810;法师生命值=324;道士生命值=810",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=32;金币=230000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 37,
		GodWeaponProperty = "攻击下限=21;攻击上限=42;魔法下限=21;魔法上限=42;道术下限=21;道术上限=42;战士生命值=845;法师生命值=338;道士生命值=845",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=32;金币=230000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 38,
		GodWeaponProperty = "攻击下限=22;攻击上限=44;魔法下限=22;魔法上限=44;道术下限=22;道术上限=44;战士生命值=845;法师生命值=338;道士生命值=845",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=36;金币=240000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 39,
		GodWeaponProperty = "攻击下限=22;攻击上限=44;魔法下限=22;魔法上限=44;道术下限=22;道术上限=44;战士生命值=880;法师生命值=352;道士生命值=880",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=36;金币=240000;服务器阶段=2;人物等级=200",
		GodWeaponLevel = 40,
		GodWeaponProperty = "攻击下限=24;攻击上限=48;魔法下限=24;魔法上限=48;道术下限=24;道术上限=48;战士生命值=880;法师生命值=352;道士生命值=880",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=40;金币=250000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 41,
		GodWeaponProperty = "攻击下限=24;攻击上限=48;魔法下限=24;魔法上限=48;道术下限=24;道术上限=48;战士生命值=915;法师生命值=366;道士生命值=915",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=40;金币=250000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 42,
		GodWeaponProperty = "攻击下限=25;攻击上限=50;魔法下限=25;魔法上限=50;道术下限=25;道术上限=50;战士生命值=915;法师生命值=366;道士生命值=915",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=46;金币=260000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 43,
		GodWeaponProperty = "攻击下限=25;攻击上限=50;魔法下限=25;魔法上限=50;道术下限=25;道术上限=50;战士生命值=950;法师生命值=380;道士生命值=950",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=46;金币=260000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 44,
		GodWeaponProperty = "攻击下限=26;攻击上限=52;魔法下限=26;魔法上限=52;道术下限=26;道术上限=52;战士生命值=950;法师生命值=380;道士生命值=950",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=52;金币=270000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 45,
		GodWeaponProperty = "攻击下限=26;攻击上限=52;魔法下限=26;魔法上限=52;道术下限=26;道术上限=52;战士生命值=1030;法师生命值=412;道士生命值=1030",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=52;金币=270000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 46,
		GodWeaponProperty = "攻击下限=27;攻击上限=54;魔法下限=27;魔法上限=54;道术下限=27;道术上限=54;战士生命值=1030;法师生命值=412;道士生命值=1030",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=58;金币=280000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 47,
		GodWeaponProperty = "攻击下限=27;攻击上限=54;魔法下限=27;魔法上限=54;道术下限=27;道术上限=54;战士生命值=1065;法师生命值=426;道士生命值=1065",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=58;金币=280000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 48,
		GodWeaponProperty = "攻击下限=28;攻击上限=56;魔法下限=28;魔法上限=56;道术下限=28;道术上限=56;战士生命值=1065;法师生命值=426;道士生命值=1065",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=64;金币=290000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 49,
		GodWeaponProperty = "攻击下限=28;攻击上限=56;魔法下限=28;魔法上限=56;道术下限=28;道术上限=56;战士生命值=1100;法师生命值=440;道士生命值=1100",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=64;金币=290000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 50,
		GodWeaponProperty = "攻击下限=30;攻击上限=60;魔法下限=30;魔法上限=60;道术下限=30;道术上限=60;战士生命值=1100;法师生命值=440;道士生命值=1100",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=70;金币=300000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 51,
		GodWeaponProperty = "攻击下限=30;攻击上限=60;魔法下限=30;魔法上限=60;道术下限=30;道术上限=60;战士生命值=1135;法师生命值=454;道士生命值=1135",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=70;金币=300000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 52,
		GodWeaponProperty = "攻击下限=31;攻击上限=62;魔法下限=31;魔法上限=62;道术下限=31;道术上限=62;战士生命值=1135;法师生命值=454;道士生命值=1135",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=76;金币=310000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 53,
		GodWeaponProperty = "攻击下限=31;攻击上限=62;魔法下限=31;魔法上限=62;道术下限=31;道术上限=62;战士生命值=1170;法师生命值=468;道士生命值=1170",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=76;金币=310000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 54,
		GodWeaponProperty = "攻击下限=32;攻击上限=64;魔法下限=32;魔法上限=64;道术下限=32;道术上限=64;战士生命值=1170;法师生命值=468;道士生命值=1170",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=82;金币=320000;服务器阶段=0;人物等级=250",
		GodWeaponLevel = 55,
		GodWeaponProperty = "攻击下限=32;攻击上限=64;魔法下限=32;魔法上限=64;道术下限=32;道术上限=64;战士生命值=1250;法师生命值=500;道士生命值=1250",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=82;金币=320000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 56,
		GodWeaponProperty = "攻击下限=33;攻击上限=66;魔法下限=33;魔法上限=66;道术下限=33;道术上限=66;战士生命值=1250;法师生命值=500;道士生命值=1250",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=88;金币=330000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 57,
		GodWeaponProperty = "攻击下限=33;攻击上限=66;魔法下限=33;魔法上限=66;道术下限=33;道术上限=66;战士生命值=1285;法师生命值=514;道士生命值=1285",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=88;金币=330000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 58,
		GodWeaponProperty = "攻击下限=34;攻击上限=68;魔法下限=34;魔法上限=68;道术下限=34;道术上限=68;战士生命值=1285;法师生命值=514;道士生命值=1285",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=94;金币=340000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 59,
		GodWeaponProperty = "攻击下限=34;攻击上限=68;魔法下限=34;魔法上限=68;道术下限=34;道术上限=68;战士生命值=1320;法师生命值=528;道士生命值=1320",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=94;金币=340000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 60,
		GodWeaponProperty = "攻击下限=36;攻击上限=72;魔法下限=36;魔法上限=72;道术下限=36;道术上限=72;战士生命值=1320;法师生命值=528;道士生命值=1320",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=100;金币=350000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 61,
		GodWeaponProperty = "攻击下限=36;攻击上限=72;魔法下限=36;魔法上限=72;道术下限=36;道术上限=72;战士生命值=1355;法师生命值=542;道士生命值=1355",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=100;金币=350000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 62,
		GodWeaponProperty = "攻击下限=37;攻击上限=74;魔法下限=37;魔法上限=74;道术下限=37;道术上限=74;战士生命值=1355;法师生命值=542;道士生命值=1355",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=108;金币=360000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 63,
		GodWeaponProperty = "攻击下限=37;攻击上限=74;魔法下限=37;魔法上限=74;道术下限=37;道术上限=74;战士生命值=1390;法师生命值=556;道士生命值=1390",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=108;金币=360000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 64,
		GodWeaponProperty = "攻击下限=38;攻击上限=76;魔法下限=38;魔法上限=76;道术下限=38;道术上限=76;战士生命值=1390;法师生命值=556;道士生命值=1390",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=116;金币=370000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 65,
		GodWeaponProperty = "攻击下限=38;攻击上限=76;魔法下限=38;魔法上限=76;道术下限=38;道术上限=76;战士生命值=1470;法师生命值=588;道士生命值=1470",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=116;金币=370000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 66,
		GodWeaponProperty = "攻击下限=39;攻击上限=78;魔法下限=39;魔法上限=78;道术下限=39;道术上限=78;战士生命值=1470;法师生命值=588;道士生命值=1470",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=124;金币=380000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 67,
		GodWeaponProperty = "攻击下限=39;攻击上限=78;魔法下限=39;魔法上限=78;道术下限=39;道术上限=78;战士生命值=1505;法师生命值=602;道士生命值=1505",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=124;金币=380000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 68,
		GodWeaponProperty = "攻击下限=40;攻击上限=80;魔法下限=40;魔法上限=80;道术下限=40;道术上限=80;战士生命值=1505;法师生命值=602;道士生命值=1505",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=132;金币=390000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 69,
		GodWeaponProperty = "攻击下限=40;攻击上限=80;魔法下限=40;魔法上限=80;道术下限=40;道术上限=80;战士生命值=1540;法师生命值=616;道士生命值=1540",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=132;金币=390000;服务器阶段=0;人物等级=300",
		GodWeaponLevel = 70,
		GodWeaponProperty = "攻击下限=42;攻击上限=84;魔法下限=42;魔法上限=84;道术下限=42;道术上限=84;战士生命值=1540;法师生命值=616;道士生命值=1540",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=140;金币=400000;服务器阶段=3;人物等级=0",
		GodWeaponLevel = 71,
		GodWeaponProperty = "攻击下限=42;攻击上限=84;魔法下限=42;魔法上限=84;道术下限=42;道术上限=84;战士生命值=1575;法师生命值=630;道士生命值=1575",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=140;金币=400000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 72,
		GodWeaponProperty = "攻击下限=43;攻击上限=86;魔法下限=43;魔法上限=86;道术下限=43;道术上限=86;战士生命值=1575;法师生命值=630;道士生命值=1575",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=150;金币=410000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 73,
		GodWeaponProperty = "攻击下限=43;攻击上限=86;魔法下限=43;魔法上限=86;道术下限=43;道术上限=86;战士生命值=1610;法师生命值=644;道士生命值=1610",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=150;金币=410000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 74,
		GodWeaponProperty = "攻击下限=44;攻击上限=88;魔法下限=44;魔法上限=88;道术下限=44;道术上限=88;战士生命值=1610;法师生命值=644;道士生命值=1610",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=160;金币=420000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 75,
		GodWeaponProperty = "攻击下限=44;攻击上限=88;魔法下限=44;魔法上限=88;道术下限=44;道术上限=88;战士生命值=1690;法师生命值=676;道士生命值=1690",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=160;金币=420000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 76,
		GodWeaponProperty = "攻击下限=45;攻击上限=90;魔法下限=45;魔法上限=90;道术下限=45;道术上限=90;战士生命值=1690;法师生命值=676;道士生命值=1690",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=170;金币=430000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 77,
		GodWeaponProperty = "攻击下限=45;攻击上限=90;魔法下限=45;魔法上限=90;道术下限=45;道术上限=90;战士生命值=1725;法师生命值=690;道士生命值=1725",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=170;金币=430000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 78,
		GodWeaponProperty = "攻击下限=46;攻击上限=92;魔法下限=46;魔法上限=92;道术下限=46;道术上限=92;战士生命值=1725;法师生命值=690;道士生命值=1725",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=180;金币=440000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 79,
		GodWeaponProperty = "攻击下限=46;攻击上限=92;魔法下限=46;魔法上限=92;道术下限=46;道术上限=92;战士生命值=1760;法师生命值=704;道士生命值=1760",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=180;金币=440000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 80,
		GodWeaponProperty = "攻击下限=48;攻击上限=96;魔法下限=48;魔法上限=96;道术下限=48;道术上限=96;战士生命值=1760;法师生命值=704;道士生命值=1760",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=190;金币=450000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 81,
		GodWeaponProperty = "攻击下限=48;攻击上限=96;魔法下限=48;魔法上限=96;道术下限=48;道术上限=96;战士生命值=1795;法师生命值=718;道士生命值=1795",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=190;金币=450000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 82,
		GodWeaponProperty = "攻击下限=49;攻击上限=98;魔法下限=49;魔法上限=98;道术下限=49;道术上限=98;战士生命值=1795;法师生命值=718;道士生命值=1795",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=200;金币=460000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 83,
		GodWeaponProperty = "攻击下限=49;攻击上限=98;魔法下限=49;魔法上限=98;道术下限=49;道术上限=98;战士生命值=1830;法师生命值=732;道士生命值=1830",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=200;金币=460000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 84,
		GodWeaponProperty = "攻击下限=50;攻击上限=100;魔法下限=50;魔法上限=100;道术下限=50;道术上限=100;战士生命值=1830;法师生命值=732;道士生命值=1830",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=210;金币=470000;服务器阶段=0;人物等级=350",
		GodWeaponLevel = 85,
		GodWeaponProperty = "攻击下限=50;攻击上限=100;魔法下限=50;魔法上限=100;道术下限=50;道术上限=100;战士生命值=1910;法师生命值=764;道士生命值=1910",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=210;金币=470000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 86,
		GodWeaponProperty = "攻击下限=51;攻击上限=102;魔法下限=51;魔法上限=102;道术下限=51;道术上限=102;战士生命值=1910;法师生命值=764;道士生命值=1910",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=220;金币=480000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 87,
		GodWeaponProperty = "攻击下限=51;攻击上限=102;魔法下限=51;魔法上限=102;道术下限=51;道术上限=102;战士生命值=1945;法师生命值=778;道士生命值=1945",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=220;金币=480000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 88,
		GodWeaponProperty = "攻击下限=52;攻击上限=104;魔法下限=52;魔法上限=104;道术下限=52;道术上限=104;战士生命值=1945;法师生命值=778;道士生命值=1945",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=230;金币=490000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 89,
		GodWeaponProperty = "攻击下限=52;攻击上限=104;魔法下限=52;魔法上限=104;道术下限=52;道术上限=104;战士生命值=1980;法师生命值=792;道士生命值=1980",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=230;金币=490000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 90,
		GodWeaponProperty = "攻击下限=54;攻击上限=108;魔法下限=54;魔法上限=108;道术下限=54;道术上限=108;战士生命值=1980;法师生命值=792;道士生命值=1980",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=240;金币=500000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 91,
		GodWeaponProperty = "攻击下限=54;攻击上限=108;魔法下限=54;魔法上限=108;道术下限=54;道术上限=108;战士生命值=2015;法师生命值=806;道士生命值=2015",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=240;金币=500000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 92,
		GodWeaponProperty = "攻击下限=55;攻击上限=110;魔法下限=55;魔法上限=110;道术下限=55;道术上限=110;战士生命值=2015;法师生命值=806;道士生命值=2015",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=260;金币=510000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 93,
		GodWeaponProperty = "攻击下限=55;攻击上限=110;魔法下限=55;魔法上限=110;道术下限=55;道术上限=110;战士生命值=2050;法师生命值=820;道士生命值=2050",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=260;金币=510000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 94,
		GodWeaponProperty = "攻击下限=56;攻击上限=112;魔法下限=56;魔法上限=112;道术下限=56;道术上限=112;战士生命值=2050;法师生命值=820;道士生命值=2050",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=280;金币=520000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 95,
		GodWeaponProperty = "攻击下限=56;攻击上限=112;魔法下限=56;魔法上限=112;道术下限=56;道术上限=112;战士生命值=2130;法师生命值=852;道士生命值=2130",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=280;金币=520000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 96,
		GodWeaponProperty = "攻击下限=57;攻击上限=114;魔法下限=57;魔法上限=114;道术下限=57;道术上限=114;战士生命值=2130;法师生命值=852;道士生命值=2130",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=300;金币=530000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 97,
		GodWeaponProperty = "攻击下限=57;攻击上限=114;魔法下限=57;魔法上限=114;道术下限=57;道术上限=114;战士生命值=2165;法师生命值=866;道士生命值=2165",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=300;金币=530000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 98,
		GodWeaponProperty = "攻击下限=58;攻击上限=116;魔法下限=58;魔法上限=116;道术下限=58;道术上限=116;战士生命值=2165;法师生命值=866;道士生命值=2165",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=320;金币=540000;服务器阶段=0;人物等级=0",
		GodWeaponLevel = 99,
		GodWeaponProperty = "攻击下限=58;攻击上限=116;魔法下限=58;魔法上限=116;道术下限=58;道术上限=116;战士生命值=2200;法师生命值=880;道士生命值=2200",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "玄铁石=320;金币=540000;服务器阶段=0;人物等级=400",
		GodWeaponLevel = 100,
		GodWeaponProperty = "攻击下限=60;攻击上限=120;魔法下限=60;魔法上限=120;道术下限=60;道术上限=120;战士生命值=2200;法师生命值=880;道士生命值=2200",
		GodWeaponType = "神舞",
		ID = 1
	},
	{
		Request = "技能石=0;金币=0;服务器阶段=1;神舞=0;天晶=0",
		GodWeaponLevel = 0,
		GodWeaponProperty = "战士生命值=0;法师生命值=0;道士生命值=0;基本剑术怒之伤害=0;刺杀剑术怒之伤害=0;半月弯刀怒之伤害=0;灭天火怒之伤害=0;雷电术怒之伤害=0;召唤神兽怒之伤害=0;神兽形象改变=0",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=5;金币=50000;服务器阶段=1;神舞=1;天晶=0",
		GodWeaponLevel = 1,
		GodWeaponProperty = "战士生命值=10;法师生命值=4;道士生命值=10;基本剑术怒之伤害=1;刺杀剑术怒之伤害=1;半月弯刀怒之伤害=1;灭天火怒之伤害=1;雷电术怒之伤害=1;召唤神兽怒之伤害=1;神兽形象改变=0",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=10;金币=50000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 2,
		GodWeaponProperty = "战士生命值=20;法师生命值=8;道士生命值=20;基本剑术怒之伤害=2;刺杀剑术怒之伤害=2;半月弯刀怒之伤害=2;灭天火怒之伤害=2;雷电术怒之伤害=2;召唤神兽怒之伤害=2;神兽形象改变=0",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=15;金币=60000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 3,
		GodWeaponProperty = "战士生命值=30;法师生命值=12;道士生命值=30;基本剑术怒之伤害=3;刺杀剑术怒之伤害=3;半月弯刀怒之伤害=3;灭天火怒之伤害=3;雷电术怒之伤害=3;召唤神兽怒之伤害=3;神兽形象改变=0",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=20;金币=60000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 4,
		GodWeaponProperty = "战士生命值=40;法师生命值=16;道士生命值=40;基本剑术怒之伤害=4;刺杀剑术怒之伤害=4;半月弯刀怒之伤害=4;灭天火怒之伤害=4;雷电术怒之伤害=4;召唤神兽怒之伤害=4;神兽形象改变=0",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=20;金币=70000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 5,
		GodWeaponProperty = "战士生命值=75;法师生命值=30;道士生命值=75;基本剑术怒之伤害=10;刺杀剑术怒之伤害=10;半月弯刀怒之伤害=10;灭天火怒之伤害=10;雷电术怒之伤害=10;召唤神兽怒之伤害=10;神兽形象改变=0",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=20;金币=70000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 6,
		GodWeaponProperty = "战士生命值=85;法师生命值=34;道士生命值=85;基本剑术怒之伤害=11;刺杀剑术怒之伤害=11;半月弯刀怒之伤害=11;灭天火怒之伤害=11;雷电术怒之伤害=11;召唤神兽怒之伤害=11;神兽形象改变=0",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=25;金币=80000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 7,
		GodWeaponProperty = "战士生命值=95;法师生命值=38;道士生命值=95;基本剑术怒之伤害=12;刺杀剑术怒之伤害=12;半月弯刀怒之伤害=12;灭天火怒之伤害=12;雷电术怒之伤害=12;召唤神兽怒之伤害=12;神兽形象改变=0",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=25;金币=80000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 8,
		GodWeaponProperty = "战士生命值=105;法师生命值=42;道士生命值=105;基本剑术怒之伤害=13;刺杀剑术怒之伤害=13;半月弯刀怒之伤害=13;灭天火怒之伤害=13;雷电术怒之伤害=13;召唤神兽怒之伤害=13;神兽形象改变=0",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=25;金币=90000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 9,
		GodWeaponProperty = "战士生命值=115;法师生命值=46;道士生命值=115;基本剑术怒之伤害=14;刺杀剑术怒之伤害=14;半月弯刀怒之伤害=14;灭天火怒之伤害=14;雷电术怒之伤害=14;召唤神兽怒之伤害=14;神兽形象改变=0",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=25;金币=90000;服务器阶段=0;神舞=5;天晶=0",
		GodWeaponLevel = 10,
		GodWeaponProperty = "战士生命值=150;法师生命值=60;道士生命值=150;基本剑术怒之伤害=20;刺杀剑术怒之伤害=20;半月弯刀怒之伤害=20;灭天火怒之伤害=20;雷电术怒之伤害=20;召唤神兽怒之伤害=20;神兽形象改变=0",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=30;金币=100000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 11,
		GodWeaponProperty = "战士生命值=160;法师生命值=64;道士生命值=160;基本剑术怒之伤害=21;刺杀剑术怒之伤害=21;半月弯刀怒之伤害=21;灭天火怒之伤害=21;雷电术怒之伤害=21;召唤神兽怒之伤害=21;神兽形象改变=0",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=30;金币=100000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 12,
		GodWeaponProperty = "战士生命值=170;法师生命值=68;道士生命值=170;基本剑术怒之伤害=22;刺杀剑术怒之伤害=22;半月弯刀怒之伤害=22;灭天火怒之伤害=22;雷电术怒之伤害=22;召唤神兽怒之伤害=22;神兽形象改变=0",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=30;金币=110000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 13,
		GodWeaponProperty = "战士生命值=180;法师生命值=72;道士生命值=180;基本剑术怒之伤害=23;刺杀剑术怒之伤害=23;半月弯刀怒之伤害=23;灭天火怒之伤害=23;雷电术怒之伤害=23;召唤神兽怒之伤害=23;神兽形象改变=0",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=35;金币=110000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 14,
		GodWeaponProperty = "战士生命值=190;法师生命值=76;道士生命值=190;基本剑术怒之伤害=24;刺杀剑术怒之伤害=24;半月弯刀怒之伤害=24;灭天火怒之伤害=24;雷电术怒之伤害=24;召唤神兽怒之伤害=24;神兽形象改变=0",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=35;金币=120000;服务器阶段=0;神舞=10;天晶=0",
		GodWeaponLevel = 15,
		GodWeaponProperty = "战士生命值=225;法师生命值=90;道士生命值=225;基本剑术怒之伤害=30;刺杀剑术怒之伤害=30;半月弯刀怒之伤害=30;灭天火怒之伤害=30;雷电术怒之伤害=30;召唤神兽怒之伤害=30;神兽形象改变=0",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=35;金币=120000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 16,
		GodWeaponProperty = "战士生命值=235;法师生命值=94;道士生命值=235;基本剑术怒之伤害=31;刺杀剑术怒之伤害=31;半月弯刀怒之伤害=31;灭天火怒之伤害=31;雷电术怒之伤害=31;召唤神兽怒之伤害=31;神兽形象改变=0",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=40;金币=130000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 17,
		GodWeaponProperty = "战士生命值=245;法师生命值=98;道士生命值=245;基本剑术怒之伤害=32;刺杀剑术怒之伤害=32;半月弯刀怒之伤害=32;灭天火怒之伤害=32;雷电术怒之伤害=32;召唤神兽怒之伤害=32;神兽形象改变=0",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=40;金币=130000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 18,
		GodWeaponProperty = "战士生命值=255;法师生命值=102;道士生命值=255;基本剑术怒之伤害=33;刺杀剑术怒之伤害=33;半月弯刀怒之伤害=33;灭天火怒之伤害=33;雷电术怒之伤害=33;召唤神兽怒之伤害=33;神兽形象改变=0",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=40;金币=140000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 19,
		GodWeaponProperty = "战士生命值=265;法师生命值=106;道士生命值=265;基本剑术怒之伤害=34;刺杀剑术怒之伤害=34;半月弯刀怒之伤害=34;灭天火怒之伤害=34;雷电术怒之伤害=34;召唤神兽怒之伤害=34;神兽形象改变=0",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=40;金币=140000;服务器阶段=0;神舞=15;天晶=0",
		GodWeaponLevel = 20,
		GodWeaponProperty = "战士生命值=300;法师生命值=120;道士生命值=300;基本剑术怒之伤害=40;刺杀剑术怒之伤害=40;半月弯刀怒之伤害=40;灭天火怒之伤害=40;雷电术怒之伤害=40;召唤神兽怒之伤害=40;神兽形象改变=0",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=50;金币=150000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 21,
		GodWeaponProperty = "战士生命值=310;法师生命值=124;道士生命值=310;基本剑术怒之伤害=41;刺杀剑术怒之伤害=41;半月弯刀怒之伤害=41;灭天火怒之伤害=41;雷电术怒之伤害=41;召唤神兽怒之伤害=41;神兽形象改变=0",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=50;金币=150000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 22,
		GodWeaponProperty = "战士生命值=320;法师生命值=128;道士生命值=320;基本剑术怒之伤害=42;刺杀剑术怒之伤害=42;半月弯刀怒之伤害=42;灭天火怒之伤害=42;雷电术怒之伤害=42;召唤神兽怒之伤害=42;神兽形象改变=0",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=50;金币=160000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 23,
		GodWeaponProperty = "战士生命值=330;法师生命值=132;道士生命值=330;基本剑术怒之伤害=43;刺杀剑术怒之伤害=43;半月弯刀怒之伤害=43;灭天火怒之伤害=43;雷电术怒之伤害=43;召唤神兽怒之伤害=43;神兽形象改变=0",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=55;金币=160000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 24,
		GodWeaponProperty = "战士生命值=340;法师生命值=136;道士生命值=340;基本剑术怒之伤害=44;刺杀剑术怒之伤害=44;半月弯刀怒之伤害=44;灭天火怒之伤害=44;雷电术怒之伤害=44;召唤神兽怒之伤害=44;神兽形象改变=0",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=55;金币=170000;服务器阶段=0;神舞=20;天晶=0",
		GodWeaponLevel = 25,
		GodWeaponProperty = "战士生命值=375;法师生命值=150;道士生命值=375;基本剑术怒之伤害=50;刺杀剑术怒之伤害=50;半月弯刀怒之伤害=50;灭天火怒之伤害=50;雷电术怒之伤害=50;召唤神兽怒之伤害=50;神兽形象改变=0",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=55;金币=170000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 26,
		GodWeaponProperty = "战士生命值=385;法师生命值=154;道士生命值=385;基本剑术怒之伤害=51;刺杀剑术怒之伤害=51;半月弯刀怒之伤害=51;灭天火怒之伤害=51;雷电术怒之伤害=51;召唤神兽怒之伤害=51;神兽形象改变=0",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=60;金币=180000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 27,
		GodWeaponProperty = "战士生命值=395;法师生命值=158;道士生命值=395;基本剑术怒之伤害=52;刺杀剑术怒之伤害=52;半月弯刀怒之伤害=52;灭天火怒之伤害=52;雷电术怒之伤害=52;召唤神兽怒之伤害=52;神兽形象改变=0",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=60;金币=180000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 28,
		GodWeaponProperty = "战士生命值=405;法师生命值=162;道士生命值=405;基本剑术怒之伤害=53;刺杀剑术怒之伤害=53;半月弯刀怒之伤害=53;灭天火怒之伤害=53;雷电术怒之伤害=53;召唤神兽怒之伤害=53;神兽形象改变=0",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=60;金币=190000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 29,
		GodWeaponProperty = "战士生命值=415;法师生命值=166;道士生命值=415;基本剑术怒之伤害=54;刺杀剑术怒之伤害=54;半月弯刀怒之伤害=54;灭天火怒之伤害=54;雷电术怒之伤害=54;召唤神兽怒之伤害=54;神兽形象改变=0",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=60;金币=190000;服务器阶段=0;神舞=0;天晶=25",
		GodWeaponLevel = 30,
		GodWeaponProperty = "战士生命值=450;法师生命值=180;道士生命值=450;基本剑术怒之伤害=60;刺杀剑术怒之伤害=60;半月弯刀怒之伤害=60;灭天火怒之伤害=60;雷电术怒之伤害=60;召唤神兽怒之伤害=60;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=80;金币=200000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 31,
		GodWeaponProperty = "战士生命值=460;法师生命值=184;道士生命值=460;基本剑术怒之伤害=61;刺杀剑术怒之伤害=61;半月弯刀怒之伤害=61;灭天火怒之伤害=61;雷电术怒之伤害=61;召唤神兽怒之伤害=61;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=80;金币=200000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 32,
		GodWeaponProperty = "战士生命值=470;法师生命值=188;道士生命值=470;基本剑术怒之伤害=62;刺杀剑术怒之伤害=62;半月弯刀怒之伤害=62;灭天火怒之伤害=62;雷电术怒之伤害=62;召唤神兽怒之伤害=62;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=80;金币=210000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 33,
		GodWeaponProperty = "战士生命值=480;法师生命值=192;道士生命值=480;基本剑术怒之伤害=63;刺杀剑术怒之伤害=63;半月弯刀怒之伤害=63;灭天火怒之伤害=63;雷电术怒之伤害=63;召唤神兽怒之伤害=63;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=80;金币=210000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 34,
		GodWeaponProperty = "战士生命值=490;法师生命值=196;道士生命值=490;基本剑术怒之伤害=64;刺杀剑术怒之伤害=64;半月弯刀怒之伤害=64;灭天火怒之伤害=64;雷电术怒之伤害=64;召唤神兽怒之伤害=64;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=80;金币=220000;服务器阶段=2;神舞=30;天晶=0",
		GodWeaponLevel = 35,
		GodWeaponProperty = "战士生命值=525;法师生命值=210;道士生命值=525;基本剑术怒之伤害=70;刺杀剑术怒之伤害=70;半月弯刀怒之伤害=70;灭天火怒之伤害=70;雷电术怒之伤害=70;召唤神兽怒之伤害=70;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=100;金币=220000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 36,
		GodWeaponProperty = "战士生命值=535;法师生命值=214;道士生命值=535;基本剑术怒之伤害=71;刺杀剑术怒之伤害=71;半月弯刀怒之伤害=71;灭天火怒之伤害=71;雷电术怒之伤害=71;召唤神兽怒之伤害=71;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=100;金币=230000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 37,
		GodWeaponProperty = "战士生命值=545;法师生命值=218;道士生命值=545;基本剑术怒之伤害=72;刺杀剑术怒之伤害=72;半月弯刀怒之伤害=72;灭天火怒之伤害=72;雷电术怒之伤害=72;召唤神兽怒之伤害=72;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=100;金币=230000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 38,
		GodWeaponProperty = "战士生命值=555;法师生命值=222;道士生命值=555;基本剑术怒之伤害=73;刺杀剑术怒之伤害=73;半月弯刀怒之伤害=73;灭天火怒之伤害=73;雷电术怒之伤害=73;召唤神兽怒之伤害=73;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=100;金币=240000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 39,
		GodWeaponProperty = "战士生命值=565;法师生命值=226;道士生命值=565;基本剑术怒之伤害=74;刺杀剑术怒之伤害=74;半月弯刀怒之伤害=74;灭天火怒之伤害=74;雷电术怒之伤害=74;召唤神兽怒之伤害=74;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=100;金币=240000;服务器阶段=0;神舞=0;天晶=35",
		GodWeaponLevel = 40,
		GodWeaponProperty = "战士生命值=600;法师生命值=240;道士生命值=600;基本剑术怒之伤害=80;刺杀剑术怒之伤害=80;半月弯刀怒之伤害=80;灭天火怒之伤害=80;雷电术怒之伤害=80;召唤神兽怒之伤害=80;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=120;金币=250000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 41,
		GodWeaponProperty = "战士生命值=610;法师生命值=244;道士生命值=610;基本剑术怒之伤害=81;刺杀剑术怒之伤害=81;半月弯刀怒之伤害=81;灭天火怒之伤害=81;雷电术怒之伤害=81;召唤神兽怒之伤害=81;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=120;金币=250000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 42,
		GodWeaponProperty = "战士生命值=620;法师生命值=248;道士生命值=620;基本剑术怒之伤害=82;刺杀剑术怒之伤害=82;半月弯刀怒之伤害=82;灭天火怒之伤害=82;雷电术怒之伤害=82;召唤神兽怒之伤害=82;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=120;金币=260000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 43,
		GodWeaponProperty = "战士生命值=630;法师生命值=252;道士生命值=630;基本剑术怒之伤害=83;刺杀剑术怒之伤害=83;半月弯刀怒之伤害=83;灭天火怒之伤害=83;雷电术怒之伤害=83;召唤神兽怒之伤害=83;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=120;金币=260000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 44,
		GodWeaponProperty = "战士生命值=640;法师生命值=256;道士生命值=640;基本剑术怒之伤害=84;刺杀剑术怒之伤害=84;半月弯刀怒之伤害=84;灭天火怒之伤害=84;雷电术怒之伤害=84;召唤神兽怒之伤害=84;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=120;金币=270000;服务器阶段=0;神舞=40;天晶=0",
		GodWeaponLevel = 45,
		GodWeaponProperty = "战士生命值=675;法师生命值=270;道士生命值=675;基本剑术怒之伤害=90;刺杀剑术怒之伤害=90;半月弯刀怒之伤害=90;灭天火怒之伤害=90;雷电术怒之伤害=90;召唤神兽怒之伤害=90;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=160;金币=270000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 46,
		GodWeaponProperty = "战士生命值=685;法师生命值=274;道士生命值=685;基本剑术怒之伤害=91;刺杀剑术怒之伤害=91;半月弯刀怒之伤害=91;灭天火怒之伤害=91;雷电术怒之伤害=91;召唤神兽怒之伤害=91;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=160;金币=280000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 47,
		GodWeaponProperty = "战士生命值=695;法师生命值=278;道士生命值=695;基本剑术怒之伤害=92;刺杀剑术怒之伤害=92;半月弯刀怒之伤害=92;灭天火怒之伤害=92;雷电术怒之伤害=92;召唤神兽怒之伤害=92;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=160;金币=280000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 48,
		GodWeaponProperty = "战士生命值=705;法师生命值=282;道士生命值=705;基本剑术怒之伤害=93;刺杀剑术怒之伤害=93;半月弯刀怒之伤害=93;灭天火怒之伤害=93;雷电术怒之伤害=93;召唤神兽怒之伤害=93;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=160;金币=290000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 49,
		GodWeaponProperty = "战士生命值=715;法师生命值=286;道士生命值=715;基本剑术怒之伤害=94;刺杀剑术怒之伤害=94;半月弯刀怒之伤害=94;灭天火怒之伤害=94;雷电术怒之伤害=94;召唤神兽怒之伤害=94;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=160;金币=290000;服务器阶段=0;神舞=0;天晶=45",
		GodWeaponLevel = 50,
		GodWeaponProperty = "战士生命值=750;法师生命值=300;道士生命值=750;基本剑术怒之伤害=100;刺杀剑术怒之伤害=100;半月弯刀怒之伤害=100;灭天火怒之伤害=100;雷电术怒之伤害=100;召唤神兽怒之伤害=100;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=200;金币=300000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 51,
		GodWeaponProperty = "战士生命值=760;法师生命值=304;道士生命值=760;基本剑术怒之伤害=101;刺杀剑术怒之伤害=101;半月弯刀怒之伤害=101;灭天火怒之伤害=101;雷电术怒之伤害=101;召唤神兽怒之伤害=101;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=200;金币=300000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 52,
		GodWeaponProperty = "战士生命值=770;法师生命值=308;道士生命值=770;基本剑术怒之伤害=102;刺杀剑术怒之伤害=102;半月弯刀怒之伤害=102;灭天火怒之伤害=102;雷电术怒之伤害=102;召唤神兽怒之伤害=102;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=200;金币=310000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 53,
		GodWeaponProperty = "战士生命值=780;法师生命值=312;道士生命值=780;基本剑术怒之伤害=103;刺杀剑术怒之伤害=103;半月弯刀怒之伤害=103;灭天火怒之伤害=103;雷电术怒之伤害=103;召唤神兽怒之伤害=103;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=200;金币=310000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 54,
		GodWeaponProperty = "战士生命值=790;法师生命值=316;道士生命值=790;基本剑术怒之伤害=104;刺杀剑术怒之伤害=104;半月弯刀怒之伤害=104;灭天火怒之伤害=104;雷电术怒之伤害=104;召唤神兽怒之伤害=104;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=200;金币=320000;服务器阶段=0;神舞=50;天晶=0",
		GodWeaponLevel = 55,
		GodWeaponProperty = "战士生命值=825;法师生命值=330;道士生命值=825;基本剑术怒之伤害=110;刺杀剑术怒之伤害=110;半月弯刀怒之伤害=110;灭天火怒之伤害=110;雷电术怒之伤害=110;召唤神兽怒之伤害=110;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=250;金币=320000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 56,
		GodWeaponProperty = "战士生命值=835;法师生命值=334;道士生命值=835;基本剑术怒之伤害=111;刺杀剑术怒之伤害=111;半月弯刀怒之伤害=111;灭天火怒之伤害=111;雷电术怒之伤害=111;召唤神兽怒之伤害=111;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=250;金币=330000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 57,
		GodWeaponProperty = "战士生命值=845;法师生命值=338;道士生命值=845;基本剑术怒之伤害=112;刺杀剑术怒之伤害=112;半月弯刀怒之伤害=112;灭天火怒之伤害=112;雷电术怒之伤害=112;召唤神兽怒之伤害=112;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=250;金币=330000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 58,
		GodWeaponProperty = "战士生命值=855;法师生命值=342;道士生命值=855;基本剑术怒之伤害=113;刺杀剑术怒之伤害=113;半月弯刀怒之伤害=113;灭天火怒之伤害=113;雷电术怒之伤害=113;召唤神兽怒之伤害=113;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=250;金币=340000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 59,
		GodWeaponProperty = "战士生命值=865;法师生命值=346;道士生命值=865;基本剑术怒之伤害=114;刺杀剑术怒之伤害=114;半月弯刀怒之伤害=114;灭天火怒之伤害=114;雷电术怒之伤害=114;召唤神兽怒之伤害=114;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=250;金币=340000;服务器阶段=0;神舞=0;天晶=50",
		GodWeaponLevel = 60,
		GodWeaponProperty = "战士生命值=900;法师生命值=360;道士生命值=900;基本剑术怒之伤害=120;刺杀剑术怒之伤害=120;半月弯刀怒之伤害=120;灭天火怒之伤害=120;雷电术怒之伤害=120;召唤神兽怒之伤害=120;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=300;金币=350000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 61,
		GodWeaponProperty = "战士生命值=910;法师生命值=364;道士生命值=910;基本剑术怒之伤害=121;刺杀剑术怒之伤害=121;半月弯刀怒之伤害=121;灭天火怒之伤害=121;雷电术怒之伤害=121;召唤神兽怒之伤害=121;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=300;金币=350000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 62,
		GodWeaponProperty = "战士生命值=920;法师生命值=368;道士生命值=920;基本剑术怒之伤害=122;刺杀剑术怒之伤害=122;半月弯刀怒之伤害=122;灭天火怒之伤害=122;雷电术怒之伤害=122;召唤神兽怒之伤害=122;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=300;金币=360000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 63,
		GodWeaponProperty = "战士生命值=930;法师生命值=372;道士生命值=930;基本剑术怒之伤害=123;刺杀剑术怒之伤害=123;半月弯刀怒之伤害=123;灭天火怒之伤害=123;雷电术怒之伤害=123;召唤神兽怒之伤害=123;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=300;金币=360000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 64,
		GodWeaponProperty = "战士生命值=940;法师生命值=376;道士生命值=940;基本剑术怒之伤害=124;刺杀剑术怒之伤害=124;半月弯刀怒之伤害=124;灭天火怒之伤害=124;雷电术怒之伤害=124;召唤神兽怒之伤害=124;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=300;金币=370000;服务器阶段=0;神舞=60;天晶=0",
		GodWeaponLevel = 65,
		GodWeaponProperty = "战士生命值=975;法师生命值=390;道士生命值=975;基本剑术怒之伤害=130;刺杀剑术怒之伤害=130;半月弯刀怒之伤害=130;灭天火怒之伤害=130;雷电术怒之伤害=130;召唤神兽怒之伤害=130;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=370;金币=370000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 66,
		GodWeaponProperty = "战士生命值=985;法师生命值=394;道士生命值=985;基本剑术怒之伤害=131;刺杀剑术怒之伤害=131;半月弯刀怒之伤害=131;灭天火怒之伤害=131;雷电术怒之伤害=131;召唤神兽怒之伤害=131;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=370;金币=380000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 67,
		GodWeaponProperty = "战士生命值=995;法师生命值=398;道士生命值=995;基本剑术怒之伤害=132;刺杀剑术怒之伤害=132;半月弯刀怒之伤害=132;灭天火怒之伤害=132;雷电术怒之伤害=132;召唤神兽怒之伤害=132;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=370;金币=380000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 68,
		GodWeaponProperty = "战士生命值=1005;法师生命值=402;道士生命值=1005;基本剑术怒之伤害=133;刺杀剑术怒之伤害=133;半月弯刀怒之伤害=133;灭天火怒之伤害=133;雷电术怒之伤害=133;召唤神兽怒之伤害=133;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=370;金币=390000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 69,
		GodWeaponProperty = "战士生命值=1015;法师生命值=406;道士生命值=1015;基本剑术怒之伤害=134;刺杀剑术怒之伤害=134;半月弯刀怒之伤害=134;灭天火怒之伤害=134;雷电术怒之伤害=134;召唤神兽怒之伤害=134;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=370;金币=390000;服务器阶段=0;神舞=0;天晶=60",
		GodWeaponLevel = 70,
		GodWeaponProperty = "战士生命值=1050;法师生命值=420;道士生命值=1050;基本剑术怒之伤害=140;刺杀剑术怒之伤害=140;半月弯刀怒之伤害=140;灭天火怒之伤害=140;雷电术怒之伤害=140;召唤神兽怒之伤害=140;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=450;金币=400000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 71,
		GodWeaponProperty = "战士生命值=1060;法师生命值=424;道士生命值=1060;基本剑术怒之伤害=141;刺杀剑术怒之伤害=141;半月弯刀怒之伤害=141;灭天火怒之伤害=141;雷电术怒之伤害=141;召唤神兽怒之伤害=141;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=450;金币=400000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 72,
		GodWeaponProperty = "战士生命值=1070;法师生命值=428;道士生命值=1070;基本剑术怒之伤害=142;刺杀剑术怒之伤害=142;半月弯刀怒之伤害=142;灭天火怒之伤害=142;雷电术怒之伤害=142;召唤神兽怒之伤害=142;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=450;金币=410000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 73,
		GodWeaponProperty = "战士生命值=1080;法师生命值=432;道士生命值=1080;基本剑术怒之伤害=143;刺杀剑术怒之伤害=143;半月弯刀怒之伤害=143;灭天火怒之伤害=143;雷电术怒之伤害=143;召唤神兽怒之伤害=143;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=450;金币=410000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 74,
		GodWeaponProperty = "战士生命值=1090;法师生命值=436;道士生命值=1090;基本剑术怒之伤害=144;刺杀剑术怒之伤害=144;半月弯刀怒之伤害=144;灭天火怒之伤害=144;雷电术怒之伤害=144;召唤神兽怒之伤害=144;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=450;金币=420000;服务器阶段=0;神舞=70;天晶=0",
		GodWeaponLevel = 75,
		GodWeaponProperty = "战士生命值=1125;法师生命值=450;道士生命值=1125;基本剑术怒之伤害=150;刺杀剑术怒之伤害=150;半月弯刀怒之伤害=150;灭天火怒之伤害=150;雷电术怒之伤害=150;召唤神兽怒之伤害=150;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=530;金币=420000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 76,
		GodWeaponProperty = "战士生命值=1135;法师生命值=454;道士生命值=1135;基本剑术怒之伤害=151;刺杀剑术怒之伤害=151;半月弯刀怒之伤害=151;灭天火怒之伤害=151;雷电术怒之伤害=151;召唤神兽怒之伤害=151;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=530;金币=430000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 77,
		GodWeaponProperty = "战士生命值=1145;法师生命值=458;道士生命值=1145;基本剑术怒之伤害=152;刺杀剑术怒之伤害=152;半月弯刀怒之伤害=152;灭天火怒之伤害=152;雷电术怒之伤害=152;召唤神兽怒之伤害=152;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=530;金币=430000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 78,
		GodWeaponProperty = "战士生命值=1155;法师生命值=462;道士生命值=1155;基本剑术怒之伤害=153;刺杀剑术怒之伤害=153;半月弯刀怒之伤害=153;灭天火怒之伤害=153;雷电术怒之伤害=153;召唤神兽怒之伤害=153;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=530;金币=440000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 79,
		GodWeaponProperty = "战士生命值=1165;法师生命值=466;道士生命值=1165;基本剑术怒之伤害=154;刺杀剑术怒之伤害=154;半月弯刀怒之伤害=154;灭天火怒之伤害=154;雷电术怒之伤害=154;召唤神兽怒之伤害=154;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=530;金币=440000;服务器阶段=0;神舞=0;天晶=70",
		GodWeaponLevel = 80,
		GodWeaponProperty = "战士生命值=1200;法师生命值=480;道士生命值=1200;基本剑术怒之伤害=160;刺杀剑术怒之伤害=160;半月弯刀怒之伤害=160;灭天火怒之伤害=160;雷电术怒之伤害=160;召唤神兽怒之伤害=160;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=600;金币=450000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 81,
		GodWeaponProperty = "战士生命值=1210;法师生命值=484;道士生命值=1210;基本剑术怒之伤害=161;刺杀剑术怒之伤害=161;半月弯刀怒之伤害=161;灭天火怒之伤害=161;雷电术怒之伤害=161;召唤神兽怒之伤害=161;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=600;金币=450000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 82,
		GodWeaponProperty = "战士生命值=1220;法师生命值=488;道士生命值=1220;基本剑术怒之伤害=162;刺杀剑术怒之伤害=162;半月弯刀怒之伤害=162;灭天火怒之伤害=162;雷电术怒之伤害=162;召唤神兽怒之伤害=162;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=600;金币=460000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 83,
		GodWeaponProperty = "战士生命值=1230;法师生命值=492;道士生命值=1230;基本剑术怒之伤害=163;刺杀剑术怒之伤害=163;半月弯刀怒之伤害=163;灭天火怒之伤害=163;雷电术怒之伤害=163;召唤神兽怒之伤害=163;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=600;金币=460000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 84,
		GodWeaponProperty = "战士生命值=1240;法师生命值=496;道士生命值=1240;基本剑术怒之伤害=164;刺杀剑术怒之伤害=164;半月弯刀怒之伤害=164;灭天火怒之伤害=164;雷电术怒之伤害=164;召唤神兽怒之伤害=164;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=600;金币=470000;服务器阶段=0;神舞=80;天晶=0",
		GodWeaponLevel = 85,
		GodWeaponProperty = "战士生命值=1275;法师生命值=510;道士生命值=1275;基本剑术怒之伤害=170;刺杀剑术怒之伤害=170;半月弯刀怒之伤害=170;灭天火怒之伤害=170;雷电术怒之伤害=170;召唤神兽怒之伤害=170;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=680;金币=470000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 86,
		GodWeaponProperty = "战士生命值=1285;法师生命值=514;道士生命值=1285;基本剑术怒之伤害=171;刺杀剑术怒之伤害=171;半月弯刀怒之伤害=171;灭天火怒之伤害=171;雷电术怒之伤害=171;召唤神兽怒之伤害=171;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=680;金币=480000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 87,
		GodWeaponProperty = "战士生命值=1295;法师生命值=518;道士生命值=1295;基本剑术怒之伤害=172;刺杀剑术怒之伤害=172;半月弯刀怒之伤害=172;灭天火怒之伤害=172;雷电术怒之伤害=172;召唤神兽怒之伤害=172;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=680;金币=480000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 88,
		GodWeaponProperty = "战士生命值=1305;法师生命值=522;道士生命值=1305;基本剑术怒之伤害=173;刺杀剑术怒之伤害=173;半月弯刀怒之伤害=173;灭天火怒之伤害=173;雷电术怒之伤害=173;召唤神兽怒之伤害=173;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=680;金币=490000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 89,
		GodWeaponProperty = "战士生命值=1315;法师生命值=526;道士生命值=1315;基本剑术怒之伤害=174;刺杀剑术怒之伤害=174;半月弯刀怒之伤害=174;灭天火怒之伤害=174;雷电术怒之伤害=174;召唤神兽怒之伤害=174;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=680;金币=490000;服务器阶段=0;神舞=0;天晶=80",
		GodWeaponLevel = 90,
		GodWeaponProperty = "战士生命值=1350;法师生命值=540;道士生命值=1350;基本剑术怒之伤害=180;刺杀剑术怒之伤害=180;半月弯刀怒之伤害=180;灭天火怒之伤害=180;雷电术怒之伤害=180;召唤神兽怒之伤害=180;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=760;金币=500000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 91,
		GodWeaponProperty = "战士生命值=1360;法师生命值=544;道士生命值=1360;基本剑术怒之伤害=181;刺杀剑术怒之伤害=181;半月弯刀怒之伤害=181;灭天火怒之伤害=181;雷电术怒之伤害=181;召唤神兽怒之伤害=181;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=760;金币=500000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 92,
		GodWeaponProperty = "战士生命值=1370;法师生命值=548;道士生命值=1370;基本剑术怒之伤害=182;刺杀剑术怒之伤害=182;半月弯刀怒之伤害=182;灭天火怒之伤害=182;雷电术怒之伤害=182;召唤神兽怒之伤害=182;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=760;金币=510000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 93,
		GodWeaponProperty = "战士生命值=1380;法师生命值=552;道士生命值=1380;基本剑术怒之伤害=183;刺杀剑术怒之伤害=183;半月弯刀怒之伤害=183;灭天火怒之伤害=183;雷电术怒之伤害=183;召唤神兽怒之伤害=183;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=760;金币=510000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 94,
		GodWeaponProperty = "战士生命值=1390;法师生命值=556;道士生命值=1390;基本剑术怒之伤害=184;刺杀剑术怒之伤害=184;半月弯刀怒之伤害=184;灭天火怒之伤害=184;雷电术怒之伤害=184;召唤神兽怒之伤害=184;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=760;金币=520000;服务器阶段=0;神舞=90;天晶=0",
		GodWeaponLevel = 95,
		GodWeaponProperty = "战士生命值=1425;法师生命值=570;道士生命值=1425;基本剑术怒之伤害=190;刺杀剑术怒之伤害=190;半月弯刀怒之伤害=190;灭天火怒之伤害=190;雷电术怒之伤害=190;召唤神兽怒之伤害=190;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=900;金币=520000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 96,
		GodWeaponProperty = "战士生命值=1435;法师生命值=574;道士生命值=1435;基本剑术怒之伤害=191;刺杀剑术怒之伤害=191;半月弯刀怒之伤害=191;灭天火怒之伤害=191;雷电术怒之伤害=191;召唤神兽怒之伤害=191;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=900;金币=530000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 97,
		GodWeaponProperty = "战士生命值=1445;法师生命值=578;道士生命值=1445;基本剑术怒之伤害=192;刺杀剑术怒之伤害=192;半月弯刀怒之伤害=192;灭天火怒之伤害=192;雷电术怒之伤害=192;召唤神兽怒之伤害=192;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=900;金币=530000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 98,
		GodWeaponProperty = "战士生命值=1455;法师生命值=582;道士生命值=1455;基本剑术怒之伤害=193;刺杀剑术怒之伤害=193;半月弯刀怒之伤害=193;灭天火怒之伤害=193;雷电术怒之伤害=193;召唤神兽怒之伤害=193;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=900;金币=540000;服务器阶段=0;神舞=0;天晶=0",
		GodWeaponLevel = 99,
		GodWeaponProperty = "战士生命值=1465;法师生命值=586;道士生命值=1465;基本剑术怒之伤害=194;刺杀剑术怒之伤害=194;半月弯刀怒之伤害=194;灭天火怒之伤害=194;雷电术怒之伤害=194;召唤神兽怒之伤害=194;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=900;金币=540000;服务器阶段=0;神舞=0;天晶=90",
		GodWeaponLevel = 100,
		GodWeaponProperty = "战士生命值=1500;法师生命值=600;道士生命值=1500;基本剑术怒之伤害=200;刺杀剑术怒之伤害=200;半月弯刀怒之伤害=200;灭天火怒之伤害=200;雷电术怒之伤害=200;召唤神兽怒之伤害=200;神兽形象改变=1",
		GodWeaponType = "太虚",
		ID = 2
	},
	{
		Request = "技能石=0;金币=0;服务器阶段=1;神舞=0;太虚=0",
		GodWeaponLevel = 0,
		GodWeaponProperty = "烈火剑法怒之伤害=0;逐日剑法怒之伤害=0;流星火雨怒之伤害=0;冰咆哮怒之伤害=0;噬血术怒之伤害=0;灵魂火符怒之伤害=0;怒之烈火几率=0;怒之火雨几率=0;怒之噬血几率=0;怒之烈火额外伤害=0;怒之火雨额外伤害=0;怒之噬血额外伤害=0",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=5;金币=50000;服务器阶段=1;神舞=3;太虚=0",
		GodWeaponLevel = 1,
		GodWeaponProperty = "烈火剑法怒之伤害=1;逐日剑法怒之伤害=1;流星火雨怒之伤害=1;冰咆哮怒之伤害=1;噬血术怒之伤害=1;灵魂火符怒之伤害=1;怒之烈火几率=0;怒之火雨几率=0;怒之噬血几率=0;怒之烈火额外伤害=0;怒之火雨额外伤害=0;怒之噬血额外伤害=0",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=10;金币=50000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 2,
		GodWeaponProperty = "烈火剑法怒之伤害=2;逐日剑法怒之伤害=2;流星火雨怒之伤害=2;冰咆哮怒之伤害=2;噬血术怒之伤害=2;灵魂火符怒之伤害=2;怒之烈火几率=0;怒之火雨几率=0;怒之噬血几率=0;怒之烈火额外伤害=0;怒之火雨额外伤害=0;怒之噬血额外伤害=0",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=15;金币=60000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 3,
		GodWeaponProperty = "烈火剑法怒之伤害=3;逐日剑法怒之伤害=3;流星火雨怒之伤害=3;冰咆哮怒之伤害=3;噬血术怒之伤害=3;灵魂火符怒之伤害=3;怒之烈火几率=0;怒之火雨几率=0;怒之噬血几率=0;怒之烈火额外伤害=0;怒之火雨额外伤害=0;怒之噬血额外伤害=0",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=20;金币=60000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 4,
		GodWeaponProperty = "烈火剑法怒之伤害=4;逐日剑法怒之伤害=4;流星火雨怒之伤害=4;冰咆哮怒之伤害=4;噬血术怒之伤害=4;灵魂火符怒之伤害=4;怒之烈火几率=0;怒之火雨几率=0;怒之噬血几率=0;怒之烈火额外伤害=0;怒之火雨额外伤害=0;怒之噬血额外伤害=0",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=20;金币=70000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 5,
		GodWeaponProperty = "烈火剑法怒之伤害=10;逐日剑法怒之伤害=10;流星火雨怒之伤害=10;冰咆哮怒之伤害=10;噬血术怒之伤害=10;灵魂火符怒之伤害=10;怒之烈火几率=0;怒之火雨几率=0;怒之噬血几率=0;怒之烈火额外伤害=0;怒之火雨额外伤害=0;怒之噬血额外伤害=0",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=20;金币=70000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 6,
		GodWeaponProperty = "烈火剑法怒之伤害=11;逐日剑法怒之伤害=11;流星火雨怒之伤害=11;冰咆哮怒之伤害=11;噬血术怒之伤害=11;灵魂火符怒之伤害=11;怒之烈火几率=0;怒之火雨几率=0;怒之噬血几率=0;怒之烈火额外伤害=0;怒之火雨额外伤害=0;怒之噬血额外伤害=0",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=25;金币=80000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 7,
		GodWeaponProperty = "烈火剑法怒之伤害=12;逐日剑法怒之伤害=12;流星火雨怒之伤害=12;冰咆哮怒之伤害=12;噬血术怒之伤害=12;灵魂火符怒之伤害=12;怒之烈火几率=0;怒之火雨几率=0;怒之噬血几率=0;怒之烈火额外伤害=0;怒之火雨额外伤害=0;怒之噬血额外伤害=0",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=25;金币=80000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 8,
		GodWeaponProperty = "烈火剑法怒之伤害=13;逐日剑法怒之伤害=13;流星火雨怒之伤害=13;冰咆哮怒之伤害=13;噬血术怒之伤害=13;灵魂火符怒之伤害=13;怒之烈火几率=0;怒之火雨几率=0;怒之噬血几率=0;怒之烈火额外伤害=0;怒之火雨额外伤害=0;怒之噬血额外伤害=0",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=25;金币=90000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 9,
		GodWeaponProperty = "烈火剑法怒之伤害=14;逐日剑法怒之伤害=14;流星火雨怒之伤害=14;冰咆哮怒之伤害=14;噬血术怒之伤害=14;灵魂火符怒之伤害=14;怒之烈火几率=0;怒之火雨几率=0;怒之噬血几率=0;怒之烈火额外伤害=0;怒之火雨额外伤害=0;怒之噬血额外伤害=0",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=25;金币=90000;服务器阶段=0;神舞=0;太虚=5",
		GodWeaponLevel = 10,
		GodWeaponProperty = "烈火剑法怒之伤害=20;逐日剑法怒之伤害=20;流星火雨怒之伤害=20;冰咆哮怒之伤害=20;噬血术怒之伤害=20;灵魂火符怒之伤害=20;怒之烈火几率=3;怒之火雨几率=3;怒之噬血几率=3;怒之烈火额外伤害=0;怒之火雨额外伤害=0;怒之噬血额外伤害=0",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=30;金币=100000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 11,
		GodWeaponProperty = "烈火剑法怒之伤害=21;逐日剑法怒之伤害=21;流星火雨怒之伤害=21;冰咆哮怒之伤害=21;噬血术怒之伤害=21;灵魂火符怒之伤害=21;怒之烈火几率=3;怒之火雨几率=3;怒之噬血几率=3;怒之烈火额外伤害=0;怒之火雨额外伤害=0;怒之噬血额外伤害=0",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=30;金币=100000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 12,
		GodWeaponProperty = "烈火剑法怒之伤害=22;逐日剑法怒之伤害=22;流星火雨怒之伤害=22;冰咆哮怒之伤害=22;噬血术怒之伤害=22;灵魂火符怒之伤害=22;怒之烈火几率=3;怒之火雨几率=3;怒之噬血几率=3;怒之烈火额外伤害=0;怒之火雨额外伤害=0;怒之噬血额外伤害=0",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=30;金币=110000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 13,
		GodWeaponProperty = "烈火剑法怒之伤害=23;逐日剑法怒之伤害=23;流星火雨怒之伤害=23;冰咆哮怒之伤害=23;噬血术怒之伤害=23;灵魂火符怒之伤害=23;怒之烈火几率=3;怒之火雨几率=3;怒之噬血几率=3;怒之烈火额外伤害=0;怒之火雨额外伤害=0;怒之噬血额外伤害=0",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=35;金币=110000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 14,
		GodWeaponProperty = "烈火剑法怒之伤害=24;逐日剑法怒之伤害=24;流星火雨怒之伤害=24;冰咆哮怒之伤害=24;噬血术怒之伤害=24;灵魂火符怒之伤害=24;怒之烈火几率=3;怒之火雨几率=3;怒之噬血几率=3;怒之烈火额外伤害=0;怒之火雨额外伤害=0;怒之噬血额外伤害=0",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=35;金币=120000;服务器阶段=0;神舞=0;太虚=10",
		GodWeaponLevel = 15,
		GodWeaponProperty = "烈火剑法怒之伤害=30;逐日剑法怒之伤害=30;流星火雨怒之伤害=30;冰咆哮怒之伤害=30;噬血术怒之伤害=30;灵魂火符怒之伤害=30;怒之烈火几率=3;怒之火雨几率=3;怒之噬血几率=3;怒之烈火额外伤害=0;怒之火雨额外伤害=0;怒之噬血额外伤害=0",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=35;金币=120000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 16,
		GodWeaponProperty = "烈火剑法怒之伤害=31;逐日剑法怒之伤害=31;流星火雨怒之伤害=31;冰咆哮怒之伤害=31;噬血术怒之伤害=31;灵魂火符怒之伤害=31;怒之烈火几率=3;怒之火雨几率=3;怒之噬血几率=3;怒之烈火额外伤害=0;怒之火雨额外伤害=0;怒之噬血额外伤害=0",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=40;金币=130000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 17,
		GodWeaponProperty = "烈火剑法怒之伤害=32;逐日剑法怒之伤害=32;流星火雨怒之伤害=32;冰咆哮怒之伤害=32;噬血术怒之伤害=32;灵魂火符怒之伤害=32;怒之烈火几率=3;怒之火雨几率=3;怒之噬血几率=3;怒之烈火额外伤害=0;怒之火雨额外伤害=0;怒之噬血额外伤害=0",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=40;金币=130000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 18,
		GodWeaponProperty = "烈火剑法怒之伤害=33;逐日剑法怒之伤害=33;流星火雨怒之伤害=33;冰咆哮怒之伤害=33;噬血术怒之伤害=33;灵魂火符怒之伤害=33;怒之烈火几率=3;怒之火雨几率=3;怒之噬血几率=3;怒之烈火额外伤害=0;怒之火雨额外伤害=0;怒之噬血额外伤害=0",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=40;金币=140000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 19,
		GodWeaponProperty = "烈火剑法怒之伤害=34;逐日剑法怒之伤害=34;流星火雨怒之伤害=34;冰咆哮怒之伤害=34;噬血术怒之伤害=34;灵魂火符怒之伤害=34;怒之烈火几率=3;怒之火雨几率=3;怒之噬血几率=3;怒之烈火额外伤害=0;怒之火雨额外伤害=0;怒之噬血额外伤害=0",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=40;金币=140000;服务器阶段=0;神舞=0;太虚=15",
		GodWeaponLevel = 20,
		GodWeaponProperty = "烈火剑法怒之伤害=40;逐日剑法怒之伤害=40;流星火雨怒之伤害=40;冰咆哮怒之伤害=40;噬血术怒之伤害=40;灵魂火符怒之伤害=40;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=0;怒之火雨额外伤害=0;怒之噬血额外伤害=0",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=50;金币=150000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 21,
		GodWeaponProperty = "烈火剑法怒之伤害=41;逐日剑法怒之伤害=41;流星火雨怒之伤害=41;冰咆哮怒之伤害=41;噬血术怒之伤害=41;灵魂火符怒之伤害=41;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=0;怒之火雨额外伤害=0;怒之噬血额外伤害=0",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=50;金币=150000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 22,
		GodWeaponProperty = "烈火剑法怒之伤害=42;逐日剑法怒之伤害=42;流星火雨怒之伤害=42;冰咆哮怒之伤害=42;噬血术怒之伤害=42;灵魂火符怒之伤害=42;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=0;怒之火雨额外伤害=0;怒之噬血额外伤害=0",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=50;金币=160000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 23,
		GodWeaponProperty = "烈火剑法怒之伤害=43;逐日剑法怒之伤害=43;流星火雨怒之伤害=43;冰咆哮怒之伤害=43;噬血术怒之伤害=43;灵魂火符怒之伤害=43;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=0;怒之火雨额外伤害=0;怒之噬血额外伤害=0",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=55;金币=160000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 24,
		GodWeaponProperty = "烈火剑法怒之伤害=44;逐日剑法怒之伤害=44;流星火雨怒之伤害=44;冰咆哮怒之伤害=44;噬血术怒之伤害=44;灵魂火符怒之伤害=44;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=0;怒之火雨额外伤害=0;怒之噬血额外伤害=0",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=55;金币=170000;服务器阶段=0;神舞=0;太虚=20",
		GodWeaponLevel = 25,
		GodWeaponProperty = "烈火剑法怒之伤害=50;逐日剑法怒之伤害=50;流星火雨怒之伤害=50;冰咆哮怒之伤害=50;噬血术怒之伤害=50;灵魂火符怒之伤害=50;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=0;怒之火雨额外伤害=0;怒之噬血额外伤害=0",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=55;金币=170000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 26,
		GodWeaponProperty = "烈火剑法怒之伤害=51;逐日剑法怒之伤害=51;流星火雨怒之伤害=51;冰咆哮怒之伤害=51;噬血术怒之伤害=51;灵魂火符怒之伤害=51;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=0;怒之火雨额外伤害=0;怒之噬血额外伤害=0",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=60;金币=180000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 27,
		GodWeaponProperty = "烈火剑法怒之伤害=52;逐日剑法怒之伤害=52;流星火雨怒之伤害=52;冰咆哮怒之伤害=52;噬血术怒之伤害=52;灵魂火符怒之伤害=52;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=0;怒之火雨额外伤害=0;怒之噬血额外伤害=0",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=60;金币=180000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 28,
		GodWeaponProperty = "烈火剑法怒之伤害=53;逐日剑法怒之伤害=53;流星火雨怒之伤害=53;冰咆哮怒之伤害=53;噬血术怒之伤害=53;灵魂火符怒之伤害=53;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=0;怒之火雨额外伤害=0;怒之噬血额外伤害=0",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=60;金币=190000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 29,
		GodWeaponProperty = "烈火剑法怒之伤害=54;逐日剑法怒之伤害=54;流星火雨怒之伤害=54;冰咆哮怒之伤害=54;噬血术怒之伤害=54;灵魂火符怒之伤害=54;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=0;怒之火雨额外伤害=0;怒之噬血额外伤害=0",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=60;金币=190000;服务器阶段=0;神舞=0;太虚=25",
		GodWeaponLevel = 30,
		GodWeaponProperty = "烈火剑法怒之伤害=60;逐日剑法怒之伤害=60;流星火雨怒之伤害=60;冰咆哮怒之伤害=60;噬血术怒之伤害=60;灵魂火符怒之伤害=60;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=20;怒之火雨额外伤害=20;怒之噬血额外伤害=20",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=80;金币=200000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 31,
		GodWeaponProperty = "烈火剑法怒之伤害=61;逐日剑法怒之伤害=61;流星火雨怒之伤害=61;冰咆哮怒之伤害=61;噬血术怒之伤害=61;灵魂火符怒之伤害=61;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=20;怒之火雨额外伤害=20;怒之噬血额外伤害=20",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=80;金币=200000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 32,
		GodWeaponProperty = "烈火剑法怒之伤害=62;逐日剑法怒之伤害=62;流星火雨怒之伤害=62;冰咆哮怒之伤害=62;噬血术怒之伤害=62;灵魂火符怒之伤害=62;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=20;怒之火雨额外伤害=20;怒之噬血额外伤害=20",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=80;金币=210000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 33,
		GodWeaponProperty = "烈火剑法怒之伤害=63;逐日剑法怒之伤害=63;流星火雨怒之伤害=63;冰咆哮怒之伤害=63;噬血术怒之伤害=63;灵魂火符怒之伤害=63;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=20;怒之火雨额外伤害=20;怒之噬血额外伤害=20",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=80;金币=210000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 34,
		GodWeaponProperty = "烈火剑法怒之伤害=64;逐日剑法怒之伤害=64;流星火雨怒之伤害=64;冰咆哮怒之伤害=64;噬血术怒之伤害=64;灵魂火符怒之伤害=64;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=20;怒之火雨额外伤害=20;怒之噬血额外伤害=20",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=80;金币=220000;服务器阶段=2;神舞=0;太虚=30",
		GodWeaponLevel = 35,
		GodWeaponProperty = "烈火剑法怒之伤害=70;逐日剑法怒之伤害=70;流星火雨怒之伤害=70;冰咆哮怒之伤害=70;噬血术怒之伤害=70;灵魂火符怒之伤害=70;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=20;怒之火雨额外伤害=20;怒之噬血额外伤害=20",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=100;金币=220000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 36,
		GodWeaponProperty = "烈火剑法怒之伤害=71;逐日剑法怒之伤害=71;流星火雨怒之伤害=71;冰咆哮怒之伤害=71;噬血术怒之伤害=71;灵魂火符怒之伤害=71;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=20;怒之火雨额外伤害=20;怒之噬血额外伤害=20",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=100;金币=230000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 37,
		GodWeaponProperty = "烈火剑法怒之伤害=72;逐日剑法怒之伤害=72;流星火雨怒之伤害=72;冰咆哮怒之伤害=72;噬血术怒之伤害=72;灵魂火符怒之伤害=72;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=20;怒之火雨额外伤害=20;怒之噬血额外伤害=20",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=100;金币=230000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 38,
		GodWeaponProperty = "烈火剑法怒之伤害=73;逐日剑法怒之伤害=73;流星火雨怒之伤害=73;冰咆哮怒之伤害=73;噬血术怒之伤害=73;灵魂火符怒之伤害=73;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=20;怒之火雨额外伤害=20;怒之噬血额外伤害=20",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=100;金币=240000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 39,
		GodWeaponProperty = "烈火剑法怒之伤害=74;逐日剑法怒之伤害=74;流星火雨怒之伤害=74;冰咆哮怒之伤害=74;噬血术怒之伤害=74;灵魂火符怒之伤害=74;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=20;怒之火雨额外伤害=20;怒之噬血额外伤害=20",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=100;金币=240000;服务器阶段=0;神舞=0;太虚=35",
		GodWeaponLevel = 40,
		GodWeaponProperty = "烈火剑法怒之伤害=80;逐日剑法怒之伤害=80;流星火雨怒之伤害=80;冰咆哮怒之伤害=80;噬血术怒之伤害=80;灵魂火符怒之伤害=80;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=40;怒之火雨额外伤害=40;怒之噬血额外伤害=40",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=120;金币=250000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 41,
		GodWeaponProperty = "烈火剑法怒之伤害=81;逐日剑法怒之伤害=81;流星火雨怒之伤害=81;冰咆哮怒之伤害=81;噬血术怒之伤害=81;灵魂火符怒之伤害=81;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=40;怒之火雨额外伤害=40;怒之噬血额外伤害=40",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=120;金币=250000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 42,
		GodWeaponProperty = "烈火剑法怒之伤害=82;逐日剑法怒之伤害=82;流星火雨怒之伤害=82;冰咆哮怒之伤害=82;噬血术怒之伤害=82;灵魂火符怒之伤害=82;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=40;怒之火雨额外伤害=40;怒之噬血额外伤害=40",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=120;金币=260000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 43,
		GodWeaponProperty = "烈火剑法怒之伤害=83;逐日剑法怒之伤害=83;流星火雨怒之伤害=83;冰咆哮怒之伤害=83;噬血术怒之伤害=83;灵魂火符怒之伤害=83;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=40;怒之火雨额外伤害=40;怒之噬血额外伤害=40",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=120;金币=260000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 44,
		GodWeaponProperty = "烈火剑法怒之伤害=84;逐日剑法怒之伤害=84;流星火雨怒之伤害=84;冰咆哮怒之伤害=84;噬血术怒之伤害=84;灵魂火符怒之伤害=84;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=40;怒之火雨额外伤害=40;怒之噬血额外伤害=40",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=120;金币=270000;服务器阶段=0;神舞=0;太虚=40",
		GodWeaponLevel = 45,
		GodWeaponProperty = "烈火剑法怒之伤害=90;逐日剑法怒之伤害=90;流星火雨怒之伤害=90;冰咆哮怒之伤害=90;噬血术怒之伤害=90;灵魂火符怒之伤害=90;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=40;怒之火雨额外伤害=40;怒之噬血额外伤害=40",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=160;金币=270000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 46,
		GodWeaponProperty = "烈火剑法怒之伤害=91;逐日剑法怒之伤害=91;流星火雨怒之伤害=91;冰咆哮怒之伤害=91;噬血术怒之伤害=91;灵魂火符怒之伤害=91;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=40;怒之火雨额外伤害=40;怒之噬血额外伤害=40",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=160;金币=280000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 47,
		GodWeaponProperty = "烈火剑法怒之伤害=92;逐日剑法怒之伤害=92;流星火雨怒之伤害=92;冰咆哮怒之伤害=92;噬血术怒之伤害=92;灵魂火符怒之伤害=92;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=40;怒之火雨额外伤害=40;怒之噬血额外伤害=40",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=160;金币=280000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 48,
		GodWeaponProperty = "烈火剑法怒之伤害=93;逐日剑法怒之伤害=93;流星火雨怒之伤害=93;冰咆哮怒之伤害=93;噬血术怒之伤害=93;灵魂火符怒之伤害=93;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=40;怒之火雨额外伤害=40;怒之噬血额外伤害=40",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=160;金币=290000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 49,
		GodWeaponProperty = "烈火剑法怒之伤害=94;逐日剑法怒之伤害=94;流星火雨怒之伤害=94;冰咆哮怒之伤害=94;噬血术怒之伤害=94;灵魂火符怒之伤害=94;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=40;怒之火雨额外伤害=40;怒之噬血额外伤害=40",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=160;金币=290000;服务器阶段=0;神舞=0;太虚=45",
		GodWeaponLevel = 50,
		GodWeaponProperty = "烈火剑法怒之伤害=100;逐日剑法怒之伤害=100;流星火雨怒之伤害=100;冰咆哮怒之伤害=100;噬血术怒之伤害=100;灵魂火符怒之伤害=100;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=60;怒之火雨额外伤害=60;怒之噬血额外伤害=60",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=200;金币=300000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 51,
		GodWeaponProperty = "烈火剑法怒之伤害=101;逐日剑法怒之伤害=101;流星火雨怒之伤害=101;冰咆哮怒之伤害=101;噬血术怒之伤害=101;灵魂火符怒之伤害=101;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=60;怒之火雨额外伤害=60;怒之噬血额外伤害=60",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=200;金币=300000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 52,
		GodWeaponProperty = "烈火剑法怒之伤害=102;逐日剑法怒之伤害=102;流星火雨怒之伤害=102;冰咆哮怒之伤害=102;噬血术怒之伤害=102;灵魂火符怒之伤害=102;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=60;怒之火雨额外伤害=60;怒之噬血额外伤害=60",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=200;金币=310000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 53,
		GodWeaponProperty = "烈火剑法怒之伤害=103;逐日剑法怒之伤害=103;流星火雨怒之伤害=103;冰咆哮怒之伤害=103;噬血术怒之伤害=103;灵魂火符怒之伤害=103;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=60;怒之火雨额外伤害=60;怒之噬血额外伤害=60",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=200;金币=310000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 54,
		GodWeaponProperty = "烈火剑法怒之伤害=104;逐日剑法怒之伤害=104;流星火雨怒之伤害=104;冰咆哮怒之伤害=104;噬血术怒之伤害=104;灵魂火符怒之伤害=104;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=60;怒之火雨额外伤害=60;怒之噬血额外伤害=60",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=200;金币=320000;服务器阶段=0;神舞=0;太虚=50",
		GodWeaponLevel = 55,
		GodWeaponProperty = "烈火剑法怒之伤害=110;逐日剑法怒之伤害=110;流星火雨怒之伤害=110;冰咆哮怒之伤害=110;噬血术怒之伤害=110;灵魂火符怒之伤害=110;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=60;怒之火雨额外伤害=60;怒之噬血额外伤害=60",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=250;金币=320000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 56,
		GodWeaponProperty = "烈火剑法怒之伤害=111;逐日剑法怒之伤害=111;流星火雨怒之伤害=111;冰咆哮怒之伤害=111;噬血术怒之伤害=111;灵魂火符怒之伤害=111;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=60;怒之火雨额外伤害=60;怒之噬血额外伤害=60",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=250;金币=330000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 57,
		GodWeaponProperty = "烈火剑法怒之伤害=112;逐日剑法怒之伤害=112;流星火雨怒之伤害=112;冰咆哮怒之伤害=112;噬血术怒之伤害=112;灵魂火符怒之伤害=112;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=60;怒之火雨额外伤害=60;怒之噬血额外伤害=60",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=250;金币=330000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 58,
		GodWeaponProperty = "烈火剑法怒之伤害=113;逐日剑法怒之伤害=113;流星火雨怒之伤害=113;冰咆哮怒之伤害=113;噬血术怒之伤害=113;灵魂火符怒之伤害=113;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=60;怒之火雨额外伤害=60;怒之噬血额外伤害=60",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=250;金币=340000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 59,
		GodWeaponProperty = "烈火剑法怒之伤害=114;逐日剑法怒之伤害=114;流星火雨怒之伤害=114;冰咆哮怒之伤害=114;噬血术怒之伤害=114;灵魂火符怒之伤害=114;怒之烈火几率=6;怒之火雨几率=6;怒之噬血几率=6;怒之烈火额外伤害=60;怒之火雨额外伤害=60;怒之噬血额外伤害=60",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=250;金币=340000;服务器阶段=0;神舞=0;太虚=55",
		GodWeaponLevel = 60,
		GodWeaponProperty = "烈火剑法怒之伤害=120;逐日剑法怒之伤害=120;流星火雨怒之伤害=120;冰咆哮怒之伤害=120;噬血术怒之伤害=120;灵魂火符怒之伤害=120;怒之烈火几率=8;怒之火雨几率=8;怒之噬血几率=8;怒之烈火额外伤害=60;怒之火雨额外伤害=60;怒之噬血额外伤害=60",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=300;金币=350000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 61,
		GodWeaponProperty = "烈火剑法怒之伤害=121;逐日剑法怒之伤害=121;流星火雨怒之伤害=121;冰咆哮怒之伤害=121;噬血术怒之伤害=121;灵魂火符怒之伤害=121;怒之烈火几率=8;怒之火雨几率=8;怒之噬血几率=8;怒之烈火额外伤害=60;怒之火雨额外伤害=60;怒之噬血额外伤害=60",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=300;金币=350000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 62,
		GodWeaponProperty = "烈火剑法怒之伤害=122;逐日剑法怒之伤害=122;流星火雨怒之伤害=122;冰咆哮怒之伤害=122;噬血术怒之伤害=122;灵魂火符怒之伤害=122;怒之烈火几率=8;怒之火雨几率=8;怒之噬血几率=8;怒之烈火额外伤害=60;怒之火雨额外伤害=60;怒之噬血额外伤害=60",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=300;金币=360000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 63,
		GodWeaponProperty = "烈火剑法怒之伤害=123;逐日剑法怒之伤害=123;流星火雨怒之伤害=123;冰咆哮怒之伤害=123;噬血术怒之伤害=123;灵魂火符怒之伤害=123;怒之烈火几率=8;怒之火雨几率=8;怒之噬血几率=8;怒之烈火额外伤害=60;怒之火雨额外伤害=60;怒之噬血额外伤害=60",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=300;金币=360000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 64,
		GodWeaponProperty = "烈火剑法怒之伤害=124;逐日剑法怒之伤害=124;流星火雨怒之伤害=124;冰咆哮怒之伤害=124;噬血术怒之伤害=124;灵魂火符怒之伤害=124;怒之烈火几率=8;怒之火雨几率=8;怒之噬血几率=8;怒之烈火额外伤害=60;怒之火雨额外伤害=60;怒之噬血额外伤害=60",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=300;金币=370000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 65,
		GodWeaponProperty = "烈火剑法怒之伤害=130;逐日剑法怒之伤害=130;流星火雨怒之伤害=130;冰咆哮怒之伤害=130;噬血术怒之伤害=130;灵魂火符怒之伤害=130;怒之烈火几率=8;怒之火雨几率=8;怒之噬血几率=8;怒之烈火额外伤害=60;怒之火雨额外伤害=60;怒之噬血额外伤害=60",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=370;金币=370000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 66,
		GodWeaponProperty = "烈火剑法怒之伤害=131;逐日剑法怒之伤害=131;流星火雨怒之伤害=131;冰咆哮怒之伤害=131;噬血术怒之伤害=131;灵魂火符怒之伤害=131;怒之烈火几率=8;怒之火雨几率=8;怒之噬血几率=8;怒之烈火额外伤害=60;怒之火雨额外伤害=60;怒之噬血额外伤害=60",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=370;金币=380000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 67,
		GodWeaponProperty = "烈火剑法怒之伤害=132;逐日剑法怒之伤害=132;流星火雨怒之伤害=132;冰咆哮怒之伤害=132;噬血术怒之伤害=132;灵魂火符怒之伤害=132;怒之烈火几率=8;怒之火雨几率=8;怒之噬血几率=8;怒之烈火额外伤害=60;怒之火雨额外伤害=60;怒之噬血额外伤害=60",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=370;金币=380000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 68,
		GodWeaponProperty = "烈火剑法怒之伤害=133;逐日剑法怒之伤害=133;流星火雨怒之伤害=133;冰咆哮怒之伤害=133;噬血术怒之伤害=133;灵魂火符怒之伤害=133;怒之烈火几率=8;怒之火雨几率=8;怒之噬血几率=8;怒之烈火额外伤害=60;怒之火雨额外伤害=60;怒之噬血额外伤害=60",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=370;金币=390000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 69,
		GodWeaponProperty = "烈火剑法怒之伤害=134;逐日剑法怒之伤害=134;流星火雨怒之伤害=134;冰咆哮怒之伤害=134;噬血术怒之伤害=134;灵魂火符怒之伤害=134;怒之烈火几率=8;怒之火雨几率=8;怒之噬血几率=8;怒之烈火额外伤害=60;怒之火雨额外伤害=60;怒之噬血额外伤害=60",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=370;金币=390000;服务器阶段=0;神舞=0;太虚=60",
		GodWeaponLevel = 70,
		GodWeaponProperty = "烈火剑法怒之伤害=140;逐日剑法怒之伤害=140;流星火雨怒之伤害=140;冰咆哮怒之伤害=140;噬血术怒之伤害=140;灵魂火符怒之伤害=140;怒之烈火几率=10;怒之火雨几率=10;怒之噬血几率=10;怒之烈火额外伤害=60;怒之火雨额外伤害=60;怒之噬血额外伤害=60",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=450;金币=400000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 71,
		GodWeaponProperty = "烈火剑法怒之伤害=141;逐日剑法怒之伤害=141;流星火雨怒之伤害=141;冰咆哮怒之伤害=141;噬血术怒之伤害=141;灵魂火符怒之伤害=141;怒之烈火几率=10;怒之火雨几率=10;怒之噬血几率=10;怒之烈火额外伤害=60;怒之火雨额外伤害=60;怒之噬血额外伤害=60",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=450;金币=400000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 72,
		GodWeaponProperty = "烈火剑法怒之伤害=142;逐日剑法怒之伤害=142;流星火雨怒之伤害=142;冰咆哮怒之伤害=142;噬血术怒之伤害=142;灵魂火符怒之伤害=142;怒之烈火几率=10;怒之火雨几率=10;怒之噬血几率=10;怒之烈火额外伤害=60;怒之火雨额外伤害=60;怒之噬血额外伤害=60",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=450;金币=410000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 73,
		GodWeaponProperty = "烈火剑法怒之伤害=143;逐日剑法怒之伤害=143;流星火雨怒之伤害=143;冰咆哮怒之伤害=143;噬血术怒之伤害=143;灵魂火符怒之伤害=143;怒之烈火几率=10;怒之火雨几率=10;怒之噬血几率=10;怒之烈火额外伤害=60;怒之火雨额外伤害=60;怒之噬血额外伤害=60",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=450;金币=410000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 74,
		GodWeaponProperty = "烈火剑法怒之伤害=144;逐日剑法怒之伤害=144;流星火雨怒之伤害=144;冰咆哮怒之伤害=144;噬血术怒之伤害=144;灵魂火符怒之伤害=144;怒之烈火几率=10;怒之火雨几率=10;怒之噬血几率=10;怒之烈火额外伤害=60;怒之火雨额外伤害=60;怒之噬血额外伤害=60",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=450;金币=420000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 75,
		GodWeaponProperty = "烈火剑法怒之伤害=150;逐日剑法怒之伤害=150;流星火雨怒之伤害=150;冰咆哮怒之伤害=150;噬血术怒之伤害=150;灵魂火符怒之伤害=150;怒之烈火几率=10;怒之火雨几率=10;怒之噬血几率=10;怒之烈火额外伤害=60;怒之火雨额外伤害=60;怒之噬血额外伤害=60",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=530;金币=420000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 76,
		GodWeaponProperty = "烈火剑法怒之伤害=151;逐日剑法怒之伤害=151;流星火雨怒之伤害=151;冰咆哮怒之伤害=151;噬血术怒之伤害=151;灵魂火符怒之伤害=151;怒之烈火几率=10;怒之火雨几率=10;怒之噬血几率=10;怒之烈火额外伤害=60;怒之火雨额外伤害=60;怒之噬血额外伤害=60",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=530;金币=430000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 77,
		GodWeaponProperty = "烈火剑法怒之伤害=152;逐日剑法怒之伤害=152;流星火雨怒之伤害=152;冰咆哮怒之伤害=152;噬血术怒之伤害=152;灵魂火符怒之伤害=152;怒之烈火几率=10;怒之火雨几率=10;怒之噬血几率=10;怒之烈火额外伤害=60;怒之火雨额外伤害=60;怒之噬血额外伤害=60",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=530;金币=430000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 78,
		GodWeaponProperty = "烈火剑法怒之伤害=153;逐日剑法怒之伤害=153;流星火雨怒之伤害=153;冰咆哮怒之伤害=153;噬血术怒之伤害=153;灵魂火符怒之伤害=153;怒之烈火几率=10;怒之火雨几率=10;怒之噬血几率=10;怒之烈火额外伤害=60;怒之火雨额外伤害=60;怒之噬血额外伤害=60",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=530;金币=440000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 79,
		GodWeaponProperty = "烈火剑法怒之伤害=154;逐日剑法怒之伤害=154;流星火雨怒之伤害=154;冰咆哮怒之伤害=154;噬血术怒之伤害=154;灵魂火符怒之伤害=154;怒之烈火几率=10;怒之火雨几率=10;怒之噬血几率=10;怒之烈火额外伤害=60;怒之火雨额外伤害=60;怒之噬血额外伤害=60",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=530;金币=440000;服务器阶段=0;神舞=0;太虚=70",
		GodWeaponLevel = 80,
		GodWeaponProperty = "烈火剑法怒之伤害=160;逐日剑法怒之伤害=160;流星火雨怒之伤害=160;冰咆哮怒之伤害=160;噬血术怒之伤害=160;灵魂火符怒之伤害=160;怒之烈火几率=10;怒之火雨几率=10;怒之噬血几率=10;怒之烈火额外伤害=80;怒之火雨额外伤害=80;怒之噬血额外伤害=80",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=600;金币=450000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 81,
		GodWeaponProperty = "烈火剑法怒之伤害=161;逐日剑法怒之伤害=161;流星火雨怒之伤害=161;冰咆哮怒之伤害=161;噬血术怒之伤害=161;灵魂火符怒之伤害=161;怒之烈火几率=10;怒之火雨几率=10;怒之噬血几率=10;怒之烈火额外伤害=80;怒之火雨额外伤害=80;怒之噬血额外伤害=80",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=600;金币=450000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 82,
		GodWeaponProperty = "烈火剑法怒之伤害=162;逐日剑法怒之伤害=162;流星火雨怒之伤害=162;冰咆哮怒之伤害=162;噬血术怒之伤害=162;灵魂火符怒之伤害=162;怒之烈火几率=10;怒之火雨几率=10;怒之噬血几率=10;怒之烈火额外伤害=80;怒之火雨额外伤害=80;怒之噬血额外伤害=80",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=600;金币=460000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 83,
		GodWeaponProperty = "烈火剑法怒之伤害=163;逐日剑法怒之伤害=163;流星火雨怒之伤害=163;冰咆哮怒之伤害=163;噬血术怒之伤害=163;灵魂火符怒之伤害=163;怒之烈火几率=10;怒之火雨几率=10;怒之噬血几率=10;怒之烈火额外伤害=80;怒之火雨额外伤害=80;怒之噬血额外伤害=80",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=600;金币=460000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 84,
		GodWeaponProperty = "烈火剑法怒之伤害=164;逐日剑法怒之伤害=164;流星火雨怒之伤害=164;冰咆哮怒之伤害=164;噬血术怒之伤害=164;灵魂火符怒之伤害=164;怒之烈火几率=10;怒之火雨几率=10;怒之噬血几率=10;怒之烈火额外伤害=80;怒之火雨额外伤害=80;怒之噬血额外伤害=80",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=600;金币=470000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 85,
		GodWeaponProperty = "烈火剑法怒之伤害=170;逐日剑法怒之伤害=170;流星火雨怒之伤害=170;冰咆哮怒之伤害=170;噬血术怒之伤害=170;灵魂火符怒之伤害=170;怒之烈火几率=10;怒之火雨几率=10;怒之噬血几率=10;怒之烈火额外伤害=80;怒之火雨额外伤害=80;怒之噬血额外伤害=80",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=680;金币=470000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 86,
		GodWeaponProperty = "烈火剑法怒之伤害=171;逐日剑法怒之伤害=171;流星火雨怒之伤害=171;冰咆哮怒之伤害=171;噬血术怒之伤害=171;灵魂火符怒之伤害=171;怒之烈火几率=10;怒之火雨几率=10;怒之噬血几率=10;怒之烈火额外伤害=80;怒之火雨额外伤害=80;怒之噬血额外伤害=80",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=680;金币=480000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 87,
		GodWeaponProperty = "烈火剑法怒之伤害=172;逐日剑法怒之伤害=172;流星火雨怒之伤害=172;冰咆哮怒之伤害=172;噬血术怒之伤害=172;灵魂火符怒之伤害=172;怒之烈火几率=10;怒之火雨几率=10;怒之噬血几率=10;怒之烈火额外伤害=80;怒之火雨额外伤害=80;怒之噬血额外伤害=80",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=680;金币=480000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 88,
		GodWeaponProperty = "烈火剑法怒之伤害=173;逐日剑法怒之伤害=173;流星火雨怒之伤害=173;冰咆哮怒之伤害=173;噬血术怒之伤害=173;灵魂火符怒之伤害=173;怒之烈火几率=10;怒之火雨几率=10;怒之噬血几率=10;怒之烈火额外伤害=80;怒之火雨额外伤害=80;怒之噬血额外伤害=80",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=680;金币=490000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 89,
		GodWeaponProperty = "烈火剑法怒之伤害=174;逐日剑法怒之伤害=174;流星火雨怒之伤害=174;冰咆哮怒之伤害=174;噬血术怒之伤害=174;灵魂火符怒之伤害=174;怒之烈火几率=10;怒之火雨几率=10;怒之噬血几率=10;怒之烈火额外伤害=80;怒之火雨额外伤害=80;怒之噬血额外伤害=80",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=680;金币=490000;服务器阶段=0;神舞=0;太虚=80",
		GodWeaponLevel = 90,
		GodWeaponProperty = "烈火剑法怒之伤害=180;逐日剑法怒之伤害=180;流星火雨怒之伤害=180;冰咆哮怒之伤害=180;噬血术怒之伤害=180;灵魂火符怒之伤害=180;怒之烈火几率=10;怒之火雨几率=10;怒之噬血几率=10;怒之烈火额外伤害=100;怒之火雨额外伤害=100;怒之噬血额外伤害=100",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=760;金币=500000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 91,
		GodWeaponProperty = "烈火剑法怒之伤害=181;逐日剑法怒之伤害=181;流星火雨怒之伤害=181;冰咆哮怒之伤害=181;噬血术怒之伤害=181;灵魂火符怒之伤害=181;怒之烈火几率=10;怒之火雨几率=10;怒之噬血几率=10;怒之烈火额外伤害=100;怒之火雨额外伤害=100;怒之噬血额外伤害=100",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=760;金币=500000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 92,
		GodWeaponProperty = "烈火剑法怒之伤害=182;逐日剑法怒之伤害=182;流星火雨怒之伤害=182;冰咆哮怒之伤害=182;噬血术怒之伤害=182;灵魂火符怒之伤害=182;怒之烈火几率=10;怒之火雨几率=10;怒之噬血几率=10;怒之烈火额外伤害=100;怒之火雨额外伤害=100;怒之噬血额外伤害=100",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=760;金币=510000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 93,
		GodWeaponProperty = "烈火剑法怒之伤害=183;逐日剑法怒之伤害=183;流星火雨怒之伤害=183;冰咆哮怒之伤害=183;噬血术怒之伤害=183;灵魂火符怒之伤害=183;怒之烈火几率=10;怒之火雨几率=10;怒之噬血几率=10;怒之烈火额外伤害=100;怒之火雨额外伤害=100;怒之噬血额外伤害=100",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=760;金币=510000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 94,
		GodWeaponProperty = "烈火剑法怒之伤害=184;逐日剑法怒之伤害=184;流星火雨怒之伤害=184;冰咆哮怒之伤害=184;噬血术怒之伤害=184;灵魂火符怒之伤害=184;怒之烈火几率=10;怒之火雨几率=10;怒之噬血几率=10;怒之烈火额外伤害=100;怒之火雨额外伤害=100;怒之噬血额外伤害=100",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=760;金币=520000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 95,
		GodWeaponProperty = "烈火剑法怒之伤害=190;逐日剑法怒之伤害=190;流星火雨怒之伤害=190;冰咆哮怒之伤害=190;噬血术怒之伤害=190;灵魂火符怒之伤害=190;怒之烈火几率=10;怒之火雨几率=10;怒之噬血几率=10;怒之烈火额外伤害=100;怒之火雨额外伤害=100;怒之噬血额外伤害=100",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=900;金币=520000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 96,
		GodWeaponProperty = "烈火剑法怒之伤害=191;逐日剑法怒之伤害=191;流星火雨怒之伤害=191;冰咆哮怒之伤害=191;噬血术怒之伤害=191;灵魂火符怒之伤害=191;怒之烈火几率=10;怒之火雨几率=10;怒之噬血几率=10;怒之烈火额外伤害=100;怒之火雨额外伤害=100;怒之噬血额外伤害=100",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=900;金币=530000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 97,
		GodWeaponProperty = "烈火剑法怒之伤害=192;逐日剑法怒之伤害=192;流星火雨怒之伤害=192;冰咆哮怒之伤害=192;噬血术怒之伤害=192;灵魂火符怒之伤害=192;怒之烈火几率=10;怒之火雨几率=10;怒之噬血几率=10;怒之烈火额外伤害=100;怒之火雨额外伤害=100;怒之噬血额外伤害=100",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=900;金币=530000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 98,
		GodWeaponProperty = "烈火剑法怒之伤害=193;逐日剑法怒之伤害=193;流星火雨怒之伤害=193;冰咆哮怒之伤害=193;噬血术怒之伤害=193;灵魂火符怒之伤害=193;怒之烈火几率=10;怒之火雨几率=10;怒之噬血几率=10;怒之烈火额外伤害=100;怒之火雨额外伤害=100;怒之噬血额外伤害=100",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=900;金币=540000;服务器阶段=0;神舞=0;太虚=0",
		GodWeaponLevel = 99,
		GodWeaponProperty = "烈火剑法怒之伤害=194;逐日剑法怒之伤害=194;流星火雨怒之伤害=194;冰咆哮怒之伤害=194;噬血术怒之伤害=194;灵魂火符怒之伤害=194;怒之烈火几率=10;怒之火雨几率=10;怒之噬血几率=10;怒之烈火额外伤害=100;怒之火雨额外伤害=100;怒之噬血额外伤害=100",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=900;金币=540000;服务器阶段=0;神舞=0;太虚=90",
		GodWeaponLevel = 100,
		GodWeaponProperty = "烈火剑法怒之伤害=200;逐日剑法怒之伤害=200;流星火雨怒之伤害=200;冰咆哮怒之伤害=200;噬血术怒之伤害=200;灵魂火符怒之伤害=200;怒之烈火几率=10;怒之火雨几率=10;怒之噬血几率=10;怒之烈火额外伤害=120;怒之火雨额外伤害=120;怒之噬血额外伤害=120",
		GodWeaponType = "凤凰",
		ID = 3
	},
	{
		Request = "技能石=0;金币=0;服务器阶段=2;神舞=0;凤凰=0",
		GodWeaponLevel = 0,
		GodWeaponProperty = "追心刺怒之伤害=0;冰天雪地怒之伤害=0;万剑归宗怒之伤害=0;攻击下限=0;攻击上限=0;魔法下限=0;魔法上限=0;道术下限=0;道术上限=0",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=5;金币=50000;服务器阶段=2;神舞=15;凤凰=0",
		GodWeaponLevel = 1,
		GodWeaponProperty = "追心刺怒之伤害=1;冰天雪地怒之伤害=1;万剑归宗怒之伤害=1;攻击下限=0;攻击上限=0;魔法下限=0;魔法上限=0;道术下限=0;道术上限=0",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=10;金币=50000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 2,
		GodWeaponProperty = "追心刺怒之伤害=2;冰天雪地怒之伤害=2;万剑归宗怒之伤害=2;攻击下限=0;攻击上限=1;魔法下限=0;魔法上限=1;道术下限=0;道术上限=1",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=15;金币=60000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 3,
		GodWeaponProperty = "追心刺怒之伤害=3;冰天雪地怒之伤害=3;万剑归宗怒之伤害=3;攻击下限=0;攻击上限=1;魔法下限=0;魔法上限=1;道术下限=0;道术上限=1",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=20;金币=60000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 4,
		GodWeaponProperty = "追心刺怒之伤害=4;冰天雪地怒之伤害=4;万剑归宗怒之伤害=4;攻击下限=0;攻击上限=2;魔法下限=0;魔法上限=2;道术下限=0;道术上限=2",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=20;金币=70000;服务器阶段=0;神舞=0;凤凰=0;追心刺等级=0;冰天雪地等级=0;万剑归宗等级=0",
		GodWeaponLevel = 5,
		GodWeaponProperty = "追心刺怒之伤害=10;冰天雪地怒之伤害=10;万剑归宗怒之伤害=10;攻击下限=0;攻击上限=2;魔法下限=0;魔法上限=2;道术下限=0;道术上限=2",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=20;金币=70000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 6,
		GodWeaponProperty = "追心刺怒之伤害=11;冰天雪地怒之伤害=11;万剑归宗怒之伤害=11;攻击下限=0;攻击上限=3;魔法下限=0;魔法上限=3;道术下限=0;道术上限=3",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=25;金币=80000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 7,
		GodWeaponProperty = "追心刺怒之伤害=12;冰天雪地怒之伤害=12;万剑归宗怒之伤害=12;攻击下限=0;攻击上限=3;魔法下限=0;魔法上限=3;道术下限=0;道术上限=3",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=25;金币=80000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 8,
		GodWeaponProperty = "追心刺怒之伤害=13;冰天雪地怒之伤害=13;万剑归宗怒之伤害=13;攻击下限=0;攻击上限=4;魔法下限=0;魔法上限=4;道术下限=0;道术上限=4",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=25;金币=90000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 9,
		GodWeaponProperty = "追心刺怒之伤害=14;冰天雪地怒之伤害=14;万剑归宗怒之伤害=14;攻击下限=0;攻击上限=4;魔法下限=0;魔法上限=4;道术下限=0;道术上限=4",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=25;金币=90000;服务器阶段=0;神舞=0;凤凰=5",
		GodWeaponLevel = 10,
		GodWeaponProperty = "追心刺怒之伤害=20;冰天雪地怒之伤害=20;万剑归宗怒之伤害=20;攻击下限=0;攻击上限=5;魔法下限=0;魔法上限=5;道术下限=0;道术上限=5",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=30;金币=100000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 11,
		GodWeaponProperty = "追心刺怒之伤害=21;冰天雪地怒之伤害=21;万剑归宗怒之伤害=21;攻击下限=0;攻击上限=5;魔法下限=0;魔法上限=5;道术下限=0;道术上限=5",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=30;金币=100000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 12,
		GodWeaponProperty = "追心刺怒之伤害=22;冰天雪地怒之伤害=22;万剑归宗怒之伤害=22;攻击下限=0;攻击上限=6;魔法下限=0;魔法上限=6;道术下限=0;道术上限=6",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=30;金币=110000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 13,
		GodWeaponProperty = "追心刺怒之伤害=23;冰天雪地怒之伤害=23;万剑归宗怒之伤害=23;攻击下限=0;攻击上限=6;魔法下限=0;魔法上限=6;道术下限=0;道术上限=6",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=35;金币=110000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 14,
		GodWeaponProperty = "追心刺怒之伤害=24;冰天雪地怒之伤害=24;万剑归宗怒之伤害=24;攻击下限=0;攻击上限=7;魔法下限=0;魔法上限=7;道术下限=0;道术上限=7",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=35;金币=120000;服务器阶段=0;神舞=0;凤凰=10",
		GodWeaponLevel = 15,
		GodWeaponProperty = "追心刺怒之伤害=30;冰天雪地怒之伤害=30;万剑归宗怒之伤害=30;攻击下限=0;攻击上限=7;魔法下限=0;魔法上限=7;道术下限=0;道术上限=7",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=35;金币=120000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 16,
		GodWeaponProperty = "追心刺怒之伤害=31;冰天雪地怒之伤害=31;万剑归宗怒之伤害=31;攻击下限=0;攻击上限=8;魔法下限=0;魔法上限=8;道术下限=0;道术上限=8",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=40;金币=130000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 17,
		GodWeaponProperty = "追心刺怒之伤害=32;冰天雪地怒之伤害=32;万剑归宗怒之伤害=32;攻击下限=0;攻击上限=8;魔法下限=0;魔法上限=8;道术下限=0;道术上限=8",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=40;金币=130000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 18,
		GodWeaponProperty = "追心刺怒之伤害=33;冰天雪地怒之伤害=33;万剑归宗怒之伤害=33;攻击下限=0;攻击上限=9;魔法下限=0;魔法上限=9;道术下限=0;道术上限=9",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=40;金币=140000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 19,
		GodWeaponProperty = "追心刺怒之伤害=34;冰天雪地怒之伤害=34;万剑归宗怒之伤害=34;攻击下限=0;攻击上限=9;魔法下限=0;魔法上限=9;道术下限=0;道术上限=9",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=40;金币=140000;服务器阶段=0;神舞=0;凤凰=15",
		GodWeaponLevel = 20,
		GodWeaponProperty = "追心刺怒之伤害=40;冰天雪地怒之伤害=40;万剑归宗怒之伤害=40;攻击下限=0;攻击上限=10;魔法下限=0;魔法上限=10;道术下限=0;道术上限=10",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=50;金币=150000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 21,
		GodWeaponProperty = "追心刺怒之伤害=41;冰天雪地怒之伤害=41;万剑归宗怒之伤害=41;攻击下限=0;攻击上限=10;魔法下限=0;魔法上限=10;道术下限=0;道术上限=10",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=50;金币=150000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 22,
		GodWeaponProperty = "追心刺怒之伤害=42;冰天雪地怒之伤害=42;万剑归宗怒之伤害=42;攻击下限=0;攻击上限=11;魔法下限=0;魔法上限=11;道术下限=0;道术上限=11",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=50;金币=160000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 23,
		GodWeaponProperty = "追心刺怒之伤害=43;冰天雪地怒之伤害=43;万剑归宗怒之伤害=43;攻击下限=0;攻击上限=11;魔法下限=0;魔法上限=11;道术下限=0;道术上限=11",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=55;金币=160000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 24,
		GodWeaponProperty = "追心刺怒之伤害=44;冰天雪地怒之伤害=44;万剑归宗怒之伤害=44;攻击下限=0;攻击上限=12;魔法下限=0;魔法上限=12;道术下限=0;道术上限=12",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=55;金币=170000;服务器阶段=0;神舞=0;凤凰=20",
		GodWeaponLevel = 25,
		GodWeaponProperty = "追心刺怒之伤害=50;冰天雪地怒之伤害=50;万剑归宗怒之伤害=50;攻击下限=0;攻击上限=12;魔法下限=0;魔法上限=12;道术下限=0;道术上限=12",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=55;金币=170000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 26,
		GodWeaponProperty = "追心刺怒之伤害=51;冰天雪地怒之伤害=51;万剑归宗怒之伤害=51;攻击下限=0;攻击上限=13;魔法下限=0;魔法上限=13;道术下限=0;道术上限=13",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=60;金币=180000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 27,
		GodWeaponProperty = "追心刺怒之伤害=52;冰天雪地怒之伤害=52;万剑归宗怒之伤害=52;攻击下限=0;攻击上限=13;魔法下限=0;魔法上限=13;道术下限=0;道术上限=13",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=60;金币=180000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 28,
		GodWeaponProperty = "追心刺怒之伤害=53;冰天雪地怒之伤害=53;万剑归宗怒之伤害=53;攻击下限=0;攻击上限=14;魔法下限=0;魔法上限=14;道术下限=0;道术上限=14",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=60;金币=190000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 29,
		GodWeaponProperty = "追心刺怒之伤害=54;冰天雪地怒之伤害=54;万剑归宗怒之伤害=54;攻击下限=0;攻击上限=14;魔法下限=0;魔法上限=14;道术下限=0;道术上限=14",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=60;金币=190000;服务器阶段=0;神舞=0;凤凰=25",
		GodWeaponLevel = 30,
		GodWeaponProperty = "追心刺怒之伤害=60;冰天雪地怒之伤害=60;万剑归宗怒之伤害=60;攻击下限=0;攻击上限=15;魔法下限=0;魔法上限=15;道术下限=0;道术上限=15",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=80;金币=200000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 31,
		GodWeaponProperty = "追心刺怒之伤害=61;冰天雪地怒之伤害=61;万剑归宗怒之伤害=61;攻击下限=0;攻击上限=15;魔法下限=0;魔法上限=15;道术下限=0;道术上限=15",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=80;金币=200000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 32,
		GodWeaponProperty = "追心刺怒之伤害=62;冰天雪地怒之伤害=62;万剑归宗怒之伤害=62;攻击下限=0;攻击上限=16;魔法下限=0;魔法上限=16;道术下限=0;道术上限=16",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=80;金币=210000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 33,
		GodWeaponProperty = "追心刺怒之伤害=63;冰天雪地怒之伤害=63;万剑归宗怒之伤害=63;攻击下限=0;攻击上限=16;魔法下限=0;魔法上限=16;道术下限=0;道术上限=16",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=80;金币=210000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 34,
		GodWeaponProperty = "追心刺怒之伤害=64;冰天雪地怒之伤害=64;万剑归宗怒之伤害=64;攻击下限=0;攻击上限=17;魔法下限=0;魔法上限=17;道术下限=0;道术上限=17",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=80;金币=220000;服务器阶段=0;神舞=0;凤凰=30",
		GodWeaponLevel = 35,
		GodWeaponProperty = "追心刺怒之伤害=70;冰天雪地怒之伤害=70;万剑归宗怒之伤害=70;攻击下限=0;攻击上限=17;魔法下限=0;魔法上限=17;道术下限=0;道术上限=17",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=100;金币=220000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 36,
		GodWeaponProperty = "追心刺怒之伤害=71;冰天雪地怒之伤害=71;万剑归宗怒之伤害=71;攻击下限=0;攻击上限=18;魔法下限=0;魔法上限=18;道术下限=0;道术上限=18",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=100;金币=230000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 37,
		GodWeaponProperty = "追心刺怒之伤害=72;冰天雪地怒之伤害=72;万剑归宗怒之伤害=72;攻击下限=0;攻击上限=18;魔法下限=0;魔法上限=18;道术下限=0;道术上限=18",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=100;金币=230000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 38,
		GodWeaponProperty = "追心刺怒之伤害=73;冰天雪地怒之伤害=73;万剑归宗怒之伤害=73;攻击下限=0;攻击上限=19;魔法下限=0;魔法上限=19;道术下限=0;道术上限=19",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=100;金币=240000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 39,
		GodWeaponProperty = "追心刺怒之伤害=74;冰天雪地怒之伤害=74;万剑归宗怒之伤害=74;攻击下限=0;攻击上限=19;魔法下限=0;魔法上限=19;道术下限=0;道术上限=19",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=100;金币=240000;服务器阶段=0;神舞=0;凤凰=35",
		GodWeaponLevel = 40,
		GodWeaponProperty = "追心刺怒之伤害=80;冰天雪地怒之伤害=80;万剑归宗怒之伤害=80;攻击下限=0;攻击上限=20;魔法下限=0;魔法上限=20;道术下限=0;道术上限=20",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=120;金币=250000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 41,
		GodWeaponProperty = "追心刺怒之伤害=81;冰天雪地怒之伤害=81;万剑归宗怒之伤害=81;攻击下限=0;攻击上限=20;魔法下限=0;魔法上限=20;道术下限=0;道术上限=20",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=120;金币=250000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 42,
		GodWeaponProperty = "追心刺怒之伤害=82;冰天雪地怒之伤害=82;万剑归宗怒之伤害=82;攻击下限=0;攻击上限=21;魔法下限=0;魔法上限=21;道术下限=0;道术上限=21",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=120;金币=260000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 43,
		GodWeaponProperty = "追心刺怒之伤害=83;冰天雪地怒之伤害=83;万剑归宗怒之伤害=83;攻击下限=0;攻击上限=21;魔法下限=0;魔法上限=21;道术下限=0;道术上限=21",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=120;金币=260000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 44,
		GodWeaponProperty = "追心刺怒之伤害=84;冰天雪地怒之伤害=84;万剑归宗怒之伤害=84;攻击下限=0;攻击上限=22;魔法下限=0;魔法上限=22;道术下限=0;道术上限=22",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=120;金币=270000;服务器阶段=0;神舞=0;凤凰=40",
		GodWeaponLevel = 45,
		GodWeaponProperty = "追心刺怒之伤害=90;冰天雪地怒之伤害=90;万剑归宗怒之伤害=90;攻击下限=0;攻击上限=22;魔法下限=0;魔法上限=22;道术下限=0;道术上限=22",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=160;金币=270000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 46,
		GodWeaponProperty = "追心刺怒之伤害=91;冰天雪地怒之伤害=91;万剑归宗怒之伤害=91;攻击下限=0;攻击上限=23;魔法下限=0;魔法上限=23;道术下限=0;道术上限=23",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=160;金币=280000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 47,
		GodWeaponProperty = "追心刺怒之伤害=92;冰天雪地怒之伤害=92;万剑归宗怒之伤害=92;攻击下限=0;攻击上限=23;魔法下限=0;魔法上限=23;道术下限=0;道术上限=23",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=160;金币=280000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 48,
		GodWeaponProperty = "追心刺怒之伤害=93;冰天雪地怒之伤害=93;万剑归宗怒之伤害=93;攻击下限=0;攻击上限=24;魔法下限=0;魔法上限=24;道术下限=0;道术上限=24",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=160;金币=290000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 49,
		GodWeaponProperty = "追心刺怒之伤害=94;冰天雪地怒之伤害=94;万剑归宗怒之伤害=94;攻击下限=0;攻击上限=24;魔法下限=0;魔法上限=24;道术下限=0;道术上限=24",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=160;金币=290000;服务器阶段=0;神舞=0;凤凰=45",
		GodWeaponLevel = 50,
		GodWeaponProperty = "追心刺怒之伤害=100;冰天雪地怒之伤害=100;万剑归宗怒之伤害=100;攻击下限=0;攻击上限=25;魔法下限=0;魔法上限=25;道术下限=0;道术上限=25",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=200;金币=300000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 51,
		GodWeaponProperty = "追心刺怒之伤害=101;冰天雪地怒之伤害=101;万剑归宗怒之伤害=101;攻击下限=0;攻击上限=25;魔法下限=0;魔法上限=25;道术下限=0;道术上限=25",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=200;金币=300000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 52,
		GodWeaponProperty = "追心刺怒之伤害=102;冰天雪地怒之伤害=102;万剑归宗怒之伤害=102;攻击下限=0;攻击上限=26;魔法下限=0;魔法上限=26;道术下限=0;道术上限=26",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=200;金币=310000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 53,
		GodWeaponProperty = "追心刺怒之伤害=103;冰天雪地怒之伤害=103;万剑归宗怒之伤害=103;攻击下限=0;攻击上限=26;魔法下限=0;魔法上限=26;道术下限=0;道术上限=26",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=200;金币=310000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 54,
		GodWeaponProperty = "追心刺怒之伤害=104;冰天雪地怒之伤害=104;万剑归宗怒之伤害=104;攻击下限=0;攻击上限=27;魔法下限=0;魔法上限=27;道术下限=0;道术上限=27",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=200;金币=320000;服务器阶段=0;神舞=0;凤凰=50",
		GodWeaponLevel = 55,
		GodWeaponProperty = "追心刺怒之伤害=110;冰天雪地怒之伤害=110;万剑归宗怒之伤害=110;攻击下限=0;攻击上限=27;魔法下限=0;魔法上限=27;道术下限=0;道术上限=27",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=250;金币=320000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 56,
		GodWeaponProperty = "追心刺怒之伤害=111;冰天雪地怒之伤害=111;万剑归宗怒之伤害=111;攻击下限=0;攻击上限=28;魔法下限=0;魔法上限=28;道术下限=0;道术上限=28",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=250;金币=330000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 57,
		GodWeaponProperty = "追心刺怒之伤害=112;冰天雪地怒之伤害=112;万剑归宗怒之伤害=112;攻击下限=0;攻击上限=28;魔法下限=0;魔法上限=28;道术下限=0;道术上限=28",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=250;金币=330000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 58,
		GodWeaponProperty = "追心刺怒之伤害=113;冰天雪地怒之伤害=113;万剑归宗怒之伤害=113;攻击下限=0;攻击上限=29;魔法下限=0;魔法上限=29;道术下限=0;道术上限=29",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=250;金币=340000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 59,
		GodWeaponProperty = "追心刺怒之伤害=114;冰天雪地怒之伤害=114;万剑归宗怒之伤害=114;攻击下限=0;攻击上限=29;魔法下限=0;魔法上限=29;道术下限=0;道术上限=29",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=250;金币=340000;服务器阶段=0;神舞=0;凤凰=55",
		GodWeaponLevel = 60,
		GodWeaponProperty = "追心刺怒之伤害=120;冰天雪地怒之伤害=120;万剑归宗怒之伤害=120;攻击下限=0;攻击上限=30;魔法下限=0;魔法上限=30;道术下限=0;道术上限=30",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=300;金币=350000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 61,
		GodWeaponProperty = "追心刺怒之伤害=121;冰天雪地怒之伤害=121;万剑归宗怒之伤害=121;攻击下限=0;攻击上限=30;魔法下限=0;魔法上限=30;道术下限=0;道术上限=30",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=300;金币=350000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 62,
		GodWeaponProperty = "追心刺怒之伤害=122;冰天雪地怒之伤害=122;万剑归宗怒之伤害=122;攻击下限=0;攻击上限=31;魔法下限=0;魔法上限=31;道术下限=0;道术上限=31",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=300;金币=360000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 63,
		GodWeaponProperty = "追心刺怒之伤害=123;冰天雪地怒之伤害=123;万剑归宗怒之伤害=123;攻击下限=0;攻击上限=31;魔法下限=0;魔法上限=31;道术下限=0;道术上限=31",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=300;金币=360000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 64,
		GodWeaponProperty = "追心刺怒之伤害=124;冰天雪地怒之伤害=124;万剑归宗怒之伤害=124;攻击下限=0;攻击上限=32;魔法下限=0;魔法上限=32;道术下限=0;道术上限=32",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=300;金币=370000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 65,
		GodWeaponProperty = "追心刺怒之伤害=130;冰天雪地怒之伤害=130;万剑归宗怒之伤害=130;攻击下限=0;攻击上限=32;魔法下限=0;魔法上限=32;道术下限=0;道术上限=32",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=370;金币=370000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 66,
		GodWeaponProperty = "追心刺怒之伤害=131;冰天雪地怒之伤害=131;万剑归宗怒之伤害=131;攻击下限=0;攻击上限=33;魔法下限=0;魔法上限=33;道术下限=0;道术上限=33",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=370;金币=380000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 67,
		GodWeaponProperty = "追心刺怒之伤害=132;冰天雪地怒之伤害=132;万剑归宗怒之伤害=132;攻击下限=0;攻击上限=33;魔法下限=0;魔法上限=33;道术下限=0;道术上限=33",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=370;金币=380000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 68,
		GodWeaponProperty = "追心刺怒之伤害=133;冰天雪地怒之伤害=133;万剑归宗怒之伤害=133;攻击下限=0;攻击上限=34;魔法下限=0;魔法上限=34;道术下限=0;道术上限=34",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=370;金币=390000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 69,
		GodWeaponProperty = "追心刺怒之伤害=134;冰天雪地怒之伤害=134;万剑归宗怒之伤害=134;攻击下限=0;攻击上限=34;魔法下限=0;魔法上限=34;道术下限=0;道术上限=34",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=370;金币=390000;服务器阶段=0;神舞=0;凤凰=60",
		GodWeaponLevel = 70,
		GodWeaponProperty = "追心刺怒之伤害=140;冰天雪地怒之伤害=140;万剑归宗怒之伤害=140;攻击下限=0;攻击上限=35;魔法下限=0;魔法上限=35;道术下限=0;道术上限=35",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=450;金币=400000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 71,
		GodWeaponProperty = "追心刺怒之伤害=141;冰天雪地怒之伤害=141;万剑归宗怒之伤害=141;攻击下限=0;攻击上限=35;魔法下限=0;魔法上限=35;道术下限=0;道术上限=35",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=450;金币=400000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 72,
		GodWeaponProperty = "追心刺怒之伤害=142;冰天雪地怒之伤害=142;万剑归宗怒之伤害=142;攻击下限=0;攻击上限=36;魔法下限=0;魔法上限=36;道术下限=0;道术上限=36",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=450;金币=410000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 73,
		GodWeaponProperty = "追心刺怒之伤害=143;冰天雪地怒之伤害=143;万剑归宗怒之伤害=143;攻击下限=0;攻击上限=36;魔法下限=0;魔法上限=36;道术下限=0;道术上限=36",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=450;金币=410000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 74,
		GodWeaponProperty = "追心刺怒之伤害=144;冰天雪地怒之伤害=144;万剑归宗怒之伤害=144;攻击下限=0;攻击上限=37;魔法下限=0;魔法上限=37;道术下限=0;道术上限=37",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=450;金币=420000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 75,
		GodWeaponProperty = "追心刺怒之伤害=150;冰天雪地怒之伤害=150;万剑归宗怒之伤害=150;攻击下限=0;攻击上限=37;魔法下限=0;魔法上限=37;道术下限=0;道术上限=37",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=530;金币=420000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 76,
		GodWeaponProperty = "追心刺怒之伤害=151;冰天雪地怒之伤害=151;万剑归宗怒之伤害=151;攻击下限=0;攻击上限=38;魔法下限=0;魔法上限=38;道术下限=0;道术上限=38",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=530;金币=430000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 77,
		GodWeaponProperty = "追心刺怒之伤害=152;冰天雪地怒之伤害=152;万剑归宗怒之伤害=152;攻击下限=0;攻击上限=38;魔法下限=0;魔法上限=38;道术下限=0;道术上限=38",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=530;金币=430000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 78,
		GodWeaponProperty = "追心刺怒之伤害=153;冰天雪地怒之伤害=153;万剑归宗怒之伤害=153;攻击下限=0;攻击上限=39;魔法下限=0;魔法上限=39;道术下限=0;道术上限=39",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=530;金币=440000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 79,
		GodWeaponProperty = "追心刺怒之伤害=154;冰天雪地怒之伤害=154;万剑归宗怒之伤害=154;攻击下限=0;攻击上限=39;魔法下限=0;魔法上限=39;道术下限=0;道术上限=39",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=530;金币=440000;服务器阶段=0;神舞=0;凤凰=70",
		GodWeaponLevel = 80,
		GodWeaponProperty = "追心刺怒之伤害=160;冰天雪地怒之伤害=160;万剑归宗怒之伤害=160;攻击下限=0;攻击上限=40;魔法下限=0;魔法上限=40;道术下限=0;道术上限=40",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=600;金币=450000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 81,
		GodWeaponProperty = "追心刺怒之伤害=161;冰天雪地怒之伤害=161;万剑归宗怒之伤害=161;攻击下限=0;攻击上限=40;魔法下限=0;魔法上限=40;道术下限=0;道术上限=40",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=600;金币=450000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 82,
		GodWeaponProperty = "追心刺怒之伤害=162;冰天雪地怒之伤害=162;万剑归宗怒之伤害=162;攻击下限=0;攻击上限=41;魔法下限=0;魔法上限=41;道术下限=0;道术上限=41",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=600;金币=460000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 83,
		GodWeaponProperty = "追心刺怒之伤害=163;冰天雪地怒之伤害=163;万剑归宗怒之伤害=163;攻击下限=0;攻击上限=41;魔法下限=0;魔法上限=41;道术下限=0;道术上限=41",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=600;金币=460000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 84,
		GodWeaponProperty = "追心刺怒之伤害=164;冰天雪地怒之伤害=164;万剑归宗怒之伤害=164;攻击下限=0;攻击上限=42;魔法下限=0;魔法上限=42;道术下限=0;道术上限=42",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=600;金币=470000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 85,
		GodWeaponProperty = "追心刺怒之伤害=170;冰天雪地怒之伤害=170;万剑归宗怒之伤害=170;攻击下限=0;攻击上限=42;魔法下限=0;魔法上限=42;道术下限=0;道术上限=42",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=680;金币=470000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 86,
		GodWeaponProperty = "追心刺怒之伤害=171;冰天雪地怒之伤害=171;万剑归宗怒之伤害=171;攻击下限=0;攻击上限=43;魔法下限=0;魔法上限=43;道术下限=0;道术上限=43",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=680;金币=480000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 87,
		GodWeaponProperty = "追心刺怒之伤害=172;冰天雪地怒之伤害=172;万剑归宗怒之伤害=172;攻击下限=0;攻击上限=43;魔法下限=0;魔法上限=43;道术下限=0;道术上限=43",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=680;金币=480000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 88,
		GodWeaponProperty = "追心刺怒之伤害=173;冰天雪地怒之伤害=173;万剑归宗怒之伤害=173;攻击下限=0;攻击上限=44;魔法下限=0;魔法上限=44;道术下限=0;道术上限=44",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=680;金币=490000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 89,
		GodWeaponProperty = "追心刺怒之伤害=174;冰天雪地怒之伤害=174;万剑归宗怒之伤害=174;攻击下限=0;攻击上限=44;魔法下限=0;魔法上限=44;道术下限=0;道术上限=44",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=680;金币=490000;服务器阶段=0;神舞=0;凤凰=80",
		GodWeaponLevel = 90,
		GodWeaponProperty = "追心刺怒之伤害=180;冰天雪地怒之伤害=180;万剑归宗怒之伤害=180;攻击下限=0;攻击上限=45;魔法下限=0;魔法上限=45;道术下限=0;道术上限=45",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=760;金币=500000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 91,
		GodWeaponProperty = "追心刺怒之伤害=181;冰天雪地怒之伤害=181;万剑归宗怒之伤害=181;攻击下限=0;攻击上限=45;魔法下限=0;魔法上限=45;道术下限=0;道术上限=45",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=760;金币=500000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 92,
		GodWeaponProperty = "追心刺怒之伤害=182;冰天雪地怒之伤害=182;万剑归宗怒之伤害=182;攻击下限=0;攻击上限=46;魔法下限=0;魔法上限=46;道术下限=0;道术上限=46",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=760;金币=510000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 93,
		GodWeaponProperty = "追心刺怒之伤害=183;冰天雪地怒之伤害=183;万剑归宗怒之伤害=183;攻击下限=0;攻击上限=46;魔法下限=0;魔法上限=46;道术下限=0;道术上限=46",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=760;金币=510000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 94,
		GodWeaponProperty = "追心刺怒之伤害=184;冰天雪地怒之伤害=184;万剑归宗怒之伤害=184;攻击下限=0;攻击上限=47;魔法下限=0;魔法上限=47;道术下限=0;道术上限=47",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=760;金币=520000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 95,
		GodWeaponProperty = "追心刺怒之伤害=190;冰天雪地怒之伤害=190;万剑归宗怒之伤害=190;攻击下限=0;攻击上限=47;魔法下限=0;魔法上限=47;道术下限=0;道术上限=47",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=900;金币=520000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 96,
		GodWeaponProperty = "追心刺怒之伤害=191;冰天雪地怒之伤害=191;万剑归宗怒之伤害=191;攻击下限=0;攻击上限=48;魔法下限=0;魔法上限=48;道术下限=0;道术上限=48",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=900;金币=530000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 97,
		GodWeaponProperty = "追心刺怒之伤害=192;冰天雪地怒之伤害=192;万剑归宗怒之伤害=192;攻击下限=0;攻击上限=48;魔法下限=0;魔法上限=48;道术下限=0;道术上限=48",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=900;金币=530000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 98,
		GodWeaponProperty = "追心刺怒之伤害=193;冰天雪地怒之伤害=193;万剑归宗怒之伤害=193;攻击下限=0;攻击上限=49;魔法下限=0;魔法上限=49;道术下限=0;道术上限=49",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=900;金币=540000;服务器阶段=0;神舞=0;凤凰=0",
		GodWeaponLevel = 99,
		GodWeaponProperty = "追心刺怒之伤害=194;冰天雪地怒之伤害=194;万剑归宗怒之伤害=194;攻击下限=0;攻击上限=49;魔法下限=0;魔法上限=49;道术下限=0;道术上限=49",
		GodWeaponType = "天晶",
		ID = 4
	},
	{
		Request = "技能石=900;金币=540000;服务器阶段=0;神舞=0;凤凰=90",
		GodWeaponLevel = 100,
		GodWeaponProperty = "追心刺怒之伤害=200;冰天雪地怒之伤害=200;万剑归宗怒之伤害=200;攻击下限=0;攻击上限=50;魔法下限=0;魔法上限=50;道术下限=0;道术上限=50",
		GodWeaponType = "天晶",
		ID = 4
	}
}

return GodWeapon
