local growthRoadConfig = {
	{
		NeedOpenDay = 0,
		Name = "等级提升",
		RelevantActs = "无",
		Npc = "庄园-水晶鉴定师",
		Items = "精力水晶;绑定精力水晶;精力鉴定卷;绑定精力鉴定卷;虔诚挂坠;老友令",
		Disc = "消灭怪物、完成系统指定的任务可以获得经验，提升角色等级。每日挂机获得经验有一定上限，达到上限后获得经验会衰减。|0|0;当你拥有活力值和精力值时，能够额外成倍地获得打怪经验。点击界面左上角箭头可以查看你的活力值和精力值，角色面板上也能查看。|0|0;活力值每天由系统赠送48点（0点赠送30点，8点赠送18点），离线也可以获得，未使用的活力值会持续累积。|0|0;精力值可以通过鉴定精力、使用精力水晶、虔诚膜拜获得。在庄园-水晶鉴定师处可以使用元宝鉴定并提取精力；当你在游戏中通过打怪或交易获得精力水晶，也可以在水晶鉴定师处使用增加精力值，每天使用次数有限制，未使用的次数会累积；此外，月卡奖励、迎新礼包、商城购买等方式都能获得虔诚挂坠，使用虔诚挂坠在比奇皇宫门口的天下第一雕像处虔诚膜拜，也能获得精力值，每天虔诚膜拜次数有限制，未使用的次数会累积。|0|0;如果仍嫌打怪使用活力值、精力值的速度太慢，可以在商城购买魔龙之血，使用之后消耗活力值、精力值获得经验的速度会大大加快，但是获得经验总量不变。|0|0;没有活力值、精力值的时候，打怪获得的经验仍然会被存储起来，可以在庄园-水晶鉴定师处使用这些存储的经验将活力值、精力值消耗掉直接获得成倍的经验。这种方式消耗活力值、精力值和打怪获得总量一样，却方便很多。高级玩家也可以消耗信用分，将自己的存储经验值兑换成“老友令”赠送给新进服的朋友或小号，节省他们在新手阶段打怪的时间。|0|0;合区时会按照本服务器与最早开服的服务器天数差值补齐每天的活力值、精力水晶使用次数、膜拜次数等。|0|0",
		NeedServerStep = 0,
		Aim = "精力值、活力值"
	},
	{
		NeedOpenDay = 0,
		Name = "突破转生",
		RelevantActs = "无",
		Npc = "庄园-神秘教头",
		Items = "无",
		Disc = "等级达到99级时，必须领取并完成庄园-神秘教头的试炼任务，才能够进行转生继续提升自己的等级。|0|0;当全区1转的玩家达到15人时，区服进入1阶段；当全区2转的玩家达到15人时，区服进入2阶段；当全区3转的玩家达到15人时，区服进入3阶段，以此推类。一些副本、功能、地图的开放会随区服阶段变化而调整。|0|0",
		NeedServerStep = 0,
		Aim = "转生"
	},
	{
		NeedOpenDay = 0,
		Name = "勋章升级",
		RelevantActs = "世界首领",
		Npc = "庄园-勋章守护人",
		Items = "声望;声望礼包;声望礼盒;绑定声望礼盒;魔尘;绑定魔尘;勋章灵印",
		Disc = "在庄园-勋章守护人处可使用声望兑换及升级勋章。|0|0;参加膜拜可获得声望，通过打怪和游戏内其他活动有几率爆出声望礼包、声望礼盒也可以获得声望，你还能在商城购买声望礼盒。|0|0;兑换勋章后可在庄园-勋章守护人处进行勋章附魔来获得魔晶的力量。魔尘可以通过击败宫殿长廊的部分怪物获得，也能在庄园-勋章守护人处和交易行购买。|0|0;角色被击败时魔晶有几率爆出，勋章升级时魔晶将保留。|0|0;服务器3阶段后开启勋章铭刻，铭刻消耗声望，分为：青龙纹、白虎纹、朱雀纹3种。|0|0;铭刻每提升10级，需要消耗勋章灵印突破一次，才能继续提升。勋章灵印由部分世界首领掉落。|0|0",
		NeedServerStep = 0,
		Aim = "无"
	},
	{
		NeedOpenDay = 0,
		Name = "闪耀宝石",
		RelevantActs = "无",
		Npc = "盟重-除魔使者",
		Items = "强攻宝石碎片;血玉宝石碎片;暴击宝石碎片;回复宝石碎片;麻痹宝石碎片;守护宝石碎片;混沌宝石碎片",
		Disc = "勇士们符合等级要求后就可以激活宝石页签中相应宝石。参加试炼首领活动和每日的除魔挑战活动能够获得宝石碎片升级宝石。不同宝石的除魔挑战每天限一次，未参加次数会累积。也可以在商城购买礼盒获取碎片。|0|0;强攻宝石提升强攻概率、强攻伤害及主属性，战斗中有更高的几率触发更高的强攻伤害。|0|0;血玉宝石提升生命值及主属性，战斗中有更高的生存能力。|0|0;暴击宝石提升生命值、暴击概率及暴击伤害，战斗中有几率触发高额的爆发伤害。|0|0;回复宝石提升生命值、回血速度及满回药的总回复量，战斗中提供更强的续航能力。|0|0;麻痹宝石提升主属性、防御、生命值、麻痹几率及麻痹时间，战斗中有几率麻痹对手。|20|0;守护宝石提升生命值、守护几率及守护效果，战斗时有几率减少受到的伤害。|20|0;混沌宝石提升生命值、主属性、防御、回血速度等基础属性，还可以获得伤害加深、伤害减免、幸运等特殊属性|0|1",
		NeedServerStep = 0,
		Aim = "无"
	},
	{
		NeedOpenDay = 0,
		Name = "华美羽翼",
		RelevantActs = "翎羽幻境;地下夺宝;石墓夺宝;闯关夺宝;沙巴克攻城;精英怪",
		Npc = "庄园-羽翼仙子",
		Items = "白色羽毛;金色羽毛;绑定羽灵印;绑定羽灵礼包;羽灵礼包;绑定羽灵礼盒;羽灵礼盒",
		Disc = "服务器达到二阶段开放羽翼系统。|0|0;使用白色羽毛可以随机提升羽翼经验，升级羽翼获得属性。|0|0;羽翼达到指定级别后，还可以消耗材料激活个性羽翼，获得特殊属性。|0|0;还有六大华美羽翼（天使系和恶魔系各3套）时装外观可以开启并展示。|0|0;服务器达到二阶段后，完成翎羽幻境周任务也可获得白色羽毛奖励。|0|0;开服达到150天，服务器达到四阶段，开放羽装系统。|0|0;羽装可以通过消耗羽灵获得，部分夺宝活动和精英怪都有几率爆出羽灵兑换道具。|0|0",
		NeedServerStep = 1,
		Aim = "无"
	},
	{
		NeedOpenDay = 0,
		Name = "神圣军鼓",
		RelevantActs = "无",
		Npc = "庄园-大将军",
		Items = "功勋礼包;绑定功勋礼包;功勋礼盒;绑定功勋礼盒;泉水罐",
		Disc = "服务器达到二阶段即可开启军鼓系统。|0|0;获得足够的功勋即可在庄园-大将军处升级军鼓，消耗功勋和泉水还可启封军鼓特殊属性。|0|0;神圣伤害在军鼓启封时可获得，可以无视防御、魔御和伤害减免等所有抵抗类功能，直接造成对应数值的伤害。|0|0;服务器达到二阶段后，完成玛法接水任务，收集泉水即可至大将军处兑换功勋。|0|0",
		NeedServerStep = 1,
		Aim = "无"
	},
	{
		NeedOpenDay = 0,
		Name = "坐骑来袭",
		RelevantActs = "无",
		Npc = "庄园-坐骑管理员",
		Items = "无",
		Disc = "开服第18天开放坐骑系统。|0|0;勇士们可通过商城购买、参加指定活动或任务、击杀首领等获得坐骑马牌。|0|0;双击使用马牌，可获得对应坐骑。|0|0;收集坐骑可获得图鉴属性加成，收集越多，累加获得的属性越好。|0|0;可在“自定义界面”中将“上马”按钮拖动至主界面，点击\"上马\"骑乘坐骑并换上人物时装，点击\"下马\"收回坐骑，恢复人物。|0|0;注意：攻击或使用技能时，会自动下马。|0|0",
		NeedServerStep = 0,
		Aim = "坐骑"
	},
	{
		NeedOpenDay = 0,
		Name = "坐骑-兽魂",
		RelevantActs = "物资援助",
		Npc = "庄园-坐骑管理员",
		Items = "兽魂丹;绑定兽魂丹;1级命中石;1级物闪石;1级魔闪石;1级神防石;1级神伤石",
		Disc = "服务器达到二阶段且开服天数达到110天开启坐骑兽魂系统。|0|0;提升兽魂等级可增加相应的属性。|0|0;满足激活条件时可激活兽魂石槽，激活后可镶嵌对应兽魂石，镶嵌兽魂石可后增加人物相应属性。|0|0;任意种类的三个同等级兽魂石可合成一个高一级兽魂石，合成成功率随合成目标等级变化。|0|0",
		NeedServerStep = 2,
		Aim = "兽魂"
	},
	{
		NeedOpenDay = 0,
		Name = "宠物养成",
		RelevantActs = "驻守宠物岛",
		Npc = "庄园-宠物管理员",
		Items = "绑定培养丹;资质丹;绑定资质丹;普通宠物蛋;中级宠物蛋;高级宠物蛋",
		Disc = "服务器达到二阶段即可开启宠物系统。|0|0;开启宠物蛋能获得对应稀有度的宠物，每个宠物会有随机的职业偏向和品质。|0|0;勇士们可在庄园-宠物管理员处前往宠物岛，击败宠物岛的怪物有几率爆出资质丹、宠物蛋。服务器达到二阶段且开服80天后，还可以完成驻守宠物岛任务获得绑定培养丹奖励。|0|0;你还可在商城、交易行中购买宠物蛋；在庄园-宠物管理员处购买培养丹。|0|0;培养你的宠物，稀有度越贵重、品质越好、资质越高、宠物等级越高，就能获得更强的实力提升。|0|0",
		NeedServerStep = 1,
		Aim = "宠物"
	},
	{
		NeedOpenDay = 20,
		Name = "军衔",
		RelevantActs = "跨服竞技",
		Npc = "庄园-大将军",
		Items = "军功",
		Disc = "服务器达到一阶段即可开启军衔系统。|0|0;勇士们可通过参加跨服活动可获得军功。|0|0;勇士们可在庄园-大将军处升级军衔，提升军衔等级可增加人物属性，每次升级会消耗一定数量的军功。|0|0;当军衔达到一定等级，可解锁军衔装备，勇士们可通过参加跨服活动获得军衔装备。|0|0;军衔装备分为盾牌、玉佩、兵符、花翎、佩剑、战旗、官印、兵书八类，军衔装备不会因在争斗中死亡而爆出。|0|0;部分军衔装备带有打怪回复属性。|0|0;打怪回复属性:人物在攻击怪物并对其造成伤害时，回复相当于打怪回复属性数值的血量。|0|0",
		NeedServerStep = 0,
		Aim = "军衔及军衔装备"
	},
	{
		NeedOpenDay = 20,
		Name = "神兵",
		RelevantActs = "每日答题",
		Npc = "庄园-神装使者",
		Items = "玄铁石;绑定玄铁石;绑定技能石",
		Disc = "服务器达到一阶段开启神兵系统。|0|0;消耗玄铁石可提升神舞神兵等级，消耗技能石可提升其余神兵等级，提升神兵等级可提升角色属性及相应技能伤害。|0|0;太虚、凤凰神兵达到一定等级将使特定技能发生变化，产生强大效果。|0|0",
		NeedServerStep = 0,
		Aim = "神兵"
	},
	{
		NeedOpenDay = 0,
		Name = "神戒",
		RelevantActs = "提炼神戒精华",
		Npc = "庄园-神装使者",
		Items = "神戒精华;绑定神戒精华;精华礼包;绑定精华礼包;精华礼盒;绑定精华礼盒",
		Disc = "服务器达到三阶段且开服天数达到130天时开启神戒系统。|0|0;勇士可通过游戏内相关玩法获得神戒精华升级神戒，升级后不同神戒可增加人物不同的特殊能力及属性。|0|0;神戒可消耗对应戒指进行升阶，神戒升阶后会赋予勇士更加强大的特殊能力。|0|0",
		NeedServerStep = 3,
		Aim = "神戒"
	},
	{
		NeedOpenDay = 0,
		Name = "信用分",
		RelevantActs = "焰火屠魔;跑蛛丝;世界首领;精英怪;藏经峡谷;地下夺宝;石墓夺宝",
		Npc = "各主城老兵、各仓库管理员",
		Items = "无",
		Disc = [[
信用分达到30分之后可以成为验证用户。为了防止恶意小号、工作室、和挂机挖矿，只有成为验证用户才能够体验全部内容。|0|0;未验证用户可携带200万金币和使用24格仓库；可以获得所有物品，但无法转移、丢弃物品给其他玩家；交易行手续费为30%；无法进入神秘矿洞；无法使用大药仓库功能。|0|0;获得信用分的方式有：
Ⅰ.参加焰火屠魔、世界首领、精英怪、藏经峡谷、散财猪、水晶珍宝战、沙巴克藏宝阁等活动或在野外击败首领和精英怪；
Ⅱ.参加地下夺宝并在活动时间内点击到活动角色；
Ⅲ.完成跑蛛丝挑战；
Ⅳ.首次锻造金刚石；
Ⅴ.在商城购买绑定道具；
Ⅵ.鉴定金刚石、锻造武器等；
Ⅶ.使用祝福油；
Ⅷ.还有许多增加信用分的方式，等待你去发现。|0|0]],
		NeedServerStep = 0,
		Aim = "信用验证用户"
	}
}

return growthRoadConfig
