local honortitle = {
	{
		PropertyStr = "生命值=18;强攻伤害=58",
		Name = "沙城霸主",
		OnlyTitle = 1,
		Time = 168,
		Descr = "君临天下的荣耀象征"
	},
	{
		PropertyStr = "攻击下限=3;攻击上限=5;防御下限=0;防御上限=1;魔御下限=0;魔御上限=1",
		Name = "玛法战神",
		OnlyTitle = 1,
		Time = 168,
		Descr = "战士之巅的至高荣耀"
	},
	{
		PropertyStr = "攻击下限=3;攻击上限=5;防御下限=0;防御上限=1;魔御下限=0;魔御上限=1",
		Name = "玛法战魁",
		OnlyTitle = 1,
		Time = 168,
		Descr = "战士之巅的至高荣耀"
	},
	{
		PropertyStr = "魔法下限=3;魔法上限=5;防御下限=0;防御上限=1;魔御下限=0;魔御上限=1",
		Name = "玛法魔君",
		OnlyTitle = 1,
		Time = 168,
		Descr = "法师之巅的至高荣耀"
	},
	{
		PropertyStr = "魔法下限=3;魔法上限=5;防御下限=0;防御上限=1;魔御下限=0;魔御上限=1",
		Name = "玛法魔灵",
		OnlyTitle = 1,
		Time = 168,
		Descr = "法师之巅的至高荣耀"
	},
	{
		PropertyStr = "道术下限=3;道术上限=5;防御下限=0;防御上限=1;魔御下限=0;魔御上限=1",
		Name = "玛法仙尊",
		OnlyTitle = 1,
		Time = 168,
		Descr = "道士之巅的至高荣耀"
	},
	{
		PropertyStr = "道术下限=3;道术上限=5;防御下限=0;防御上限=1;魔御下限=0;魔御上限=1",
		Name = "玛法仙姬",
		OnlyTitle = 1,
		Time = 168,
		Descr = "道士之巅的至高荣耀"
	},
	{
		PropertyStr = "攻击下限=10;攻击上限=20;魔法下限=10;魔法上限=20;道术下限=10;道术上限=20",
		Name = "劳动最光荣",
		OnlyTitle = 0,
		Time = 720,
		Descr = "热爱劳动的勇士"
	},
	{
		PropertyStr = "防御下限=1;防御上限=5;魔御下限=1;魔御上限=5;生命值=68",
		Name = "优秀青年",
		OnlyTitle = 0,
		Time = 720,
		Descr = "当代的优秀青年"
	},
	{
		PropertyStr = "攻击下限=5;攻击上限=10;魔法下限=5;魔法上限=10;道术下限=5;道术上限=10",
		Name = "闪耀之星",
		OnlyTitle = 0,
		Time = 192,
		Descr = "你就是最闪耀的星"
	},
	{
		PropertyStr = "攻击下限=3;攻击上限=3;魔法下限=3;魔法上限=3;道术下限=3;道术上限=3",
		Name = "优秀会长",
		OnlyTitle = 0,
		Time = 360,
		Descr = "新区优秀公会奖励"
	},
	{
		PropertyStr = "攻击下限=5;攻击上限=5;魔法下限=5;魔法上限=5;道术下限=5;道术上限=5;暴击概率=10",
		Name = "难得有情人",
		OnlyTitle = 0,
		Time = 360,
		Descr = "有情人终成眷属"
	},
	{
		PropertyStr = "攻击下限=5;攻击上限=10;魔法下限=5;魔法上限=10;道术下限=5;道术上限=10",
		Name = "单身贵族",
		OnlyTitle = 0,
		Time = 720,
		Descr = "单身是一种态度"
	},
	{
		PropertyStr = "攻击下限=10;攻击上限=20;魔法下限=10;魔法上限=20;道术下限=10;道术上限=20",
		Name = "童心未泯",
		OnlyTitle = 0,
		Time = 720,
		Descr = "保留着孩童般的纯真"
	},
	{
		PropertyStr = "攻击下限=5;攻击上限=5;魔法下限=5;魔法上限=5;道术下限=5;道术上限=5;暴击概率=10",
		Name = "路漫漫其修远兮",
		OnlyTitle = 0,
		Time = 720,
		Descr = "吾将上下而求索"
	},
	{
		PropertyStr = "攻击下限=10;攻击上限=20;魔法下限=10;魔法上限=20;道术下限=10;道术上限=20",
		Name = "夏日狂欢",
		OnlyTitle = 0,
		Time = 720,
		Descr = "畅爽一夏"
	},
	{
		PropertyStr = "攻击下限=5;攻击上限=5;魔法下限=5;魔法上限=5;道术下限=5;道术上限=5;暴击概率=10",
		Name = "浪漫七夕",
		OnlyTitle = 0,
		Time = 720,
		Descr = "让我们鹊桥相会"
	},
	{
		PropertyStr = "攻击下限=10;攻击上限=20;魔法下限=10;魔法上限=20;道术下限=10;道术上限=20",
		Name = "辛勤园丁",
		OnlyTitle = 0,
		Time = 720,
		Descr = "致敬那些可爱的教师们"
	},
	{
		PropertyStr = "攻击下限=5;攻击上限=5;魔法下限=5;魔法上限=5;道术下限=5;道术上限=5;暴击概率=10",
		Name = "花好月圆",
		OnlyTitle = 0,
		Time = 720,
		Descr = "团团圆圆赏明月"
	},
	{
		PropertyStr = "攻击下限=10;攻击上限=20;魔法下限=10;魔法上限=20;道术下限=10;道术上限=20",
		Name = "举国同庆",
		OnlyTitle = 0,
		Time = 720,
		Descr = "爱我中华"
	},
	{
		PropertyStr = "攻击下限=10;攻击上限=20;魔法下限=10;魔法上限=20;道术下限=10;道术上限=20",
		Name = "荣耀军需官",
		OnlyTitle = 0,
		Time = 336,
		Descr = "荣耀的象征"
	},
	{
		PropertyStr = "攻击下限=5;攻击上限=10;魔法下限=5;魔法上限=10;道术下限=5;道术上限=10",
		Name = "护花圣手",
		OnlyTitle = 0,
		Time = 720,
		Descr = "赠人鲜花手留余香"
	},
	{
		PropertyStr = "攻击下限=10;攻击上限=20;魔法下限=10;魔法上限=20;道术下限=10;道术上限=20",
		Name = "国士无双",
		OnlyTitle = 0,
		Time = 720,
		Descr = "人气之最"
	},
	{
		PropertyStr = "攻击下限=10;攻击上限=20;魔法下限=10;魔法上限=20;道术下限=10;道术上限=20",
		Name = "国色天香",
		OnlyTitle = 0,
		Time = 720,
		Descr = "人气之最"
	},
	{
		PropertyStr = "攻击下限=5;攻击上限=10;魔法下限=5;魔法上限=10;道术下限=5;道术上限=10",
		Name = "缘定三生",
		OnlyTitle = 0,
		Time = 720,
		Descr = "确认过眼神"
	},
	{
		PropertyStr = "攻击下限=5;攻击上限=25;魔法下限=5;魔法上限=25;道术下限=5;道术上限=25",
		Name = "跨服·城主",
		OnlyTitle = 0,
		Time = 240,
		Descr = "跨服沙巴克城主"
	},
	{
		PropertyStr = "攻击下限=5;攻击上限=20;魔法下限=5;魔法上限=20;道术下限=5;道术上限=20",
		Name = "跨服·英雄",
		OnlyTitle = 0,
		Time = 240,
		Descr = "跨服沙巴克成员"
	},
	{
		PropertyStr = "攻击下限=5;攻击上限=15;魔法下限=5;魔法上限=15;道术下限=5;道术上限=15",
		Name = "跨服·勇士",
		OnlyTitle = 0,
		Time = 240,
		Descr = "跨服沙巴克参与成员"
	},
	{
		PropertyStr = "攻击下限=5;攻击上限=25;魔法下限=5;魔法上限=25;道术下限=5;道术上限=25",
		Name = "乱斗王者",
		OnlyTitle = 0,
		Time = 240,
		Descr = "跨服大乱斗冠军"
	},
	{
		PropertyStr = "攻击下限=5;攻击上限=20;魔法下限=5;魔法上限=20;道术下限=5;道术上限=20",
		Name = "乱斗勇士",
		OnlyTitle = 0,
		Time = 240,
		Descr = "跨服大乱斗勇士"
	},
	{
		PropertyStr = "攻击下限=5;攻击上限=10;魔法下限=5;魔法上限=10;道术下限=5;道术上限=10;防御下限=5;防御上限=5;魔御下限=5;魔御上限=5;生命值=50",
		Name = "玛法骑士团",
		OnlyTitle = 0,
		Time = 336,
		Descr = "守卫玛法大陆的勇士们"
	},
	{
		PropertyStr = "麻痹=1000;伤害减免=8;攻击下限=0;攻击上限=50;魔法下限=0;魔法上限=50;道术下限=0;道术上限=50",
		Name = "抖音大神",
		OnlyTitle = 0,
		Time = 168,
		Descr = "巅峰大神人气之最"
	},
	{
		PropertyStr = "麻痹=800;伤害减免=6;攻击下限=0;攻击上限=35;魔法下限=0;魔法上限=35;道术下限=0;道术上限=35",
		Name = "抖音达人",
		OnlyTitle = 0,
		Time = 168,
		Descr = "群星闪耀你最闪亮"
	},
	{
		PropertyStr = "麻痹=500;伤害减免=3;攻击下限=0;攻击上限=30;魔法下限=0;魔法上限=30;道术下限=0;道术上限=30",
		Name = "抖音明星",
		OnlyTitle = 0,
		Time = 168,
		Descr = "你就是耀眼的明星"
	},
	{
		PropertyStr = "攻击下限=10;攻击上限=20;魔法下限=10;魔法上限=20;道术下限=10;道术上限=20;生命值=50",
		Name = "2018玛法盛典",
		OnlyTitle = 0,
		Time = 8760,
		Descr = "2018周年庆纪念称号"
	},
	{
		PropertyStr = "攻击下限=9;攻击上限=19;魔法下限=9;魔法上限=19;道术下限=9;道术上限=19;生命值=40",
		Name = "2018玛法庆典",
		OnlyTitle = 0,
		Time = 4320,
		Descr = "2018周年庆纪念称号"
	},
	{
		PropertyStr = "攻击下限=8;攻击上限=18;魔法下限=8;魔法上限=18;道术下限=8;道术上限=18;生命值=30",
		Name = "2018玛法大典",
		OnlyTitle = 0,
		Time = 1440,
		Descr = "2018周年庆纪念称号"
	},
	{
		PropertyStr = "攻击下限=5;攻击上限=15;魔法下限=5;魔法上限=15;道术下限=5;道术上限=15;生命值=10",
		Name = "2018周年狂欢",
		OnlyTitle = 0,
		Time = 336,
		Descr = "2018周年庆纪念称号"
	},
	{
		PropertyStr = "攻击下限=5;攻击上限=15;魔法下限=5;魔法上限=15;道术下限=5;道术上限=15;生命值=10",
		Name = "欢庆传奇18周年",
		OnlyTitle = 0,
		Time = 720,
		Descr = "传奇18周年纪念称号"
	},
	{
		PropertyStr = "攻击下限=0;攻击上限=30;魔法下限=0;魔法上限=30;道术下限=0;道术上限=30",
		Name = "跨服沙城城主",
		OnlyTitle = 0,
		Time = 168,
		Descr = "跨服沙巴克城主"
	},
	{
		PropertyStr = "攻击下限=0;攻击上限=15;魔法下限=0;魔法上限=15;道术下限=0;道术上限=15",
		Name = "跨服沙城英雄",
		OnlyTitle = 0,
		Time = 168,
		Descr = "跨服沙巴克成员"
	},
	{
		PropertyStr = "攻击下限=0;攻击上限=10;魔法下限=0;魔法上限=10;道术下限=0;道术上限=10",
		Name = "跨服沙城勇士",
		OnlyTitle = 0,
		Time = 168,
		Descr = "跨服沙巴克参与成员"
	},
	{
		PropertyStr = "攻击下限=5;攻击上限=25;魔法下限=5;魔法上限=25;道术下限=5;道术上限=25",
		Name = "跨服乱斗王者",
		OnlyTitle = 0,
		Time = 168,
		Descr = "跨服大乱斗冠军"
	},
	{
		PropertyStr = "攻击下限=5;攻击上限=15;魔法下限=5;魔法上限=15;道术下限=5;道术上限=15",
		Name = "跨服乱斗勇士",
		OnlyTitle = 0,
		Time = 168,
		Descr = "跨服大乱斗勇士"
	},
	{
		PropertyStr = "攻击下限=5;攻击上限=25;魔法下限=5;魔法上限=25;道术下限=5;道术上限=25",
		Name = "竞技王者",
		OnlyTitle = 0,
		Time = 168,
		Descr = "跨服竞技场冠军"
	},
	{
		PropertyStr = "攻击下限=5;攻击上限=15;魔法下限=5;魔法上限=15;道术下限=5;道术上限=15",
		Name = "竞技英雄",
		OnlyTitle = 0,
		Time = 168,
		Descr = "跨服竞技场英雄"
	},
	{
		PropertyStr = "攻击下限=5;攻击上限=10;魔法下限=5;魔法上限=10;道术下限=5;道术上限=10",
		Name = "竞技勇士",
		OnlyTitle = 0,
		Time = 168,
		Descr = "跨服竞技场勇士"
	},
	{
		PropertyStr = "攻击下限=10;攻击上限=20;魔法下限=10;魔法上限=20;道术下限=10;道术上限=20",
		Name = "护国勇士",
		OnlyTitle = 0,
		Time = 720,
		Descr = "我的祖国由我来守护"
	},
	{
		PropertyStr = "攻击下限=10;攻击上限=20;魔法下限=10;魔法上限=20;道术下限=10;道术上限=20",
		Name = "重阳登高",
		OnlyTitle = 0,
		Time = 720,
		Descr = "登高远望赏金秋"
	},
	{
		PropertyStr = "攻击下限=5;攻击上限=25;魔法下限=5;魔法上限=25;道术下限=5;道术上限=25",
		Name = "天庭将军",
		OnlyTitle = 0,
		Time = 720,
		Descr = "天庭的巅峰"
	},
	{
		PropertyStr = "攻击下限=5;攻击上限=20;魔法下限=5;魔法上限=20;道术下限=5;道术上限=20",
		Name = "天庭统领",
		OnlyTitle = 0,
		Time = 360,
		Descr = "天庭的支柱"
	},
	{
		PropertyStr = "攻击下限=5;攻击上限=15;魔法下限=5;魔法上限=15;道术下限=5;道术上限=15",
		Name = "天庭卫士",
		OnlyTitle = 0,
		Time = 360,
		Descr = "天庭的基石"
	},
	{
		PropertyStr = "攻击下限=20;攻击上限=40;魔法下限=20;魔法上限=40;道术下限=20;道术上限=40;生命值=1000;强攻伤害=58",
		Name = "拼多多达人",
		OnlyTitle = 0,
		Time = 720,
		Descr = "拼多多活动称号"
	},
	{
		PropertyStr = "攻击下限=15;攻击上限=30;魔法下限=15;魔法上限=30;道术下限=15;道术上限=30",
		Name = "荣耀王者军需官",
		OnlyTitle = 0,
		Time = 336,
		Descr = "卓越与荣耀的象征"
	},
	{
		PropertyStr = "攻击下限=8;攻击上限=15;魔法下限=8;魔法上限=15;道术下限=8;道术上限=15;防御下限=8;防御上限=8;魔御下限=8;魔御上限=8;生命值=75",
		Name = "玛法王者骑士团",
		OnlyTitle = 0,
		Time = 336,
		Descr = "守卫玛法大陆的精英勇士们"
	},
	{
		PropertyStr = "攻击下限=10;攻击上限=20;魔法下限=10;魔法上限=20;道术下限=10;道术上限=20",
		Name = "单身的祝福",
		OnlyTitle = 0,
		Time = 720,
		Descr = "送你美好的祝福"
	},
	{
		PropertyStr = "攻击下限=15;攻击上限=30;魔法下限=15;魔法上限=30;道术下限=15;道术上限=30",
		Name = "单身贵族的祝福",
		OnlyTitle = 0,
		Time = 720,
		Descr = "送你最美好的祝福"
	},
	{
		PropertyStr = "攻击下限=15;攻击上限=30;魔法下限=15;魔法上限=30;道术下限=15;道术上限=30",
		Name = "宝库守护者",
		OnlyTitle = 0,
		Time = 168,
		Descr = "宝藏谁不爱"
	},
	{
		PropertyStr = "攻击下限=10;攻击上限=20;魔法下限=10;魔法上限=20;道术下限=10;道术上限=20",
		Name = "火鸡终结者",
		OnlyTitle = 0,
		Time = 336,
		Descr = "爱吃火鸡"
	},
	{
		PropertyStr = "攻击下限=5;攻击上限=15;魔法下限=5;魔法上限=15;道术下限=5;道术上限=15",
		Name = "平安祈祷者",
		OnlyTitle = 0,
		Time = 720,
		Descr = "圣诞快乐"
	},
	{
		PropertyStr = "攻击下限=15;攻击上限=30;魔法下限=15;魔法上限=30;道术下限=15;道术上限=30;防御下限=2;防御上限=5;魔御下限=2;魔御上限=5;强攻伤害=58",
		Name = "拼多多勇士",
		OnlyTitle = 0,
		Time = 360,
		Descr = "拼多多活动称号"
	},
	{
		PropertyStr = "攻击下限=10;攻击上限=20;魔法下限=10;魔法上限=20;道术下限=10;道术上限=20",
		Name = "腊月风和意已春",
		OnlyTitle = 0,
		Time = 336,
		Descr = "过了腊八就是年"
	},
	{
		PropertyStr = "攻击下限=1;攻击上限=5;魔法下限=1;魔法上限=5;道术下限=1;道术上限=5;防御下限=1;防御上限=2;魔御下限=1;魔御上限=2",
		Name = "3975.com宣传员",
		OnlyTitle = 0,
		Time = 360,
		Descr = "fgcq.3975.com下载复古传奇，了解游戏最新资讯"
	},
	{
		PropertyStr = "攻击下限=5;攻击上限=15;魔法下限=5;魔法上限=15;道术下限=5;道术上限=15",
		Name = "2019辞旧迎新",
		OnlyTitle = 0,
		Time = 720,
		Descr = "欢欢喜喜过新年"
	},
	{
		PropertyStr = "攻击下限=10;攻击上限=20;魔法下限=10;魔法上限=20;道术下限=10;道术上限=20",
		Name = "团团圆圆",
		OnlyTitle = 0,
		Time = 336,
		Descr = "团团圆圆过元宵"
	},
	{
		PropertyStr = "攻击下限=10;攻击上限=20;魔法下限=10;魔法上限=20;道术下限=10;道术上限=20",
		Name = "皇后恋曲",
		OnlyTitle = 0,
		Time = 360,
		Descr = "百分之百的爱"
	},
	{
		PropertyStr = "攻击下限=15;攻击上限=30;魔法下限=15;魔法上限=30;道术下限=15;道术上限=30",
		Name = "春分抬头",
		OnlyTitle = 0,
		Time = 168,
		Descr = "二月二龙抬头"
	},
	{
		PropertyStr = "攻击下限=5;攻击上限=15;魔法下限=5;魔法上限=15;道术下限=5;道术上限=15",
		Name = "绝代佳人",
		OnlyTitle = 0,
		Time = 720,
		Descr = "独一无二的美丽女人"
	},
	{
		PropertyStr = "攻击下限=15;攻击上限=30;魔法下限=15;魔法上限=30;道术下限=15;道术上限=30",
		Name = "最强王者",
		OnlyTitle = 0,
		Time = 168,
		Descr = "战队锦标赛荣耀巅峰"
	}
}

return honortitle
