local milRankCompMsg = {
	{
		msg = [[
坚固木盾合成说明：
1.所需材料：|粗制木盾*6|
2.合成成功率：100%
3.该装备属性：攻击：2-6、魔法：2-6、道术：2-6、打怪回复+2
4.合成时优先消耗绑定材料]],
		milkRankName = "坚固木盾"
	},
	{
		msg = [[
军用铜盾合成说明：
1.所需材料：|坚固木盾*6|
2.合成成功率：100%
3.该装备属性：攻击：3-10、魔法：3-10、道术：3-10、打怪回复+3
4.合成时优先消耗绑定材料]],
		milkRankName = "军用铜盾"
	},
	{
		msg = [[
绿营铜盾合成说明：
1.所需材料：|军用铜盾*3、盾牌精华*50|
2.合成成功率：100%
3.该装备属性：攻击：4-18、魔法：4-18、道术：4-18、打怪回复+4
4.合成时优先消耗绑定材料]],
		milkRankName = "绿营铜盾"
	},
	{
		msg = [[
振威银盾合成说明：
1.所需材料：|绿营铜盾*1、盾牌精华*160|
2.合成成功率：100%
3.该装备属性：攻击：5-26、魔法：5-26、道术：5-26、打怪回复+5
4.合成时优先消耗绑定材料]],
		milkRankName = "振威银盾"
	},
	{
		msg = [[
护国银盾合成说明：
1.所需材料：|振威银盾*1、盾牌精华*280|
2.合成成功率：100%
3.该装备属性：攻击：7-36、魔法：7-36、道术：7-36、打怪回复+6
4.合成时优先消耗绑定材料]],
		milkRankName = "护国银盾"
	},
	{
		msg = [[
鸟纹玉佩合成说明：
1.所需材料：|谷纹玉佩*6|
2.合成成功率：100%
3.该装备属性：攻击：2-6、魔法：2-6、道术：2-6、防御：0-2
4.合成时优先消耗绑定材料]],
		milkRankName = "鸟纹玉佩"
	},
	{
		msg = [[
鱼纹玉佩合成说明：
1.所需材料：|鸟纹玉佩*6|
2.合成成功率：100%
3.该装备属性：攻击：3-10、魔法：3-10、道术：3-10、防御：1-3
4.合成时优先消耗绑定材料]],
		milkRankName = "鱼纹玉佩"
	},
	{
		msg = [[
兽纹玉佩合成说明：
1.所需材料：|鱼纹玉佩*3、玉佩精华*50|
2.合成成功率：100%
3.该装备属性：攻击：4-18、魔法：4-18、道术：4-18、防御：1-4
4.合成时优先消耗绑定材料]],
		milkRankName = "兽纹玉佩"
	},
	{
		msg = [[
云纹玉佩合成说明：
1.所需材料：|兽纹玉佩*1、玉佩精华*160|
2.合成成功率：100%
3.该装备属性：攻击：5-26、魔法：5-26、道术：5-26、防御：2-5
4.合成时优先消耗绑定材料]],
		milkRankName = "云纹玉佩"
	},
	{
		msg = [[
螭纹玉佩合成说明：
1.所需材料：|云纹玉佩*1、玉佩精华*280|
2.合成成功率：100%
3.该装备属性：攻击：7-36、魔法：7-36、道术：7-36、防御：3-6
4.合成时优先消耗绑定材料]],
		milkRankName = "螭纹玉佩"
	},
	{
		msg = [[
精雕虎符合成说明：
1.所需材料：|木质虎符*6|
2.合成成功率：100%
3.该装备属性：攻击：2-6、魔法：2-6、道术：2-6、魔御：0-2
4.合成时优先消耗绑定材料]],
		milkRankName = "精雕虎符"
	},
	{
		msg = [[
黄铜虎符合成说明：
1.所需材料：|精雕虎符*6|
2.合成成功率：100%
3.该装备属性：攻击：3-10、魔法：3-10、道术：3-10、魔御：1-3
4.合成时优先消耗绑定材料]],
		milkRankName = "黄铜虎符"
	},
	{
		msg = [[
精铜虎符合成说明：
1.所需材料：|黄铜虎符*3、兵符精华*50|
2.合成成功率：100%
3.该装备属性：攻击：4-18、魔法：4-18、道术：4-18、魔御：1-4
4.合成时优先消耗绑定材料]],
		milkRankName = "精铜虎符"
	},
	{
		msg = [[
白银虎符合成说明：
1.所需材料：|精铜虎符*1、兵符精华*160|
2.合成成功率：100%
3.该装备属性：攻击：5-26、魔法：5-26、道术：5-26、魔御：2-5
4.合成时优先消耗绑定材料]],
		milkRankName = "白银虎符"
	},
	{
		msg = [[
秘银虎符合成说明：
1.所需材料：|白银虎符*1、兵符精华*280|
2.合成成功率：100%
3.该装备属性：攻击：7-36、魔法：7-36、道术：7-36、魔御：3-6
4.合成时优先消耗绑定材料]],
		milkRankName = "秘银虎符"
	},
	{
		msg = [[
蓝羽翎合成说明：
1.所需材料：|黑羽翎*6|
2.合成成功率：100%
3.该装备属性：攻击：2-7、魔法：2-7、道术：2-7
4.合成时优先消耗绑定材料]],
		milkRankName = "蓝羽翎"
	},
	{
		msg = [[
青羽翎合成说明：
1.所需材料：|蓝羽翎*6|
2.合成成功率：100%
3.该装备属性：攻击：3-12、魔法：3-12、道术：3-12
4.合成时优先消耗绑定材料]],
		milkRankName = "青羽翎"
	},
	{
		msg = [[
湖蓝羽翎合成说明：
1.所需材料：|青羽翎*3、花翎精华*50|
2.合成成功率：100%
3.该装备属性：攻击：4-20、魔法：4-20、道术：4-20
4.合成时优先消耗绑定材料]],
		milkRankName = "湖蓝羽翎"
	},
	{
		msg = [[
藏青羽翎合成说明：
1.所需材料：|湖蓝羽翎*1、花翎精华*160|
2.合成成功率：100%
3.该装备属性：攻击：5-29、魔法：5-29、道术：5-29
4.合成时优先消耗绑定材料]],
		milkRankName = "藏青羽翎"
	},
	{
		msg = [[
玄紫羽翎合成说明：
1.所需材料：|藏青羽翎*1、花翎精华*280|
2.合成成功率：100%
3.该装备属性：攻击：7-40、魔法：7-40、道术：7-40
4.合成时优先消耗绑定材料]],
		milkRankName = "玄紫羽翎"
	}
}

return milRankCompMsg
