local notice35 = {
	{
		notice_text = "小贴士:在苍月岛武器店锻造武器会获得信用分"
	},
	{
		notice_text = "小贴士:活力和精力可以使你在打怪时获得额外的多倍经验"
	},
	{
		notice_text = "小贴士:别忘了去比奇皇宫前的天下第一雕像膜拜获取奖励"
	},
	{
		notice_text = "小贴士:虔诚挂坠可以用来进行虔诚膜拜获取精力值"
	},
	{
		notice_text = "小贴士:时刻关注聊天框的怪物信息有助于更好的找到首领"
	},
	{
		notice_text = "小贴士:使用飞鞋功能可以随时传送到指定的地图"
	},
	{
		notice_text = "小贴士:30级之后随着等级提升也会获得大量主属性提升"
	},
	{
		notice_text = "小贴士:死亡时穿戴的首饰和衣服是有几率会爆出的"
	},
	{
		notice_text = "小贴士:使用微端的玩家在无线网络状态时下载完整资源可以获得下载福利"
	},
	{
		notice_text = "小贴士:每日活力值会在0点和8点刷新，不在线也会获得"
	},
	{
		notice_text = "小贴士:在盟重安全区活动使者处可以购买月卡礼包和迎新礼包"
	},
	{
		notice_text = "小贴士:沃玛级以上的武器和首饰都可以在庄园进行装备精炼"
	},
	{
		notice_text = "小贴士:装备精炼后可以获得强大的精炼属性"
	},
	{
		notice_text = "小贴士:装备死亡爆出时，精炼属性也会消失"
	},
	{
		notice_text = "小贴士:“界面”功能可以自由摆放你的按钮"
	}
}

return notice35
