local notice0 = {
	{
		notice_text = "小贴士:等级达到20级并成为验证用户后才可以面对面交易"
	},
	{
		notice_text = "小贴士:获取30信用分后可在仓库管理员和老兵处成为验证用户"
	},
	{
		notice_text = "小贴士:商城中购买指定商品可以获得信用分"
	},
	{
		notice_text = "小贴士:与其他角色组队击杀首领可以获得信用分"
	},
	{
		notice_text = "小贴士:金刚石可以找庄园中的炼金师用灵符锻造获得"
	},
	{
		notice_text = "小贴士:使用微端的玩家在无线网络状态时下载完整资源可以获得下载福利"
	},
	{
		notice_text = "小贴士:找到庄园锻造师可以使用金刚石锻造武器"
	},
	{
		notice_text = "小贴士:主界面中点击血球菜单可以打开功能列表"
	},
	{
		notice_text = "小贴士:在神秘矿洞开启时可以进入挖矿"
	},
	{
		notice_text = "小贴士:“界面”功能可以自由摆放你的按钮"
	},
	{
		notice_text = "小贴士:可以在设置-辅助中设置自动练功"
	},
	{
		notice_text = "小贴士:魔龙之血可以在打怪时更快地消耗活力值和精力值"
	},
	{
		notice_text = "小贴士:输入聊天文字后点击“发送”按钮即可"
	},
	{
		notice_text = "小贴士:聊天中还可以发送装备、物品、坐标等信息"
	},
	{
		notice_text = "小贴士:放在主界面的技能才能在挂机时使用"
	},
	{
		notice_text = "小贴士:在设置-辅助中选择挂机时使用的技能"
	},
	{
		notice_text = "小贴士:在各城市安全区小贩处可以用金币购买商店装备"
	},
	{
		notice_text = "小贴士:在各城市的书店老板那里可以用金币购买技能书"
	},
	{
		notice_text = "小贴士:使用飞鞋功能可以随时传送到指定的地图"
	},
	{
		notice_text = "小贴士:别忘了背包里的新手礼包，在35级前可以领取大量药品"
	},
	{
		notice_text = "小贴士:双击背包中的物品可以快速使用"
	},
	{
		notice_text = "小贴士:只能在安全区领取邮件中的附件"
	},
	{
		notice_text = "小贴士:储存的经验可以在水晶鉴定师使用活力或精力提取"
	},
	{
		notice_text = "小贴士:从“界面”拖出“下属”按钮，才能操纵宝宝切换攻击/休息状态"
	},
	{
		notice_text = "小贴士:30级之后随着等级提升也会获得大量主属性提升"
	},
	{
		notice_text = "小贴士:死亡时穿戴的装备是有几率会爆出的"
	},
	{
		notice_text = "小贴士:每日活力值会在0点和8点刷新，不在线也会获得"
	}
}

return notice0
