local PetAptPropertyCfg = {
	[0] = {
		PropertyStr = "攻击下限=0;攻击上限=0;魔法下限=0;魔法上限=0;道术下限=0;道术上限=0;战士生命值=0;法师生命值=0;道士生命值=0"
	},
	{
		PropertyStr = "攻击下限=1;攻击上限=2;魔法下限=1;魔法上限=2;道术下限=1;道术上限=2;战士生命值=20;法师生命值=8;道士生命值=20"
	},
	{
		PropertyStr = "攻击下限=2;攻击上限=4;魔法下限=2;魔法上限=4;道术下限=2;道术上限=4;战士生命值=40;法师生命值=16;道士生命值=40"
	},
	{
		PropertyStr = "攻击下限=3;攻击上限=6;魔法下限=3;魔法上限=6;道术下限=3;道术上限=6;战士生命值=60;法师生命值=24;道士生命值=60"
	},
	{
		PropertyStr = "攻击下限=4;攻击上限=8;魔法下限=4;魔法上限=8;道术下限=4;道术上限=8;战士生命值=80;法师生命值=32;道士生命值=80"
	},
	{
		PropertyStr = "攻击下限=5;攻击上限=10;魔法下限=5;魔法上限=10;道术下限=5;道术上限=10;战士生命值=100;法师生命值=40;道士生命值=100"
	},
	{
		PropertyStr = "攻击下限=6;攻击上限=12;魔法下限=6;魔法上限=12;道术下限=6;道术上限=12;战士生命值=120;法师生命值=48;道士生命值=120"
	},
	{
		PropertyStr = "攻击下限=7;攻击上限=14;魔法下限=7;魔法上限=14;道术下限=7;道术上限=14;战士生命值=140;法师生命值=56;道士生命值=140"
	},
	{
		PropertyStr = "攻击下限=8;攻击上限=16;魔法下限=8;魔法上限=16;道术下限=8;道术上限=16;战士生命值=160;法师生命值=64;道士生命值=160"
	},
	{
		PropertyStr = "攻击下限=9;攻击上限=18;魔法下限=9;魔法上限=18;道术下限=9;道术上限=18;战士生命值=180;法师生命值=72;道士生命值=180"
	},
	{
		PropertyStr = "攻击下限=10;攻击上限=20;魔法下限=10;魔法上限=20;道术下限=10;道术上限=20;战士生命值=200;法师生命值=80;道士生命值=200"
	},
	{
		PropertyStr = "攻击下限=11;攻击上限=22;魔法下限=11;魔法上限=22;道术下限=11;道术上限=22;战士生命值=220;法师生命值=88;道士生命值=220"
	},
	{
		PropertyStr = "攻击下限=12;攻击上限=24;魔法下限=12;魔法上限=24;道术下限=12;道术上限=24;战士生命值=240;法师生命值=96;道士生命值=240"
	},
	{
		PropertyStr = "攻击下限=13;攻击上限=26;魔法下限=13;魔法上限=26;道术下限=13;道术上限=26;战士生命值=260;法师生命值=104;道士生命值=260"
	},
	{
		PropertyStr = "攻击下限=14;攻击上限=28;魔法下限=14;魔法上限=28;道术下限=14;道术上限=28;战士生命值=280;法师生命值=112;道士生命值=280"
	},
	{
		PropertyStr = "攻击下限=15;攻击上限=30;魔法下限=15;魔法上限=30;道术下限=15;道术上限=30;战士生命值=300;法师生命值=120;道士生命值=300"
	},
	{
		PropertyStr = "攻击下限=16;攻击上限=32;魔法下限=16;魔法上限=32;道术下限=16;道术上限=32;战士生命值=320;法师生命值=128;道士生命值=320"
	},
	{
		PropertyStr = "攻击下限=17;攻击上限=34;魔法下限=17;魔法上限=34;道术下限=17;道术上限=34;战士生命值=340;法师生命值=136;道士生命值=340"
	},
	{
		PropertyStr = "攻击下限=18;攻击上限=36;魔法下限=18;魔法上限=36;道术下限=18;道术上限=36;战士生命值=360;法师生命值=144;道士生命值=360"
	},
	{
		PropertyStr = "攻击下限=19;攻击上限=38;魔法下限=19;魔法上限=38;道术下限=19;道术上限=38;战士生命值=380;法师生命值=152;道士生命值=380"
	},
	{
		PropertyStr = "攻击下限=20;攻击上限=40;魔法下限=20;魔法上限=40;道术下限=20;道术上限=40;战士生命值=400;法师生命值=160;道士生命值=400"
	},
	{
		PropertyStr = "攻击下限=21;攻击上限=42;魔法下限=21;魔法上限=42;道术下限=21;道术上限=42;战士生命值=420;法师生命值=168;道士生命值=420"
	},
	{
		PropertyStr = "攻击下限=22;攻击上限=44;魔法下限=22;魔法上限=44;道术下限=22;道术上限=44;战士生命值=440;法师生命值=176;道士生命值=440"
	},
	{
		PropertyStr = "攻击下限=23;攻击上限=46;魔法下限=23;魔法上限=46;道术下限=23;道术上限=46;战士生命值=460;法师生命值=184;道士生命值=460"
	},
	{
		PropertyStr = "攻击下限=24;攻击上限=48;魔法下限=24;魔法上限=48;道术下限=24;道术上限=48;战士生命值=480;法师生命值=192;道士生命值=480"
	},
	{
		PropertyStr = "攻击下限=25;攻击上限=50;魔法下限=25;魔法上限=50;道术下限=25;道术上限=50;战士生命值=500;法师生命值=200;道士生命值=500"
	},
	{
		PropertyStr = "攻击下限=26;攻击上限=52;魔法下限=26;魔法上限=52;道术下限=26;道术上限=52;战士生命值=520;法师生命值=208;道士生命值=520"
	},
	{
		PropertyStr = "攻击下限=27;攻击上限=54;魔法下限=27;魔法上限=54;道术下限=27;道术上限=54;战士生命值=540;法师生命值=216;道士生命值=540"
	},
	{
		PropertyStr = "攻击下限=28;攻击上限=56;魔法下限=28;魔法上限=56;道术下限=28;道术上限=56;战士生命值=560;法师生命值=224;道士生命值=560"
	},
	{
		PropertyStr = "攻击下限=29;攻击上限=58;魔法下限=29;魔法上限=58;道术下限=29;道术上限=58;战士生命值=580;法师生命值=232;道士生命值=580"
	},
	{
		PropertyStr = "攻击下限=30;攻击上限=60;魔法下限=30;魔法上限=60;道术下限=30;道术上限=60;战士生命值=600;法师生命值=240;道士生命值=600"
	}
}

return PetAptPropertyCfg
