local WingActivateCfg = {
	{
		NeedWingLv = 5,
		Name = "纯洁之翼",
		Img = "cjzy",
		NeedWhiteFeatherNum = 50,
		Kind = 0,
		PropertyStr = "战士守护减免=10;法师守护减免=10;道士守护减免=10;战士守护概率=5;法师守护概率=3;道士守护概率=4;战士暴击系数=0;法师暴击系数=0;道士暴击系数=0;战士暴击概率=0;法师暴击概率=0;道士暴击概率=0;防御下限=2;防御上限=2;魔御下限=2;魔御上限=2;攻击下限=0;攻击上限=0;魔法下限=0;魔法上限=0;道术下限=0;道术上限=0"
	},
	{
		NeedWingLv = 21,
		Name = "疯狂之翼",
		Img = "fkzy",
		NeedWhiteFeatherNum = 50,
		Kind = 1,
		PropertyStr = "战士守护减免=0;法师守护减免=0;道士守护减免=0;战士守护概率=0;法师守护概率=0;道士守护概率=0;战士暴击系数=50;法师暴击系数=50;道士暴击系数=50;战士暴击概率=10;法师暴击概率=7;道士暴击概率=7;防御下限=0;防御上限=0;魔御下限=0;魔御上限=0;攻击下限=2;攻击上限=2;魔法下限=2;魔法上限=2;道术下限=2;道术上限=2"
	},
	{
		NeedWingLv = 35,
		Name = "大天使之翼",
		Img = "dtszy",
		NeedWhiteFeatherNum = 150,
		Kind = 0,
		PropertyStr = "战士守护减免=20;法师守护减免=20;道士守护减免=20;战士守护概率=10;法师守护概率=7;道士守护概率=8;战士暴击系数=0;法师暴击系数=0;道士暴击系数=0;战士暴击概率=0;法师暴击概率=0;道士暴击概率=0;防御下限=5;防御上限=5;魔御下限=5;魔御上限=5;攻击下限=0;攻击上限=0;魔法下限=0;魔法上限=0;道术下限=0;道术上限=0"
	},
	{
		NeedWingLv = 50,
		Name = "大魔神之翼",
		Img = "dmszy",
		NeedWhiteFeatherNum = 150,
		Kind = 1,
		PropertyStr = "战士守护减免=0;法师守护减免=0;道士守护减免=0;战士守护概率=0;法师守护概率=0;道士守护概率=0;战士暴击系数=100;法师暴击系数=100;道士暴击系数=100;战士暴击概率=20;法师暴击概率=14;道士暴击概率=14;防御下限=0;防御上限=0;魔御下限=0;魔御上限=0;攻击下限=4;攻击上限=4;魔法下限=4;魔法上限=4;道术下限=4;道术上限=4"
	},
	{
		NeedWingLv = 70,
		Name = "辉煌天使之翼",
		Img = "hhtszy",
		NeedWhiteFeatherNum = 250,
		Kind = 0,
		PropertyStr = "战士守护减免=40;法师守护减免=40;道士守护减免=40;战士守护概率=20;法师守护概率=14;道士守护概率=16;战士暴击系数=0;法师暴击系数=0;道士暴击系数=0;战士暴击概率=0;法师暴击概率=0;道士暴击概率=0;防御下限=8;防御上限=8;魔御下限=8;魔御上限=8;攻击下限=0;攻击上限=0;魔法下限=0;魔法上限=0;道术下限=0;道术上限=0"
	},
	{
		NeedWingLv = 90,
		Name = "傲气魔神之翼",
		Img = "aqmszy",
		NeedWhiteFeatherNum = 250,
		Kind = 1,
		PropertyStr = "战士守护减免=0;法师守护减免=0;道士守护减免=0;战士守护概率=0;法师守护概率=0;道士守护概率=0;战士暴击系数=150;法师暴击系数=150;道士暴击系数=150;战士暴击概率=30;法师暴击概率=21;道士暴击概率=21;防御下限=0;防御上限=0;魔御下限=0;魔御上限=0;攻击下限=6;攻击上限=6;魔法下限=6;魔法上限=6;道术下限=6;道术上限=6"
	}
}

return WingActivateCfg
