UIStrConfig:Add(
{
	['friend101'] = '好友',
	['friend102'] = '亲密度',
	['friend103'] = '帮派',
	['friend104'] = '推荐好友',
	['friend105'] = '添加好友',
	['friend106'] = '搜索：联系人,好友',
	['friend107'] = '无好友搜索结果',
	['friend108'] = '亲密度效果说明',
	['friend109'] = "<u>属性加成</u>",
	
	['friend201'] = '输入玩家昵称进行添加',
	
	['friend301'] = '推荐好友',
	['friend302'] = '添加好友',
	['friend303'] = '全部添加',
	['friend304'] = '换一批',
	['friend305'] = "好友申请",
	['friend306'] = "以下玩家请求添加您为好友：",
	['friend307'] = "全选",
	
	['friend401'] = "我知道了",
}
)