UIStrConfig:Add(
{
	['team1'] = '队伍',
	['team2'] = '我的队伍',
	['team3'] = '附近队伍',
	['team4'] = '附近玩家',
	['team5'] = '没有组队时，自动接受他人发出的组队邀请',
	['team6'] = '我是队长时，自动接受他人发出的入队申请',
	['team7'] = '创建队伍',
	['team8'] = '查看资料',
	['team9'] = '加为好友',
	['team10'] = '退出队伍',
	['team11'] = '任命队长',
	['team12'] = '开除队友',
	['team13'] = '添加队员',
	['team14'] = '刷新列表',
	-- ['team15'] = "同意", --UITeamConfirm 删除，2014年10月29日20:19:34
	-- ['team16'] = "拒绝",
	-- ['team17'] = "入队确认",
	['team18'] = "申请加入",
	['team19'] = "邀请",
}
)