local healthy = {
    vt = 3600, --游客体验游戏时间(秒)
    v_disDay = 15, --游客再次体检时间间隔，15天内不允许重复提供游客体验
    logout = {22, 8}, --未成年不能登录游戏的时间
    playTime = {3, 1.5}, --未成年每日累计玩游戏时间，{节假日累计时间，其他日期累计时间}
    rlimit = {
        [1] = {100, 400}, --{单次充值限制，月累计充值限制}
        [2] = {50, 200}, --{单次充值限制，月累计充值限制}
    },
    holiday = {
        [2020] = {
            rest = {--休息日，以月份配置
                [1] = {1, {24, 30}},
                [4] = {{4, 6}},
                [5] = {{1, 5}},
                [6] = {{25, 27}},
                [10] = {{1, 8}},
            },
            work = {--周六日上班配置
                [1] = {19},
                [2] = {1},
                [4] = {26},
                [5] = {9},
                [6] = {28},
                [9] = {27},
                [10] = {10},
            },
        },
    },
}

return healthy

