----------------------------------------------------
-- 此文件由数据工具生成
-- 配置数据--encounter_data.xml
--------------------------------------

Config = Config or {} 
Config.EncounterData = Config.EncounterData or {}

-- -------------------encounter_const_start-------------------
Config.EncounterData.data_encounter_const_length = 3
Config.EncounterData.data_encounter_const = {
	["encounter_lev"] = {key="encounter_lev", val=15, desc="玩家等级"},
	["encounter_update_time"] = {key="encounter_update_time", val={{0,3600},{43200,46800}}, desc="刷新时间段"},
	["rules"] = {key="rules", val=1, desc="1.在每天的0点-1点，12点-13点这两个时间段会刷新出新的物语。\n2.已经解锁的英雄伙伴才有机会触发对应的物语。\n3.达到对应的等级和战斗力也可以触发不同的物语。\n4.已获得的物语可以通过物语图鉴查看。"}
}
Config.EncounterData.data_encounter_const_fun = function(key)
	local data=Config.EncounterData.data_encounter_const[key]
	if DATA_DEBUG and data == nil then
		print('(Config.EncounterData.data_encounter_const['..key..'])not found') return
	end
	return data
end
-- -------------------encounter_const_end---------------------


-- -------------------encounter_info_start-------------------
Config.EncounterData.data_encounter_info_length = 40
Config.EncounterData.data_encounter_info = {
	[1] = {id=1, partner_bid=20402, star=4, weight=75, first_power=0, first_lev=0, reward={{1,{1201101}},{2,{1201101}},{3,{1201101}}}, question="0", answer={{1,[[安慰她]]},{2,[[冷笑三声直接离去]]},{3,[[嘲笑她]]}}, dialogue={{[[凯瑟琳]],0,0,10023,[[啊，是冒险者大人，你能遇见我真是太幸运了，因为我有一个新学的魔法要展示给你看~]]},{[[凯瑟琳]],0,0,10023,[[我演示的可是很厉害的魔法，冒险者大人你可要躲远一点不要被误伤了！]]},{[[凯瑟琳]],0,0,10023,[[看！我！的！超！级！无！敌！宇！宙！第！一！厉！害！的！大！火！球！术！]]},{[[凯瑟琳]],1,0,10023,[[啊啊啊啊啊啊，怎么会这样，怎么又烧到了头发，好痛啊！]]},{[[凯瑟琳]],0,0,10023,[[冒险者大人，你真好，我一定会成为一位伟大的魔法师的！&&唉，为什么这么冷漠，冒险者真是一群天性凉薄的人啊。&&哼，你这是在嘲笑未来伟大的魔法师吗，将来我一定会让你把这些嘲笑都收回去的！]]}}, name="魔法学徒"},
	[2] = {id=2, partner_bid=10509, star=5, weight=10, first_power=0, first_lev=0, reward={{1,{1202101}}}, question="0", answer={0}, dialogue={{[[阿瑞斯]],0,0,10040,[[榨干自己最后一丝力气也要和对手拼搏下去！]]},{[[阿瑞斯]],0,0,10040,[[哪怕会失败，哪怕会受伤也不能畏惧！挺起胸膛，直面对手的拳头。]]},{[[阿瑞斯]],0,0,10040,[[胜负不在我的考虑范围之内，绝对不让这场较量留下一丝一毫的遗憾！]]},{[[阿瑞斯]],0,0,10040,[[这，就是我作为战神的尊严——战神宣言 阿瑞斯]]}}, name="战神宣言"},
	[3] = {id=3, partner_bid=10507, star=5, weight=10, first_power=300000, first_lev=0, reward={{1,{1203101}}}, question="0", answer={0}, dialogue={{[[少年梅林]],0,0,10030,[[你好，冒险者。我是梅林。我能够预言一切，未来的大魔法师，不用客气叫我梅林就好啦。我不太喜欢拘谨。]]},{[[少年梅林]],0,0,10030,[[你可以向我提一个问题，来吧来吧，有什么问题就问呀。当然，一句话也不问就此别过也是一种选择。对我来说，如果你能这么做就太好了。]]},{[[]],0,1,10030,[[你为什么会辅佐亚瑟呢？]]},{[[少年梅林]],0,0,10030,[[哦，这件事啊。嗯，虽然我拥有一双能够看破命运的双眼。但说实话，也是因为我和亚瑟王十分相似——我们都想拯救这片饱受战火蹂躏的大陆。]]},{[[少年梅林]],0,0,10030,[[另一方面，我只是大陆历史的见证者，我压根不打算与任何人为伍，我对大陆的未来很感兴趣，想要见证这一切的发生，因此我遵从命运的指引去辅佐亚瑟。]]}}, name="时空旅人"},
	[4] = {id=4, partner_bid=30508, star=5, weight=10, first_power=500000, first_lev=0, reward={{1,{1204101}}}, question="0", answer={0}, dialogue={{[[斯芬克斯]],0,0,10081,[[冒险者，你想要获得我的力量吗，你的智慧将会有所提升，因为我的智慧超绝。]]},{[[斯芬克斯]],0,0,10081,[[在月圆之夜于一空地上，以沙画一五芒星阵，每一点插上一个可以插三根点燃蜡烛的烛台，再准备好契约书、一面镜子，一把银剑；在阵中央，以银剑划三六之印，将自己的血淋于契约上颂念。]]},{[[斯芬克斯]],0,0,10081,[[恐惧之父宇宙之秘，于月圆之夜飞驰于大陆沙漠的魔兽，汝之凝视即众妙之门，吾将以此精血粉碎光之封印，速至于此与我相会。]]},{[[斯芬克斯]],0,0,10081,[[如果成功，我将出现在你的面前，但我会闭上双眼，所以冒险者你可以注视着我，我会向你提出一个谜语，每一次的谜语都不同，如果答对，我便会成为你的力量之源，智慧之泉。]]}}, name="沙漠守望"},
	[5] = {id=5, partner_bid=10401, star=5, weight=75, first_power=0, first_lev=0, reward={{1,{1205101}}}, question="0", answer={0}, dialogue={{[[少年梅林]],0,1,10030,[[在要拔起那把剑之前，你确实需要好好地想一下，得到这把剑的人就会被人憎恨，走向凄惨的死亡。拔起它，你将获得一个完全不同的人生。]]},{[[亚瑟]],0,0,10043,[[看着这些聚拢的人群，他们都是我的子民们，他们眼含期冀，希望有人能带领他们走出战乱与纷争！]]},{[[亚瑟]],0,0,10043,[[我已下定了决心，就算看到了自己的未来。有这许多人的期许，我想，一定很不错。拔出此剑，吾即为王！]]},{[[少年梅林]],0,1,10030,[[把剑从石中拔出来的人，就应当成为王。但奇迹是需要付出代价的，作为交换的，应该就是你最重要的事物吧。]]}}, name="石中剑亚瑟"},
	[6] = {id=6, partner_bid=50404, star=4, weight=83, first_power=0, first_lev=0, reward={{1,{1206101}}}, question="0", answer={0}, dialogue={{[[黑精灵秘言]],0,0,10050,[[我因为渴望强大的魔力而陷入了魔瘾，人类因为猜忌而不愿意真心接纳我，指派我去完成最艰难的任务，在无数的猜忌和偏见之下，我与人类决裂了。]]},{[[黑精灵秘言]],0,0,10050,[[我自愿将灵魂出卖给恶魔，献祭自己的肉身，以此来获得强大的力量，解决我的魔瘾。我获得了吞噬万物灵力的能力。]]},{[[]],0,1,10050,[[为了获得力量你真是不择手段，竟然自甘堕落将肉体与灵魂出卖给恶魔！]]},{[[黑精灵秘言]],0,0,10050,[[你体会过魔瘾袭来，万虫噬体魂魄都在被啃噬的感觉？没有经历过我的痛苦，就不要我的行为妄下断言。]]}}, name="噬灵秘术"},
	[7] = {id=7, partner_bid=40502, star=6, weight=11, first_power=2000000, first_lev=0, reward={{1,{1207101}}}, question="0", answer={0}, dialogue={{[[神王宙斯]],0,1,10001,[[我名为宙斯，司掌雷电之力，获得了神器雷霆。我正在组织推翻第二代神王的残暴统治，建立一个崭新的神界。你的能力是什么？愿意加入我们吗？]]},{[[天后赫拉]],0,0,10027,[[我..我..我的神职是时空的创造与毁灭。（这个可恶的家伙为什么像太阳一样光明灿烂，无比耀眼。居然在见到我的第一面就透露给我这么大的秘密。）]]},{[[神王宙斯]],0,1,10001,[[什么？掌握时空，那可真是强大的力量啊，我们正在积蓄力量反抗暴政，你一定要加入我们，为此我愿意将一半的神力给你，你要为我们效力。]]},{[[天后赫拉]],0,0,10027,[[（该死的，居然是这种我无法拒绝的条件，我现在最缺的就是神力。好像跟着这个讨厌的家伙也不错）你可确定自己想清楚了？]]},{[[神王宙斯]],0,1,10001,[[我需要你的帮助，你需要我的神力，以物易物，各取所需，十分公平。]]}}, name="神王与天后"},
	[8] = {id=8, partner_bid=50508, star=6, weight=11, first_power=800000, first_lev=0, reward={{1,{1208101}}}, question="0", answer={0}, dialogue={{[[海拉]],0,0,10092,[[你见过亡者的世界吗？是充满阳光与希望的天堂？亦或是暗无天日充满绝望的地狱？]]},{[[海拉]],0,0,10092,[[亡者的世界并没有生者想象中的那样不堪，阳光普照，格局甚至和人间有那么几分相像。人们的脸上并没有死后的悲痛与绝望；小孩儿们嬉戏打闹，一片祥和安宁。]]},{[[海拉]],0,0,10092,[[我毫不吝惜地将神力赐予整个亡者世界，让冥界的亡灵也能感受到平安喜乐。]]},{[[海拉]],0,0,10092,[[我早已厌倦了与神界的纷争，我喜欢现在这种和平而安定的生活，没有战火的扰攘，心灵也得到了洗涤净化。]]}}, name="亡者之瞳"},
	[9] = {id=9, partner_bid=20509, star=6, weight=10, first_power=0, first_lev=0, reward={{1,{1209101}}}, question="0", answer={0}, dialogue={{[[洛基]],0,0,10088,[[我不知想象了多少次，也脑补过无数次自己死亡的原因。但意想不到的是每一次赴死的时候，都能阴差阳错地化险为夷，也许我是被上天眷顾的。　　]]},{[[洛基]],0,0,10088,[[我并不爱惜自己的生命，我早已知晓最终的结局，神的生命很漫长，长到忽略了时间，但也有死去的那天。]]},{[[洛基]],0,0,10088,[[由于漫长的生命，我感觉我的生活很没有意义，我想过得有存在感，得到其他神明的关注，我开始随性而为做一些恶作剧。]]},{[[洛基]],0,0,10088,[[可是这些恶作剧却受到了其他神明的厌恶，我变得愤怒。我利用槲寄生杀死了巴尔德，这恰好符合预言中神界崩坏的前兆，我就像命运中的那样与神界一同死去。]]}}, name="恶作剧之王"},
	[10] = {id=10, partner_bid=30501, star=5, weight=10, first_power=0, first_lev=0, reward={{1,{1210101}}}, question="0", answer={0}, dialogue={{[[奥丁]],0,0,10039,[[年轻人，欢迎来到英灵殿，一起来享受宴会吧！]]},{[[]],0,1,10039,[[你听说那可怕的预言了吗？]]},{[[奥丁]],0,0,10039,[[呵~孩子~拯救世界不是一个人能完成的任务。]]},{[[奥丁]],0,0,10039,[[我会率领无数的英灵浴血奋战，这将使我成为一个真正的领袖。]]},{[[奥丁]],0,0,10039,[[世界或许会陷入短暂的混乱，而敢于挑战我权威的人，必将成为一具尸体，我会享受这种风姿！]]}}, name="独眼王者"},
	[11] = {id=11, partner_bid=20502, star=5, weight=10, first_power=0, first_lev=0, reward={{1,{1211101}},{2,{1211101}}}, question="0", answer={{1,[[看我一口水让你熄灭]]},{2,[[惹不起惹不起]]}}, dialogue={{[[炎魔之王]],0,0,10008,[[冒险大陆，我还是回来了！这该死的封印能奈我何！]]},{[[炎魔之王]],0,0,10008,[[失去了神之庇佑的大陆，还有谁能阻挡我的步伐，哈哈哈~]]},{[[]],1,1,10008,[[步伐？说的好像你真的用脚走路一样。（请选择选项）]]},{[[炎魔之王]],0,0,10008,[[区区蝼蚁，竟敢挑衅伟大的魔族君主，感受我愤怒的烈焰吧！&&区区蝼蚁，竟敢挑衅伟大的魔族君主，感受我愤怒的烈焰吧！死吧！虫子！]]}}, name="炎魔再临"},
	[12] = {id=12, partner_bid=50402, star=4, weight=83, first_power=0, first_lev=0, reward={{1,{1212101}},{2,{1212101}}}, question="0", answer={{1,[[成为傀儡才是最愚蠢的事]]},{2,[[消灭魔族就是我存在的意义]]}}, dialogue={{[[死亡骑士]],0,0,10082,[[呵，人类，你终究还是未能杀死我的主人，总有一天，我主终将归来！]]},{[[]],0,1,10082,[[可恶！要不是你挡住了最后一击...........]]},{[[死亡骑士]],1,0,10082,[[作为主人的影子，这一切不都是应该的吗么？我的第二次生命，是主人赐予的，自然也该归还于主人。（请选择选项）]]},{[[死亡骑士]],0,0,10082,[[作为一个人类而活着是多么的愚蠢。主人赋予我的，不止是这颗心脏带来的强大力量，还有一个作为“影子”而存在的意义&&作为一个人类而活着是多么的愚蠢。主人赋予我的，不止是这颗心脏带来的强大力量，还有一个作为“影子”而存在的意义]]}}, name="傀儡与影子"},
	[13] = {id=13, partner_bid=20505, star=5, weight=10, first_power=0, first_lev=0, reward={{1,{1213101}}}, question="0", answer={0}, dialogue={{[[阿波罗]],0,0,10041,[[冒险者，黑夜，到底是什么样子的呢？]]},{[[]],0,0,10041,[[你没有见过黑夜吗？]]},{[[阿波罗]],0,0,10041,[[我醒着的时候大地永远艳阳高照，黑夜只有在我睡着的时候才会出现，所以我的世界里只有白天没有黑夜。]]},{[[]],0,1,10041,[[黑夜，大概就是没有你的样子吧！]]}}, name="白昼与黑夜"},
	[14] = {id=14, partner_bid=30501, star=6, weight=10, first_power=1500000, first_lev=0, reward={{1,{1214101}}}, question="0", answer={0}, dialogue={{[[诸神的黄昏]],0,0,10039,[[即使我不愿相信这样的预言，但预言终究是应验了，雪不停地下，严霜使大地冰冻，凛冽的寒风在昏暗的天空呼啸。在刺骨的严寒中，世界充斥着战争和冲突，旷野的恶兽为了寻找食物四处徘徊。]]},{[[诸神的黄昏]],0,0,10091,[[能张口便能吞天噬地的巨狼芬里尔已挣脱束缚它的咒锁，它抖一抖身上银白的皮毛，整个世界都为之颤动，世界之树从树根一直震颤到树梢，山崩地裂，仿佛末日来临。]]},{[[诸神的黄昏]],0,0,10089,[[环绕在中庭的巨蟒耶梦加得醒来了，她翻转身子，掀起滔天巨浪，海水直冲诸神的国度，世界变成了一片汪洋。]]},{[[诸神的黄昏]],0,0,10092,[[死亡国度的主人海拉，唤起了她的亡灵大军，亡灵们空洞的眼神中充满了战意，它们乘坐着死人指甲制成的大船，向诸神的国度起航。]]},{[[诸神的黄昏]],0,0,10097,[[盘踞在世界树底的黑龙尼德霍格苏醒了，他振翅飞上高空，俯瞰整个世界树，他喷出道道蕴含着绝望的吐息，众神对此束手无策。黑龙开始啃食世界树的树根，世界树摇摇欲坠，世界进入了毁灭的边缘.......]]}}, name="诸神的黄昏"},
	[15] = {id=15, partner_bid=20506, star=6, weight=10, first_power=0, first_lev=0, reward={{1,{1215101}},{2,{1215101}}}, question="0", answer={{1,[[我当然懂]]},{2,[[我不懂]]}}, dialogue={{[[吸血伯爵]],0,0,10011,[[我是高贵而优雅的血族。我拥有近乎永恒的生命，我将这漫长的生命统统投入到艺术中去]]},{[[吸血伯爵]],1,0,10011,[[愿意跟着我来学习艺术吗，跟我一起探索这个世界的终极——艺术吧，我会让你变得成熟而优雅，充满迷人的魅力~，冒险者，你懂艺术吗？]]},{[[吸血伯爵]],0,0,10011,[[哼，看着你那迷茫的小眼神儿，你竟然如此傲慢地不懂装懂，不懂艺术的粗鄙之人呐！&&不懂艺术的粗鄙之人呐！]]}}, name="血族的艺术"},
	[16] = {id=16, partner_bid=20405, star=4, weight=75, first_power=0, first_lev=0, reward={{1,{1216101}},{2,{1216101}}}, question="0", answer={{1,[[赶紧把水瓶收起来]]},{2,[[南方的泉水很甘甜，不来一口吗]]}}, dialogue={{[[翼女]],0,0,10007,[[不要叫我鸟人，叫我女王大人！]]},{[[]],0,1,10007,[[......（什么都没说）]]},{[[翼女]],0,0,10007,[[哼！我们火羽一族在遥远而宁静的西北高原中生活了上千年之久，是大陆中最古老而高贵的种族，本女王在族人中更是美丽和神圣存在（挺胸）！我们信仰神圣的永恒之焰。]]},{[[翼女]],0,0,10007,[[可是几年前那场黑暗的灾难打破了一切，那群可恶的嗜血魔物在不断蹂躏我们的土地，迫不得已才南下寻找新的栖身之处，区区人类可不要太得意忘...喂！别把水洒过来！你这个呆瓜！蠢材！]]},{[[]],1,1,10007,[[......（准备喝水却不小心把水瓶中的水洒了出来）]]},{[[翼女]],0,0,10007,[[哼~（心想：快恳请本女王的原谅吧~）&&混蛋！哼！（气鼓鼓地走了）]]}}, name="羽族女王"},
	[17] = {id=17, partner_bid=30501, star=5, weight=11, first_power=0, first_lev=0, reward={{1,{1217101}}}, question="0", answer={0}, dialogue={{[[奥丁]],0,0,10039,[[哎……]]},{[[]],0,1,10039,[[神也会有叹气的时候吗]]},{[[奥丁]],0,0,10039,[[即使是神，也会有感到无力的时候。都以为神无所不能，其实神也不过是一颗棋子。]]},{[[奥丁]],0,0,10039,[[我本以为拥有了预言之力就拥有了改变一切的力量，可我还是错了。即使训练出一支再强大的英灵军，也逃不过神界被覆灭的命运。]]},{[[奥丁]],0,0,10039,[[但，既然命运已经写好了一切，我也不甘愿就这样按照剧本去排演！]]}}, name="神之叹息"},
	[18] = {id=18, partner_bid=10403, star=4, weight=75, first_power=0, first_lev=0, reward={{1,{1218101}},{2,{1218101}}}, question="0", answer={{1,[[没有没有，这冰雕做的真好！]]},{2,[[啊这里有点冷，我出去晒晒太阳~]]}}, dialogue={{[[水元素]],0,0,10014,[[小家伙要来欣赏下我制作的艺术品吗？]]},{[[水元素]],0,0,10014,[[我最擅长的就是做冰雕了，这是卡达尔森林的树木做成的冰雕，这是维瑟斯山城的仙人掌做成的冰雕……]]},{[[]],0,1,10014,[[等等，你该不会是直接把它们直接冰冻起来了吧？]]},{[[水元素]],1,0,10014,[[是啊，小家伙你不觉得这样做出来的冰雕特别逼真么？还是说你也想试试做冰雕的感觉？]]},{[[水元素]],0,0,10014,[[哈哈哈哈~不要害怕呀，我这里有一个小礼物送给你，温柔似水才是我的真实写照。&&哈哈哈哈~不要害怕呀，我这里有一个小礼物送给你，柔情似水才是我的真实写照。]]}}, name="柔情似水"},
	[19] = {id=19, partner_bid=30405, star=5, weight=75, first_power=0, first_lev=0, reward={{1,{1219101}}}, question="0", answer={0}, dialogue={{[[]],0,1,10033,[[听说德鲁伊可以随意地改变自己的形态，这是真的么？]]},{[[德鲁伊]],0,0,10033,[[是……是啊。]]},{[[]],0,1,10033,[[那你为什么要一直维持着现在的模样呢？]]},{[[德鲁伊]],0,0,10033,[[因……因为精灵女王大人曾经夸过这个造型好看，虽然我也只是在慌乱之中才不小心变成了这幅模样。]]},{[[德鲁伊]],0,0,10033,[[但是能获得女王大人的赞赏的这副模样一定是最棒的！]]}}, name="自然亲和"},
	[20] = {id=20, partner_bid=20503, star=5, weight=11, first_power=0, first_lev=0, reward={{1,{1220101}}}, question="0", answer={0}, dialogue={{[[剑豪卡赞]],0,0,10025,[[小子，拔剑一战吧！]]},{[[剑豪卡赞]],0,0,10025,[[嗯？你不用剑的啊，那你走吧，我生平只和用剑的人一较高低。]]},{[[]],0,1,10025,[[大叔，你哪位啊？我认识你吗？]]},{[[剑豪卡赞]],0,0,10025,[[我啊，可是被誉为剑中豪杰的男人。哈哈哈哈]]}}, name="剑中豪杰"},
	[21] = {id=21, partner_bid=40507, star=5, weight=11, first_power=0, first_lev=0, reward={{1,{1221101}}}, question="0", answer={0}, dialogue={{[[神灵大祭司]],0,0,10080,[[天选之人啊，吾以神灵之命，赋予你穿越时空之力。]]},{[[神灵大祭司]],0,0,10080,[[请肩负起你的使命，寻找失落的神器，重现诸神的荣耀。属于你的时代，已经来临！]]},{[[神灵大祭司]],0,0,10080,[[勇敢的冒险者大人啊！命运之日即将到来！]]},{[[神灵大祭司]],0,0,10080,[[努力收集五大神器，潜心修炼，寻找志同道合的伙伴一起迎接最终的命运，守卫大陆上的生灵们吧！]]}}, name="神灵代言"},
	[22] = {id=22, partner_bid=40402, star=4, weight=84, first_power=0, first_lev=0, reward={{1,{1222101}}}, question="0", answer={0}, dialogue={{[[月之祭司]],0,0,10003,[[你看今晚的月色多美啊，我们每一个人都沐浴在月神辛西娅大人的光辉之中。]]},{[[月之祭司]],0,0,10003,[[我守御着月神大人在大陆上的每一处月神殿。清冷的月光就是辛西娅大人圣洁的光辉，在每一个夜晚月光都会指引每一个迷途的旅人，免使他们堕入黑暗。]]},{[[]],0,1,10003,[[啊，那月神大人的力量一定十分强大了！]]},{[[月之祭司]],0,0,10003,[[不是的，辛西娅大人本身的力量并不强大，她的力量来自为大陆奉献的精神，来自每一位像我这样的月神祭司的虔诚信仰！]]}}, name="月神光辉"},
	[23] = {id=23, partner_bid=30502, star=5, weight=11, first_power=0, first_lev=0, reward={{1,{1223101}}}, question="0", answer={0}, dialogue={{[[影刹]],0,0,10086,[[哦，年轻人，愿意跟我一起学功夫吗，我可是功夫大师。。]]},{[[旁白]],0,1,10086,[[与影刹一起学习功夫。（许久之后.................）]]},{[[影刹]],0,0,10086,[[唔，你的招式.......很精妙，我现在终于体会到我的师父将招数传授给我时的感受了！]]},{[[影刹]],0,0,10086,[[看到你用出我传授给你的招式，我就感觉我们之间有了羁绊，听到我说我把你当成我自己的孩子时，请你不要觉得我很唐突。]]},{[[影刹]],0,0,10086,[[你给予了我不能言表的荣耀，谢谢你，我的徒弟！]]}}, name="功夫大师"},
	[24] = {id=24, partner_bid=30404, star=5, weight=75, first_power=0, first_lev=0, reward={{1,{1224101}}}, question="0", answer={0}, dialogue={{[[甘道夫]],0,0,10070,[[我活过了漫长的岁月，真正难以忘怀的却那么少...........也许是我应该心怀感激？]]},{[[甘道夫]],0,0,10070,[[我早已淡忘了悠悠岁月中的所有悲剧，铭刻在心的都是世间的奇迹。]]},{[[甘道夫]],0,0,10070,[[我历经的岁月让我明白，生命中的所有光辉灿烂，最终都需要用寂寞来偿还。]]},{[[甘道夫]],0,0,10070,[[所有人一同承受着时间流逝的痛苦，无论是他，还是她，都无法阻止这不可逆转的时间洪流。]]},{[[甘道夫]],0,0,10070,[[老头子年纪大了，就喜欢乱发些感慨。冒险家这些请你收下，以此纪念你在冒险大陆的光荣与灿烂！]]}}, name="时光的感慨"},
	[25] = {id=25, partner_bid=20510, star=5, weight=11, first_power=0, first_lev=0, reward={{1,{1225101}}}, question="0", answer={0}, dialogue={{[[哪吒]],0,0,10096,[[哼！冒险者，你有没有见过一个圆滚滚的大胖熊？他与小爷我一样都来自这片大陆的东方。]]},{[[]],0,1,10096,[[......（沉默不语）大胖熊？？？]]},{[[哪吒]],0,0,10096,[[若不是看在这只大胖熊抵御魔物入侵有功，捍卫了大陆上的亿万生灵，小爷我的红缨枪，早就捅他个透心凉心飞扬了。]]},{[[影刹]],0,0,10086,[[（此时大陆某处）阿嚏！阿嚏！怎么会无缘无故打喷嚏，谁在骂我，肯定是那个脚踩破轮，浑身冒火的小鬼了，下次看到他一定要好好修理修理他！]]}}, name="宿怨"},
	[26] = {id=26, partner_bid=40503, star=6, weight=11, first_power=0, first_lev=0, reward={{1,{1226101}}}, question="0", answer={0}, dialogue={{[[天后赫拉]],0,0,10027,[[这里是我私属空间——赫斯佩里德拉，这是一个封闭的世界，没有人听到我们说的话，现在可以把详细的计划告诉我了吗？]]},{[[天神宙斯]],0,0,10001,[[太好了！二代神王克洛诺斯是远古泰坦一族的佼佼者，全身被他浩瀚的神力笼罩，毫无破绽。但他在醉酒之后会脆弱如同凡人，而且他还有个致命的缺陷，他嗜酒如命。]]},{[[天神宙斯]],0,0,10001,[[我们就利用他这一弱点，我去假扮他的侍酒童子，在他的酒里偷偷撒下毒药，使他神力激荡并引起反噬，再对他群起而攻之，我们就能把他逐下神座。]]},{[[天后赫拉]],0,0,10027,[[可是，我们面对的不仅仅是二代神王克洛诺斯一人，还有他背后的整个泰坦神族，泰坦们依靠神王而荣耀于其他神族，战争时期泰坦们又会是神王的强大助力。]]},{[[天神宙斯]],0,0,10001,[[不要紧的，我有办法对付他们，而且我始终坚信，正义必将战胜邪恶，光明所至之处，黑暗无处遁形，今时今日即是泰坦神族荣耀永绝之始！]]},{[[天后赫拉]],0,0,10027,[[好吧，姑且相信你（这个家伙笑起来可真好看....也许他天生就有这样的感染力吧，他就像太阳一样纯净耀眼。）]]}}, name="倾覆"},
	[27] = {id=27, partner_bid=10305, star=3, weight=0, first_power=0, first_lev=30, reward={{1,{1227101,1228101}}}, question="0", answer={0}, dialogue={{[[月之骑士]],0,0,10002,[[初次见面，冒险者~我是月神艾露希娅大人座下的神殿骑士，负责守御艾露希娅大人在大陆各处神殿的安危。]]},{[[月之骑士]],0,0,10002,[[恭喜你达到30级，我为你带来了艾露希娅大人的祝福，在月神大人的注视下继续前进吧！荡平大陆魔物的重任就托付于你了！]]}}, name="等级贺礼"},
	[28] = {id=28, partner_bid=40301, star=3, weight=0, first_power=0, first_lev=40, reward={{1,{1227101,1228101}}}, question="0", answer={0}, dialogue={{[[光之苏尔]],0,0,10071,[[嘿~冒险者大人，吾是三代神王天神宙斯麾下传令使者光之苏尔，神王大人得知您达到了40级，特派我来为您献上一份礼物~]]},{[[光之苏尔]],0,0,10071,[[神王大人期冀着您快速成长，早日成为大陆的中流砥柱，共御魔物，捍卫大陆苍生！]]}}, name="等级贺礼"},
	[29] = {id=29, partner_bid=50301, star=3, weight=0, first_power=0, first_lev=50, reward={{1,{1227101,1228101}}}, question="0", answer={0}, dialogue={{[[暗影战士]],0,0,10073,[[咳咳咳咳.....冒险者，伟大的黑暗主宰黑暗之主大人洞悉到你达到了50级，让我略备薄礼前来探望。]]},{[[暗影战士]],0,0,10073,[[我们黑暗神界与所谓的神王宙斯领袖的光明神界，向来势同水火。黑暗之主大人希望你能加入黑暗阵营，驱逐傲慢自大，虚伪贪婪，戴着伪善的面具，以正义自居的光明神族。]]}}, name="等级贺礼"},
	[30] = {id=30, partner_bid=10503, star=5, weight=11, first_power=0, first_lev=0, reward={{1,{1231101}}}, question="0", answer={0}, dialogue={{[[冰霜巨龙]],0,0,10037,[[冒险者，想不想听一个故事？这是关于次神时代最为耀眼的明星——冰雪女王大人的。我们冰霜巨龙一族，自次神纪元起就是女王大人忠诚的追随者。]]},{[[冰霜巨龙]],0,0,10037,[[作为那个年代的巅峰，女王仅差一步就可以迈入神之领域，但魔族肆虐，天下苍生陷入水深火热之中。]]},{[[冰霜巨龙]],0,0,10037,[[女王殿下放弃了更进一步的机会，就算逆大势而行也要投身乱世，为了大陆的万千生灵情愿与整个魔族与天理命运对抗。]]},{[[冰霜巨龙]],0,0,10037,[[其他的次神都是因为自身的过失而止步不前，冰雪女王却是因为放下这片大陆才没能更进一步，只有这样伟大的神明才值得我们巨龙一族去追随啊！]]}}, name="冰雪秘史"},
	[31] = {id=31, partner_bid=50509, star=6, weight=11, first_power=0, first_lev=0, reward={{1,{1232101}}}, question="0", answer={0}, dialogue={{[[尼德霍格]],0,0,10097,[[我十分迷恋毁掉那些令人珍视的东西，耗费了无数代人心血去守护的却于顷刻间毁于我手。]]},{[[尼德霍格]],0,0,10097,[[所剩下的一片废墟狼藉在不断地向我印证一个真理，一切都毫无意义...你我亦是如此...]]},{[[尼德霍格]],0,0,10097,[[这片看似繁荣，孕育万千生灵的大陆也是，反正早晚都要归于虚无，不如就让我来毁灭掉它。]]}}, name="暴虐成性"},
	[32] = {id=32, partner_bid=20507, star=6, weight=11, first_power=0, first_lev=0, reward={{1,{1233101}}}, question="0", answer={0}, dialogue={{[[普罗米修斯]],0,0,10078,[[同胞们啊，你们一定要记住，虽有幸生而为人，也不要以万物灵长而自居，要常怀谦逊感恩之心。]]},{[[普罗米修斯]],0,0,10078,[[狂妄尊大只会滋生傲慢，正是这种傲慢才阻碍了人类的进步，人类仅仅只是天地万物中的一份子。]]},{[[普罗米修斯]],0,0,10078,[[万物各有所长，万物皆可为师，万事万物本为一体！师万物之所长于己一身，最终融于万物。]]},{[[普罗米修斯]],0,0,10078,[[这些就是我在修行之路上的一些心得，希望能与诸君共勉！]]}}, name="薪火传承"},
	[33] = {id=33, partner_bid=30506, star=5, weight=11, first_power=0, first_lev=0, reward={{1,{1234101}}}, question="0", answer={0}, dialogue={{[[雅典娜]],0,0,10010,[[脚长在你身上长着，走不走，走哪条路，走什么样的路自己决定，做不做人，做什么样的人亦是如此！]]},{[[美杜莎]],0,0,10059,[[啧啧啧......想不到，智慧女神雅典娜竟会如此天真，怎么会说这种傻话，大多时候，你我的模样是别人决定的。]]},{[[雅典娜]],0,0,10010,[[是啊，想走的路不好走，想做人，不好做。都说是身不由己，不是废话吗！己不由心，身又岂能由己？好自为之吧。]]},{[[美杜莎]],0,0,10059,[[............（沉思）]]}}, name="智慧女神"},
	[34] = {id=34, partner_bid=50505, star=6, weight=11, first_power=0, first_lev=0, reward={{1,{1235101}}}, question="0", answer={0}, dialogue={{[[阿努比斯]],0,0,10067,[[有喜悦必定有忧伤，有相聚必定有离别，有爱慕必定有憎恨，有得到必定会失去，有生必定有死。]]},{[[阿努比斯]],0,0,10067,[[若视前者为甘甜，那这诸般种种必将化作痛苦收场。而于前后两者之间患得患失，本身就是种痛苦。]]},{[[阿努比斯]],0,0,10067,[[即使什么都不做，也依然要忍受百无聊赖之苦，众生皆苦，痛苦是行走在这光怪陆离的世界上唯一的收获。]]},{[[阿努比斯]],0,0,10067,[[若想从这苦难痛苦的世界中寻得解脱，迎接痛苦，拥抱苦难，这是唯一的道路！]]}}, name="痛苦之源"},
	[35] = {id=35, partner_bid=40506, star=6, weight=11, first_power=0, first_lev=0, reward={{1,{1236101}}}, question="0", answer={0}, dialogue={{[[艾蕾莉亚]],0,0,10068,[[哦，冒险者，你觉得一个人的价值应该由什么来决定？是权势？是地位？是财富？亦或是别人的评价？一个人价值，是不能以任何方式量化的。]]},{[[艾蕾莉亚]],0,0,10068,[[这片大陆不应该成为生灵们苟活的地方，而是承载所有族群希望的载体，抵御魔族不是为了救别人，而是为了救我们自己。]]},{[[艾蕾莉亚]],0,0,10068,[[这片大陆上，没有哪条法则，就从我们一出生就否定我们，无论是神还是芸芸众生，我们每一位生灵，都是独一无二的存在。]]},{[[艾蕾莉亚]],0,0,10068,[[每一位生灵都有平等生存下去的权利，不应饱受魔族的欺凌，不应战栗在魔族的铁蹄之下，不应每天都活在屈辱和绝望之中。]]},{[[艾蕾莉亚]],0,0,10068,[[为了孕育我们的家园，为了祥和安宁的生活，为了更美好的明天，我们要与魔族抗争到底！]]}}, name="独角天使"},
	[36] = {id=36, partner_bid=50502, star=5, weight=11, first_power=0, first_lev=0, reward={{1,{1237101}}}, question="0", answer={0}, dialogue={{[[哈迪斯]],0,0,10028,[[这片大陆上有种种的玄妙秘术，往往都是入门容易，精通极难，甚至越往深处钻研越危险。]]},{[[哈迪斯]],0,0,10028,[[而我所创的幽冥秘典却不一样，我这秘术入门就等于学会了，但入门极难需要卓越的天赋，不懈的毅力，和命运的眷顾。]]},{[[哈迪斯]],0,0,10028,[[可惜仅有这些还不够，还需要勘破生与死，不是那种横着一条心，不怕死的那种勘破。]]},{[[哈迪斯]],0,0,10028,[[想要完全掌握，必有拥有完全漠视生命的境界。秘术的难点在于，不到面对死亡的那一刻，你根本不知道自己是哪种状态。]]},{[[哈迪斯]],0,0,10028,[[如果状态不对，却有打算使用秘术，你自己就会成为我这幽冥秘典的牺牲品，哈哈哈哈。]]}}, name="冥王秘典"},
	[37] = {id=37, partner_bid=30507, star=6, weight=11, first_power=0, first_lev=0, reward={{1,{1238101}}}, question="0", answer={0}, dialogue={{[[潘]],0,0,10076,[[在死亡之前仿佛一切存在，一切所发生的都是理所应当，都是天经地义的。]]},{[[潘]],0,0,10076,[[直至死亡的那一瞬间，才发现随着只是缺失了一点点，就那么一点点难以名状的东西一旦消失了.......]]},{[[潘]],0,0,10076,[[断掉的再也接不回来，破损的再也无法修补，之前所拥有的一切都不复存在。]]},{[[潘]],0,0,10076,[[不能说，不能看，不能吃，不能喝。没有感觉，没有回应，仿佛世间万事万物陷入静止。]]},{[[潘]],0,0,10076,[[这时，才能体会到，活着，拥有生命本身就是个奇迹啊！世间无数种可能都是基于这个奇迹而存在，奇迹被终结的一刻，一切都归于虚无。]]}}, name="生命与死亡"},
	[38] = {id=38, partner_bid=30504, star=5, weight=11, first_power=0, first_lev=0, reward={{1,{1239101}}}, question="0", answer={0}, dialogue={{[[魅魔女王]],0,0,10019,[[冒险者，你可知道对于一个刺客而言最重要的是什么？是一击不成远遁千里的果决吗，是隐身暗处不眠不休盯住猎物的毅力吗？]]},{[[魅魔女王]],0,0,10019,[[都不是，读出对方的心理和隐藏自己的情绪，就是一个刺客最重要的能力。]]},{[[魅魔女王]],0,0,10019,[[生灵们当然可以拥有一切情感，但作为一名刺客的时候，是非善恶，爱恨喜怒就都需要放下，保留的只有将对手送达死亡的那个动作。]]},{[[魅魔女王]],0,0,10019,[[用捡起一颗小石子的心态去摧毁一个生命，这就是刺客的心态。]]}}, name="刺客奥义"},
	[39] = {id=39, partner_bid=10502, star=5, weight=11, first_power=0, first_lev=0, reward={{1,{1240101}}}, question="0", answer={0}, dialogue={{[[冰雪女王]],0,0,10036,[[大陆上的一座神殿塌了，工匠，牧师，骑士，吟游诗人等等的贩夫走卒三教九流都汇聚起来，花费良久，重建了一座更加宏伟的神殿，做完这一切这些人就走了，没人知道他们的名字。]]},{[[冰雪女王]],0,0,10036,[[正是这群人在大陆的角落中默默无闻，为大陆人族的生存繁衍添砖加瓦，我对他们一无所知，却无时无刻不生活在他们的庇护之下。]]},{[[冰雪女王]],0,0,10036,[[我自大陆的极北寒境中诞生，受天地感召汲取苍蓝之梦的力量产生灵智，每念及此深感对大陆亏欠良多。]]},{[[冰雪女王]],0,0,10036,[[愿与他们一道为大陆苍生的生存繁衍尽心竭力。]]},{[[冰雪女王]],0,0,10036,[[而今天下乱象已现，各地魔族蠢蠢欲动，我愿以此身荡平天下魔族，还大陆生灵一个太平世界，还世间朗朗乾坤。]]}}, name="冰雪意志"},
	[40] = {id=40, partner_bid=50509, star=6, weight=12, first_power=0, first_lev=0, reward={{1,{1241101}}}, question="0", answer={0}, dialogue={{[[尼德霍格]],0,0,10097,[[不知道从什么时候开始注意到的，只要接触到鲜血，杀戮，破坏之类的东西的时候，我就会莫名的兴奋。]]},{[[尼德霍格]],0,0,10097,[[凶残的畜生？天生的坏种？哈哈哈哈哈哈哈，我就是名为绝望的黑龙。]]},{[[尼德霍格]],0,0,10097,[[这也是为什么我会参与到诸神黄昏之中，把这个世界搅动得天翻地覆，看着诸神在我的阴影下哀嚎呻吟，就是我最开心的事。]]},{[[尼德霍格]],0,0,10097,[[我热衷于杀戮和破坏，我漠视他人的生命，也不珍惜自己的性命。我喜欢破坏他人珍视的东西，毁灭就是我的终极目标。]]}}, name="毁灭天性"}
}
Config.EncounterData.data_encounter_info_fun = function(key)
	local data=Config.EncounterData.data_encounter_info[key]
	if DATA_DEBUG and data == nil then
		print('(Config.EncounterData.data_encounter_info['..key..'])not found') return
	end
	return data
end
-- -------------------encounter_info_end---------------------


-- -------------------encounter_bid_list_start-------------------
Config.EncounterData.data_encounter_bid_list_length = 37
Config.EncounterData.data_encounter_bid_list = {
	[20402] = {{id=1}},
	[10509] = {{id=2}},
	[10507] = {{id=3}},
	[30508] = {{id=4}},
	[10401] = {{id=5}},
	[50404] = {{id=6}},
	[40502] = {{id=7}},
	[50508] = {{id=8}},
	[20509] = {{id=9}},
	[30501] = {{id=17}, {id=14}, {id=10}},
	[20502] = {{id=11}},
	[50402] = {{id=12}},
	[20505] = {{id=13}},
	[20506] = {{id=15}},
	[20405] = {{id=16}},
	[10403] = {{id=18}},
	[30405] = {{id=19}},
	[20503] = {{id=20}},
	[40507] = {{id=21}},
	[40402] = {{id=22}},
	[30502] = {{id=23}},
	[30404] = {{id=24}},
	[20510] = {{id=25}},
	[40503] = {{id=26}},
	[10305] = {{id=27}},
	[40301] = {{id=28}},
	[50301] = {{id=29}},
	[10503] = {{id=30}},
	[50509] = {{id=40}, {id=31}},
	[20507] = {{id=32}},
	[30506] = {{id=33}},
	[50505] = {{id=34}},
	[40506] = {{id=35}},
	[50502] = {{id=36}},
	[30507] = {{id=37}},
	[30504] = {{id=38}},
	[10502] = {{id=39}}
}
-- -------------------encounter_bid_list_end---------------------
