----------------------------------------------------
-- 此文件由数据工具生成
-- GM配置数据--gm_data.xml
--------------------------------------

Config = Config or {} 
Config.GmData = Config.GmData or {}

-- -------------------list_start-------------------
Config.GmData.data_list_length = 165
Config.GmData.data_list = {
	[1] = {tips="战斗相关", info=[[]], is_show=1, list={84,85,86,87,88}},
	[2] = {tips="精灵相关", info=[[]], is_show=1, list={20,36,34,50,51,52,53,54,507,508,509,510,511,512,513,516,515,517,518,514,519}},
	[3] = {tips="精灵星级", info=[[]], is_show=1, list={21,22,23,24,35,36}},
	[4] = {tips="装备相关", info=[[获取物品 40101 1
获取物品 40102 1
获取物品 40103 1
获取物品 40104 1
获取物品 40105 1
获取物品 40106 1
获取物品 40107 1
获取物品 40108 1
获取物品 40109 1
获取物品 40110 1
获取物品 40111 1
获取物品 40112 1
获取物品 40113 1
获取物品 40114 1
获取物品 40115 1
获取物品 40116 1
获取物品 40117 1
获取物品 40201 1
获取物品 40202 1
获取物品 40203 1
获取物品 40204 1
获取物品 40205 1
获取物品 40206 1
获取物品 40207 1
获取物品 40208 1
获取物品 40209 1
获取物品 40210 1
获取物品 40211 1
获取物品 40212 1
获取物品 40213 1
获取物品 40214 1
获取物品 40215 1
获取物品 40216 1
获取物品 40217 1
获取物品 40301 1
获取物品 40302 1
获取物品 40303 1
获取物品 40304 1
获取物品 40305 1
获取物品 40306 1
获取物品 40307 1
获取物品 40308 1
获取物品 40309 1
获取物品 40310 1
获取物品 40311 1
获取物品 40312 1
获取物品 40313 1
获取物品 40314 1
获取物品 40315 1
获取物品 40316 1
获取物品 40317 1
获取物品 40401 1
获取物品 40402 1
获取物品 40403 1
获取物品 40404 1
获取物品 40405 1
获取物品 40406 1
获取物品 40407 1
获取物品 40408 1
获取物品 40409 1
获取物品 40410 1
获取物品 40411 1
获取物品 40412 1
获取物品 40413 1
获取物品 40414 1
获取物品 40415 1
获取物品 40416 1
获取物品 40417 1]], is_show=1, list={}},
	[5] = {tips="饰品获取", info=[[]], is_show=1, list={200,201,202,203,204,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241}},
	[6] = {tips="剧情副本", info=[[]], is_show=1, list={80,81,82,83}},
	[7] = {tips="跳过新手", info=[[跳过新手剧情]], is_show=1, list={}},
	[8] = {tips="秒变土豪", info=[[获取物品 1 99999999
获取物品 22 99999999
获取物品 3 99999999
获取物品 10001 99999]], is_show=1, list={}},
	[9] = {tips="阵法位置", info=[[]], is_show=1, list={26,27,28,29,30,31}},
	[10] = {tips="日常30活跃", info=[[获取物品 9 30]], is_show=1, list={}},
	[11] = {tips="清空装备", info=[[清空装备背包]], is_show=1, list={}},
	[12] = {tips="邮件测试", info=[[邮件测试  [{1,100}] [{10401,1},{10402,1}] 86400]], is_show=1, list={}},
	[13] = {tips="公告测试", info=[[公告测试 2 2 600 标题 文字内容文字内容文字内容文字内容文字内容]], is_show=1, list={}},
	[14] = {tips="获取家具", info=[[]], is_show=1, list={301,302,303,304,305}},
	[15] = {tips="萌宠出行", info=[[]], is_show=1, list={401,402,403,404,405}},
	[16] = {tips="充值相关", info=[[]], is_show=1, list={100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142}},
	[17] = {tips="学习器系统", info=[[]], is_show=1, list={501,502,503,504,505,506}},
	[18] = {tips="其他升星", info=[[]], is_show=1, list={23,24,32,33,21,22,56,57,58}},
	[20] = {tips="全部精灵", info=[[加伙伴 10101
加伙伴 10201
加伙伴 10202
加伙伴 10301
加伙伴 10302
加伙伴 10303
加伙伴 10304
加伙伴 10305
加伙伴 10401
加伙伴 10402
加伙伴 10403
加伙伴 10404
加伙伴 10405
加伙伴 10501
加伙伴 10502
加伙伴 10503
加伙伴 10504
加伙伴 10505
加伙伴 10506
加伙伴 10507
加伙伴 10508
加伙伴 10509
加伙伴 10510
加伙伴 10511
加伙伴 10512
加伙伴 20201
加伙伴 20202
加伙伴 20301
加伙伴 20302
加伙伴 20303
加伙伴 20304
加伙伴 20305
加伙伴 20401
加伙伴 20402
加伙伴 20403
加伙伴 20404
加伙伴 20405
加伙伴 20501
加伙伴 20502
加伙伴 20503
加伙伴 20504
加伙伴 20505
加伙伴 20506
加伙伴 20507
加伙伴 20508
加伙伴 20509
加伙伴 20510
加伙伴 20511
加伙伴 20512
加伙伴 30201
加伙伴 30202
加伙伴 30301
加伙伴 30302
加伙伴 30303
加伙伴 30304
加伙伴 30305
加伙伴 30401
加伙伴 30402
加伙伴 30403
加伙伴 30404
加伙伴 30405
加伙伴 30501
加伙伴 30502
加伙伴 30503
加伙伴 30504
加伙伴 30505
加伙伴 30506
加伙伴 30507
加伙伴 30508
加伙伴 30509
加伙伴 30510
加伙伴 30511
加伙伴 30512
加伙伴 40301
加伙伴 40401
加伙伴 40402
加伙伴 40403
加伙伴 40404
加伙伴 40501
加伙伴 40502
加伙伴 40503
加伙伴 40504
加伙伴 40505
加伙伴 40506
加伙伴 40507
加伙伴 40508
加伙伴 40509
加伙伴 40510
加伙伴 50301
加伙伴 50401
加伙伴 50402
加伙伴 50403
加伙伴 50404
加伙伴 50501
加伙伴 50502
加伙伴 50503
加伙伴 50504
加伙伴 50505
加伙伴 50506
加伙伴 50507
加伙伴 50508
加伙伴 50509
加伙伴 50510]], is_show=0, list={}},
	[21] = {tips="精灵10星", info=[[伙伴星级 10101 10
伙伴星级 10201 10
伙伴星级 10202 10
伙伴星级 10301 10
伙伴星级 10302 10
伙伴星级 10303 10
伙伴星级 10304 10
伙伴星级 10305 10
伙伴星级 10401 10
伙伴星级 10402 10
伙伴星级 10403 10
伙伴星级 10404 10
伙伴星级 10405 10
伙伴星级 10501 10
伙伴星级 10502 10
伙伴星级 10503 10
伙伴星级 10504 10
伙伴星级 10505 10
伙伴星级 10506 10
伙伴星级 10507 10
伙伴星级 10508 10
伙伴星级 10509 10
伙伴星级 10510 10
伙伴星级 10511 10
伙伴星级 10512 10
伙伴星级 20201 10
伙伴星级 20202 10
伙伴星级 20301 10
伙伴星级 20302 10
伙伴星级 20303 10
伙伴星级 20304 10
伙伴星级 20305 10
伙伴星级 20401 10
伙伴星级 20402 10
伙伴星级 20403 10
伙伴星级 20404 10
伙伴星级 20405 10
伙伴星级 20501 10
伙伴星级 20502 10
伙伴星级 20503 10
伙伴星级 20504 10
伙伴星级 20505 10
伙伴星级 20506 10
伙伴星级 20507 10
伙伴星级 20508 10
伙伴星级 20509 10
伙伴星级 20510 10
伙伴星级 20511 10
伙伴星级 20512 10
伙伴星级 30201 10
伙伴星级 30202 10
伙伴星级 30301 10
伙伴星级 30302 10
伙伴星级 30303 10
伙伴星级 30304 10
伙伴星级 30305 10
伙伴星级 30401 10
伙伴星级 30402 10
伙伴星级 30403 10
伙伴星级 30404 10
伙伴星级 30405 10
伙伴星级 30501 10
伙伴星级 30502 10
伙伴星级 30503 10
伙伴星级 30504 10
伙伴星级 30505 10
伙伴星级 30506 10
伙伴星级 30507 10
伙伴星级 30508 10
伙伴星级 30509 10
伙伴星级 30510 10
伙伴星级 30511 10
伙伴星级 30512 10
伙伴星级 40301 10
伙伴星级 40401 10
伙伴星级 40402 10
伙伴星级 40403 10
伙伴星级 40404 10
伙伴星级 40501 10
伙伴星级 40502 10
伙伴星级 40503 10
伙伴星级 40504 10
伙伴星级 40505 10
伙伴星级 40506 10
伙伴星级 40507 10
伙伴星级 40508 10
伙伴星级 40509 10
伙伴星级 40510 10
伙伴星级 50301 10
伙伴星级 50401 10
伙伴星级 50402 10
伙伴星级 50403 10
伙伴星级 50404 10
伙伴星级 50501 10
伙伴星级 50502 10
伙伴星级 50503 10
伙伴星级 50504 10
伙伴星级 50505 10
伙伴星级 50506 10
伙伴星级 50507 10
伙伴星级 50508 10
伙伴星级 50509 10
伙伴星级 50510 10]], is_show=0, list={}},
	[22] = {tips="精灵11星", info=[[伙伴星级 10101 11
伙伴星级 10201 11
伙伴星级 10202 11
伙伴星级 10301 11
伙伴星级 10302 11
伙伴星级 10303 11
伙伴星级 10304 11
伙伴星级 10305 11
伙伴星级 10401 11
伙伴星级 10402 11
伙伴星级 10403 11
伙伴星级 10404 11
伙伴星级 10405 11
伙伴星级 10501 11
伙伴星级 10502 11
伙伴星级 10503 11
伙伴星级 10504 11
伙伴星级 10505 11
伙伴星级 10506 11
伙伴星级 10507 11
伙伴星级 10508 11
伙伴星级 10509 11
伙伴星级 10510 11
伙伴星级 10511 11
伙伴星级 10512 11
伙伴星级 20201 11
伙伴星级 20202 11
伙伴星级 20301 11
伙伴星级 20302 11
伙伴星级 20303 11
伙伴星级 20304 11
伙伴星级 20305 11
伙伴星级 20401 11
伙伴星级 20402 11
伙伴星级 20403 11
伙伴星级 20404 11
伙伴星级 20405 11
伙伴星级 20501 11
伙伴星级 20502 11
伙伴星级 20503 11
伙伴星级 20504 11
伙伴星级 20505 11
伙伴星级 20506 11
伙伴星级 20507 11
伙伴星级 20508 11
伙伴星级 20509 11
伙伴星级 20510 11
伙伴星级 20511 11
伙伴星级 20512 11
伙伴星级 30201 11
伙伴星级 30202 11
伙伴星级 30301 11
伙伴星级 30302 11
伙伴星级 30303 11
伙伴星级 30304 11
伙伴星级 30305 11
伙伴星级 30401 11
伙伴星级 30402 11
伙伴星级 30403 11
伙伴星级 30404 11
伙伴星级 30405 11
伙伴星级 30501 11
伙伴星级 30502 11
伙伴星级 30503 11
伙伴星级 30504 11
伙伴星级 30505 11
伙伴星级 30506 11
伙伴星级 30507 11
伙伴星级 30508 11
伙伴星级 30509 11
伙伴星级 30510 11
伙伴星级 30511 11
伙伴星级 30512 11
伙伴星级 40301 11
伙伴星级 40401 11
伙伴星级 40402 11
伙伴星级 40403 11
伙伴星级 40404 11
伙伴星级 40501 11
伙伴星级 40502 11
伙伴星级 40503 11
伙伴星级 40504 11
伙伴星级 40505 11
伙伴星级 40506 11
伙伴星级 40507 11
伙伴星级 40508 11
伙伴星级 40509 11
伙伴星级 40510 11
伙伴星级 50301 11
伙伴星级 50401 11
伙伴星级 50402 11
伙伴星级 50403 11
伙伴星级 50404 11
伙伴星级 50501 11
伙伴星级 50502 11
伙伴星级 50503 11
伙伴星级 50504 11
伙伴星级 50505 11
伙伴星级 50506 11
伙伴星级 50507 11
伙伴星级 50508 11
伙伴星级 50509 11
伙伴星级 50510 11]], is_show=0, list={}},
	[23] = {tips="精灵6星", info=[[伙伴星级 10101 6
伙伴星级 10201 6
伙伴星级 10202 6
伙伴星级 10301 6
伙伴星级 10302 6
伙伴星级 10303 6
伙伴星级 10304 6
伙伴星级 10305 6
伙伴星级 10401 6
伙伴星级 10402 6
伙伴星级 10403 6
伙伴星级 10404 6
伙伴星级 10405 6
伙伴星级 10501 6
伙伴星级 10502 6
伙伴星级 10503 6
伙伴星级 10504 6
伙伴星级 10505 6
伙伴星级 10506 6
伙伴星级 10507 6
伙伴星级 10508 6
伙伴星级 10509 6
伙伴星级 10510 6
伙伴星级 10511 6
伙伴星级 10512 6
伙伴星级 20101 6
伙伴星级 20201 6
伙伴星级 20202 6
伙伴星级 20301 6
伙伴星级 20302 6
伙伴星级 20303 6
伙伴星级 20304 6
伙伴星级 20305 6
伙伴星级 20401 6
伙伴星级 20402 6
伙伴星级 20403 6
伙伴星级 20404 6
伙伴星级 20405 6
伙伴星级 20501 6
伙伴星级 20502 6
伙伴星级 20503 6
伙伴星级 20504 6
伙伴星级 20505 6
伙伴星级 20506 6
伙伴星级 20507 6
伙伴星级 20508 6
伙伴星级 20509 6
伙伴星级 20510 6
伙伴星级 20511 6
伙伴星级 20512 6
伙伴星级 30101 6
伙伴星级 30201 6
伙伴星级 30202 6
伙伴星级 30301 6
伙伴星级 30302 6
伙伴星级 30303 6
伙伴星级 30304 6
伙伴星级 30305 6
伙伴星级 30401 6
伙伴星级 30402 6
伙伴星级 30403 6
伙伴星级 30404 6
伙伴星级 30405 6
伙伴星级 30501 6
伙伴星级 30502 6
伙伴星级 30503 6
伙伴星级 30504 6
伙伴星级 30505 6
伙伴星级 30506 6
伙伴星级 30507 6
伙伴星级 30508 6
伙伴星级 30509 6
伙伴星级 30510 6
伙伴星级 30511 6
伙伴星级 30512 6
伙伴星级 40301 6
伙伴星级 40401 6
伙伴星级 40402 6
伙伴星级 40403 6
伙伴星级 40404 6
伙伴星级 40501 6
伙伴星级 40502 6
伙伴星级 40503 6
伙伴星级 40504 6
伙伴星级 40505 6
伙伴星级 40506 6
伙伴星级 40507 6
伙伴星级 40508 6
伙伴星级 40509 6
伙伴星级 40510 6
伙伴星级 50301 6
伙伴星级 50401 6
伙伴星级 50402 6
伙伴星级 50403 6
伙伴星级 50404 6
伙伴星级 50501 6
伙伴星级 50502 6
伙伴星级 50503 6
伙伴星级 50504 6
伙伴星级 50505 6
伙伴星级 50506 6
伙伴星级 50507 6
伙伴星级 50508 6
伙伴星级 50509 6
伙伴星级 50510 6]], is_show=0, list={}},
	[24] = {tips="精灵7星", info=[[伙伴星级 10101 7
伙伴星级 10201 7
伙伴星级 10202 7
伙伴星级 10301 7
伙伴星级 10302 7
伙伴星级 10303 7
伙伴星级 10304 7
伙伴星级 10305 7
伙伴星级 10401 7
伙伴星级 10402 7
伙伴星级 10403 7
伙伴星级 10404 7
伙伴星级 10405 7
伙伴星级 10501 7
伙伴星级 10502 7
伙伴星级 10503 7
伙伴星级 10504 7
伙伴星级 10505 7
伙伴星级 10506 7
伙伴星级 10507 7
伙伴星级 10508 7
伙伴星级 10509 7
伙伴星级 10510 7
伙伴星级 10511 7
伙伴星级 10512 7
伙伴星级 20101 7
伙伴星级 20201 7
伙伴星级 20202 7
伙伴星级 20301 7
伙伴星级 20302 7
伙伴星级 20303 7
伙伴星级 20304 7
伙伴星级 20305 7
伙伴星级 20401 7
伙伴星级 20402 7
伙伴星级 20403 7
伙伴星级 20404 7
伙伴星级 20405 7
伙伴星级 20501 7
伙伴星级 20502 7
伙伴星级 20503 7
伙伴星级 20504 7
伙伴星级 20505 7
伙伴星级 20506 7
伙伴星级 20507 7
伙伴星级 20508 7
伙伴星级 20509 7
伙伴星级 20510 7
伙伴星级 20511 7
伙伴星级 20512 7
伙伴星级 30101 7
伙伴星级 30201 7
伙伴星级 30202 7
伙伴星级 30301 7
伙伴星级 30302 7
伙伴星级 30303 7
伙伴星级 30304 7
伙伴星级 30305 7
伙伴星级 30401 7
伙伴星级 30402 7
伙伴星级 30403 7
伙伴星级 30404 7
伙伴星级 30405 7
伙伴星级 30501 7
伙伴星级 30502 7
伙伴星级 30503 7
伙伴星级 30504 7
伙伴星级 30505 7
伙伴星级 30506 7
伙伴星级 30507 7
伙伴星级 30508 7
伙伴星级 30509 7
伙伴星级 30510 7
伙伴星级 30511 7
伙伴星级 30512 7
伙伴星级 40301 7
伙伴星级 40401 7
伙伴星级 40402 7
伙伴星级 40403 7
伙伴星级 40404 7
伙伴星级 40501 7
伙伴星级 40502 7
伙伴星级 40503 7
伙伴星级 40504 7
伙伴星级 40505 7
伙伴星级 40506 7
伙伴星级 40507 7
伙伴星级 40508 7
伙伴星级 40509 7
伙伴星级 40510 7
伙伴星级 50301 7
伙伴星级 50401 7
伙伴星级 50402 7
伙伴星级 50403 7
伙伴星级 50404 7
伙伴星级 50501 7
伙伴星级 50502 7
伙伴星级 50503 7
伙伴星级 50504 7
伙伴星级 50505 7
伙伴星级 50506 7
伙伴星级 50507 7
伙伴星级 50508 7
伙伴星级 50509 7
伙伴星级 50510 7]], is_show=0, list={}},
	[25] = {tips="获取宝石", info=[[获取物品 10451 1
获取物品 10452 1
获取物品 10453 1
获取物品 10454 1
获取物品 10455 1]], is_show=1, list={}},
	[26] = {tips="锋矢阵", info=[[发起战斗 90000]], is_show=0, list={}},
	[27] = {tips="天攻阵", info=[[发起战斗 90001]], is_show=0, list={}},
	[28] = {tips="地御阵", info=[[发起战斗 90002]], is_show=0, list={}},
	[29] = {tips="疾风阵", info=[[发起战斗 90003]], is_show=0, list={}},
	[30] = {tips="雷威阵", info=[[发起战斗 90004]], is_show=0, list={}},
	[31] = {tips="圣灵阵", info=[[发起战斗 90005]], is_show=0, list={}},
	[32] = {tips="精灵8星", info=[[伙伴星级 10101 8
伙伴星级 10201 8
伙伴星级 10202 8
伙伴星级 10301 8
伙伴星级 10302 8
伙伴星级 10303 8
伙伴星级 10304 8
伙伴星级 10305 8
伙伴星级 10401 8
伙伴星级 10402 8
伙伴星级 10403 8
伙伴星级 10404 8
伙伴星级 10405 8
伙伴星级 10501 8
伙伴星级 10502 8
伙伴星级 10503 8
伙伴星级 10504 8
伙伴星级 10505 8
伙伴星级 10506 8
伙伴星级 10507 8
伙伴星级 10508 8
伙伴星级 10509 8
伙伴星级 10510 8
伙伴星级 20101 8
伙伴星级 20201 8
伙伴星级 20202 8
伙伴星级 20301 8
伙伴星级 20302 8
伙伴星级 20303 8
伙伴星级 20304 8
伙伴星级 20305 8
伙伴星级 20401 8
伙伴星级 20402 8
伙伴星级 20403 8
伙伴星级 20404 8
伙伴星级 20405 8
伙伴星级 20501 8
伙伴星级 20502 8
伙伴星级 20503 8
伙伴星级 20504 8
伙伴星级 20505 8
伙伴星级 20506 8
伙伴星级 20507 8
伙伴星级 20508 8
伙伴星级 20509 8
伙伴星级 20510 8
伙伴星级 20511 8
伙伴星级 30101 8
伙伴星级 30201 8
伙伴星级 30202 8
伙伴星级 30301 8
伙伴星级 30302 8
伙伴星级 30303 8
伙伴星级 30304 8
伙伴星级 30305 8
伙伴星级 30401 8
伙伴星级 30402 8
伙伴星级 30403 8
伙伴星级 30404 8
伙伴星级 30405 8
伙伴星级 30501 8
伙伴星级 30502 8
伙伴星级 30503 8
伙伴星级 30504 8
伙伴星级 30505 8
伙伴星级 30506 8
伙伴星级 30507 8
伙伴星级 30508 8
伙伴星级 30509 8
伙伴星级 30510 8
伙伴星级 30511 8
伙伴星级 40301 8
伙伴星级 40401 8
伙伴星级 40402 8
伙伴星级 40403 8
伙伴星级 40404 8
伙伴星级 40501 8
伙伴星级 40502 8
伙伴星级 40503 8
伙伴星级 40504 8
伙伴星级 40505 8
伙伴星级 40506 8
伙伴星级 40507 8
伙伴星级 40508 8
伙伴星级 40509 8
伙伴星级 40510 8
伙伴星级 50301 8
伙伴星级 50401 8
伙伴星级 50402 8
伙伴星级 50403 8
伙伴星级 50404 8
伙伴星级 50501 8
伙伴星级 50502 8
伙伴星级 50503 8
伙伴星级 50504 8
伙伴星级 50505 8
伙伴星级 50506 8
伙伴星级 50507 8
伙伴星级 50508 8
伙伴星级 50509 8
伙伴星级 50510 8]], is_show=0, list={}},
	[33] = {tips="精灵9星", info=[[伙伴星级 10101 9
伙伴星级 10201 9
伙伴星级 10202 9
伙伴星级 10301 9
伙伴星级 10302 9
伙伴星级 10303 9
伙伴星级 10304 9
伙伴星级 10305 9
伙伴星级 10401 9
伙伴星级 10402 9
伙伴星级 10403 9
伙伴星级 10404 9
伙伴星级 10405 9
伙伴星级 10501 9
伙伴星级 10502 9
伙伴星级 10503 9
伙伴星级 10504 9
伙伴星级 10505 9
伙伴星级 10506 9
伙伴星级 10507 9
伙伴星级 10508 9
伙伴星级 10509 9
伙伴星级 10510 9
伙伴星级 20101 9
伙伴星级 20201 9
伙伴星级 20202 9
伙伴星级 20301 9
伙伴星级 20302 9
伙伴星级 20303 9
伙伴星级 20304 9
伙伴星级 20305 9
伙伴星级 20401 9
伙伴星级 20402 9
伙伴星级 20403 9
伙伴星级 20404 9
伙伴星级 20405 9
伙伴星级 20501 9
伙伴星级 20502 9
伙伴星级 20503 9
伙伴星级 20504 9
伙伴星级 20505 9
伙伴星级 20506 9
伙伴星级 20507 9
伙伴星级 20508 9
伙伴星级 20509 9
伙伴星级 20510 9
伙伴星级 20511 9
伙伴星级 30101 9
伙伴星级 30201 9
伙伴星级 30202 9
伙伴星级 30301 9
伙伴星级 30302 9
伙伴星级 30303 9
伙伴星级 30304 9
伙伴星级 30305 9
伙伴星级 30401 9
伙伴星级 30402 9
伙伴星级 30403 9
伙伴星级 30404 9
伙伴星级 30405 9
伙伴星级 30501 9
伙伴星级 30502 9
伙伴星级 30503 9
伙伴星级 30504 9
伙伴星级 30505 9
伙伴星级 30506 9
伙伴星级 30507 9
伙伴星级 30508 9
伙伴星级 30509 9
伙伴星级 30510 9
伙伴星级 30511 9
伙伴星级 40301 9
伙伴星级 40401 9
伙伴星级 40402 9
伙伴星级 40403 9
伙伴星级 40404 9
伙伴星级 40501 9
伙伴星级 40502 9
伙伴星级 40503 9
伙伴星级 40504 9
伙伴星级 40505 9
伙伴星级 40506 9
伙伴星级 40507 9
伙伴星级 40508 9
伙伴星级 40509 9
伙伴星级 40510 9
伙伴星级 50301 9
伙伴星级 50401 9
伙伴星级 50402 9
伙伴星级 50403 9
伙伴星级 50404 9
伙伴星级 50501 9
伙伴星级 50502 9
伙伴星级 50503 9
伙伴星级 50504 9
伙伴星级 50505 9
伙伴星级 50506 9
伙伴星级 50507 9
伙伴星级 40508 9
伙伴星级 40509 9
伙伴星级 50508 9
伙伴星级 50509 9
伙伴星级 50510 9]], is_show=0, list={}},
	[34] = {tips="一键最强", info=[[伙伴进阶 6
伙伴等级 340]], is_show=0, list={}},
	[35] = {tips="精灵12星", info=[[伙伴星级 10101 12
伙伴星级 10201 12
伙伴星级 10202 12
伙伴星级 10301 12
伙伴星级 10302 12
伙伴星级 10303 12
伙伴星级 10304 12
伙伴星级 10305 12
伙伴星级 10401 12
伙伴星级 10402 12
伙伴星级 10403 12
伙伴星级 10404 12
伙伴星级 10405 12
伙伴星级 10501 12
伙伴星级 10502 12
伙伴星级 10503 12
伙伴星级 10504 12
伙伴星级 10505 12
伙伴星级 10506 12
伙伴星级 10507 12
伙伴星级 10508 12
伙伴星级 10509 12
伙伴星级 10510 12
伙伴星级 10511 12
伙伴星级 10512 12
伙伴星级 20101 12
伙伴星级 20201 12
伙伴星级 20202 12
伙伴星级 20301 12
伙伴星级 20302 12
伙伴星级 20303 12
伙伴星级 20304 12
伙伴星级 20305 12
伙伴星级 20401 12
伙伴星级 20402 12
伙伴星级 20403 12
伙伴星级 20404 12
伙伴星级 20405 12
伙伴星级 20501 12
伙伴星级 20502 12
伙伴星级 20503 12
伙伴星级 20504 12
伙伴星级 20505 12
伙伴星级 20506 12
伙伴星级 20507 12
伙伴星级 20508 12
伙伴星级 20509 12
伙伴星级 20510 12
伙伴星级 20511 12
伙伴星级 20512 12
伙伴星级 30101 12
伙伴星级 30201 12
伙伴星级 30202 12
伙伴星级 30301 12
伙伴星级 30302 12
伙伴星级 30303 12
伙伴星级 30304 12
伙伴星级 30305 12
伙伴星级 30401 12
伙伴星级 30402 12
伙伴星级 30403 12
伙伴星级 30404 12
伙伴星级 30405 12
伙伴星级 30501 12
伙伴星级 30502 12
伙伴星级 30503 12
伙伴星级 30504 12
伙伴星级 30505 12
伙伴星级 30506 12
伙伴星级 30507 12
伙伴星级 30508 12
伙伴星级 30509 12
伙伴星级 30510 12
伙伴星级 30511 12
伙伴星级 30512 12
伙伴星级 40301 12
伙伴星级 40401 12
伙伴星级 40402 12
伙伴星级 40403 12
伙伴星级 40404 12
伙伴星级 40501 12
伙伴星级 40502 12
伙伴星级 40503 12
伙伴星级 40504 12
伙伴星级 40505 12
伙伴星级 40506 12
伙伴星级 40507 12
伙伴星级 40508 12
伙伴星级 40509 12
伙伴星级 40510 12
伙伴星级 50301 12
伙伴星级 50401 12
伙伴星级 50402 12
伙伴星级 50403 12
伙伴星级 50404 12
伙伴星级 50501 12
伙伴星级 50502 12
伙伴星级 50503 12
伙伴星级 50504 12
伙伴星级 50505 12
伙伴星级 50506 12
伙伴星级 50507 12
伙伴星级 50508 12
伙伴星级 50509 12
伙伴星级 50510 12]], is_show=0, list={}},
	[36] = {tips="精灵13星", info=[[伙伴星级 10101 13
伙伴星级 10201 13
伙伴星级 10202 13
伙伴星级 10301 13
伙伴星级 10302 13
伙伴星级 10303 13
伙伴星级 10304 13
伙伴星级 10305 13
伙伴星级 10401 13
伙伴星级 10402 13
伙伴星级 10403 13
伙伴星级 10404 13
伙伴星级 10405 13
伙伴星级 10501 13
伙伴星级 10502 13
伙伴星级 10503 13
伙伴星级 10504 13
伙伴星级 10505 13
伙伴星级 10506 13
伙伴星级 10507 13
伙伴星级 10508 13
伙伴星级 10509 13
伙伴星级 10510 13
伙伴星级 10511 13
伙伴星级 10512 13
伙伴星级 20101 13
伙伴星级 20201 13
伙伴星级 20202 13
伙伴星级 20301 13
伙伴星级 20302 13
伙伴星级 20303 13
伙伴星级 20304 13
伙伴星级 20305 13
伙伴星级 20401 13
伙伴星级 20402 13
伙伴星级 20403 13
伙伴星级 20404 13
伙伴星级 20405 13
伙伴星级 20501 13
伙伴星级 20502 13
伙伴星级 20503 13
伙伴星级 20504 13
伙伴星级 20505 13
伙伴星级 20506 13
伙伴星级 20507 13
伙伴星级 20508 13
伙伴星级 20509 13
伙伴星级 20510 13
伙伴星级 20511 13
伙伴星级 20512 13
伙伴星级 30101 13
伙伴星级 30201 13
伙伴星级 30202 13
伙伴星级 30301 13
伙伴星级 30302 13
伙伴星级 30303 13
伙伴星级 30304 13
伙伴星级 30305 13
伙伴星级 30401 13
伙伴星级 30402 13
伙伴星级 30403 13
伙伴星级 30404 13
伙伴星级 30405 13
伙伴星级 30501 13
伙伴星级 30502 13
伙伴星级 30503 13
伙伴星级 30504 13
伙伴星级 30505 13
伙伴星级 30506 13
伙伴星级 30507 13
伙伴星级 30508 13
伙伴星级 30509 13
伙伴星级 30510 13
伙伴星级 30511 13
伙伴星级 30512 13
伙伴星级 40301 13
伙伴星级 40401 13
伙伴星级 40402 13
伙伴星级 40403 13
伙伴星级 40404 13
伙伴星级 40501 13
伙伴星级 40502 13
伙伴星级 40503 13
伙伴星级 40504 13
伙伴星级 40505 13
伙伴星级 40506 13
伙伴星级 40507 13
伙伴星级 40508 13
伙伴星级 40509 13
伙伴星级 40510 13
伙伴星级 50301 13
伙伴星级 50401 13
伙伴星级 50402 13
伙伴星级 50403 13
伙伴星级 50404 13
伙伴星级 50501 13
伙伴星级 50502 13
伙伴星级 50503 13
伙伴星级 50504 13
伙伴星级 50505 13
伙伴星级 50506 13
伙伴星级 50507 13
伙伴星级 50508 13
伙伴星级 50509 13
伙伴星级 50510 13]], is_show=0, list={}},
	[40] = {tips="加白装", info=[[获取物品 40100 1
获取物品 40101 1
获取物品 40102 1
获取物品 40103 1
获取物品 40104 1
获取物品 40105 1
获取物品 40106 1
获取物品 40107 1
获取物品 40108 1
获取物品 40109 1
获取物品 40110 1
获取物品 40200 1
获取物品 40201 1
获取物品 40202 1
获取物品 40203 1
获取物品 40204 1
获取物品 40205 1
获取物品 40206 1
获取物品 40207 1
获取物品 40208 1
获取物品 40209 1
获取物品 40210 1
获取物品 40300 1
获取物品 40301 1
获取物品 40302 1
获取物品 40303 1
获取物品 40304 1
获取物品 40305 1
获取物品 40306 1
获取物品 40307 1
获取物品 40308 1
获取物品 40309 1
获取物品 40310 1
获取物品 40400 1
获取物品 40401 1
获取物品 40402 1
获取物品 40403 1
获取物品 40404 1
获取物品 40405 1
获取物品 40406 1
获取物品 40407 1
获取物品 40408 1
获取物品 40409 1
获取物品 40410 1]], is_show=0, list={}},
	[41] = {tips="绿装", info=[[获取物品 41100 1
获取物品 41101 1
获取物品 41102 1
获取物品 41103 1
获取物品 41104 1
获取物品 41105 1
获取物品 41106 1
获取物品 41107 1
获取物品 41108 1
获取物品 41109 1
获取物品 41110 1
获取物品 41200 1
获取物品 41201 1
获取物品 41202 1
获取物品 41203 1
获取物品 41204 1
获取物品 41205 1
获取物品 41206 1
获取物品 41207 1
获取物品 41208 1
获取物品 41209 1
获取物品 41210 1
获取物品 41300 1
获取物品 41301 1
获取物品 41302 1
获取物品 41303 1
获取物品 41304 1
获取物品 41305 1
获取物品 41306 1
获取物品 41307 1
获取物品 41308 1
获取物品 41309 1
获取物品 41310 1
获取物品 41400 1
获取物品 41401 1
获取物品 41402 1
获取物品 41403 1
获取物品 41404 1
获取物品 41405 1
获取物品 41406 1
获取物品 41407 1
获取物品 41408 1
获取物品 41409 1
获取物品 41410 1]], is_show=0, list={}},
	[42] = {tips="蓝装", info=[[获取物品 42100 1
获取物品 42101 1
获取物品 42102 1
获取物品 42103 1
获取物品 42104 1
获取物品 42105 1
获取物品 42106 1
获取物品 42107 1
获取物品 42108 1
获取物品 42109 1
获取物品 42110 1
获取物品 42200 1
获取物品 42201 1
获取物品 42202 1
获取物品 42203 1
获取物品 42204 1
获取物品 42205 1
获取物品 42206 1
获取物品 42207 1
获取物品 42208 1
获取物品 42209 1
获取物品 42210 1
获取物品 42300 1
获取物品 42301 1
获取物品 42302 1
获取物品 42303 1
获取物品 42304 1
获取物品 42305 1
获取物品 42306 1
获取物品 42307 1
获取物品 42308 1
获取物品 42309 1
获取物品 42310 1
获取物品 42400 1
获取物品 42401 1
获取物品 42402 1
获取物品 42403 1
获取物品 42404 1
获取物品 42405 1
获取物品 42406 1
获取物品 42407 1
获取物品 42408 1
获取物品 42409 1
获取物品 42410 1]], is_show=0, list={}},
	[43] = {tips="紫装", info=[[获取物品 43100 1
获取物品 43101 1
获取物品 43102 1
获取物品 43103 1
获取物品 43104 1
获取物品 43105 1
获取物品 43106 1
获取物品 43107 1
获取物品 43108 1
获取物品 43109 1
获取物品 43110 1
获取物品 43200 1
获取物品 43201 1
获取物品 43202 1
获取物品 43203 1
获取物品 43204 1
获取物品 43205 1
获取物品 43206 1
获取物品 43207 1
获取物品 43208 1
获取物品 43209 1
获取物品 43210 1
获取物品 43300 1
获取物品 43301 1
获取物品 43302 1
获取物品 43303 1
获取物品 43304 1
获取物品 43305 1
获取物品 43306 1
获取物品 43307 1
获取物品 43308 1
获取物品 43309 1
获取物品 43310 1
获取物品 43400 1
获取物品 43401 1
获取物品 43402 1
获取物品 43403 1
获取物品 43404 1
获取物品 43405 1
获取物品 43406 1
获取物品 43407 1
获取物品 43408 1
获取物品 43409 1
获取物品 43410 1]], is_show=0, list={}},
	[44] = {tips="橙装", info=[[获取物品 44100 1
获取物品 44101 1
获取物品 44102 1
获取物品 44103 1
获取物品 44104 1
获取物品 44105 1
获取物品 44106 1
获取物品 44107 1
获取物品 44108 1
获取物品 44109 1
获取物品 44110 1
获取物品 44200 1
获取物品 44201 1
获取物品 44202 1
获取物品 44203 1
获取物品 44204 1
获取物品 44205 1
获取物品 44206 1
获取物品 44207 1
获取物品 44208 1
获取物品 44209 1
获取物品 44210 1
获取物品 44300 1
获取物品 44301 1
获取物品 44302 1
获取物品 44303 1
获取物品 44304 1
获取物品 44305 1
获取物品 44306 1
获取物品 44307 1
获取物品 44308 1
获取物品 44309 1
获取物品 44310 1
获取物品 44400 1
获取物品 44401 1
获取物品 44402 1
获取物品 44403 1
获取物品 44404 1
获取物品 44405 1
获取物品 44406 1
获取物品 44407 1
获取物品 44408 1
获取物品 44409 1
获取物品 44410 1]], is_show=0, list={}},
	[50] = {tips="水系精灵", info=[[加伙伴 10101
加伙伴 10201
加伙伴 10202
加伙伴 10301
加伙伴 10302
加伙伴 10303
加伙伴 10304
加伙伴 10305
加伙伴 10401
加伙伴 10402
加伙伴 10403
加伙伴 10404
加伙伴 10405
加伙伴 10501
加伙伴 10502
加伙伴 10503
加伙伴 10504
加伙伴 10505
加伙伴 10506
加伙伴 10507
加伙伴 10508
加伙伴 10509
加伙伴 10510
加伙伴 10511
加伙伴 10512]], is_show=0, list={}},
	[51] = {tips="火系精灵", info=[[加伙伴 20201
加伙伴 20202
加伙伴 20301
加伙伴 20302
加伙伴 20303
加伙伴 20304
加伙伴 20305
加伙伴 20401
加伙伴 20402
加伙伴 20403
加伙伴 20404
加伙伴 20405
加伙伴 20501
加伙伴 20502
加伙伴 20503
加伙伴 20504
加伙伴 20505
加伙伴 20506
加伙伴 20507
加伙伴 20508
加伙伴 20509
加伙伴 20510
加伙伴 20511
加伙伴 20512]], is_show=0, list={}},
	[52] = {tips="风系精灵", info=[[加伙伴 30201
加伙伴 30202
加伙伴 30301
加伙伴 30302
加伙伴 30303
加伙伴 30304
加伙伴 30305
加伙伴 30401
加伙伴 30402
加伙伴 30403
加伙伴 30404
加伙伴 30405
加伙伴 30501
加伙伴 30502
加伙伴 30503
加伙伴 30504
加伙伴 30505
加伙伴 30506
加伙伴 30507
加伙伴 30508
加伙伴 30509
加伙伴 30510
加伙伴 30511
加伙伴 30512]], is_show=0, list={}},
	[53] = {tips="光系精灵", info=[[加伙伴 40301
加伙伴 40401
加伙伴 40402
加伙伴 40403
加伙伴 40404
加伙伴 40501
加伙伴 40502
加伙伴 40503
加伙伴 40504
加伙伴 40505
加伙伴 40506
加伙伴 40507
加伙伴 40508
加伙伴 40509
加伙伴 40510]], is_show=0, list={}},
	[54] = {tips="暗系精灵", info=[[加伙伴 50301
加伙伴 50401
加伙伴 50402
加伙伴 50403
加伙伴 50404
加伙伴 50501
加伙伴 50502
加伙伴 50503
加伙伴 50504
加伙伴 50505
加伙伴 50506
加伙伴 50507
加伙伴 50508
加伙伴 50509
加伙伴 50510]], is_show=0, list={}},
	[55] = {tips="测试阵容", info=[[加伙伴 40502
加伙伴 20502
加伙伴 10505
加伙伴 10503
加伙伴 10502
加伙伴 40505
加伙伴 40506
加伙伴 40401
加伙伴 10501
加伙伴 10504
加伙伴 40501
加伙伴 50504
加伙伴 10507
加伙伴 10508
加伙伴10509
加伙伴 30402
加伙伴 20501
加伙伴 20503
加伙伴 20504
加伙伴 20506
加伙伴 10401
加伙伴10403
加伙伴 10405
加伙伴 10506
加伙伴 40507]], is_show=1, list={}},
	[56] = {tips="6星测试", info=[[伙伴星级 40502 6
伙伴星级 20502 6
伙伴星级 10505 6
伙伴星级 10503 6
伙伴星级 10502 6
伙伴星级 40505 6
伙伴星级 40506 6
伙伴星级 40401 6
伙伴星级 10501 6
伙伴星级 10504 6
伙伴星级 40501 6
伙伴星级 50504 6
伙伴星级 10507 6
伙伴星级 10508 6
伙伴星级10509 6
伙伴星级 30402 6
伙伴星级 20501 6
伙伴星级 20503 6
伙伴星级 20504 6
伙伴星级 20506 6]], is_show=0, list={}},
	[57] = {tips="10星测试", info=[[伙伴星级 10501 10
伙伴星级 10502 10
伙伴星级 10503 10
伙伴星级 10504 10
伙伴星级 10505 10
伙伴星级 10506 10
伙伴星级 10507 10
伙伴星级 10508 10
伙伴星级 10509 10
伙伴星级 10510 10
伙伴星级 10511 10
伙伴星级 20501 10
伙伴星级 20502 10
伙伴星级 20503 10
伙伴星级 20504 10
伙伴星级 20505 10
伙伴星级 20506 10
伙伴星级 20507 10
伙伴星级 20508 10
伙伴星级 20509 10
伙伴星级 20510 10
伙伴星级 20511 10
伙伴星级 30501 10
伙伴星级 30502 10
伙伴星级 30503 10
伙伴星级 30504 10
伙伴星级 30505 10
伙伴星级 30506 10
伙伴星级 30507 10
伙伴星级 30508 10
伙伴星级 30509 10
伙伴星级 30510 10
伙伴星级 30511 10
伙伴星级 40501 10
伙伴星级 40502 10
伙伴星级 40503 10
伙伴星级 40504 10
伙伴星级 40505 10
伙伴星级 40506 10
伙伴星级 40507 10
伙伴星级 40508 10
伙伴星级 40509 10
伙伴星级 40510 10
伙伴星级 50501 10
伙伴星级 50502 10
伙伴星级 50503 10
伙伴星级 50504 10
伙伴星级 50505 10
伙伴星级 50506 10
伙伴星级 50507 10
伙伴星级 50508 10
伙伴星级 50509 10
伙伴星级 50510 10]], is_show=0, list={}},
	[58] = {tips="12星测试", info=[[伙伴星级 10501 12
伙伴星级 10502 12
伙伴星级 10503 12
伙伴星级 10504 12
伙伴星级 10505 12
伙伴星级 10506 12
伙伴星级 10507 12
伙伴星级 10508 12
伙伴星级 10509 12
伙伴星级 10510 12
伙伴星级 10511 12
伙伴星级 20501 12
伙伴星级 20502 12
伙伴星级 20503 12
伙伴星级 20504 12
伙伴星级 20505 12
伙伴星级 20506 12
伙伴星级 20507 12
伙伴星级 20508 12
伙伴星级 20509 12
伙伴星级 20510 12
伙伴星级 20511 12
伙伴星级 30501 12
伙伴星级 30502 12
伙伴星级 30503 12
伙伴星级 30504 12
伙伴星级 30505 12
伙伴星级 30506 12
伙伴星级 30507 12
伙伴星级 30508 12
伙伴星级 30509 12
伙伴星级 30510 12
伙伴星级 30511 12
伙伴星级 40501 12
伙伴星级 40502 12
伙伴星级 40503 12
伙伴星级 40504 12
伙伴星级 40505 12
伙伴星级 40506 12
伙伴星级 40507 12
伙伴星级 40508 12
伙伴星级 40509 12
伙伴星级 40510 12
伙伴星级 50501 12
伙伴星级 50502 12
伙伴星级 50503 12
伙伴星级 50504 12
伙伴星级 50505 12
伙伴星级 50506 12
伙伴星级 50507 12
伙伴星级 50508 12
伙伴星级 50509 12
伙伴星级 50510 12]], is_show=0, list={}},
	[60] = {tips="召唤测试", info=[[获取物品 10401 4
获取物品 10403 4]], is_show=0, list={}},
	[62] = {tips="30活跃", info=[[获取物品 8 30]], is_show=0, list={}},
	[63] = {tips="签到刷新", info=[[0点更新]], is_show=0, list={}},
	[71] = {tips="关机器人", info=[[关闭机器人]], is_show=0, list={}},
	[72] = {tips="加16机器", info=[[开机器人 1 16 dwar]], is_show=0, list={}},
	[73] = {tips="加32机器", info=[[开机器人 1 32 dwar]], is_show=0, list={}},
	[74] = {tips="加64机器", info=[[开机器人 1 64 dwar]], is_show=0, list={}},
	[80] = {tips="副本全开", info=[[剧情副本全开]], is_show=0, list={}},
	[81] = {tips="设置全通关", info=[[剧情章节通关]], is_show=0, list={}},
	[82] = {tips="一秒清冷却", info=[[剧情关卡冷却]], is_show=0, list={}},
	[83] = {tips="通关第一章", info=[[剧情章节通关 10410]], is_show=0, list={}},
	[84] = {tips="技能无CD", info=[[无CD]], is_show=0, list={}},
	[85] = {tips="战斗沙包", info=[[发起战斗 99999]], is_show=0, list={}},
	[86] = {tips="解锁技能", info=[[解锁技能]], is_show=0, list={}},
	[87] = {tips="打自己", info=[[打自己]], is_show=0, list={}},
	[88] = {tips="打沙包1", info=[[发起战斗 99997]], is_show=0, list={}},
	[100] = {tips="普通充值6", info=[[充值 6 3]], is_show=0, list={}},
	[101] = {tips="普通充值30", info=[[充值 30 4]], is_show=0, list={}},
	[102] = {tips="普通充值98", info=[[充值 98 5]], is_show=0, list={}},
	[103] = {tips="普通充值198", info=[[充值 198 6]], is_show=0, list={}},
	[104] = {tips="普通充值328", info=[[充值 328 7]], is_show=0, list={}},
	[105] = {tips="普通充值648", info=[[充值 648 8]], is_show=0, list={}},
	[106] = {tips="普通充值68", info=[[充值 68 20]], is_show=0, list={}},
	[107] = {tips="普通充值128", info=[[充值 128 21]], is_show=0, list={}},
	[108] = {tips="成长基金", info=[[充值 98 101]], is_show=0, list={}},
	[109] = {tips="128基金", info=[[充值 128 102]], is_show=0, list={}},
	[110] = {tips="328基金", info=[[充值 328 103]], is_show=0, list={}},
	[111] = {tips="5星级养成", info=[[充值 30 201]], is_show=0, list={}},
	[112] = {tips="6星级养成", info=[[充值 68 202]], is_show=0, list={}},
	[113] = {tips="7星级养成", info=[[充值 128 203]], is_show=0, list={}},
	[114] = {tips="8星级养成", info=[[充值 328 204]], is_show=0, list={}},
	[115] = {tips="9星级养成", info=[[充值 328 205]], is_show=0, list={}},
	[116] = {tips="10星级养成", info=[[充值 448 206]], is_show=0, list={}},
	[117] = {tips="18等级包", info=[[充值 18 211]], is_show=0, list={}},
	[118] = {tips="48等级包", info=[[充值 68 212]], is_show=0, list={}},
	[119] = {tips="68等级包", info=[[充值 128 213]], is_show=0, list={}},
	[120] = {tips="78等级包", info=[[充值 128 214]], is_show=0, list={}},
	[121] = {tips="88等级包", info=[[充值 328 215]], is_show=0, list={}},
	[122] = {tips="98等级包", info=[[充值 328 216]], is_show=0, list={}},
	[123] = {tips="108等级包", info=[[充值 328 217]], is_show=0, list={}},
	[124] = {tips="118等级包", info=[[充值 448 218]], is_show=0, list={}},
	[125] = {tips="128等级包", info=[[充值 448 219]], is_show=0, list={}},
	[126] = {tips="138等级包", info=[[充值 648 220]], is_show=0, list={}},
	[127] = {tips="1元礼包", info=[[充值 1 301]], is_show=0, list={}},
	[128] = {tips="3元V1礼包", info=[[充值 3 302]], is_show=0, list={}},
	[129] = {tips="6元V2礼包", info=[[充值 6 303]], is_show=0, list={}},
	[130] = {tips="30先知水晶", info=[[充值 30 304]], is_show=0, list={}},
	[131] = {tips="68快速特权", info=[[充值 68 305]], is_show=0, list={}},
	[132] = {tips="30每周礼包", info=[[充值 30 401]], is_show=0, list={}},
	[133] = {tips="68每周礼包", info=[[充值 68 402]], is_show=0, list={}},
	[134] = {tips="128每周礼包", info=[[充值 128 403]], is_show=0, list={}},
	[135] = {tips="328每周礼包", info=[[充值 328 404]], is_show=0, list={}},
	[136] = {tips="448每周礼包", info=[[充值 448 405]], is_show=0, list={}},
	[137] = {tips="30月度礼包", info=[[充值 30 411]], is_show=0, list={}},
	[138] = {tips="68月度礼包", info=[[充值 68 412]], is_show=0, list={}},
	[139] = {tips="128月度礼包", info=[[充值 128 413]], is_show=0, list={}},
	[140] = {tips="328月度礼包", info=[[充值 328 414]], is_show=0, list={}},
	[141] = {tips="448月度礼包", info=[[充值 448 415]], is_show=0, list={}},
	[142] = {tips="648月度礼包", info=[[充值 648 416]], is_show=0, list={}},
	[200] = {tips="1星勇气", info=[[获取物品 1010201
获取物品 1010202
获取物品 1010203
获取物品 1010204]], is_show=0, list={}},
	[201] = {tips="1星狂怒", info=[[获取物品 2010201
获取物品 2010202
获取物品 2010203
获取物品 2010204]], is_show=0, list={}},
	[202] = {tips="1星斗志", info=[[获取物品 3010201
获取物品 3010202
获取物品 3010203
获取物品 3010204]], is_show=0, list={}},
	[203] = {tips="1星灵咏", info=[[获取物品 4010201
获取物品 4010202
获取物品 4010203
获取物品 4010204]], is_show=0, list={}},
	[204] = {tips="1星穿甲", info=[[获取物品 5010201
获取物品 5010202
获取物品 5010203
获取物品 5010204]], is_show=0, list={}},
	[205] = {tips="1星破法", info=[[获取物品 6010201
获取物品 6010202
获取物品 6010203
获取物品 6010204]], is_show=0, list={}},
	[206] = {tips="1星斗战", info=[[获取物品 7010201
获取物品 7010202
获取物品 7010203
获取物品 7010204]], is_show=0, list={}},
	[207] = {tips="1星镇灵", info=[[获取物品 8010201
获取物品 8010202
获取物品 8010203
获取物品 8010204]], is_show=0, list={}},
	[208] = {tips="1星魔甲", info=[[获取物品 9010201
获取物品 9010202
获取物品 9010203
获取物品 9010204]], is_show=0, list={}},
	[209] = {tips="1星神战", info=[[获取物品 10010201
获取物品 10010202
获取物品 10010203
获取物品 10010204]], is_show=0, list={}},
	[210] = {tips="1星龙威", info=[[获取物品 11010201
获取物品 11010202
获取物品 11010203
获取物品 11010204]], is_show=0, list={}},
	[211] = {tips="1星神愈", info=[[获取物品 12010201
获取物品 12010202
获取物品 12010203
获取物品 12010204]], is_show=0, list={}},
	[212] = {tips="1星极速", info=[[获取物品 13010201
获取物品 13010202
获取物品 13010203
获取物品 13010204]], is_show=0, list={}},
	[213] = {tips="1星玄护", info=[[获取物品 14010201
获取物品 14010202
获取物品 14010203
获取物品 14010204]], is_show=0, list={}},
	[214] = {tips="5星勇气", info=[[获取物品 1050201
获取物品 1050202
获取物品 1050203
获取物品 1050204]], is_show=0, list={}},
	[215] = {tips="5星狂怒", info=[[获取物品 2050201
获取物品 2050202
获取物品 2050203
获取物品 2050204]], is_show=0, list={}},
	[216] = {tips="5星斗志", info=[[获取物品 3050201
获取物品 3050202
获取物品 3050203
获取物品 3050204]], is_show=0, list={}},
	[217] = {tips="5星灵咏", info=[[获取物品 4050201
获取物品 4050202
获取物品 4050203
获取物品 4050204]], is_show=0, list={}},
	[218] = {tips="5星穿甲", info=[[获取物品 5050201
获取物品 5050202
获取物品 5050203
获取物品 5050204]], is_show=0, list={}},
	[219] = {tips="5星破法", info=[[获取物品 6050201
获取物品 6050202
获取物品 6050203
获取物品 6050204]], is_show=0, list={}},
	[220] = {tips="5星斗战", info=[[获取物品 7050201
获取物品 7050202
获取物品 7050203
获取物品 7050204]], is_show=0, list={}},
	[221] = {tips="5星镇灵", info=[[获取物品 8050201
获取物品 8050202
获取物品 8050203
获取物品 8050204]], is_show=0, list={}},
	[222] = {tips="5星魔甲", info=[[获取物品 9050201
获取物品 9050202
获取物品 9050203
获取物品 9050204]], is_show=0, list={}},
	[223] = {tips="5星神战", info=[[获取物品 10050201
获取物品 10050202
获取物品 10050203
获取物品 10050204]], is_show=0, list={}},
	[224] = {tips="5星龙威", info=[[获取物品 11050201
获取物品 11050202
获取物品 11050203
获取物品 11050204]], is_show=0, list={}},
	[225] = {tips="5星神愈", info=[[获取物品 12050201
获取物品 12050202
获取物品 12050203
获取物品 12050204]], is_show=0, list={}},
	[226] = {tips="5星极速", info=[[获取物品 13050201
获取物品 13050202
获取物品 13050203
获取物品 13050204]], is_show=0, list={}},
	[227] = {tips="5星玄护", info=[[获取物品 14050201
获取物品 14050202
获取物品 14050203
获取物品 14050204]], is_show=0, list={}},
	[301] = {tips="温馨小屋主题", info=[[获取物品 200151
获取物品 200152
获取物品 200101
获取物品 200102
获取物品 200103
获取物品 200104
获取物品 200105
获取物品 200106
获取物品 200107
获取物品 200108
获取物品 200109
获取物品 200110
获取物品 200111
获取物品 200112
获取物品 200113
获取物品 200114]], is_show=0, list={}},
	[302] = {tips="皇室贵族主题", info=[[获取物品 200251
获取物品 200252
获取物品 200201
获取物品 200202
获取物品 200203
获取物品 200204
获取物品 200205
获取物品 200206
获取物品 200207
获取物品 200208
获取物品 200209
获取物品 200210
获取物品 200211
获取物品 200212
获取物品 200213
获取物品 200214]], is_show=0, list={}},
	[303] = {tips="占星密室主题", info=[[获取物品 200351
获取物品 200352
获取物品 200301
获取物品 200302
获取物品 200303
获取物品 200304
获取物品 200305
获取物品 200306
获取物品 200307
获取物品 200308
获取物品 200309
获取物品 200310
获取物品 200311
获取物品 200312
获取物品 200313
获取物品 200314]], is_show=0, list={}},
	[304] = {tips="浓情七夕主题", info=[[获取物品 200451
获取物品 200452
获取物品 200401
获取物品 200402
获取物品 200403
获取物品 200404
获取物品 200405
获取物品 200406
获取物品 200407
获取物品 200408
获取物品 200409
获取物品 200410
获取物品 200411
获取物品 200412
获取物品 200413
获取物品 200414]], is_show=0, list={}},
	[305] = {tips="万圣节主题", info=[[获取物品 200501
获取物品 200502
获取物品 200503
获取物品 200504
获取物品 200505
获取物品 200506
获取物品 200507
获取物品 200508
获取物品 200509
获取物品 200510
获取物品 200511
获取物品 200512
获取物品 200513
获取物品 200514
获取物品 200551
获取物品 200552]], is_show=0, list={}},
	[401] = {tips="所有食物", info=[[获取物品 100101 1
获取物品 100102 1
获取物品 100103 1
获取物品 100104 1
获取物品 100105 1
获取物品 100106 1
获取物品 100107 1
获取物品 100108 1]], is_show=0, list={}},
	[402] = {tips="所有道具", info=[[获取物品 100201 1
获取物品 100202 1
获取物品 100203 1
获取物品 100204 1
获取物品 100205 1
获取物品 100241 1
获取物品 100242 1
获取物品 100243 1
获取物品 100244 1
获取物品 100245 1
获取物品 100281 1
获取物品 100282 1
获取物品 100283 1]], is_show=0, list={}},
	[403] = {tips="所有珍品", info=[[获取物品 100301 1
获取物品 100302 1
获取物品 100303 1
获取物品 100304 1
获取物品 100305 1
获取物品 100306 1
获取物品 100307 1
获取物品 100308 1
获取物品 100309 1
获取物品 100310 1
获取物品 100311 1
获取物品 100312 1]], is_show=0, list={}},
	[404] = {tips="所有明信片", info=[[获取物品 100401 1
获取物品 100402 1
获取物品 100403 1
获取物品 100404 1
获取物品 100405 1]], is_show=0, list={}},
	[405] = {tips="所有日记", info=[[获取物品 100501 1
获取物品 100502 1
获取物品 100503 1
获取物品 100504 1
获取物品 100505 1
获取物品 100506 1
获取物品 100507 1
获取物品 100508 1
获取物品 100509 1
获取物品 100510 1
获取物品 100511 1
获取物品 100512 1
获取物品 100513 1
获取物品 100514 1
获取物品 100515 1
获取物品 100516 1
获取物品 100517 1
获取物品 100518 1
获取物品 100519 1
获取物品 100520 1
获取物品 100521 1
获取物品 100522 1
获取物品 100523 1
获取物品 100524 1
获取物品 100525 1
获取物品 100526 1
获取物品 100527 1
获取物品 100528 1
获取物品 100529 1
获取物品 100530 1
获取物品 100531 1
获取物品 100532 1
获取物品 100533 1
获取物品 100534 1
获取物品 100535 1
获取物品 100536 1
获取物品 100537 1
获取物品 100538 1
获取物品 100539 1
获取物品 100540 1]], is_show=0, list={}},
	[501] = {tips="所有光盘", info=[[获取物品 10601 10
获取物品 10602 10
获取物品 10603 10]], is_show=0, list={}},
	[502] = {tips="所有道具", info=[[获取物品 10701 10
获取物品 10702 10
获取物品 10703 10]], is_show=0, list={}},
	[503] = {tips="所有初级招式", info=[[获取物品 111001 1
获取物品 111002 1
获取物品 111003 1
获取物品 111004 1
获取物品 111005 1
获取物品 112001 1
获取物品 112002 1
获取物品 112003 1
获取物品 112004 1
获取物品 113001 1
获取物品 113002 1
获取物品 113003 1
获取物品 113004 1
获取物品 113005 1
获取物品 113006 1
获取物品 113007 1
获取物品 113008 1
获取物品 113009 1]], is_show=0, list={}},
	[504] = {tips="所有满级招式", info=[[获取物品 111401 1
获取物品 111402 1
获取物品 111403 1
获取物品 111404 1
获取物品 111405 1
获取物品 112401 1
获取物品 112402 1
获取物品 112403 1
获取物品 112404 1
获取物品 113401 1
获取物品 113402 1
获取物品 113403 1
获取物品 113404 1
获取物品 113405 1
获取物品 113406 1
获取物品 113407 1
获取物品 113408 1
获取物品 113409 1]], is_show=0, list={}},
	[505] = {tips="超多奥术之尘", info=[[获取物品 10040 50000]], is_show=0, list={}},
	[506] = {tips="超多圣露", info=[[获取物品 10041 500]], is_show=0, list={}},
	[507] = {tips="风火阵", info=[[加伙伴 20507
加伙伴 20510
加伙伴 30507
加伙伴 30508
加伙伴 30509
伙伴星级 20507 13
伙伴星级 20510 13
伙伴星级 30507 13
伙伴星级 30508 13
伙伴星级 30509 13]], is_show=0, list={}},
	[508] = {tips="光暗菜刀", info=[[加伙伴 50504
加伙伴 50508
加伙伴 50509
加伙伴 40506
加伙伴 40508
伙伴星级 50504 13
伙伴星级 50508 13
伙伴星级 50509 13
伙伴星级 40506 13
伙伴星级 40508 13]], is_show=0, list={}},
	[509] = {tips="纯光", info=[[加伙伴 40503
加伙伴 40507
加伙伴 40508
加伙伴 40509
加伙伴 40510
伙伴星级 40503 13
伙伴星级 40507 13
伙伴星级 40508 13
伙伴星级 40509 13
伙伴星级 40510 13]], is_show=0, list={}},
	[510] = {tips="纯暗", info=[[加伙伴 50504
加伙伴 50508
加伙伴 50509
加伙伴 50510
加伙伴 50507
伙伴星级 50504 13
伙伴星级 50508 13
伙伴星级 50509 13
伙伴星级 50510 13
伙伴星级 50507 13]], is_show=0, list={}},
	[511] = {tips="风光阵", info=[[加伙伴 40507
加伙伴 40508
加伙伴 30507
加伙伴 30508
加伙伴 30509
伙伴星级 40507 13
伙伴星级 40508 13
伙伴星级 30507 13
伙伴星级 30508 13
伙伴星级 30509 13]], is_show=0, list={}},
	[512] = {tips="纯火", info=[[加伙伴 20507
加伙伴 20510
加伙伴 20504
加伙伴 20508
加伙伴 20509
伙伴星级 20507 13
伙伴星级 20510 13
伙伴星级 20504 13
伙伴星级 20508 13
伙伴星级 20509 13]], is_show=0, list={}},
	[513] = {tips="纯风", info=[[加伙伴 30507
加伙伴 30508
加伙伴 30509
加伙伴 30510
加伙伴 30511
伙伴星级 30507 13
伙伴星级 30508 13
伙伴星级 30509 13
伙伴星级 30510 13
伙伴星级 30511 13]], is_show=0, list={}},
	[514] = {tips="训练师任务完成", info=[[圣器任务完成]], is_show=0, list={}},
	[515] = {tips="公会技能满级", info=[[设联盟技能 2 40
设联盟技能 3 40
设联盟技能 4 40
设联盟技能 5 40
加联盟活跃经验 999999]], is_show=0, list={}},
	[516] = {tips="所有石板满级", info=[[圣物等级 1 100
圣物等级 2 100
圣物等级 3 100set
圣物等级 4 100
圣物等级 5 100
圣物进阶 1 10
圣物进阶 2 10
圣物进阶 3 10
圣物进阶 4 10
圣物进阶 5 10]], is_show=0, list={}},
	[517] = {tips="所有天赋石", info=[[获取物品 宝石精华 999999
获取物品 天界神石 999999
获取物品 10460 999999
获取物品 16001 20
获取物品 16002 20
获取物品 16003 20
获取物品 16004 20
获取物品 16005 20
获取物品 16006 20
获取物品 16007 20
获取物品 16008 20
获取物品 16009 20
获取物品 16010 20
获取物品 16011 20
获取物品 16012 20
获取物品 16013 20
获取物品 16014 20
获取物品 16015 20
获取物品 16016 20
获取物品 16017 20
获取物品 16018 20
获取物品 16019 20
获取物品 16020 20
获取物品 16021 20
获取物品 16022 20
获取物品 16023 20
获取物品 16024 20
获取物品 16025 20
获取物品 16026 20
获取物品 16027 20
获取物品 16028 20
获取物品 16029 20
获取物品 16030 20
获取物品 16031 20
获取物品 16032 20
获取物品 16033 20
获取物品 16034 20
获取物品 16035 20
获取物品 16036 20
获取物品 16037 20
获取物品 16038 20
获取物品 16039 20
获取物品 16040 20
获取物品 16041 20
获取物品 16042 20
获取物品 16043 20
获取物品 16044 20
获取物品 16045 20
获取物品 16046 20
获取物品 16047 20
获取物品 16101 20
获取物品 16102 20
获取物品 16103 20
获取物品 16104 20
获取物品 16105 20
获取物品 16106 20
获取物品 16107 20
获取物品 16108 20]], is_show=0, list={}},
	[518] = {tips="装备宝石饰品", info=[[获取物品 40117 10
获取物品 40217 10
获取物品 40317 10
获取物品 40417 10
获取物品 10455 20
获取物品 1050201
获取物品 1050202
获取物品 1050203
获取物品 1050204
获取物品 2050201
获取物品 2050202
获取物品 2050203
获取物品 2050204
获取物品 3050201
获取物品 3050202
获取物品 3050203
获取物品 3050204
获取物品 4050201
获取物品 4050202
获取物品 4050203
获取物品 4050204
获取物品 5050201
获取物品 5050202
获取物品 5050203
获取物品 5050204
获取物品 6050201
获取物品 6050202
获取物品 6050203
获取物品 6050204
获取物品 7050201
获取物品 7050202
获取物品 7050203
获取物品 7050204
获取物品 8050201
获取物品 8050202
获取物品 8050203
获取物品 8050204
获取物品 9050201
获取物品 9050202
获取物品 9050203
获取物品 9050204
获取物品 10050201
获取物品 10050202
获取物品 10050203
获取物品 10050204
获取物品 11050201
获取物品 11050202
获取物品 11050203
获取物品 11050204
获取物品 12050201
获取物品 12050202
获取物品 12050203
获取物品 12050204
获取物品 13050201
获取物品 13050202
获取物品 13050203
获取物品 13050204
获取物品 14050201
获取物品 14050202
获取物品 14050203
获取物品 14050204]], is_show=0, list={}},
	[519] = {tips="训练师满级", info=[[设圣器阶数 1 24
设圣器阶数 2 24
设圣器阶数 3 24
设圣器阶数 4 24
设圣器阶数 5 24
神器精炼 1 72
神器精炼 2 72
神器精炼 3 72
神器精炼 4 72
神器精炼 5 72
设圣器技能等级 1 12
设圣器技能等级 2 12
设圣器技能等级 3 12
设圣器技能等级 4 12
设圣器技能等级 5 12
幻化解锁 1
幻化解锁 2
幻化解锁 3]], is_show=0, list={}}
}
Config.GmData.data_list_fun = function(key)
	local data=Config.GmData.data_list[key]
	if DATA_DEBUG and data == nil then
		print('(Config.GmData.data_list['..key..'])not found') return
	end
	return data
end
-- -------------------list_end---------------------
