----------------------------------------------------
-- 此文件由数据工具生成
-- 定时领奖活动数据配置文件--holiday_time_award_data.xml
--------------------------------------

Config = Config or {} 
Config.HolidayTimeAwardData = Config.HolidayTimeAwardData or {}

-- -------------------const_start-------------------
Config.HolidayTimeAwardData.data_const_length = 2
Config.HolidayTimeAwardData.data_const = {
	["time_quantum"] = {val={{12,0,0},{22,0,0}}, desc="图标每日出现时间段"},
	["award"] = {val={{39069,1}}, desc="奖励"}
}
Config.HolidayTimeAwardData.data_const_fun = function(key)
	local data=Config.HolidayTimeAwardData.data_const[key]
	if DATA_DEBUG and data == nil then
		print('(Config.HolidayTimeAwardData.data_const['..key..'])not found') return
	end
	return data
end
-- -------------------const_end---------------------


-- -------------------dialog_start-------------------
Config.HolidayTimeAwardData.data_dialog_length = 1
Config.HolidayTimeAwardData.data_dialog = {
	[17440] = {
		[1] = {camp_id=17440, partner_id=1, pro=120, dialogue={{[[神灵大祭司]],0,[[rumengling]],[[冒险者大人新年快乐！]],220,150,70},{[[]],1,[[rumengling]],[[新年快乐！]],220,150,70},{[[神灵大祭司]],0,[[rumengling]],[[过去的一年，因为冒险者大人的努力，冒险大陆也变得更加和平安定了呢。新的一年，也请冒险者大人和诸位神明一起继续加油噢！]],220,150,70}}},
		[2] = {camp_id=17440, partner_id=2, pro=80, dialogue={{[[斯芬克斯]],0,[[jinxiunishang]],[[（愤怒）两脚兽，你吵到我了！回答我一个问题，答对了我就饶过你。]],350,150,70},{[[]],1,[[jinxiunishang]],[[什……什么问题？]],350,150,70},{[[斯芬克斯]],0,[[jinxiunishang]],[[今天见到我第一句话应该说什么？]],350,150,70},{[[]],1,[[jinxiunishang]],[[新年快乐？]],350,150,70},{[[斯芬克斯]],0,[[jinxiunishang]],[[（满意）嗯，答对了。快过去，别打扰我睡新年觉。]],350,150,70}}},
		[3] = {camp_id=17440, partner_id=3, pro=80, dialogue={{[[]],1,[[pan]],[[爆竹声中一岁除，春风送暖入屠苏。]],250,150,80},{[[潘]],0,[[pan]],[[千门万户曈曈日，总把新桃换旧符。]],250,150,80},{[[]],1,[[pan]],[[原来潘神也知道这首诗？]],250,150,80},{[[潘]],0,[[pan]],[[家喻户晓的诗词，知道也是应该的。小生希望能为冒险者大人吹奏一曲，祝贺大人新春快乐~]],250,150,80}}},
		[4] = {camp_id=17440, partner_id=4, pro=80, dialogue={{[[尼德霍格]],0,[[nidehuoge]],[[嘿嘿嘿，人类，本大爷给你一个机会。告诉本大爷，你们的龙在新年的时候都是怎么打扮的？]],50,150,75},{[[]],1,[[nidehuoge]],[[你问这个问题，难道也想和我们一样过新年？]],50,150,75},{[[尼德霍格]],0,[[nidehuoge]],[[（一本正经地狡辩）才不是！越是幸福，就越能清晰地感受绝望，为了给世界带来绝望，这是我不得不去做得事情！]],50,150,75},{[[]],1,[[nidehuoge]],[[好好好，黑龙大爷说什么就是什么，你过来我就告诉你……]],50,150,75}}},
		[5] = {camp_id=17440, partner_id=5, pro=80, dialogue={{[[黑暗之主]],0,[[anyingbaojun]],[[嘿嘿嘿，你们好像都很开心的样子]],550,120,60},{[[]],1,[[anyingbaojun]],[[肌肉男，你来做什么？]],550,120,60},{[[黑暗之主]],0,[[anyingbaojun]],[[别误会，我今天可不是来找你打架的。听说过年是件很开心的事情，那怎么能少了我呢？]],550,120,60},{[[黑暗之主]],0,[[anyingbaojun]],[[我还特意带了份礼物来祝贺一下，如果你不收下的话，我可是会不开心的]],550,120,60}}},
		[6] = {camp_id=17440, partner_id=6, pro=80, dialogue={{[[哪吒]],0,[[nezha]],[[（脚踩风火轮急急忙忙地往前冲，看到你之后停了下来）你来得正好，快点跟我一起去！]],250,150,70},{[[]],1,[[nezha]],[[这么急急忙忙地要去做什么？]],250,150,70},{[[哪吒]],0,[[nezha]],[[小爷我可是等了整整一年了，这次我一定要狠狠地大闹一番，放个鞭炮，把年兽痛扁一顿才过瘾！]],250,150,70},{[[哪吒]],0,[[nezha]],[[哎呀快跟上，去晚了年兽都被人打跑了！]],250,150,70}}},
		[7] = {camp_id=17440, partner_id=7, pro=80, dialogue={{[[瓦尔基里]],0,[[chiyuhuowu]],[[身为一名英灵殿的战士，时刻都不能松懈，即使节日也要早起训练！]],250,150,70},{[[]],1,[[chiyuhuowu]],[[（尬笑）是啊哈哈哈，你拿着剑，你说的对。]],250,150,70},{[[瓦尔基里]],0,[[chiyuhuowu]],[[但是作为一名英灵殿的侍女……]],250,150,70},{[[瓦尔基里]],0,[[chiyuhuowu]],[[（凑近你的耳边低声说）新年快乐，冒险者大人。]],250,150,70}}},
		[8] = {camp_id=17440, partner_id=8, pro=80, dialogue={{[[潘多拉]],0,[[panduola]],[[（潘多拉来到你面前，双手捧着魔盒，递给了你）]],370,130,85},{[[]],1,[[panduola]],[[（内心：不会是什么奇奇怪怪的东西吧？）这是……送给我的新年礼物？]],370,130,85},{[[潘多拉]],0,[[panduola]],[[（面无表情地点了点头）嗯……]],370,130,85},{[[]],1,[[panduola]],[[（接过潘多拉的魔盒，缓缓地打开）]],370,130,85}}},
		[9] = {camp_id=17440, partner_id=9, pro=80, dialogue={{[[拉斐尔]],0,[[shengdantianshi]],[[我的新年愿望是，每一天都是新年。]],250,150,70},{[[]],1,[[shengdantianshi]],[[为什么是这个愿望呢？]],250,150,70},{[[拉斐尔]],0,[[shengdantianshi]],[[因为这一天，一切都是全新的。人们可以告别过去，迎来全新的自己。]],250,150,70},{[[]],1,[[shengdantianshi]],[[这么美好的愿望一定能够实现的，新年快乐~]],250,150,70}}},
		[10] = {camp_id=17440, partner_id=10, pro=80, dialogue={{[[维纳斯]],0,[[weinasi]],[[每一个新年，都是这个世界最美的时刻。]],400,150,60},{[[维纳斯]],0,[[weinasi]],[[人们的脸上洋溢着灿烂的笑容，期待着新的一年里的平安顺意，这是我见过的他们最美的样子。]],400,150,60},{[[维纳斯]],0,[[weinasi]],[[所以，新的一年也一定要一直一直保持这份美啊！]],400,150,60}}},
		[11] = {camp_id=17440, partner_id=11, pro=80, dialogue={{[[娜迦公主]],0,[[tianxinnvpu]],[[（急匆匆）啊啊，是冒险者大人。]],250,150,70},{[[]],1,[[tianxinnvpu]],[[这么着急要去做什么啊？]],250,150,70},{[[娜迦公主]],0,[[tianxinnvpu]],[[嘻嘻，我现在正要去给冒险者大人们送礼物呢！对了，这个也送给你，新年快乐！喵~]],250,150,70}}},
		[12] = {camp_id=17440, partner_id=12, pro=80, dialogue={{[[辛西娅]],0,[[xinxiya]],[[奇怪，今天怎么大街上看起来都这么热闹的样子？]],300,180,60},{[[]],1,[[xinxiya]],[[嘿，辛西娅。因为现在是春节啦~]],300,180,60},{[[辛西娅]],0,[[xinxiya]],[[（拍了下脑袋）我差点把这个给忘了。那我要去努力的打猎，准备一顿大餐！]],300,180,60}}},
	},
}
-- -------------------dialog_end---------------------
