----------------------------------------------------
-- 此文件由数据工具生成
-- 竞技场--holiday_boss_data.xml
--------------------------------------

Config = Config or {} 
Config.HolidayBossData = Config.HolidayBossData or {}

-- -------------------const_start-------------------
Config.HolidayBossData.data_const_length = 5
Config.HolidayBossData.data_const = {
	["action_time"] = {label='action_time', val=1, desc="7月11日~7月17日"},
	["action_pre_reward"] = {label='action_pre_reward', val={{55806,1},{29905,50},{200314,1},{200352,1}}, desc="活动界面奖励预览"},
	["fight_max_count"] = {label='fight_max_count', val=5, desc="显示挑战次数上限"},
	["start_fight_count"] = {label='start_fight_count', val=5, desc="初始挑战次数"},
	["game_rule1"] = {label='game_rule1', val=1, desc="活动期间完成试炼可以获取五星英雄，稀有家具皮肤！\n1.冒险者大人在活动期间可以挑战<div fontcolor=#15ee5c>难度逐渐提升</div>的挑战关卡，击败关卡怪物可以获得试炼彩星\n2.每个关卡都有<div fontcolor=#15ee5c>独特的关卡效果</div>，请务必注意，合理使用英雄会事半功倍哦\n3.每层均有一个boss，击败关卡boss后将会解锁下一层，boss的血量是<div fontcolor=#15ee5c>实时保留</div>的，一次失败也没有关系，加油挑战吧\n4.积分计算：完全击败怪物会获得通关积分，对怪物造成伤害会按比例获取伤害积分（只会取最大伤害的百分比计算）\n5.活动奖励：获取指定数量的试炼彩星可以获取积分奖励，活动结束会统计全服排名，达到指定排名会获得专属勋章奖励哦。\n6.每日0点会重置免费次数，每日可额外购买5次调整机会，机会有限，<div fontcolor=#15ee5c>要珍惜机会</div>才能获得更高的分数哦\n7.活动会于<div fontcolor=#15ee5c>7月17日23：00</div>进入结算阶段，结算阶段<div fontcolor=#15ee5c>不能进行关卡挑战</div>"}
}
Config.HolidayBossData.data_const_fun = function(key)
	local data=Config.HolidayBossData.data_const[key]
	if DATA_DEBUG and data == nil then
		print('(Config.HolidayBossData.data_const['..key..'])not found') return
	end
	return data
end
-- -------------------const_end---------------------


-- -------------------boss_info_start-------------------
Config.HolidayBossData.data_boss_info_length = 50
Config.HolidayBossData.data_boss_info_cache = {}
Config.HolidayBossData.data_boss_info = function(key)
	if Config.HolidayBossData.data_boss_info_cache[key] == nil then
		local base = Config.HolidayBossData.data_boss_info_table[key]
		if not base then return end
		base = loadstring(string.format('return %s',base))()
		if not base then return end
		Config.HolidayBossData.data_boss_info_cache[key] = {
			order_id = base[1],
			add_skills = base[2],
			add_skill_decs = base[3],
			unit_id = base[4],
			star = base[5],
			head_id = base[6],
			head_half_id = base[7],
			name = base[8],
			level = base[9],
			dps_score = base[10],
			kill_score = base[11],
			group_id = base[12],
		}
	end
	return Config.HolidayBossData.data_boss_info_cache[key] 
end
Config.HolidayBossData.data_boss_info_table = {
	[50] = [[{50, {{0,650081}}, {"每回合会受到4%最大生命的伤害","敌方不会受到控制"}, 89306, 10, 40504, 6, "雷神", "BOSS", 8000, 8000, 10}]],
	[49] = [[{49, {{0,650081}}, {"每回合会受到4%最大生命的伤害","敌方不会受到控制"}, 89305, 10, 10502, 5, "冰雪女王", "BOSS", 8000, 8000, 10}]],
	[48] = [[{48, {{0,650081}}, {"每回合会受到4%最大生命的伤害","敌方不会受到控制"}, 89304, 10, 20508, 2, "瓦尔基里", "BOSS", 8000, 8000, 10}]],
	[47] = [[{47, {{0,650081}}, {"每回合会受到4%最大生命的伤害","敌方不会受到控制"}, 89303, 10, 40503, 1, "赫拉", "BOSS", 8000, 8000, 10}]],
	[46] = [[{46, {{0,650081}}, {"每回合会受到4%最大生命的伤害","敌方不会受到控制"}, 89302, 10, 30508, 4, "斯芬克斯", "BOSS", 8000, 8000, 10}]],
	[45] = [[{45, {{0,650121}}, {"治疗时，会造成同等治疗量的伤害","敌方英雄物理，魔法免伤100%"}, 89301, 10, 40506, 10, "艾蕾莉亚", "EX", 4000, 4000, 9}]],
	[44] = [[{44, {{0,650091},{0,650101}}, {"被控制时，增加100%受到伤害","我方英雄治疗与被治疗提升100%"}, 89300, 10, 10505, 13, "波塞冬", "EX", 4000, 4000, 9}]],
	[43] = [[{43, {{0,650091},{0,650101}}, {"被控制时，增加100%受到伤害","我方英雄治疗与被治疗提升100%"}, 89299, 10, 10502, 5, "冰雪女王", "EX", 4000, 4000, 9}]],
	[42] = [[{42, {{0,650091},{0,650101}}, {"被控制时，增加100%受到伤害","我方英雄治疗与被治疗提升100%"}, 89298, 10, 20508, 2, "瓦尔基里", "EX", 4000, 4000, 9}]],
	[41] = [[{41, {{0,650091},{0,650101}}, {"被控制时，增加100%受到伤害","我方英雄治疗与被治疗提升100%"}, 89297, 10, 30508, 4, "斯芬克斯", "EX", 4000, 4000, 9}]],
	[40] = [[{40, {{0,650091}}, {"敌方英雄魔法免伤100%","被控制时，增加100%受到伤害"}, 89296, 10, 40503, 1, "赫拉", "SSS", 3000, 3000, 8}]],
	[39] = [[{39, {{5,650021},{0,650081}}, {"我方暗系英雄伤害提升100%","回合结束双方受到4%最大生命伤害"}, 89295, 10, 10508, 7, "海宁芙", "SSS", 3000, 3000, 8}]],
	[38] = [[{38, {{2,650051},{0,650081}}, {"我方火系英雄伤害提升100%","回合结束双方受到4%最大生命伤害"}, 89294, 10, 30504, 3, "魅魔女王", "SSS", 3000, 3000, 8}]],
	[37] = [[{37, {{1,650041},{0,650081}}, {"我方水系英雄伤害提升100%","回合结束双方受到4%最大生命伤害"}, 89293, 9, 30401, 11, "吟游诗人", "SSS", 3000, 3000, 8}]],
	[36] = [[{36, {{3,650031},{0,650081}}, {"我方自然系英雄伤害提升100%","回合结束双方受到4%最大生命伤害"}, 89292, 9, 10404, 9, "冰晶魔法师", "SSS", 3000, 3000, 8}]],
	[35] = [[{35, {{0,650061}}, {"敌方英雄物理免伤100%","我方物理伤害提升100%"}, 89291, 10, 10502, 5, "冰雪女王", "SS", 2000, 2000, 7}]],
	[34] = [[{34, {{4,650011},{0,650121}}, {"我方光系英雄伤害提升100%","治疗时，会造成同等治疗量的伤害"}, 89290, 10, 10505, 13, "波塞冬", "SS", 2000, 2000, 7}]],
	[33] = [[{33, {{2,650051},{0,650121}}, {"我方火系英雄伤害提升100%","治疗时，会造成同等治疗量的伤害"}, 89289, 10, 10502, 5, "冰雪女王", "SS", 2000, 2000, 7}]],
	[32] = [[{32, {{1,650041},{0,650121}}, {"我方水系英雄伤害提升100%","治疗时，会造成同等治疗量的伤害"}, 89288, 10, 20508, 2, "瓦尔基里", "SS", 2000, 2000, 7}]],
	[31] = [[{31, {{3,650031},{0,650121}}, {"我方自然系英雄伤害提升100%","治疗时，会造成同等治疗量的伤害"}, 89287, 10, 30508, 4, "斯芬克斯", "SS", 2000, 2000, 7}]],
	[30] = [[{30, {{0,650121}}, {"治疗时，会造成同等治疗量的伤害","敌方不会受到控制"}, 89286, 10, 20508, 2, "瓦尔基里", "S", 1400, 1400, 6}]],
	[29] = [[{29, {{5,650021},{0,650091}}, {"我方暗系英雄伤害提升100%","被控制时，增加100%受到伤害"}, 89285, 10, 10508, 7, "海宁芙", "S", 1400, 1400, 6}]],
	[28] = [[{28, {{2,650051},{0,650091}}, {"我方火系英雄伤害提升100%","被控制时，增加100%受到伤害"}, 89284, 10, 30504, 3, "魅魔女王", "S", 1400, 1400, 6}]],
	[27] = [[{27, {{1,650041},{0,650091}}, {"我方水系英雄伤害提升100%","被控制时，增加100%受到伤害"}, 89283, 9, 30401, 11, "吟游诗人", "S", 1400, 1400, 6}]],
	[26] = [[{26, {{3,650031},{0,650091}}, {"我方自然系英雄伤害提升100%","被控制时，增加100%受到伤害"}, 89282, 9, 10404, 9, "冰晶魔法师", "S", 1400, 1400, 6}]],
	[25] = [[{25, {{0,650101},{0,650081}}, {"我方英雄治疗与被治疗效果提升100%","回合结束双方受到4%最大生命伤害"}, 89281, 10, 30508, 4, "斯芬克斯", "A", 1000, 1000, 5}]],
	[24] = [[{24, {{4,650011},{0,650071}}, {"我方光系英雄伤害提升100%","我方法术伤害提升100%"}, 89280, 10, 10505, 13, "波塞冬", "A", 1000, 1000, 5}]],
	[23] = [[{23, {{2,650051},{0,650071}}, {"我方火系英雄伤害提升100%","我方法术伤害提升100%"}, 89279, 10, 10502, 5, "冰雪女王", "A", 1000, 1000, 5}]],
	[22] = [[{22, {{1,650041},{0,650071}}, {"我方水系英雄伤害提升100%","我方法术伤害提升100%"}, 89278, 10, 20508, 2, "瓦尔基里", "A", 1000, 1000, 5}]],
	[21] = [[{21, {{3,650031},{0,650071}}, {"我方自然系英雄伤害提升100%","我方法术伤害提升100%"}, 89277, 10, 40504, 6, "雷神", "A", 1000, 1000, 5}]],
	[20] = [[{20, {{0,650061},{0,650091}}, {"我方物理伤害提升100%","被控制时，增加100%受到伤害"}, 89276, 10, 10505, 13, "波塞冬", "B", 700, 700, 4}]],
	[19] = [[{19, {{5,650021},{0,650061}}, {"我方暗系英雄伤害提升100%","我方物理伤害提升100%"}, 89275, 10, 10508, 7, "海宁芙", "B", 700, 700, 4}]],
	[18] = [[{18, {{2,650051},{0,650061}}, {"我方火系英雄伤害提升100%","我方物理伤害提升100%"}, 89274, 10, 30504, 3, "魅魔女王", "B", 700, 700, 4}]],
	[17] = [[{17, {{1,650041},{0,650061}}, {"我方水系英雄伤害提升100%","我方物理伤害提升100%"}, 89273, 9, 30401, 11, "吟游诗人", "B", 700, 700, 4}]],
	[16] = [[{16, {{3,650031},{0,650061}}, {"我方自然系英雄伤害提升100%","我方物理伤害提升100%"}, 89272, 9, 10404, 9, "冰晶魔法师", "B", 700, 700, 4}]],
	[15] = [[{15, {{0,650061},{0,650071}}, {"我方物理伤害提升100%","我方法术伤害提升100%"}, 89271, 10, 20508, 2, "瓦尔基里", "C", 400, 400, 3}]],
	[14] = [[{14, {{2,650051},{0,650071}}, {"我方火系英雄伤害提升100%","我方法术伤害提升100%"}, 89270, 10, 10508, 7, "海宁芙", "C", 400, 400, 3}]],
	[13] = [[{13, {{2,650051},{0,650071}}, {"我方火系英雄伤害提升100%","我方法术伤害提升100%"}, 89269, 10, 30504, 3, "魅魔女王", "C", 400, 400, 3}]],
	[12] = [[{12, {{2,650051},{0,650071}}, {"我方火系英雄伤害提升100%","我方法术伤害提升100%"}, 89268, 9, 30401, 11, "吟游诗人", "C", 400, 400, 3}]],
	[11] = [[{11, {{2,650051},{0,650071}}, {"我方火系英雄伤害提升100%","我方法术伤害提升100%"}, 89267, 9, 10404, 9, "冰晶魔法师", "C", 400, 400, 3}]],
	[10] = [[{10, {{0,650071}}, {"我方法术伤害提升100%","敌方不会受到控制"}, 89266, 10, 30508, 4, "斯芬克斯", "D", 200, 200, 2}]],
	[9] = [[{9, {{1,650041},{0,650061}}, {"我方水系英雄伤害提升100%","我方物理伤害提升100%"}, 89265, 10, 10505, 13, "波塞冬", "D", 200, 200, 2}]],
	[8] = [[{8, {{1,650041},{0,650061}}, {"我方水系英雄伤害提升100%","我方物理伤害提升100%"}, 89264, 10, 10502, 5, "冰雪女王", "D", 200, 200, 2}]],
	[7] = [[{7, {{1,650041},{0,650061}}, {"我方水系英雄伤害提升100%","我方物理伤害提升100%"}, 89263, 10, 20508, 2, "瓦尔基里", "D", 200, 200, 2}]],
	[6] = [[{6, {{1,650041},{0,650061}}, {"我方水系英雄伤害提升100%","我方物理伤害提升100%"}, 89262, 10, 40504, 6, "雷神", "D", 200, 200, 2}]],
	[5] = [[{5, {{0,650061}}, {"我方物理伤害提升100%","敌方不会受到控制"}, 89261, 10, 10505, 13, "波塞冬", "E", 100, 100, 1}]],
	[4] = [[{4, {{3,650031},{0,650071}}, {"我方自然系英雄伤害提升100%","我方法术伤害提升100%"}, 89260, 10, 10508, 7, "海宁芙", "E", 100, 100, 1}]],
	[3] = [[{3, {{3,650031},{0,650071}}, {"我方自然系英雄伤害提升100%","我方法术伤害提升100%"}, 89259, 10, 30504, 3, "魅魔女王", "E", 100, 100, 1}]],
	[2] = [[{2, {{3,650031},{0,650071}}, {"我方自然系英雄伤害提升100%","我方法术伤害提升100%"}, 89258, 9, 30401, 11, "吟游诗人", "E", 100, 100, 1}]],
	[1] = [[{1, {{3,650031},{0,650071}}, {"我方自然系英雄伤害提升100%","我方法术伤害提升100%"}, 89257, 9, 10404, 9, "冰晶魔法师", "E", 100, 100, 1}]]
}
-- -------------------boss_info_end---------------------


-- -------------------boss_group_start-------------------
Config.HolidayBossData.data_boss_group_length = 10
Config.HolidayBossData.data_boss_group = {
	[1] = {{order_id=5}, {order_id=4}, {order_id=3}, {order_id=2}, {order_id=1}},
	[2] = {{order_id=10}, {order_id=9}, {order_id=8}, {order_id=7}, {order_id=6}},
	[3] = {{order_id=15}, {order_id=14}, {order_id=13}, {order_id=12}, {order_id=11}},
	[4] = {{order_id=20}, {order_id=19}, {order_id=18}, {order_id=17}, {order_id=16}},
	[5] = {{order_id=25}, {order_id=24}, {order_id=23}, {order_id=22}, {order_id=21}},
	[6] = {{order_id=30}, {order_id=29}, {order_id=28}, {order_id=27}, {order_id=26}},
	[7] = {{order_id=35}, {order_id=34}, {order_id=33}, {order_id=32}, {order_id=31}},
	[8] = {{order_id=40}, {order_id=39}, {order_id=38}, {order_id=37}, {order_id=36}},
	[9] = {{order_id=45}, {order_id=44}, {order_id=43}, {order_id=42}, {order_id=41}},
	[10] = {{order_id=50}, {order_id=49}, {order_id=48}, {order_id=47}, {order_id=46}}
}
-- -------------------boss_group_end---------------------


-- -------------------buy_info_start-------------------
Config.HolidayBossData.data_buy_info_length = 3
Config.HolidayBossData.data_buy_info = {
{min=0, max=0, expend={{3,50}}},
{min=1, max=2, expend={{3,100}}},
{min=3, max=5, expend={{3,200}}}
}
-- -------------------buy_info_end---------------------


-- -------------------rank_info_start-------------------
Config.HolidayBossData.data_rank_info_length = 8
Config.HolidayBossData.data_rank_info = {
{min=1, max=1, items={{3,1000},{14001,4},{55806,1}}},
{min=2, max=2, items={{3,800},{14001,3},{55806,1}}},
{min=3, max=3, items={{3,500},{14001,2},{55806,1}}},
{min=4, max=10, items={{3,300},{10403,10},{55806,1}}},
{min=11, max=20, items={{3,200},{10403,5}}},
{min=21, max=50, items={{3,150},{10403,3}}},
{min=51, max=100, items={{3,100},{10403,1}}},
{min=101, max=200, items={{3,50}}}
}
-- -------------------rank_info_end---------------------


-- -------------------reward_info_start-------------------
Config.HolidayBossData.data_reward_info_length = 10
Config.HolidayBossData.data_reward_info = {
{id=1, num=2000, items={{10450,100}}},
{id=2, num=4000, items={{10407,1}}},
{id=3, num=6000, items={{29905,10}}},
{id=4, num=9000, items={{200352,1}}},
{id=5, num=11000, items={{10450,200}}},
{id=6, num=14000, items={{29905,20}}},
{id=7, num=20000, items={{10407,1}}},
{id=8, num=25000, items={{10450,200}}},
{id=9, num=34000, items={{29905,20}}},
{id=10, num=50000, items={{200314,1}}}
}
-- -------------------reward_info_end---------------------
