
UIStrConfig:Add(
{
	--聊天设置
	['chat001'] = '过滤设置',
	['chat002'] = '系统消息过滤：',
	['chat003'] = '拒绝接收好友上下线提示',
	['chat004'] = '拒绝接收帮派成员上下线提示',
	['chat005'] = '拒绝接收仇人上下线提示',
	['chat006'] = '拒绝接收帮派成员被击败提示',
	['chat007'] = '拒绝接收好友被击败提示',
	['chat008'] = '拒绝接收队伍聊天信息',
	['chat009'] = '拒绝接收帮派聊天信息',
	['chat010'] = '拒绝接收世界聊天信息',
	['chat011'] = '拒绝接收私聊信息',
	['chat012'] = '保存设置',
	['chat013'] = '此设置在重新登录后失效',
	['chat014'] = '聊天消息过滤：',
	
	--喇叭
	['chat021'] = '喇叭',
	['chat022'] = '选择想要发送的喇叭类型',
	
	--私聊
	['chat031'] = '消息盒子',
	['chat032'] = '忽略全部',
	['chat033'] = '私聊',
	['chat034'] = '交谈中切勿相信汇款、中奖、出售元宝等信息。',
	['chat035'] = '取消',
	['chat036'] = '发送',
}
)