
local tb    = {
    cg_pg1 = {--长歌扇诀1--20级
		attack_attackrate_v={100},
		attack_usebasedamage_p={{{1,70},{20,90},{30,120},{31,123}}},
		attack_earthdamage_v={
			[1]={{1,70*2*0.9},{20,90*2*0.9},{30,120*2*0.9},{31,123*2*0.9}},
			[3]={{1,70*2*1.1},{20,90*2*1.1},{30,120*2*1.1},{31,123*2*1.1}}
		},
		state_npchurt_attack={100,6},
		missile_hitcount={3,0,0},
    },

    cg_pg2 = {--长歌扇诀2--20级
		attack_attackrate_v={100},
		attack_usebasedamage_p={{{1,70},{20,90},{30,120},{31,123}}},
		attack_earthdamage_v={
			[1]={{1,70*2*0.9},{20,90*2*0.9},{30,120*2*0.9},{31,123*2*0.9}},
			[3]={{1,70*2*1.1},{20,90*2*1.1},{30,120*2*1.1},{31,123*2*1.1}}
		},
		state_npchurt_attack={100,6},
		state_stun_attack={{{1,30},{20,30},{30,30},{32,30}},{{1,15*1},{20,15*1},{30,15*1},{32,15*1}}},
		missile_hitcount={3,0,0},
    },

    cg_pg3 = {--长歌扇诀3--20级
		attack_attackrate_v={100},
		attack_usebasedamage_p={{{1,70},{20,90},{30,120},{31,123}}},
		attack_earthdamage_v={
			[1]={{1,70*2*0.9},{20,90*2*0.9},{30,120*2*0.9},{31,123*2*0.9}},
			[3]={{1,70*2*1.1},{20,90*2*1.1},{30,120*2*1.1},{31,123*2*1.1}}
		},
	--	state_hurt_attack={50,5,0},
		state_stun_attack={{{1,50},{20,50},{30,50},{32,50}},{{1,15*1},{20,15*1},{30,15*1},{32,15*1}}},
		state_npchurt_attack={100,6},
		missile_hitcount={3,0,0},
    },

    cg_pg4 = {--长歌扇诀4--20级
		attack_attackrate_v={100},
		attack_usebasedamage_p={{{1,70*1.5},{20,90*1.5},{30,120*1.5},{31,123*1.5}}},
		attack_earthdamage_v={
			[1]={{1,70*1.5*2*0.9},{20,90*1.5*2*0.9},{30,120*1.5*2*0.9},{31,123*1.5*2*0.9}},
			[3]={{1,70*1.5*2*1.1},{20,90*1.5*2*1.1},{30,120*1.5*2*1.1},{31,123*1.5*2*1.1}}
		},
		state_stun_attack={{{1,80},{20,80},{30,80},{32,80}},{{1,15*1.5},{20,15*1.5},{30,15*1.5},{31,15*1.5}}},
		state_npchurt_attack={80,6},
		missile_hitcount={3,0,0},
    },
    cg_psyl = {--平沙雁落-1级主动1--105级
		attack_usebasedamage_p={{{1,201},{15,381},{20,445}}},
		attack_earthdamage_v={
			[1]={{1,201*2*0.9},{15,381*2*0.9},{20,445*2*0.9}},
			[3]={{1,201*2*1.1},{15,381*2*1.1},{20,445*2*1.1}}
		},
		state_stun_attack={0,0},		--配合秘籍用
		
		skill_mintimepercast_v={12*15},
    },
	
	cg_book1 = {--平沙雁落--高级
		add_usebasedmg_p1={4506,{{1,6},{10,64},{15,128},{20,128}}},				--增加攻击力
		
		add_stun_r={4506,{{1,0},{10,0},{11,16},{15,80},{20,80}}},				--增加造成眩晕的概率
		add_stun_t={4506,{{1,0},{10,0},{11,0.4*15},{15,2*15},{20,2*15}}},		--增加造成眩晕的时间
		
		add_hitskill1={4506,{{1,0},{15,0},{16,4572},{20,4572}},{{1,0},{15,0},{16,16},{20,20}}},				--降低被击者的攻击力,持续一段时间
		userdesc_000={4572},
		
		skill_statetime={-1},
    },
	cg_book1_child3 = {--平沙雁落秘籍
		physics_potentialdamage_p={{{1,0},{15,0},{16,-17},{20,-85}}},
		skill_statetime={{{1,0},{15,0},{16,8*15},{20,8*15}}},
	},
	
    cg_ysjh = {--云生结海-4级主动2--15级
		userdesc_000={4509},
    },
    cg_ysjh_self = {--云生结海_自身
		physics_potentialdamage_p={{{1,10},{15,40},{16,42},{21,50}}},
		all_series_resist_p={{{1,30},{15,120},{16,125},{21,180}}},
		meleedamagereturn_p={{{1,2},{15,15},{16,16},{21,18}}},
		rangedamagereturn_p={{{1,2},{15,15},{16,16},{21,18}}},
		userdesc_101={{{1,5},{15,20},{16,21},{21,25}}},				--描述用，队友BUFF数值
		userdesc_102={{{1,15},{15,90},{16,95},{21,130}}},			--描述用，队友BUFF数值
		userdesc_103={{{1,2},{15,10},{16,11},{21,13}}},				--描述用，队友BUFF数值
		userdesc_104={{{1,2},{15,10},{16,11},{21,13}}},				--描述用，队友BUFF数值
	--	runspeed_v={{{1,5},{15,20},{16,21},{21,30}}},
		skill_statetime={{{1,15*8},{15,15*8},{16,15*8},{21,15*8}}},
    },
    cg_ysjh_team = {--云生结海_队友
		physics_potentialdamage_p={{{1,5},{15,20},{16,21},{21,25}}},
		all_series_resist_p={{{1,15},{15,90},{16,95},{21,130}}},
		meleedamagereturn_p={{{1,2},{15,10},{16,11},{21,13}}},
		rangedamagereturn_p={{{1,2},{15,10},{16,11},{21,13}}},
	--	runspeed_v={{{1,5},{15,10},{16,11},{21,15}}},
		skill_statetime={{{1,15*2},{15,15*2},{16,15*2},{21,15*2}}},
    },
	cg_qycx = {--清音长啸-10级主动3--15级
		state_hurt_attack={{{1,30},{15,30},{20,40}},{{1,15*1},{15,15*1.5},{16,15*1.5},{21,15*2}}},
		missile_hitcount={0,0,1},

		skill_mintimepercast_v={15*15},

		userdesc_000={4511},
	},
	cg_qycx_child1 = {--清音长啸_子1
		state_zhican_attack={{{1,30},{15,30},{20,40}},{{1,15*1},{15,15*1.5},{16,15*1.5},{21,15*2}}},
		missile_hitcount={0,0,1},
	},
	cg_qycx_child2 = {--清音长啸_子2
		state_slowall_attack={{{1,30},{15,30},{20,40}},{{1,15*1},{15,15*1.5},{16,15*1.5},{21,15*2}}},
		missile_hitcount={0,0,1},
	},
	cg_qycx_child3 = {--清音长啸_子3
		state_palsy_attack={{{1,30},{15,30},{20,40}},{{1,15*1},{15,15*1.5},{16,15*1.5},{21,15*2}}},
		missile_hitcount={0,0,1},
	},
	cg_qycx_child4 = {--清音长啸_子4
		state_stun_attack={{{1,30},{15,30},{20,40}},{{1,15*1},{15,15*1.5},{16,15*1.5},{21,15*2}}},
		missile_hitcount={0,0,1},
	},
	cg_qycx_dmg = {--清音长啸-伤害
		attack_usebasedamage_p={{{1,75},{15,136},{20,158}}},
		attack_earthdamage_v={
			[1]={{1,75*2*1.1},{15,136*2*0.9},{20,158*2*0.9}},
			[3]={{1,75*2*1.1},{15,136*2*1.1},{20,158*2*1.1}}
		},
	},
	
	cg_book2 = {--清音长啸秘籍
		add_steallife_p={4511,{{1,500},{10,5000},{20,7000}}},		--技能ID，吸血万分比
		
		add_deadlystrike_p1={4511,{{1,0},{10,0},{11,5},{15,25},{20,25}}},	--增加会心点数1
		
		addstartskill={4516,{{1,0},{15,0},{16,4568},{20,4568}},{{1,0},{15,0},{16,16},{20,20}}},				--清除友方诅咒
		
		skill_statetime={-1},
		userdesc_000={4568},
	},
    cg_book2_child3 = {--清音长啸驱散
		rand_ignoreskill={{{1,0},{15,0},{16,50},{20,100}},{{1,0},{15,0},{16,1},{20,2}},5},		--概率，数量，类型（skillsetting下定义类型）
		missile_hitcount={6,0,0},
    },

	cg_tyzm = {--天音知脉-20级被动1--10级
		physics_potentialdamage_p={{{1,24},{10,70},{11,80}}},
		lifemax_p={{{1,45},{10,60},{11,62}}},
		state_slowall_resistrate={{{1,35},{10,150},{11,165}}},
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
	},
    cg_jzyt = {--江逐月天-30级主动4--15级
		skill_mintimepercast_v={{{1,45*15},{15,40*15},{16,40*15},{21,40*15}}},

		userdesc_000={4519,4520},
    },
    cg_jzyt_child1 = {--江逐月天_子1--15级
		attack_usebasedamage_p={{{1,30},{10,50},{15,70},{16,75},{21,100}}},
		attack_earthdamage_v={
			[1]={{1,70*0.9},{10,200*0.9},{15,245*0.9},{16,260*0.9},{21,700*0.9}},
			[3]={{1,70*1.1},{10,200*1.1},{15,245*1.1},{16,260*1.1},{21,700*1.1}}
			},
		state_stun_attack={{{1,40},{15,40},{16,40},{21,40}},{{1,15*1},{15,15*1},{16,15*1},{21,15*1}}},
		attackrate_p={{{1,-20},{15,-100},{16,-120},{21,-150}}},
		deadlystrike_p={{{1,-10},{15,-50},{16,-55},{21,-80}}},
	--	all_series_resist_p={{{1,-20},{15,-100},{16,-120},{21,-150}}},
		skill_statetime={{{1,15*2},{15,15*2},{16,15*2},{21,15*2}}},
		missile_hitcount={{{1,5},{15,5},{16,5},{21,5}}},
    },
    cg_jzyt_child2 = {--江逐月天_子2--15级
		physics_potentialdamage_p={{{1,20},{15,65},{16,68},{21,93}}},
		attackspeed_v={{{1,5},{15,50},{16,53},{21,68}}},
		runspeed_v={{{1,5},{15,50},{16,53},{21,68}}},
		skill_statetime={{{1,15*2},{15,15*2},{16,15*2},{21,15*2}}},
    },
    cg_yyfl = {--夜引风岚-40级被动2--10级
		add_mult_proc_sate1={4523,{{1,6},{10,6},{11,6}},64},  --技能ID,叠加层数，自身为圆心格子半径
		
		skill_statetime={-1},
		
		userdesc_000={4523},
    },
    cg_yyfl_child = {--夜引风岚_子
		skill_mult_relation={3}, --对应的NPC类型，从skillsetting.ini上查看
		resist_allseriesstate_time_v={{{1,14},{10,70},{12,70*1.2}}},
		defense_p={{{1,12},{10,60},{12,60*1.2}}},
		skill_statetime={10*15},
    },
	
    cg_gjsj = {--高级扇诀-50级被动3--10级
		add_skill_level={4501,{{1,1},{10,10},{11,11}},0},
		add_skill_level2={4502,{{1,1},{10,10},{11,11}},0},
		add_skill_level3={4503,{{1,1},{10,10},{11,11}},0},
		add_skill_level4={4504,{{1,1},{10,10},{11,11}},0},
		userdesc_000={4526},
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    cg_gjsj_child = {--高级扇诀_子（仅用作显示，无实际效果加成。实际效果查看普攻的21-31级）--10级
		attack_usebasedamage_p={{{1,3},{10,30},{11,33}}},
		attack_earthdamage_v={
			[1]={{1,12*1},{10,120},{11,232}},
			[3]={{1,12*1},{10,120},{11,232}}
			},
    },
    cg_mycr = {--魔音缠绕-60级被动4--10级
		autoskill={142,{{1,1},{10,10},{11,11}}},
		userdesc_000={4528},
		userdesc_101={100},								--描述用，实际触发几率请查看autoskill.tab中的魔音缠绕
		userdesc_102={{{1,15*5},{10,15*5},{11,15*5}}},	--描述用，实际触发间隔请查看autoskill.tab中的魔音缠绕
		missile_hitcount={{{1,1},{10,1},{11,1}}},
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    cg_mycr_child = {--魔音缠绕_子
		physics_potentialdamage_p={{{1,-20},{10,-65},{11,-68},{14,-78},{18,-91}}},
		attackrate_p={{{1,-20},{10,-100},{11,-120},{12,-120}}},
		deadlystrike_p={{{1,-10},{10,-50},{11,-55},{14,-60},{18,-70}}},
		all_series_resist_p={{{1,-15},{10,-80},{11,-90},{14,-96},{18,-112}}},
		skill_statetime={10*15},
    },
    cg_hmzg = {--回梦逐光-70级被动5--10级
		autoskill={143,{{1,1},{10,10},{11,11}}},
		userdesc_000={4530,4532},
		userdesc_101={{{1,15*2},{10,15*6},{11,15*7}}},				--假描述，回血BUFF时间，查看cg_hmzg_self
		userdesc_102={{{1,40},{10,90},{11,95}}},					--假描述，触发概率，实际触发概率于aotuskill.tab中设置
		userdesc_103={{{1,15*30},{10,15*30},{11,15*30}}},			--假描述，触发间隔，实际触发概率于aotuskill.tab中设置
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    cg_hmzg_self = {--回梦逐光_回复
		recover_life_p={{{1,1},{10,4},{11,4}},15},
		skill_statetime={{{1,15*2},{10,15*6},{11,15*7}}},
    },
    cg_hmzg_child = {--回梦逐光_攻击   权值，技能ID，技能等级
		skill_randskill1={{{1,20},{10,20}},4532,{{1,1},{10,10},{11,11}}},
		skill_randskill2={{{1,20},{10,20}},4533,{{1,1},{10,10},{11,11}}},
		skill_randskill3={{{1,20},{10,20}},4534,{{1,1},{10,10},{11,11}}},
		skill_randskill4={{{1,20},{10,20}},4535,{{1,1},{10,10},{11,11}}},
		skill_randskill5={{{1,20},{10,20}},4536,{{1,1},{10,10},{11,11}}},
    },
    cg_hmzg_ss = {--回梦逐光_受伤
		state_hurt_attack={{{1,100},{10,100},{11,100}},{{1,15*1},{10,15*2},{11,15*2.2}}},
    },
    cg_hmzg_zc = {--回梦逐光_致残
		state_zhican_attack={{{1,100},{10,100},{11,100}},{{1,15*1},{10,15*2},{11,15*2.2}}},
    },
    cg_hmzg_ch = {--回梦逐光_迟缓
		state_slowall_attack={{{1,100},{10,100},{11,100}},{{1,15*1},{10,15*2},{11,15*2.2}}},
    },
    cg_hmzg_mb = {--回梦逐光_麻痹
		state_palsy_attack={{{1,100},{10,100},{11,100}},{{1,15*1},{10,15*2},{11,15*2.2}}},
    },
    cg_hmzg_xy = {--回梦逐光_眩晕
		state_stun_attack={{{1,100},{10,100},{11,100}},{{1,15*1},{10,15*2},{11,15*2.2}}},
    },
    cg_yzqy = {--银烛清韵-80级被动6--20级
		physics_potentialdamage_p={{{1,5},{20,90},{24,120*1.2}}},
		lifemax_p={{{1,2},{20,25},{24,25*1.2}}},
		attackspeed_v={{{1,5},{20,20},{24,20*1.2}}},
		all_series_resist_p={{{1,3},{20,45},{24,45*1.2}}},
		--defense_p={{{1,2},{20,30},{24,30*1.2}}},
		state_stun_attackrate={{{1,10},{20,200},{24,200*1.2}}},
		state_slowall_resisttime={{{1,10},{20,200},{24,200*1.2}}},
		skill_statetime={-1},
    },
	cg_ycbx = {--阳春白雪-90级被动7--10级
		autoskill={144,{{1,1},{10,10},{11,11}}},
		userdesc_101={{{1,15*4},{10,15*2},{11,15*2}}},			--描述用，触发间隔。实际时间查看autoskill.tab的阳春白雪
		userdesc_102={{{1,10},{10,30},{11,32}}},				--描述用，触发几率。实际几率查看autoskill.tab的阳春白雪
		userdesc_000={4542},
		skill_statetime={{{1,-1},{10,-1}}},
    },
	cg_ycbx_child1 = {--阳春白雪_buff1
		addstartskill={4501,4542,{{1,1},{10,10},{11,11}}},
		addstartskill2={4502,4542,{{1,1},{10,10},{11,11}}},
		skill_statetime={{{1,2},{30,2}}},							--buff持续时间
    },
	cg_ycbx_child2 = {--阳春白雪_buff2
		addstartskill={4503,4543,{{1,1},{10,10},{11,11}}},
		addstartskill2={4504,4543,{{1,1},{10,10},{11,11}}},
		skill_statetime={{{1,2},{30,2}}},							--buff持续时间
    },
	cg_ycbx_child3 = {--阳春白雪_前2式禁疗BUFF，与后两式区别于命中个数
		forbid_recover={1},			--禁止回复生命
		skill_statetime={{{1,15*1},{10,15*3},{11,15*3}}},
		missile_hitcount={2,2,2},
    },
	cg_ycbx_child4 = {--阳春白雪_前2式禁疗BUFF
		forbid_recover={1},			--禁止回复生命
		skill_statetime={{{1,15*1},{10,15*3},{11,15*3}}},
		missile_hitcount={3,3,3},
    },
	
	
    cg_nq = {--长歌怒气-怒气
		attack_usebasedamage_p={{{1,300},{30,300}}},
		attack_metaldamage_v={
			[1]={{1,2000*0.9},{30,2000*0.9},{31,4000*0.9}},
			[3]={{1,2000*1.1},{30,2000*1.1},{31,4000*1.1}}
			},
    },
    cg_nq_child1 = {--长歌怒气_子
		attack_usebasedamage_p={{{1,1000},{30,1000}}},
		attack_metaldamage_v={
			[1]={{1,2000*0.9},{30,2000*0.9},{31,4000*0.9}},
			[3]={{1,2000*1.1},{30,2000*1.1},{31,4000*1.1}}
			},
    },
	cg_nq_child2 = {--长歌怒气_免疫
		ignore_series_state={},		--免疫属性效果
		ignore_abnor_state={},		--免疫负面效果
		skill_statetime={{{1,15*4},{30,15*4}}},
    },
}

FightSkill:AddMagicData(tb)