
local tb    = {
    cy_pg1 = {--翠烟御伞诀1--20级
		attack_attackrate_v={10},
		attack_usebasedamage_p={{{1,10},{20,10},{30,10},{31,10}}},
		attack_waterdamage_v={
			[1]={{1,60*2*0.9},{20,90*2*0.9},{30,120*2*0.9},{31,123*2*0.9}},
			[3]={{1,60*2*1.1},{20,90*2*1.1},{30,120*2*1.1},{31,123*2*1.1}}
		},
		state_npchurt_attack={100,6},
		missile_hitcount={3,0,0},
    },
    cy_pg2 = {--翠烟御伞诀2--20级
		attack_attackrate_v={10},
		attack_usebasedamage_p={{{1,10},{20,10},{30,10},{31,10}}},
		attack_waterdamage_v={
			[1]={{1,60*2*0.9},{20,90*2*0.9},{30,120*2*0.9},{31,123*2*0.9}},
			[3]={{1,60*2*1.1},{20,90*2*1.1},{30,120*2*1.1},{31,123*2*1.1}}
		},
		state_npchurt_attack={100,6},
		state_slowall_attack={{{1,30},{20,30},{30,30}},{{1,15*1.5},{20,15*1.5},{30,15*1.5}}},
		missile_hitcount={3,0,0},
    },
    cy_pg3 = {--翠烟御伞诀3--20级
		attack_attackrate_v={10},
		attack_usebasedamage_p={{{1,10},{20,10},{30,10},{31,10}}},
		attack_waterdamage_v={
			[1]={{1,60*2*0.9},{20,90*2*0.9},{30,120*2*0.9},{31,123*2*0.9}},
			[3]={{1,60*2*1.1},{20,90*2*1.1},{30,120*2*1.1},{31,123*2*1.1}}
		},
	--	state_hurt_attack={50,5,0},
		state_slowall_attack={{{1,50},{20,50},{30,50}},{{1,15*1.5},{20,15*1.5},{30,15*1.5}}},
		state_npchurt_attack={100,6},
		missile_hitcount={3,0,0},
    },
    cy_pg4 = {--翠烟御伞诀4--20级
		attack_attackrate_v={10},
		attack_usebasedamage_p={{{1,6*1.5},{20,9*1.5},{30,12*1.5},{31,13*1.5}}},
		attack_waterdamage_v={
			[1]={{1,60*1.5*2*0.9},{20,90*1.5*2*0.9},{30,120*1.5*2*0.9},{31,123*1.5*2*0.9}},
			[3]={{1,60*1.5*2*1.1},{20,90*1.5*2*1.1},{30,120*1.5*2*1.1},{31,123*1.5*2*1.1}}
		},
		state_slowall_attack={{{1,80},{20,80},{30,80},{31,80}},{{1,15*1.5},{20,15*1.5},{30,15*1.5},{31,15*1.5}}},
		state_npchurt_attack={80,6},
		missile_hitcount={3,0,0},
    },

    cy_tlxj = {--璇玑罗舞-1级主动1--15级			--初始击退
		state_knock_attack={100,5,70},				--几率，时间，速度
		state_npcknock_attack={100,5,70},			--几率，时间，速度
		spe_knock_param={3 , 4, 9},					--停留时间，玩家动作ID，NPC动作ID

		missile_hitcount={3,0,0},

		skill_mintimepercast_v={7.5*15},

		userdesc_000={805,807},
    },
    cy_tlxj_child1 = {--璇玑罗舞_子1--15级		--持续的罗伞
		ms_one_hit_count={0,0,1},
    },
    cy_tlxj_child1c = {--璇玑罗舞_子1--15级		--持续的飞镖伤害
		attack_usebasedamage_p={{{1,26},{15,30},{20,35}}},
		attack_waterdamage_v={
			[1]={{1,26*2*0.9},{15,30*2*0.9},{20,35*2*0.9}},
			[3]={{1,26*2*1.1},{15,30*2*1.1},{20,35*2*1.1}}
		},
		state_slowall_attack={{{1,16},{15,30},{20,40}},10},

		missile_hitcount={3,0,0},
    },

    cy_book1 = {--璇玑罗舞
		--普攻击中时叠加提高璇玑罗舞伤害
		autoskill={80,{{1,1},{10,10}}},

		--璇玑罗舞飞镖击中时自身回血
		add_hitskill1={{{1,0},{10,0},{11,805},{20,805}},{{1,0},{10,0},{11,859},{20,859}},{{1,0},{10,0},{11,11},{20,20}}},

		--增加持续时间和迟缓几率
		addms_life1={807,{{1,0},{15,0},{16,20},{20,60}}},		--增加璇玑罗舞子弹的存活时间（目前每10帧伤害一次）
		add_slowall_r={805,{{1,0},{15,0},{16,5},{20,25}}},									--增加璇玑罗舞造成迟缓的几率
		--add_slowall_t={805,{{1,15*1},{10,15*1.5},{15,15*1.5},{20,15*2}}},				 				--增加璇玑罗舞造成迟缓的时间

		skill_statetime={-1},
		userdesc_000={860,859},
    },
    cy_book1_child1 = {--叠加提高璇玑罗舞伤害
		add_usebasedmg_p1={805,{{1,1},{10,4},{15,6},{20,6}}},			--增加璇玑罗舞飞镖的攻击力

		superposemagic={{{1,3},{10,10},{20,10}}},

		skill_statetime={5*15},
    },
    cy_book1_child2 = {--击中回血
		dir_recover_life_pp={{{1,0},{10,0},{11,10},{15,50},{20,50}},1},		--生命上限万分比,自身数值
    },

    cy_ydlh = {--雨打梨花-4级主动2--10级
		skill_mintimepercast_v={30*15},

		userdesc_000={829},
    },
    cy_ydlh_child1 = {--雨打梨花伤害
		attack_usebasedamage_p={{{1,15},{15,20},{21,25}}},
		attack_waterdamage_v={
			[1]={{1,15*2*0.9},{15,20*2*0.9},{20,25*2*0.9}},
			[3]={{1,15*2*1.1},{15,20*2*1.1},{20,25*2*1.1}}
		},
		state_slowall_attack={{{1,22},{15,50},{20,60}},1*15},

		missile_hitcount={3,0,0},
    },

    cy_book2 = {--雨打梨花秘籍
		--初级.增加暴击率
		add_deadlystrike_p1={829,{{1,3},{10,30},{20,30}}},
		add_igdefense_p1={829,{{1,3},{10,30},{20,30}}},  					--增加第一段忽闪%

		--中级.减cd
		deccdtime={808,{{1,0},{10,0},{11,1.6*15},{15,8*15},{20,8*15}}},		--减少雨打梨花CD时间

		--高级击中叠加提高伤害
		add_hitskill1={{{1,0},{15,0},{16,829},{20,829}},{{1,0},{15,0},{16,858},{20,858}},{{1,0},{15,0},{16,16},{20,20}}},
		userdesc_000={858},

		skill_statetime={-1},
    },
    cy_book2_child3 = {--高级雨打梨花
		add_usebasedmg_p1={829,{{1,0},{16,2},{20,2}}},			--增加雨打梨花攻击力

		superposemagic={{{1,0},{15,0},{16,6},{20,30}}},

		skill_statetime={5*15},
    },

	cy_zh = {--召唤啵啵-10级主动3--15级
		call_npc1={1827, -1, 3},				--NPCid, NPC等级（-1为跟玩家一样），NPC五行
		remove_call_npc={1827},
		skill_statetime={15*15},

		skill_mintimepercast_v={{{1,45*15},{15,35*15},{20,35*15}}},

		userdesc_000={811},
    },
	cy_zh_child = {--召唤啵啵_子--15级
	 	callnpc_life={1827,100},			--NPCid，生命值%
	 	callnpc_damage={1827,{{1,50},{15,113},{20,142}}},			--NPCid，攻击力%
		skill_statetime={15*15},				--持续时间需要跟cy_zh的时间一致
    },
    cy_xm_normal = {--啵啵-普攻
		attack_usebasedamage_p={10},
	--	attack_waterdamage_v={
	--		[1]={{1,200*0.9},{10,200*0.9}},
	--		[3]={{1,200*1.1},{10,200*1.1}}
	--		},
		state_slowall_attack={50,15*1},			--概率，持续时间
		missile_hitcount={3,0,0},
    },
    cy_xm_chong = {--啵啵-冲
		attack_usebasedamage_p={10},
		state_slowall_attack={100,15*2},
	--	state_knock_attack={100,35,30},
		state_npcknock_attack={100,35,30},
		spe_knock_param={26 , 26, 26},

		missile_hitcount={3,0,0},
    },
	cy_xmmy = {--熊猫免疫
		ignore_series_state={},		--免疫属性效果
		ignore_abnor_state={},		--免疫负面效果
		invincible_b={1},
		skill_statetime={-1},
    },

    cy_book3 = {--高级召唤啵啵
		--addcall_npclife={811,{{1,10},{10,30},{15,40},{20,50}}},					--增加熊猫血量
		addcall_npcdmg={811,{{1,3},{10,26},{20,26}}},					--增加熊猫攻击

		add_callnpc_skill={{{1,0},{10,0},{11,810},{20,810}},{{1,0},{10,0},{11,877},{20,877}},{{1,0},{10,0},{11,11},{20,20}}},			--召唤熊猫的buffid,给熊猫的buffid,等级

		deccdtime={810,{{1,0},{15,0},{16,2*15},{20,10*15}}},			--减少召唤熊猫CD时间

		skill_statetime={-1},

		userdesc_000={879},
    },
    cy_book3_child2 = {--高级召唤啵啵_子
		--add_usebasedmg_p1={834,{{1,0},{15,0},{16,20},{20,50}}},					--增加熊猫撞击的攻击力
		--add_slowall_t={834,{{1,0},{15,0},{16,15*0.2},{20,15*1}}},				--增加熊猫撞击造成迟缓的时间
		autoskill={81,{{1,1},{10,10}}},		--每秒放子弹降低周围人普攻攻击
		skill_statetime={-1},
    },
    cy_book3_child2c = {--中级召唤啵啵_子
		style_skill_damage_p={6,{{1,0},{10,0},{11,-20},{15,-100},{20,-100}}},				--普攻伤害降低
		skill_statetime={3*15},
    },

    cy_bxqy = {--冰心倩影-20级被动1--10级
		physics_potentialdamage_p={{{1,15},{10,40},{11,44}}},
		lifemax_p={{{1,20},{10,50},{11,55}}},
		state_palsy_resistrate={{{1,15},{10,150}}},
		skill_statetime={-1},
    },

    cy_bzwy = {--冰踪无影-30级主动4--15级
		missile_hitcount={0,0,1},

		skill_mintimepercast_v={20*15},

	 	userdesc_000={817,813},
    },
    cy_bzwy_child = {--冰踪无影_伤害--15级
		attack_usebasedamage_p={{{1,223},{15,260},{20,300}}},
		attack_waterdamage_v={
			[1]={{1,223*2*0.9},{15,260*2*0.9},{20,300*2*0.9}},
			[3]={{1,223*2*1.1},{15,260*2*1.1},{20,300*2*1.1}}
		},
		missile_hitcount={3,0,0},
    },
    cy_bzwy_child2 = {--冰踪无影_冰冻
		state_freeze_attack={{{1,60},{15,100},{16,100},{21,100}},{{1,15*1},{15,15*2},{16,15*2.5},{21,15*2.5}}},
		missile_hitcount={3,0,0},
    },

    cy_book4 = {--高级冰踪无影
		--偷buff
		add_hitskill1={816,856,{{1,1},{10,10},{20,20}}},

		--扩大冰冻和伤害的范围
		autoskill={{{1,0},{10,0},{11,79},{20,79}},{{1,0},{10,0},{11,11},{20,20}}},
		addstartskill2={817,870,{{1,1},{10,10},{15,15},{20,20}}},			--增加变大特效
		addms_dmg_range1={817,{{1,0},{10,0},{11,1},{15,8},{20,8}}},			--增加子弹爆炸范围格子，1格子=0.28米直径
		addms_dmg_range2={813,{{1,0},{10,0},{11,1},{15,8},{20,8}}},			--增加子弹爆炸范围格子，1格子=0.28米直径
		add_usebasedmg_p1={817,{{1,0},{10,0},{11,18},{15,90},{20,90}}},				--增加冰踪无影攻击力

		--释放后一段时间提高基础攻击和忽略最终闪避
		addstartskill={{{1,0},{15,0},{16,816},{20,816}},{{1,0},{15,0},{16,857},{20,857}},{{1,0},{15,0},{16,16},{20,20}}},			--追加buff
		--autoskill={{{1,0},{15,0},{16,79},{16,79}},{{1,0},{15,0},{16,16},{20,20}}},
		userdesc_000={856,857},

		skill_statetime={-1},
    },
	cy_book4_child1 = {--初级偷取对方一个buff
		stealstate_type={{{1,10},{10,100},{20,100}},1,2},	--偷取BUFF的几率， 偷取数量， 技能类型索引SkillSetting.ini
		skill_stealstate_time={6*15},
    },
    cy_book4_child3 = {--高级,加攻击和忽闪
		physics_potentialdamage_p={{{1,0},{15,0},{16,20},{20,100}}},			--基础攻击力增加
		ignore_defense_p={{{1,0},{15,0},{16,10},{20,50}}},						--忽略最终闪避提高
		skill_statetime={7.5*15},
    },

    cy_xy = {--雪影-40级被动2（光环）--10级
		runspeed_v={{{1,10},{10,40},{11,44}}},
		ignore_defense_vp={{{1,40},{10,100},{11,110}}},
		skill_statetime={{{1,15*3},{10,15*3},{11,15*3}}},
    },
    cy_xy_team = {--雪影_队友--10级
		runspeed_v={{{1,5},{10,20},{11,22}}},
		ignore_defense_vp={{{1,20},{10,50},{11,55}}},
		skill_statetime={{{1,15*3},{10,15*3},{11,15*3}}},
    },
    cy_gjysj = {--高级御伞诀-50级被动3--10级
		add_skill_level={801,{{1,1},{10,10},{11,11}},0},
		add_skill_level2={802,{{1,1},{10,10},{11,11}},0},
		add_skill_level3={803,{{1,1},{10,10},{11,11}},0},
		add_skill_level4={804,{{1,1},{10,10},{11,11}},0},
		skill_statetime={-1},

		userdesc_000={821},
    },
    cy_gjysj_child = {--高级御伞诀_子（仅用作显示，无实际效果加成。实际效果查看普攻的21-31级）--10级
		attack_usebasedamage_p={{{1,3},{10,30},{11,33}}},
		attack_waterdamage_v={
			[1]={{1,3*2*0.9},{10,30*2*0.9},{11,33*2*0.9}},
			[3]={{1,3*2*1.1},{10,30*2*1.1},{11,33*2*1.1}}
        },
    },
    cy_hthb = {--护体寒冰-60级被动4--10级
		remote_dmg_p={{{1,-2},{10,-15},{12,-18}}},
		meleedamagereturn_p={{{1,2},{10,15},{12,18}}},
		skill_statetime={-1},
    },

    cy_bjyg = {--冰肌玉骨-70级被动5--10级
		autoskill={82,{{1,1},{10,10},{11,11}}},
		userdesc_000={825,826},
		userdesc_101={{{1,40},{10,90},{11,95}}},			--假描述，触发概率，实际触发概率于aotuskill.tab中设置
		userdesc_102={{{1,15*30},{10,15*30},{11,15*30}}},	--假描述，触发间隔，实际触发概率于aotuskill.tab中设置
		skill_statetime={-1},
    },
    cy_bjyg_child1 = {--冰肌玉骨_子1--10级
		recover_life_p={{{1,3},{10,5},{11,5}},15},
		skill_statetime={{{1,15*2},{10,15*6},{11,15*6}}},
    },
    cy_bjyg_child2 = {--冰肌玉骨_子2--10级
		state_freeze_attack={{{1,100},{10,100},{11,100}},{{1,15*1.5},{10,15*2.5},{11,15*2.5}}},
    },
    cy_bgxx = {--冰骨雪心-80级被动6--20级
		physics_potentialdamage_p={{{1,2},{20,40},{24,40*1.2}}},
		lifemax_p={{{1,5},{20,95},{24,95*1.2}}},
		attackspeed_v={{{1,5},{20,20},{24,20*1.2}}},
		all_series_resist_p={{{1,2},{20,40},{24,40*1.2}}},
		state_slowall_attackrate={{{1,10},{20,200},{24,200*1.2}}},
		state_palsy_resisttime={{{1,10},{20,200},{24,200*1.2}}},
		skill_statetime={-1},
    },
    cy_90_fysx = {--浮云散雪-90级被动7--10级
		lifereplenish_p={{{1,4},{10,40},{11,44}}},
		lowhp_damage_att_p={{{1,-4},{10,-22}},{{1,4},{10,22}}},		--造成伤害增加=当前损失生命*参数1+参数2,第一个负数就是自己血越少,造成伤害越低
		skill_statetime={-1},
    },

    cy_nq = {--翠烟-怒气
		attack_usebasedamage_p={{{1,10},{10,10}}},
		attack_waterdamage_v={
			[1]={{1,300*0.9},{10,200*0.9},{31,200*0.9}},
			[3]={{1,300*1.1},{10,200*1.1},{31,200*1.1}}
			},
    },
    cy_nq_child1 = {--翠烟-怒气_子1
		attack_usebasedamage_p={{{1,10},{10,10}}},
		attack_waterdamage_v={
			[1]={{1,1000*0.9},{10,2000*0.9},{31,2000*0.9}},
			[3]={{1,1000*1.1},{10,2000*1.1},{31,2000*1.1}}
			},
    },
    cy_nq_child2 = {--翠烟-怒气_子
		ignore_series_state={},		--免疫属性效果
		ignore_abnor_state={},		--免疫负面效果
		skill_statetime={{{1,30},{10,30}}},
    },
}

FightSkill:AddMagicData(tb)