
local tb    = {
    ds_pg1 = {--段氏扇诀1--20级
		attack_attackrate_v={100},
		attack_usebasedamage_p={{{1,60},{20,90},{30,120},{31,123}}},
		attack_waterdamage_v={
			[1]={{1,60*2*0.9},{20,90*2*0.9},{30,120*2*0.9},{31,123*2*0.9}},
			[3]={{1,60*2*1.1},{20,90*2*1.1},{30,120*2*1.1},{31,123*2*1.1}}
		},
		adddamagebydist={1,80000,100},					--放大%=(min(（距离-参数3）*参数1，参数2)/1000)%，此处加入仅配合秘籍使用
		state_npchurt_attack={100,6},
		missile_hitcount={3,0,0},
    },

    ds_pg2 = {--段氏扇诀2--20级
		attack_attackrate_v={100},
		attack_usebasedamage_p={{{1,60},{20,90},{30,120},{31,123}}},
		attack_waterdamage_v={
			[1]={{1,60*2*0.9},{20,90*2*0.9},{30,120*2*0.9},{31,123*2*0.9}},
			[3]={{1,60*2*1.1},{20,90*2*1.1},{30,120*2*1.1},{31,123*2*1.1}}
		},
		adddamagebydist={1,80000,100},					--放大%=(min(（距离-参数3）*参数1，参数2)/1000)%，此处加入仅配合秘籍使用
		state_npchurt_attack={100,6},
		state_slowall_attack={{{1,30},{20,30},{30,30}},{{1,15*1.5},{20,15*1.5},{30,15*1.5}}},
		missile_hitcount={3,0,0},
    },

    ds_pg3 = {--段氏扇诀3--20级
		attack_attackrate_v={100},
		attack_usebasedamage_p={{{1,60},{20,90},{30,120},{31,123}}},
		attack_waterdamage_v={
			[1]={{1,60*2*0.9},{20,90*2*0.9},{30,120*2*0.9},{31,123*2*0.9}},
			[3]={{1,60*2*1.1},{20,90*2*1.1},{30,120*2*1.1},{31,123*2*1.1}}
		},
		adddamagebydist={1,80000,100},					--放大%=(min(（距离-参数3）*参数1，参数2)/1000)%，此处加入仅配合秘籍使用
		state_slowall_attack={{{1,50},{20,50},{30,50}},{{1,15*1.5},{20,15*1.5},{30,15*1.5}}},
		state_npchurt_attack={100,6},
		missile_hitcount={3,0,0},
    },

    ds_pg4 = {--段氏扇诀4--20级
		attack_attackrate_v={100},
		attack_usebasedamage_p={{{1,60*1.5},{20,90*1.5},{30,120*1.5},{31,223*1.5}}},
		attack_waterdamage_v={
			[1]={{1,60*1.5*2*0.9},{20,90*1.5*2*0.9},{30,120*1.5*2*0.9},{31,223*1.5*2*0.9}},
			[3]={{1,60*1.5*2*1.1},{20,90*1.5*2*1.1},{30,120*1.5*2*1.1},{31,223*1.5*2*1.1}}
		},
		adddamagebydist={1,80000,100},					--放大%=(min(（距离-参数3）*参数1，参数2)/1000)%，此处加入仅配合秘籍使用
		state_slowall_attack={{{1,80},{20,80},{30,80},{31,80}},{{1,15*1.5},{20,15*1.5},{30,15*1.5},{31,15*1.5}}},
		state_npchurt_attack={80,6},
		missile_hitcount={3,0,0},
    },

    ds_yyz = --一阳指-1级主动1--10级
    {
		state_slowall_attack={{{1,50},{15,80},{20,100},{21,100}},{{1,15*1.5},{15,15*1.5},{16,15*1.5},{21,15*2}}},
		attack_usebasedamage_p={{{1,251},{15,538},{20,841}}},
		attack_waterdamage_v={
			[1]={{1,251*2*0.9},{15,538*2*0.9},{20,841*2*0.9}},
			[3]={{1,251*2*1.1},{15,538*2*1.1},{20,841*2*1.1}}
			},
		missile_hitcount={3,0,0},
		skill_mintimepercast_v={13*15},
    },
    ds_yyz_child = --一阳指_清一次六脉CD
    {
		reduce_cd_time_point1={5611,{{1,15*5},{10,15*5}},1},		--清六脉cd,对充能可减
		skill_statetime={1},
    },

    ds_book1 = --秘籍.一阳指
    {
		--初级秘籍
		add_deadlystrike_p1={5606,{{1,5},{10,25},{20,25}}},

		--中级秘籍
		deccdtime={5606,{{1,0},{10,0},{11,1*15},{15,5*15},{20,5*15}}},

		--高级秘籍
		addstartskill={5607,5653,{{1,0},{15,0},{16,16},{20,20}}},

		userdesc_000={5653},
		skill_statetime={{{1,-1},{10,-1}}},
    },
    ds_book1_child = --秘籍.一阳指回复生命
    {
		--高级秘籍
		dir_recover_life_pp={{{1,0},{15,0},{16,60},{20,300}},1},		--生命上限,自身数值

		skill_statetime={{{1,1},{10,1}}},
    },

    ds_wlqy = --五罗轻烟-4级主动2--15级
    {
		state_slowall_attack={{{1,30},{15,30},{16,30},{21,40}},{{1,15*1.5},{15,15*1.5},{16,15*1.5},{21,15*2}}},
		attack_usebasedamage_p={{{1,189},{15,328},{20,478}}},
		attack_waterdamage_v={
			[1]={{1,189*2*0.9},{15,328*2*0.9},{20,478*2*0.9}},
			[3]={{1,189*2*1.1},{15,328*2*1.1},{20,478*2*1.1}}
			},
		missile_hitcount={3,0,0},

		state_knock_attack={100,4,150},  --几率，时间，速度
		state_npcknock_attack={100,4,150},
		spe_knock_param={0 , 9, 9},
		spe_knock_param1={1},

		skill_mintimepercast_v={10*15},
    },
    ds_wlqy_sumiao = --六脉神剑-4级主动2--15级
    {
		state_slowall_attack={{{1,30},{15,30},{16,30},{21,40}},{{1,15*1.5},{15,15*1.5},{16,15*1.5},{21,15*2}}},
		attack_usebasedamage_p={{{1,91},{15,224},{20,372}}},
		attack_waterdamage_v={
			[1]={{1,91*2*0.9},{15,224*2*0.9},{20,372*2*0.9}},
			[3]={{1,91*2*1.1},{15,224*2*1.1},{20,372*2*1.1}}
			},
		missile_hitcount={3,0,0},
		add_usebasedmg_p1={5611,{{1,10},{10,40},{11,44}}},
		state_knock_attack={100,4,150},
		state_npcknock_attack={100,4,150},
		spe_knock_param={0 , 9, 9},
		spe_knock_param1={1},
		state_freeze_attack={{{1,100},{15,100},{16,100},{21,100}},{{1,15*1},{15,15*2},{16,15*2.5},{21,15*2.5}}},
		skill_mintimepercast_v={10*15},
    },
    ds_book2 = --秘籍.五罗轻烟
    {
		--初级秘籍
		addstartskill={5608,5657,{{1,1},{10,10}}},

		--中级秘籍
		add_slowall_r={5608,{{1,0},{10,0},{11,5},{15,40},{20,40}}},						--增加五罗轻烟造成迟缓的几率
		add_slowall_t={5608,{{1,0},{10,0},{11,0.5*15},{15,2.5*15},{20,2.5*15}}},		--增加五罗轻烟造成迟缓的时间

		--高级秘籍
		deccdtime={5608,{{1,0},{15,0},{16,1*15},{20,5*15}}},

		userdesc_000={5657},
		skill_statetime={{{1,-1},{10,-1}}},
    },
    ds_book2_child = --秘籍.五罗轻烟后增加跑速
    {
		--初级秘籍
		attackspeed_v={{{1,10},{10,60},{20,60}}},
		runspeed_v={{{1,13},{10,130},{20,130}}},

		skill_statetime={{{1,5*15},{10,5*15}}},
    },

    ds_lmsj_kamo =
    {
		userdesc_000={5617,5618},
		skill_point={{{1,300},{3,300},{4,400},{6,400},{7,500},{9,500},{10,600},{11,600}},{{1,100},{10,100}}}, --参数1/100：叠加次数，参数2/100：每次CD回复的次数
		--skill_mintimepercast_v={18*15},
		skill_mintimepercast_v={{{1,25*15},{15,18*15},{20,15*15}}},
    },

	ds_lmsj = --六脉神剑-10级主动3--15级
	{
		userdesc_000={5617,5618},
		skill_point={{{1,300},{3,300},{4,400},{6,400},{7,500},{9,500},{10,600},{11,600}},{{1,100},{10,100}}}, --参数1/100：叠加次数，参数2/100：每次CD回复的次数
		skill_mintimepercast_v={{{1,5*15},{15,5*15},{16,5*15},{21,5*15}}},
	},

	ds_lmsj_child1 = --六脉神剑_子-10级主动3--15级
	{
		attack_usebasedamage_p={{{1,80},{15,173},{20,307}}},
		attack_waterdamage_v={
			[1]={{1,80*2*0.9},{15,173*2*0.9},{20,307*2*0.9}},
			[3]={{1,80*2*1.1},{15,173*2*1.1},{20,307*2*1.1}}
			},
		missile_hitcount={3,0,0},
	},
	ds_lmsj_child2 = --六脉神剑_三层伤害加成
	{
		add_usebasedmg_p1={5617,{{1,5},{15,11},{20,14}}},
		skill_statetime={{{1,2*15},{10,2*15}}},
	},
	ds_lmsj_child3 = --六脉神剑_六层伤害加成
	{
		add_usebasedmg_p1={5617,{{1,10},{15,22},{20,28}}},
		skill_statetime={{{1,2*15},{10,2*15}}},
	},
	ds_lmsj_child4 = --六脉神剑清伤害加成
	{
		ignore_skillstate1={5618},
		ignore_skillstate2={5619},
		skill_statetime={{{1,1},{10,1}}},
	},

    ds_book3 = --秘籍.六脉神剑
    {
		--初级秘籍
		add_usebasedmg_p1={5617,{{1,6},{10,33},{20,33}}},

		--中级秘籍
		add_hitskill1={{{1,0},{10,0},{11,5617},{15,5617},{20,5617}},{{1,0},{10,0},{11,5661},{15,5661},{20,5661}},{{1,0},{10,0},{11,11},{15,15},{20,20}}},  --技能ID1，技能ID2，触发等级

		--高级秘籍
		add_deadlydmg_p1={5617,{{1,0},{15,0},{16,12},{20,60}}},				--增加会心伤害

		userdesc_000={5661},
		skill_statetime={{{1,-1},{10,-1}}},
    },
	ds_book3_child = --秘籍.六脉神剑弹射
	{
		attack_usebasedamage_p={{{1,0},{10,0},{11,30},{15,163},{20,263}}},
		attack_waterdamage_v={
			[1]={{1,0*2*0.9},{10,0*2*0.9},{11,30*2*0.9},{15,163*2*0.9},{20,263*2*0.9}},
			[3]={{1,0*2*1.1},{10,0*2*1.1},{11,30*2*1.1},{15,163*2*1.1},{20,263*2*1.1}}
			},
		missile_hitcount={3,0,0},
	},

	ds_dsxf = --段氏心法-20级被动1--10级
	{
		physics_potentialdamage_p={{{1,24},{10,70},{11,80},{12,70*1.2},{14,70*1.4}}},
		state_palsy_resistrate={{{1,15},{10,150}}},
		runspeed_v={{{1,20},{10,50},{11,55},{16,80},{17,80}}},
		--lifemax_p={{{1,45},{10,60},{11,63}}},
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
	},

    ds_sly = --水龙狱-30级主动4--15级
    {
		--attack_usebasedamage_p={{{1,169},{15,303},{20,351}}},
		--attack_waterdamage_v={
		--	[1]={{1,169*2*0.9},{15,303*2*0.9},{20,351*2*0.9}},
		--	[3]={{1,169*2*1.1},{15,303*2*1.1},{20,351*2*1.1}}
		--	},
		--move_limit={},   		--将敌方困住，限制在子弹内行动
		hitfilter_target={1},  	--只打中选择的目标
		userdesc_000={5628},
		missile_hitcount={1,1,1},
		skill_statetime={{{1,2*15},{15,5*15},{16,5*15}}},
		skill_mintimepercast_v={{{1,20*15},{15,20*15},{20,20*15}}},
    },
    ds_sly_child1 = --水龙狱-30级主动4--15级
    {
		attack_usebasedamage_p={{{1,280},{15,529},{20,618}}},
		attack_waterdamage_v={
			[1]={{1,280*2*0.9},{15,529*2*0.9},{20,618*2*0.9}},
			[3]={{1,280*2*1.1},{15,529*2*1.1},{20,618*2*1.1}}
			},
		missile_hitcount={4,0,0},
    },
    ds_sly_child2 = --水龙狱_墙边冰冻
    {
		attack_usebasedamage_p={{{1,280},{15,529},{20,618}}},
		attack_waterdamage_v={
			[1]={{1,280*2*0.9},{15,529*2*0.9},{20,618*2*0.9}},
			[3]={{1,280*2*1.1},{15,529*2*1.1},{20,618*2*1.1}}
			},
		state_freeze_attack={{{1,100},{15,100},{16,100},{21,100}},{{1,15*1},{15,15*2},{16,15*2.5},{21,15*2.5}}},
		missile_hitcount={4,0,0},
    },
    ds_sly_child3 = --水龙狱_增加困人子弹时间
    {
		addms_life1={5626,{{1,0.5*15},{15,3*15},{16,3*15}}},	  --增加困人子弹时间
		addms_life2={5628,{{1,0.5*15},{15,3*15},{16,3*15}}},	  --增加冰冻子弹时间
		skill_statetime={{{1,-1},{10,-1}}},
    },
    ds_sly_child4 = --水龙狱_增加画地为牢子弹时间
    {
		addms_life1={5638,{{1,0.5*15},{15,3*15},{16,3*15}}},	  --增加圈外攻击BUFF时间
		addms_life2={5639,{{1,0.5*15},{15,3*15},{16,3*15}}},	  --增加圈内反伤&速度
		addms_life3={5640,{{1,0.5*15},{15,3*15},{16,3*15}}},	  --增加圈内队友速度
		skill_statetime={{{1,-1},{10,-1}}},
    },
    ds_book4 = --秘籍.水龙狱
    {
		--初级秘籍.增加攻击力
		add_usebasedmg_p1={5626,{{1,8},{10,89},{20,89}}},
		add_usebasedmg_p2={5627,{{1,8},{10,89},{20,89}}},

		--中级秘籍.减会心免伤与跑速
		add_hitskill1={5626,5666,{{1,1},{20,20}}},
		add_hitskill2={5627,5666,{{1,1},{20,20}}},
		userdesc_000={5666,5667},
		userdesc_101={5*15},		  --ds_book4_child1的持续时间

		skill_statetime={{{1,-1},{10,-1}}},
    },
    ds_book4_high = --高级秘籍.水龙狱
    {
		--初级秘籍.增加攻击力
		add_usebasedmg_p1={5626,{{1,8},{10,89},{20,89}}},
		add_usebasedmg_p2={5627,{{1,8},{10,89},{20,89}}},

		--中级秘籍.减会心免伤与跑速
		add_hitskill1={5626,5668,{{1,0},{10,0},{11,11},{20,20}}},
		add_hitskill2={5627,5668,{{1,0},{10,0},{11,11},{20,20}}},
		userdesc_000={5666,5667,5679},
		userdesc_101={5*15},		  --ds_book4_child1的持续时间
		userdesc_102={5*15},		  --ds_book4_child2的持续时间

		--高级秘籍
		autoskill={115,{{1,1},{10,10},{11,11}}},  --击中时回复生命，间隔1秒

		skill_statetime={{{1,-1},{10,-1}}},
    },
	ds_book4_child1 = --秘籍.水龙狱_子
	{
		--中级秘籍，减会心免伤与跑速
		weaken_deadlystrike_damage_p={{{1,0},{10,0},{11,-10},{15,-50},{20,-50}}},
		runspeed_v={{{1,0},{10,0},{11,-16},{15,-160},{20,-160}}},

		--高级秘籍，减低基础闪避
		defense_p={{{1,0},{15,0},{16,-40},{20,-200},{21,-200}}},

		skill_statetime={5*15},

	},
    ds_book4_child2 = --高级秘籍.水龙狱.增加血量上限
    {
		--高级秘籍，增加血量上限
		lifecurmax_p={{{1,0},{15,0},{16,1},{20,5}}},
		skill_statetime={5*15},
    },
    ds_book4_child3 = --高级秘籍.水龙狱.回复血量
    {
		--高级秘籍，回复血量
		dir_recover_life_pp={{{1,0},{15,0},{16,60},{20,300}},1},		--生命上限,自身数值
		skill_statetime={5*15},
    },

    ds_mdz = --妙谛指-40级被动2--10级
    {
		ignore_defense_p={{{1,2},{10,20}}},						--忽略最终闪避百分比
		autoskill={111,{{1,1},{10,10},{11,11}}},
		userdesc_101={{{1,20},{10,50},{11,53}}},				--减少一阳指cd的几率
		userdesc_000={5634},
		skill_statetime={-1},
    },
    ds_mdz_child = --妙谛指_减CD
    {
		reduce_cd_time_point1={5606,{{1,15*1},{10,15*3.5},{11,15*3.5}}},		--减少一阳指cd
		skill_statetime={1},
    },
    ds_gjsj = --高级扇诀-50级被动3--10级
    {
		add_skill_level={5601,{{1,1},{10,10},{11,11}},0},
		add_skill_level2={5602,{{1,1},{10,10},{11,11}},0},
		add_skill_level3={5603,{{1,1},{10,10},{11,11}},0},
		add_skill_level4={5604,{{1,1},{10,10},{11,11}},0},
		userdesc_000={5636},
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    ds_gjsj_child = --高级扇诀_子（仅用作显示，无实际效果加成。实际效果查看普攻的21-31级）--10级
    {
		attack_usebasedamage_p={{{1,3},{10,30},{11,33}}},
		attack_waterdamage_v={
			[1]={{1,12*1},{10,120},{11,132}},
			[3]={{1,12*1},{10,120},{11,132}}
		},
    },

    ds_hdwl = --画地为牢-60级被动4--10级
    {
		addstartskill={5629,5638,{{1,1},{10,10}}},
		userdesc_000={5638,5639},
		skill_statetime={{{1,-1},{10,-1}}},
    },
    ds_hdwl_child1 = --画地为牢_圈外攻击&生命回复效率
    {
		physics_potentialdamage_p={{{1,20},{10,200},{11,220}}},
		lifereplenish_p={{{1,4},{10,40},{11,44}}},
		skill_statetime={{{1,15*2},{10,15*2},{11,15*2}}},
    },
    ds_hdwl_child2 = --画地为牢_圈内反伤&速度
    {
		meleedamagereturn_p={{{1,3},{10,12},{11,13}}},  --反弹近程伤害
		rangedamagereturn_p={{{1,3},{10,12},{11,13}}},  --反弹远程伤害
		attackspeed_v={{{1,3},{10,30},{11,33}}},
		runspeed_v={{{1,3},{10,30},{11,33}}},
		ignore_skillstate1={5638},						--清除圈外攻击加成
		skill_statetime={{{1,15*1},{10,15*1},{11,15*1}}},
    },
    ds_hdwl_child3 = --画地为牢_圈内队友速度
    {
		attackspeed_v={{{1,3},{10,30},{11,33}}},
		runspeed_v={{{1,3},{10,30},{11,33}}},
		skill_statetime={{{1,15*2},{10,15*2},{11,15*2}}},
    },

    ds_krcg = --枯荣禅功-70级被动5--10级
    {
		autoskill={112,{{1,1},{10,10},{11,11}}},
		userdesc_000={5643},
		userdesc_101={{{1,40},{10,90},{11,95}}},				--描述用，实际触发几率请查看autoskill.tab中的枯荣禅功
		userdesc_102={{{1,15*30},{10,15*30},{11,15*30}}},		--描述用，实际触发间隔请查看autoskill.tab中的枯荣禅功
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    ds_krcg_child1 = --枯荣禅功_免控与回复生命--10级
    {
		recover_life_p={{{1,3},{10,3},{11,3}},15},
		skill_statetime={{{1,15*3},{10,15*3},{11,15*3}}},
    },
    ds_krcg_child2 = --枯荣禅功_清除CD--10级
    {
		reduce_cd_time1={5626,{{1,15*60},{10,15*60},{11,15*60}}},			--清除水龙狱CD
    },

    ds_tlsg = --天龙神功-80级被动6--20级
    {
		physics_potentialdamage_p={{{1,2},{20,40},{24,40*1.2}}},
		lifemax_p={{{1,5},{20,95},{24,95*1.2}}},
		attackspeed_v={{{1,5},{20,20},{24,20*1.2}}},
		all_series_resist_p={{{1,2},{20,40},{24,40*1.2}}},
		state_slowall_attackrate={{{1,10},{20,200},{24,200*1.2}}},
		state_palsy_resisttime={{{1,10},{20,200},{24,200*1.2}}},
		skill_statetime={-1},
    },
    ds_bmsg = --北冥神功-90级被动7--10级
    {
		autoskill={113,{{1,1},{10,10}}},				--受到攻击减少敌人基础攻击力

		skill_statetime={-1},

		userdesc_000={5647,5649},
		userdesc_101={{{1,15*10},{10,15*10},{11,15*10}}},  --此描述为ds_bmsg_child1的持续时间
		userdesc_102={{{1,15*3},{10,15*3},{11,15*3}}},  --此描述为减BUFF的触发间隔
    },
    ds_bmsg_child1 = --北冥神功_减基础攻击力
    {
		physics_potentialdamage_p={{{1,-10},{10,-30},{11,-35}}},
		superposemagic={4},								--叠加层数

		skill_statetime={{{1,15*10},{10,15*10},{11,15*10}}},
    },
    ds_bmsg_child2 = --北冥神功_冰环触发buff
    {
		autoskill={114,{{1,1},{10,10}}},				--普攻触发冰环
		skill_statetime={{{1,15*5},{10,15*5},{11,15*5}}},
    },
    ds_bmsg_child3 = --北冥神功_冰环
    {
		attack_usebasedamage_p={{{1,194},{15,259},{20,283}}},
		attack_waterdamage_v={
			[1]={{1,194*2*0.9},{15,259*2*0.9},{20,283*2*0.9}},
			[3]={{1,194*2*1.1},{15,259*2*1.1},{20,283*2*1.1}}
			},
		missile_hitcount={3,0,0},
    },
	ds_bmsg_child4 = --北冥神功_清冰环buff
	{
		ignore_skillstate1={5648},
		skill_statetime={{{1,1},{10,1}}},
	},

    ds_nq = --瀚海百丈冰-怒气
    {
		attack_usebasedamage_p={{{1,800},{30,800}}},
		attack_firedamage_v={
			[1]={{1,2000*0.9},{30,2000*0.9},{31,2000*0.9}},
			[3]={{1,2000*1.1},{30,2000*1.1},{31,2000*1.1}}
			},
    },
    ds_nq_child = --瀚海百丈冰_子2（免疫）
    {
		ignore_series_state={},		--免疫属性效果
		ignore_abnor_state={},		--免疫负面效果
		skill_statetime={{{1,50},{30,50}}},
    },

    ds_nq_kamo = --瀚海百丈冰-怒气
    {
		attack_usebasedamage_p={{{1,250},{15,350},{20,450}}},
		attack_waterdamage_v={
			[1]={{1,250*2*0.9},{15,350*2*0.9},{20,450*2*0.9}},
			[3]={{1,250*2*1.1},{15,350*2*1.1},{20,450*2*1.1}}
			},
    },

    ds_nq_child_kamo = --瀚海百丈冰_子2（免疫）
    {
		ignore_series_state={},		--免疫属性效果
		ignore_abnor_state={},		--免疫负面效果
		skill_statetime={{{1,50},{30,50}}},
    },
}

FightSkill:AddMagicData(tb)