
local tb    = {
    em_pg1 = --峨眉剑法1--20级
    {
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
		attack_usebasedamage_p={{{1,70},{20,90},{30,130},{32,238}}},
		attack_waterdamage_v={
			[1]={{1,40*1},{20,150*0.95},{30,300*0.95},{32,330*0.95}},
			[3]={{1,40*1},{20,150*1.05},{30,300*1.05},{32,330*1.05}}
			},
		state_npchurt_attack={100,6},
		state_slowall_attack={{{1,30},{20,30},{30,30},{32,30}},{{1,15*1.5},{20,15*1.5},{30,15*1.5},{32,15*1.5}}},
		missile_hitcount={3,0,0},
    },

    em_pg2 = --峨眉剑法2--20级
    {
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
		attack_usebasedamage_p={{{1,70},{20,90},{30,130},{32,238}}},
		attack_waterdamage_v={
			[1]={{1,40*1},{20,150*0.95},{30,300*0.95},{32,330*0.95}},
			[3]={{1,40*1},{20,150*1.05},{30,300*1.05},{32,330*1.05}}
			},
		state_npchurt_attack={100,6},
		state_slowall_attack={{{1,50},{20,50},{30,50},{32,50}},{{1,15*1.5},{20,15*1.5},{30,15*1.5},{32,15*1.5}}},
		missile_hitcount={3,0,0},
    },

    em_pg3 = --峨眉剑法3--20级
    {
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
		attack_usebasedamage_p={{{1,70},{20,90},{30,130},{32,238}}},
		attack_waterdamage_v={
			[1]={{1,40*1},{20,150*0.95},{30,300*0.95},{32,330*0.95}},
			[3]={{1,40*1},{20,150*1.05},{30,300*1.05},{32,330*1.05}}
			},
	--	state_hurt_attack={50,5,0},
		state_slowall_attack={{{1,70},{20,70},{30,70},{32,70}},{{1,15*1.5},{20,15*1.5},{30,15*2},{32,15*2}}},
		state_npchurt_attack={100,6},
		missile_hitcount={3,0,0},
    },

    em_pg4 = --峨眉剑法4--20级
    {
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
		attack_usebasedamage_p={{{1,70*1.5},{20,90*1.5},{30,130*1.5},{32,238*1.5}}},
		attack_waterdamage_v={
			[1]={{1,40*1*1.5},{20,150*0.95*1.5},{30,300*0.95*1.5},{32,330*0.95*1.5}},
			[3]={{1,40*1*1.5},{20,150*1.05*1.5},{30,300*1.05*1.5},{32,330*1.05*1.5}}
			},
		state_slowall_attack={{{1,90},{20,90},{30,90},{32,90}},{{1,15*1.5},{20,15*1.5},{30,15*2},{32,15*2}}},
		state_npchurt_attack={80,6},
		missile_hitcount={3,0,0},
    },
    em_jhnb = --江海凝波-1级主动1--10级
    {
		userdesc_000={311},
		skill_mintimepercast_v={20*15},
    },
    em_jhnb_child = --江海凝波_子--10级
    {
		state_slowall_attack={{{1,30},{15,30},{16,30},{21,40}},{{1,15*1.5},{15,15*1.5},{16,15*1.5},{21,15*2}}},
		attack_usebasedamage_p={{{1,91},{15,224},{20,272}}},
		attack_waterdamage_v={
			[1]={{1,91*2*0.9},{15,224*2*0.9},{20,272*2*0.9}},
			[3]={{1,91*2*1.1},{15,224*2*1.1},{20,272*2*1.1}}
			},
		missile_hitcount={3,0,0},
    },

    em_book1 = --高级江海凝波
    {
		add_usebasedmg_p1={311,{{1,5},{10,30},{15,70},{16,80},{20,200}}},				--增加江海凝波攻击力

		add_slowall_r={311,{{1,0},{10,0},{11,5},{15,20},{16,25},{20,40}}},				--增加江海凝波造成迟缓的几率

		add_igdefense_p1={311,{{1,0},{15,0},{16,3},{20,15}}},							--增加忽闪点数
		add_deadlystrike_p1={311,{{1,0},{15,0},{16,3},{20,15}}},						--增加会心点数
		skill_statetime={{{1,-1},{10,-1}}},
    },

    em_twbl = --天舞宝轮-4级主动2--15级
    {
		--vitality_recover_life={{{1,20*2},{15,20*8},{16,20*9},{21,20*12}},15},
		dir_recover_life_pp={{{1,25},{15,300},{20,700}},1},		--生命上限万分比,自身数值

		skill_statetime={2},

		skill_mintimepercast_v={30*15},

		userdesc_000={313},
    },
    em_twbl_child1 = --天舞宝轮_子1--15级
    {
		attack_usebasedamage_p={{{1,30},{10,60},{15,80},{16,85},{20,110},{21,260}}},
		attack_waterdamage_v={
			[1]={{1,70*0.9},{10,200*0.9},{15,245*0.9},{16,260*0.9},{21,700*0.9}},
			[3]={{1,70*1.1},{10,200*1.1},{15,245*1.1},{16,260*1.1},{21,700*1.1}}
			},
		state_slowall_attack={{{1,70},{15,70},{16,70},{21,70}},{{1,15*3},{15,15*3},{16,15*3},{21,15*3}}},
		state_nojump_attack={{{1,60},{15,60},{16,60},{21,60}},{{1,8},{15,8},{16,8},{21,8}}},
		missile_hitcount={3,0,0},
    },

	em_chpd = {--慈航普度-10级主动3--15级,初始1次,后续4次
		dir_recover_life_pp={{{1,200},{15,600},{20,900}},1},	--生命上限万分比,自身数值
		physics_potentialdamage_p={1},							--需要有buff属性
		skill_statetime={5*15},

		missile_hitcount={0,0,1},
		hitfilter_target={1},

		skill_mintimepercast_v={{{1,40*15},{15,20*15},{16,20*15},{21,20*15}}},

		userdesc_000={307},
	},
	em_chpd_child = {--慈航普度-10级主动3--15级
		dir_recover_life_pp={{{1,200},{15,600},{20,900}},1},	--生命上限万分比,自身数值
		--skill_statetime={2},
		missile_hitcount={0,0,1},
		hitfilter_target={1},
	},

	em_jxtm = --剑心通明-20级被动1--10级
	{
	--	attackspeed_v={{{1,10},{30,10}}},
		physics_potentialdamage_p={{{1,24},{10,70},{11,80},{12,70*1.2},{14,80*1.4}}},
		lifemax_p={{{1,45},{10,60},{11,83}}},
		state_palsy_resistrate={{{1,15},{10,150}}},
		runspeed_v={{{1,20},{10,50},{11,55},{16,80},{17,90}}},
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
	},
    em_blns = --白露凝霜-30级主动4--15级
    {
		attack_usebasedamage_p={{{1,169},{15,303},{20,651}}},
		attack_waterdamage_v={
			[1]={{1,169*2*0.9},{15,303*2*0.9},{20,651*2*0.9}},
			[3]={{1,169*2*1.1},{15,303*2*1.1},{20,651*2*1.1}}
			},
		state_slowall_attack={{{1,40},{15,80},{20,100},{21,100}},3*15},

		missile_hitcount={0,0,1},
		skill_mintimepercast_v={{{1,20*15},{15,10*15},{20,10*15}}},
    },
    em_bxys = --冰心云裳-40级被动2--10级
    {
		ignore_deadlystrike_vp={{{1,10},{10,100},{11,110}}},
		weaken_deadlystrike_damage_p={{{1,5},{10,30},{11,33}}},
		skill_statetime={-1},
    },
    em_gjjf = --剑法进阶-50级被动3--10级
    {
		addaction_event1={304,324},		--技能304被324替换
		add_skill_level={301,{{1,1},{10,10},{11,11}},0},
		add_skill_level2={302,{{1,1},{10,10},{11,11}},0},
		add_skill_level3={303,{{1,1},{10,10},{11,11}},0},
		add_skill_level4={304,{{1,1},{10,10},{11,11}},0},
		userdesc_000={361},
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    em_gjjf_child1 = --剑法进阶_伤害--10级
    {
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
		attack_usebasedamage_p={{{1,100},{20,150},{30,180},{32,186}}},
		attack_waterdamage_v={
			[1]={{1,90*1},{20,300*0.95},{30,420*0.95},{32,444*0.95}},
			[3]={{1,90*1},{20,300*1.05},{30,420*1.05},{32,444*1.05}}
			},
		state_slowall_attack={{{1,80},{20,80},{30,80},{32,80}},{{1,15*0.5},{20,15*0.5},{30,15*0.5},{32,15*0.5}}},
		state_npchurt_attack={80,6},
		missile_hitcount={3,0,0},
    },
    em_gjjf_child2 = --高级剑法_子（仅用作显示，无实际效果加成。实际效果查看普攻的21-31级）--10级
    {
		attack_usebasedamage_p={{{1,3},{10,30},{11,33}}},
		attack_waterdamage_v={
			[1]={{1,12*1},{10,120},{11,132}},
			[3]={{1,12*1},{10,120},{11,132}}
		},
    },
    em_fxcy = --佛心慈佑-60级被动4（光环）--10级
    {
		resist_allseriesstate_rate_v={{{1,20},{10,80},{11,88}}},
		resist_allseriesstate_time_v={{{1,20},{10,80},{11,88}}},
		resist_allspecialstate_rate_v={{{1,20},{10,80},{11,88}}},
		resist_allspecialstate_time_v={{{1,20},{10,80},{11,88}}},
		userdesc_101={{{1,20},{10,80},{11,88}}},					--增加队友光环的描述
		userdesc_102={{{1,20},{10,80},{11,88}}},					--增加队友光环的描述
		userdesc_103={{{1,20},{10,80},{11,88}}},					--增加队友光环的描述
		userdesc_104={{{1,20},{10,80},{11,88}}},					--增加队友光环的描述
		skill_statetime={{{1,15*3},{10,15*3},{11,15*3}}},
    },
    em_fxcy_team = --佛心慈佑_队友--10级
    {
		resist_allseriesstate_rate_v={{{1,20},{10,80},{11,88}}},
		resist_allseriesstate_time_v={{{1,20},{10,80},{11,88}}},
		resist_allspecialstate_rate_v={{{1,20},{10,80},{11,88}}},
		resist_allspecialstate_time_v={{{1,20},{10,80},{11,88}}},
		skill_statetime={{{1,15*3},{10,15*3},{11,15*3}}},
    },
    em_mlcz = --绵里藏针-70级被动5--10级
    {
		autoskill={31,{{1,1},{10,10},{11,11}}},
		userdesc_000={318},
		userdesc_101={{{1,40},{10,90},{11,95}}},					--假描述，触发概率，实际触发概率于aotuskill.tab中设置
		userdesc_102={{{1,15*30},{10,15*30},{11,15*30}}},			--假描述，触发间隔，实际触发概率于aotuskill.tab中设置
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    em_mlcz_child1 = --绵里藏针子1--10级
    {
		recover_life_p={{{1,3},{10,6},{11,7}},15},
		skill_statetime={{{1,15*2},{10,15*6},{11,15*7}}},
    },
    em_mlcz_child2 = --绵里藏针_子2--10级
    {
		state_knock_attack={100,3,80},
		state_npcknock_attack={100,3,80},
		spe_knock_param={0 , 9, 9},
		spe_knock_param1={1},
    },
    em_ffwb = --佛法无边-80级被动6--20级
    {
		physics_potentialdamage_p={{{1,40},{20,90},{21,100},{24,90*1.2},{28,90*1.4}}},
		lifemax_p={{{1,5},{20,25},{21,28},{24,40*1.2},{28,50*1.4}}},
		attackspeed_v={{{1,15},{20,50},{21,55},{22,76}}},--攻速成长均为1
		state_slowall_attackrate={{{1,10},{20,200},{24,300*1.2}}},
		state_palsy_resisttime={{{1,10},{20,200},{24,200*1.2}}},
		skill_statetime={-1},
    },
     em_90_qxps = --清心普善-90级被动7--10级
    {
		add_hitskill1={312,358,{{1,1},{10,10}}},
		add_hitskill2={306,359,{{1,1},{10,10}}},
		add_hitskill3={307,359,{{1,1},{10,10}}},
		lifereplenish_p={{{1,2},{10,15},{11,17}}},

		skill_statetime={-1},

		userdesc_000={358},
		userdesc_101={{{1,20},{10,200},{12,240}},1},					--描述用，加慈航普度回复效果
    },
    em_90_qxps_child1 = --清心普善_加天舞-90级被动7
    {
		dir_recover_life_pp={{{1,12},{10,125},{12,180}},1},
    },
    em_90_qxps_child2 = --清心普善_加慈航-90级被动7
    {
		dir_recover_life_pp={{{1,20},{10,200},{12,340}},1},
    },
    em_bphlj = --冰魄红莲劫-怒气
    {
		state_freeze_attack={{{1,100},{10,100}},{{1,15*5},{10,15*5}}},
		attack_usebasedamage_p={{{1,1000},{10,1000}}},
		attack_waterdamage_v={
			[1]={{1,300*0.9},{10,2000*0.9}},
			[3]={{1,300*1.1},{10,2000*1.1}}
			},
    },
    em_bphlj_child1 = --冰魄红莲劫_子1
    {
		all_series_resist_v={{{1,-2000},{10,-2000}}},
		skill_statetime={{{1,15*15},{10,15*15}}},
    },
	em_bphlj_child2 = --冰魄红莲劫_子2
    {
		ignore_series_state={},		--免疫属性效果
		ignore_abnor_state={},		--免疫负面效果
		skill_statetime={{{1,35},{10,35}}},
    },
}

FightSkill:AddMagicData(tb)