
local tb    = {
    gb_pg1 = {--丐帮棍法1-普攻1式--20级
		attack_attackrate_v={100},
		attack_usebasedamage_p={{{1,60},{20,90},{30,130},{31,134}}},
		attack_firedamage_v={
			[1]={{1,60*2*0.9},{20,90*2*0.9},{30,130*2*0.9},{31,134*2*0.9}},
			[3]={{1,60*2*1.1},{20,90*2*1.1},{30,130*2*1.1},{31,134*2*1.1}}
		},
		state_palsy_attack={30,4},
		state_npchurt_attack={100,7},

		missile_hitcount={3,0,0},
    },
    gb_pg2 = {--丐帮棍法2-普攻2式--20级
		attack_attackrate_v={100},
		attack_usebasedamage_p={{{1,60},{20,90},{30,130},{31,134}}},
		attack_firedamage_v={
			[1]={{1,60*2*0.9},{20,90*2*0.9},{30,130*2*0.9},{31,134*2*0.9}},
			[3]={{1,60*2*1.1},{20,90*2*1.1},{30,130*2*1.1},{31,134*2*1.1}}
		},
		state_palsy_attack={30,4},
		state_npchurt_attack={100,7},

		missile_hitcount={3,0,0},
    },
    gb_pg3 = {--丐帮棍法3-普攻3式--20级,第3段包括3和4,有2次伤害
		attack_attackrate_v={100},
		attack_usebasedamage_p={{{1,60/2},{20,90/2},{30,130/2},{31,134/2}}},
		attack_firedamage_v={
			[1]={{1,60/2*2*0.9},{20,90/2*2*0.9},{30,130/2*2*0.9},{31,134/2*2*0.9}},
			[3]={{1,60/2*2*1.1},{20,90/2*2*1.1},{30,130/2*2*1.1},{31,134/2*2*1.1}}
		},
		state_palsy_attack={40/2,6},
		state_npchurt_attack={100,7},

		missile_hitcount={3,0,0},
    },
    gb_pg4 = {--丐帮棍法4-普攻4式--20级
		attack_attackrate_v={100},
		attack_usebasedamage_p={{{1,60/2},{20,90/2},{30,130/2},{31,134/2}}},
		attack_firedamage_v={
			[1]={{1,60/2*2*0.9},{20,90/2*2*0.9},{30,130/2*2*0.9},{31,134/2*2*0.9}},
			[3]={{1,60/2*2*1.1},{20,90/2*2*1.1},{30,130/2*2*1.1},{31,134/2*2*1.1}}
		},
		state_palsy_attack={50/2,6},
		state_npchurt_attack={100,7},

		missile_hitcount={3,0,0},
    },
    gb_pg5 = {--丐帮棍法5-普攻5式--20级
		attack_attackrate_v={100},
		attack_usebasedamage_p={{{1,60*1.5},{20,90*1.5},{30,130*1.5},{31,134*1.5}}},
		attack_firedamage_v={
			[1]={{1,60*1.5*0.9},{20,90*1.5*2*0.9},{30,130*1.5*2*0.9},{31,134*1.5*2*0.9}},
			[3]={{1,60*1.5*1.1},{20,90*1.5*2*1.1},{30,130*1.5*2*1.1},{31,134*1.5*2*1.1}}
			},
		state_palsy_attack={100,10},
		state_npchurt_attack={100,7},

		missile_hitcount={3,0,0},
    },

    gb_klyh = --亢龙有悔-1级主动1 --15级
    {
		attack_usebasedamage_p={{{1,160},{15,200},{16,210},{21,260}}},
		attack_firedamage_v={
			[1]={{1,300*0.95},{15,500*0.95},{16,550*0.95},{21,800*0.95}},
			[3]={{1,300*1.05},{15,500*1.05},{16,550*1.05},{21,800*1.05}}
			},
		state_palsy_attack={{{1,5},{15,30},{16,30},{21,30}},{{1,15*1},{15,15*1},{16,15*1},{21,15*1}}},
		skill_point={{{1,200},{7,200},{8,300},{10,300},{11,400},{13,400},{14,400},{15,500},{16,500},{21,500}},{{1,100},{15,100},{16,100},{21,100}}}, --参数1/100：叠加次数，参数2/100：每次CD回复的次数

		missile_hitcount={3,0,0},
    },
    gb_klg = --困龙功-4级主动2--15级
    {
		userdesc_000={4209},
    },
    gb_klg_child = --困龙功_子--15级
    {
		attack_usebasedamage_p={{{1,240},{15,300},{16,310},{21,360}}},
		attack_firedamage_v={
			[1]={{1,500*1},{15,800*0.95},{16,900*0.95},{21,1400*0.95}},
			[3]={{1,500*1},{15,800*1.05},{16,900*1.05},{21,1400*1.05}}
			},
		state_palsy_attack={{{1,50},{15,70},{16,80},{21,80}},{{1,15*1.5},{15,15*1.5},{16,15*1.5},{21,15*1.5}}},
		state_fixed_attack={{{1,50},{15,70},{16,80},{21,80}},{{1,15*1.5},{15,15*1.5},{16,15*1.5},{21,15*1.5}}},
		state_npchurt_attack={100,10},

		missile_hitcount={3,0,0},
    },
    gb_zdkw = --醉蝶狂舞-10级主动3--15级
    {
		runspeed_v={{{1,100},{15,200},{16,210},{21,260}}},
		defense_p={{{1,1000},{15,1600},{16,1700},{21,2200}}},
		skill_statetime={{{1,15*8},{15,15*8},{16,15*8},{21,15*8}}},

		skill_mintimepercast_v={30*15},
    },
    gb_hxwy = --化险为夷-20级被动1--10级
    {
		lifemax_p={{{1,20},{10,40},{11,42}}},
		runspeed_v={{{1,10},{10,30},{11,32},{16,42},{17,42}}},
		defense_p={{{1,100},{10,240},{11,245}}},
		state_hurt_resistrate={{{1,15},{10,150},{11,165}}},
		skill_statetime={-1},
    },
    gb_lzyy = --龙战于野-30级主动4--15级
    {
		skill_mintimepercast_v={{{1,45*15},{15,40*15},{16,40*15},{21,40*15}}},

		userdesc_000={4214},
    },
    gb_lzyy_child = --龙战于野_子1（群攻）--15级
    {
		attack_usebasedamage_p={{{1,27},{15,96},{20,121},{21,126}}},
		attack_firedamage_v={
			[1]={{1,27*2*0.95},{15,96*2*0.95},{20,121*2*0.95},{21,126*2*0.95}},
			[3]={{1,27*2*1.05},{15,96*2*1.05},{20,121*2*1.05},{21,126*2*1.05}}
			},
		state_palsy_attack={{{1,5},{15,20},{16,22},{21,32}},{{1,15*1},{15,15*1},{16,15*1},{21,15*1}}},
		state_npchurt_attack={100,10},
		skill_statetime={{{1,1},{30,1}}},								--debuff持续时间 填的短代表只掉血1次

		missile_hitcount={3,0,0},
    },
    gb_hbls = --霸王卸甲-40级被动2--10级
    {
		add_mult_proc_sate1={4219,{{1,2},{10,5},{11,5}},60},  --技能ID,叠加层数，自身为圆心格子半径
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
		userdesc_000={4219},
    },
    gb_hbls_child = --霸王卸甲_子--10级
    {
		skill_mult_relation={1}, 									--对应的NPC类型，从skillsetting.ini上查看
		ignore_all_resist={100,{{1,2},{10,8},{11,9}}},
		skill_statetime={{{1,15*10},{10,15*10},{11,15*10}}},
    },
    gb_gjgf = --高级棍法-50级被动3--10级
    {
		add_skill_level={4201,{{1,1},{10,10},{11,11}},0},
		add_skill_level2={4202,{{1,1},{10,10},{11,11}},0},
		add_skill_level3={4203,{{1,1},{10,10},{11,11}},0},
		add_skill_level4={4205,{{1,1},{10,10},{11,11}},0},
		add_att_speed1={4201,{{1,1},{10,10},{11,11}}},				--增加普攻1的攻击速度
		add_att_speed2={4202,{{1,1},{10,10},{11,11}}},				--增加普攻2的攻击速度
		add_att_speed3={4203,{{1,1},{10,10},{11,11}}},				--增加普攻34的攻击速度
		add_att_speed4={4205,{{1,1},{10,10},{11,11}}},				--增加普攻5的攻击速度
		skill_statetime={-1},

		userdesc_000={4221},
    },
    gb_gjgf_child = --高级棍法_子（仅用作显示，无实际效果加成。实际效果查看普攻的21-30级）--10级
    {
		attack_usebasedamage_p={{{1,4},{10,40},{11,44}}},
		attack_firedamage_v={
			[1]={{1,4*2*0.9},{10,40*2*0.9},{11,44*2*0.9}},
			[3]={{1,4*2*1.1},{10,40*2*1.1},{11,44*2*1.1}}
		},
    },
    gb_ylj = --游龙决-60级被动4--10级
    {
		autoskill={45,{{1,1},{10,10},{11,11}}},
		userdesc_000={4224,4223},
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    gb_ylj_child1 = --游龙决_子1
    {
		physics_potentialdamage_p={{{1,20},{10,40},{11,54}}},		--闪避后增加攻击
		dir_recover_life_pp={{{1,100},{10,300},{11,360}},1},		--生命上限万分比,自身数值

		superposemagic={{{1,2},{10,5},{11,5}}},						--叠加层数

		skill_statetime={12*15},		--攻击加成的持续时间

		userdesc_102={5*15},				--描述用，游龙决的触发间隔，实际触发间隔请查看autoskill.tab中的游龙决

    },
    gb_ylj_child2 = --游龙决_子2_作废
    {
		recover_life_p={{{1,1},{10,3},{11,3}},15},					--闪避后回复生命
		skill_statetime={{{1,1},{10,1},{11,1}}},					--时间填得短，代表只回复一次
    },
    gb_jctq = --金蝉脱壳-70级被动5--10级
    {
		autoskill={46,{{1,1},{10,10},{11,11}}},
		userdesc_000={4226},
		userdesc_101={{{1,40},{10,90},{11,95}}},				--描述用，实际触发几率请查看autoskill.tab中的金蝉脱壳
		userdesc_102={{{1,15*30},{10,15*30},{11,15*30}}},		--描述用，实际触发几率请查看autoskill.tab中的金蝉脱壳
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    gb_jctq_child = --金蝉脱壳_子--10级
    {
		ignore_series_state={},							--免疫、清除属性效果
		ignore_abnor_state={},							--免疫、清除负面效果
		--autoskill2={47,{{1,1},{10,10},{11,11}}},		--此处触发等级不生效。取的是“醉蝶狂舞”的当前等级
		skill_statetime={{{1,15*1},{10,15*1},{11,15*1}}},
    },

    gb_txwg = --天下无狗-80级被动6--20级
    {
		physics_potentialdamage_p={{{1,2},{20,40},{24,50*1.2}}},
		lifemax_p={{{1,5},{20,90},{24,95*1.2}}},
		attackspeed_v={{{1,5},{20,20},{24,24*1.2}}},
		all_series_resist_p={{{1,3},{20,50},{24,60*1.2}}},
		state_palsy_attackrate={{{1,10},{20,200},{24,200*1.2}}},
		state_hurt_resisttime={{{1,10},{20,200},{24,200*1.2}}},
		skill_statetime={-1},
    },
	gb_tthr = --偷天换日-90级被动7--10级
    {
		autoskill={48,{{1,1},{10,10},{11,11}}},
		autoskill2={49,{{1,1},{10,10},{11,11}}},
		userdesc_101={{{1,15*10},{10,15*10},{11,15*10},{12,145}}},		--描述用，触发间隔。实际效果查看autoskill.tab的偷天换日
		userdesc_103={{{1,15*6},{10,15*2},{11,15*2}}},					--描述用，触发间隔。实际效果查看autoskill.tab的偷天换日
		userdesc_102={{{1,40},{10,60},{11,60}}},						--描述用，触发几率。实际效果查看autoskill.tab的偷天换日
		userdesc_000={4230,4255},
		skill_statetime={{{1,-1},{10,-1}}},
    },
	gb_tthr_child1 = --偷天换日_偷BUFF
    {
		stealstate_type={100,1,2}, 								--偷取BUFF的几率， 偷取数量， 技能类型索引SkillSetting.ini
		skill_stealstate_time={{{1,15*5},{10,15*5},{11,15*5}}},
    },
    gb_tthr_child2 = --偷天换日_减CD
    {
		reduce_cd_time_point1={4206,{{1,15*0.2},{10,15*2}},1},		--亢龙有悔cd,对充能可减
		reduce_cd_time_point2={4208,{{1,15*0.2},{10,15*2}},1},		--困龙功cd,对充能可减
		reduce_cd_time_point3={4213,{{1,15*0.2},{10,15*2}},1},		--龙战于野cd,对充能可减
		skill_statetime={1},
    },
    gb_xlsbz = --降龙十八掌-怒气
    {
		attack_usebasedamage_p={{{1,800},{30,1200}}},
		attack_firedamage_v={
			[1]={{1,2000*0.9},{30,2000*0.9},{31,2500*0.9}},
			[3]={{1,2000*1.1},{30,2000*1.1},{31,2500*1.1}}
			},
    },
    gb_xlsbz_child = --降龙十八掌_子（免疫）
    {
		ignore_series_state={},		--免疫属性效果
		ignore_abnor_state={},		--免疫负面效果
		skill_statetime={{{1,37},{30,37}}},
    },
}

FightSkill:AddMagicData(tb)