
local tb    = {
    mj_pg1 = {--明教普攻1式--20级
		attack_attackrate_v={100},
		attack_usebasedamage_p={{{1,60},{20,90},{30,130},{31,134}}},
		attack_firedamage_v={
			[1]={{1,60*2*0.9},{20,90*2*0.9},{30,130*2*0.9},{31,134*2*0.9}},
			[3]={{1,60*2*1.1},{20,90*2*1.1},{30,130*2*1.1},{31,134*2*1.1}}
		},
		state_palsy_attack={30,4},
		state_npchurt_attack={100,7},

		missile_hitcount={3,0,0},
    },
    mj_pg2 = {--明教普攻2式--20级
		attack_attackrate_v={100},
		attack_usebasedamage_p={{{1,60},{20,90},{30,130},{31,134}}},
		attack_firedamage_v={
			[1]={{1,60*2*0.9},{20,90*2*0.9},{30,130*2*0.9},{31,134*2*0.9}},
			[3]={{1,60*2*1.1},{20,90*2*1.1},{30,130*2*1.1},{31,134*2*1.1}}
		},
		state_palsy_attack={30,4},
		state_npchurt_attack={100,7},

		missile_hitcount={3,0,0},
    },
    mj_pg3 = {--明教普攻3式--20级,第3段包括3和4,有2次伤害
		attack_attackrate_v={100},
		attack_usebasedamage_p={{{1,60},{20,90},{30,130},{31,134}}},
		attack_firedamage_v={
			[1]={{1,60*2*0.9},{20,90*2*0.9},{30,130*2*0.9},{31,134*2*0.9}},
			[3]={{1,60*2*1.1},{20,90*2*1.1},{30,130*2*1.1},{31,134*2*1.1}}
		},
		state_palsy_attack={40,6},
		state_npchurt_attack={100,7},

		missile_hitcount={3,0,0},
    },
    mj_pg4 = {--明教普攻4式--20级
		attack_attackrate_v={100},
		attack_usebasedamage_p={{{1,60*1.5},{20,90*1.5},{30,130*1.5},{31,134*1.5}}},
		attack_firedamage_v={
			[1]={{1,60*1.5*0.9},{20,90*1.5*2*0.9},{30,130*1.5*2*0.9},{31,134*1.5*2*0.9}},
			[3]={{1,60*1.5*1.1},{20,90*1.5*2*1.1},{30,130*1.5*2*1.1},{31,134*1.5*2*1.1}}
			},
		state_palsy_attack={100,10},
		state_npchurt_attack={100,7},

		missile_hitcount={3,0,0},
    },

    mj_fssc = --焚山噬川-1级主动1 --15级
    {
		attack_usebasedamage_p={{{1,361},{15,527},{20,586}}},
		attack_firedamage_v={
			[1]={{1,361*2*0.9},{15,527*2*0.9},{20,586*2*0.9}},
			[3]={{1,361*2*1.1},{15,527*2*1.1},{20,586*2*1.1}}
			},

		--state_palsy_attack={{{1,5},{15,30},{16,30},{21,30}},{{1,15*1},{15,15*1},{16,15*1},{21,15*1}}},

		skill_mintimepercast_v={15*15},

		missile_hitcount={3,0,0},
    },

	mj_book1 = {--焚山噬川秘籍_20级
		--增加会心
		add_deadlystrike_p1={5506,{{1,2},{10,25},{20,25}}},

		--增加吸血
		add_steallife_p={5506,{{1,0},{10,0},{11,1000},{16,5000},{20,5000}}},				--技能ID，吸血万分比

		--减CD
		deccdtime={5506,{{1,0},{15,0},{16,1*15},{20,5*15}}},

		skill_statetime={-1},

		userdesc_000={5249},
	},

    mj_dgsh = --电光石火-4级主动2--15级
    {
		userdesc_000={5509},
		skill_mintimepercast_v={10*15},
    },
    mj_dgsh_child = --电光石火_子--15级
    {
		attack_usebasedamage_p={{{1,310},{15,558},{20,646}}},
		attack_firedamage_v={
			[1]={{1,310*2*0.9},{15,558*2*0.9},{20,646*2*0.9}},
			[3]={{1,310*2*1.1},{15,558*2*1.1},{20,646*2*1.1}}
			},
		state_palsy_attack={{{1,50},{15,70},{20,100},{21,100}},{{1,15*2},{15,15*2},{20,15*2}}},
		state_npchurt_attack={100,10},
		state_fixed_attack={0,0},  --秘籍需要用到

		missile_hitcount={3,0,0},
    },

	mj_book2 = {--电光石火秘籍_20级
		--增加攻击力
		add_usebasedmg_p1={5509,{{1,8},{10,82},{20,82}}},

		--增加麻痹几率
		add_palsy_t={5509,{{1,0},{10,0},{11,3},{15,15},{20,15}}},			--增加麻痹时间
		add_fixed_r={5509,{{1,0},{10,0},{11,20},{15,100},{20,100}}},		--增加造成定身的概率
		add_fixed_t={5509,2*15},											--增加造成定身的时间

		--冲刺后获得免控buff
		addstartskill={
			{{1,0},{15,0},{16,5508},{20,5508}},
			{{1,0},{15,0},{16,5543},{20,5543}},
			{{1,0},{15,0},{16,16},{20,20}}
		},

		skill_statetime={-1},

		userdesc_000={5543},
	},
	mj_book2_child3 = {--电光石火秘籍_免控
		ignore_abnor_state={9},		--免疫除冰冻外的效果
		ignore_series_state={},		--免疫属性

		skill_statetime={{{1,0},{15,0},{16,0.8*15},{20,4*15}}},
	},

    mj_hgcy = --火光残影-10级主动3--15级
    {
		runspeed_v={{{1,50},{15,120},{20,150}}},
		defense_p={{{1,200},{15,600},{20,800}}},
		skill_statetime={{{1,15*8},{15,15*8},{16,15*8},{21,15*8}}},

		userdesc_000={5512},

		skill_mintimepercast_v={25*15},
    },
    mj_hgcy_child = --火光残影_控制--15级
    {
		attack_usebasedamage_p={{{1,20},{15,50},{20,60}}},
		attack_firedamage_v={
			[1]={{1,20*2*0.9},{15,50*2*0.9},{20,60*2*0.9}},
			[3]={{1,20*2*1.1},{15,50*2*1.1},{20,60*2*1.1}}
			},

		state_palsy_attack={{{1,4},{15,60}},{{1,15*1.5},{15,15*1.5}}},
		state_npchurt_attack={100,10},

		ms_one_hit_count={5,0,0},				--每次攻击最大数量
    },

	mj_book3 = --火光残影秘籍
	{
		--初级秘籍.附带减抗和减速
		add_hitskill1={5512,5545,{{1,1},{10,10},{20,20}}},

		--高级秘籍.减[焚山噬川]CD
		addstartskill={
			{{1,0},{15,0},{16,5545},{20,5545}},
			{{1,0},{15,0},{16,5549},{20,5549}},
			{{1,0},{15,0},{16,16},{20,20}}
		},

		skill_statetime={-1},

		userdesc_000={5545},
		userdesc_101={5506,{{1,0},{15,0},{16,15*0.2},{20,15*1}}},   		--mj_book3_child3中的reduce_cd_time1
	},
	mj_book3_middle = --火光残影秘籍
	{
		--初级秘籍.附带减抗和减速
		add_hitskill1={5512,5547,{{1,1},{10,10},{20,20}}},

		--高级秘籍.减[焚山噬川]CD
		addstartskill={
			{{1,0},{15,0},{16,5547},{20,5547}},
			{{1,0},{15,0},{16,5549},{20,5549}},
			{{1,0},{15,0},{16,16},{20,20}}
		},

		skill_statetime={-1},

		userdesc_000={5547},
		userdesc_101={5506,{{1,0},{15,0},{16,15*0.2},{20,15*1}}},   		--mj_book3_child3中的reduce_cd_time1
	},

	mj_book3_child = --火光残影秘籍
	{
		--初级秘籍，减少基础全抗与移动速度
		all_series_resist_p={{{1,-28},{10,-280},{20,-280}}},
		runspeed_v={{{1,-16},{10,-160},{20,-160}}},

		--中级秘籍，减少抗属性与抗负面效果
		resist_allseriesstate_rate_v	={{{1,0},{10,0},{11,-24},{15,-120},{20,-120}}},  --抗属性效果几率
		resist_allspecialstate_rate_v	={{{1,0},{10,0},{11,-24},{15,-120},{20,-120}}},  --抗负面效果几率
		resist_allseriesstate_time_v	={{{1,0},{10,0},{11,-24},{15,-120},{20,-120}}},  --抗属性效果时间
		resist_allspecialstate_time_v	={{{1,0},{10,0},{11,-24},{15,-120},{20,-120}}},  --抗负面效果时间

		skill_statetime={2*15},

	},
    mj_book3_child3 = --火光残影高级秘籍
    {
		autoskill={179,{{1,0},{15,0},{16,16},{20,20}}},
		skill_statetime={14},
    },
    mj_book3_child4 = --火光残影高级秘籍
    {
		reduce_cd_time_point1={5506,{{1,0},{15,0},{16,15*0.2},{20,15*1}}},			--每次击中减少焚山噬川的CD
		skill_statetime={1},
    },

    mj_gmy = --光明引-20级被动1--10级
    {
		physics_potentialdamage_p={{{1,20},{10,40},{11,44},{16,64},{17,70}}},
		defense_p={{{1,4},{10,40},{11,44}}},
		runspeed_v={{{1,10},{10,50},{11,55},{16,80},{17,80}}},
		state_hurt_resistrate={{{1,15},{10,150},{11,165}}},
		skill_statetime={-1},
    },
    mj_htmd = --毁天灭地-30级主动4--15级
    {
		skill_mintimepercast_v={{{1,35*15},{15,25*15},{16,25*15},{21,25*15}}},
		force_ignore_spe_state={8388095},-- 除了冰冻外的控制下可释放
		userdesc_000={5516,5518},
    },
    mj_htmd_child1 = --毁天灭地_子1（群攻）--15级
    {
		attack_usebasedamage_p={{{1,10},{15,25},{20,30}}},
		attack_firedamage_v={
			[1]={{1,10*2*0.9},{15,25*2*0.9},{20,30*2*0.9}},
			[3]={{1,10*2*1.1},{15,25*2*1.1},{20,30*2*1.1}}
		},

		state_npcknock_attack={100,14,30},
		spe_knock_param={11 , 4, 26},
		spe_knock_param1={1},

		--remove_skill_missile={5516 , 1},

		--skill_mintimepercast_v={{{1,27*15},{15,17*15},{16,17*15},{21,17*15}}},

		missile_hitcount={5,0,0},
    },
    mj_htmd_child2 = --毁天灭地_子2--15级
    {
		runspeed_v={{{1,50},{15,200},{20,200}}},
		invincible_b={1},		   					--腾空无敌状态
		skill_statetime={5*15},
    },
    mj_htmd_child3 = --毁天灭地_子3_第二段--15级
    {
		attack_usebasedamage_p={{{1,500},{15,1400},{20,1722}}},
		attack_firedamage_v={
			[1]={{1,500*2*0.9},{15,1400*2*0.9},{20,1722*2*0.9}},
			[3]={{1,500*2*1.1},{15,1400*2*1.1},{20,1722*2*1.1}}
		},

		state_npcknock_attack={100,14,30},
		spe_knock_param={11 , 4, 26},
		spe_knock_param1={1},

		--remove_skill_missile={5516 , 1},

		--skill_mintimepercast_v={{{1,27*15},{15,17*15},{16,17*15},{21,17*15}}},

		missile_hitcount={5,0,0},
    },
    mj_htmd_child4 = --毁天灭地_子4_清第一段子弹
    {
		--remove_skill_missile={5516 , 1},
		skill_statetime={1},
    },

	mj_book4 = --毁天灭地初级秘籍
	{
		--初级秘籍
		add_usebasedmg_p1={5518,{{1,16},{10,160},{20,160}}},
		addstartskill={5519,5551,{{1,1},{10,10},{11,11}}},

		userdesc_101={{{1,0.5*15},{10,3*15},{11,3*15}}},   		--mj_book4_child中的skill_statetime
		skill_statetime={-1},
    },
	mj_book4_middle = --毁天灭地中级、高级秘籍
	{
		--初级秘籍
		add_usebasedmg_p1={5518,{{1,16},{10,160},{20,160}}},
		addstartskill={5519,5553,{{1,1},{10,10},{11,11}}},

		--高级秘籍：闪避减CD
		autoskill={178,{{1,0},{15,0},{16,16},{20,20}}},

		userdesc_101={{{1,0.5*15},{10,3*15},{11,3*15}}},   		--mj_book4_child中的skill_statetime
		userdesc_102={{{1,1*15},{10,1*15},{11,1*15}}},   		--触发间隔
		userdesc_000={5553,5556},  								--回复生命，减CD
		skill_statetime={-1},
    },
    mj_book4_child = --毁天灭地秘籍
	{
		ignore_abnor_state={},		--免疫负面
		ignore_series_state={},		--免疫属性
		lifemax_p={{{1,0},{10,0},{11,30},{15,100},{20,100}}},
		dir_recover_life_pp={{{1,0},{10,0},{11,120},{15,600},{20,600}},1},		--生命上限,自身数值
		skill_statetime={{{1,0.5*15},{10,3*15},{11,3*15}}},
    },
    mj_book4_child4 = --闪避减CD
    {
		reduce_cd_time_point1={5515,{{1,0},{15,0},{16,15*0.2},{20,15*1}}},  	--减少毁天灭地CD
		reduce_cd_time_point2={5518,{{1,0},{15,0},{16,15*0.2},{20,15*1}}},  	--减少毁天灭地CD
    },

    mj_shtt = --圣火滔天-40级被动2--10级
    {
		add_hitskill1={5506,5525,{{1,1},{10,10}}},

		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
		userdesc_000={5525},
    },
    mj_shtt_child =   --圣火滔天_伤害
    {
		damage_maxlife_p={{{1,1},{10,10},{11,11}},150},
		missile_hitcount={3,0,0},
    },
    mj_gjyhj = --高级御环诀-50级被动3--10级
    {
		add_skill_level={5501,{{1,1},{10,10},{11,11}},0},
		add_skill_level2={5502,{{1,1},{10,10},{11,11}},0},
		add_skill_level3={5503,{{1,1},{10,10},{11,11}},0},
		add_skill_level4={5504,{{1,1},{10,10},{11,11}},0},
		--add_att_speed1={4201,{{1,1},{10,10},{11,11}}},				--增加普攻1的攻击速度
		--add_att_speed2={4202,{{1,1},{10,10},{11,11}}},				--增加普攻2的攻击速度
		--add_att_speed3={4203,{{1,1},{10,10},{11,11}}},				--增加普攻3的攻击速度
		--add_att_speed4={4205,{{1,1},{10,10},{11,11}}},				--增加普攻4的攻击速度
		skill_statetime={-1},

		userdesc_101={{{1,4},{10,40},{11,44}}},
		userdesc_102={
			[1]={{1,4*2*0.9},{10,40*2*0.9},{11,44*2*0.9}},
			[3]={{1,4*2*1.1},{10,40*2*1.1},{11,44*2*1.1}}
		},
    },
    mj_yhss = --引火烧身-60级被动4--10级
    {
		--addstartskill={5512,5528,{{1,1},{10,10},{11,11}}},		--释放火光残影后增加忽略最终抗性与忽略基础抗性
		--userdesc_000={5528},
		--buff_addition={4509,6,{{1,1},{10,10},{11,10}}},
		ignore_all_resist={100,{{1,2},{10,24},{11,27}}},  --忽略最终抗性
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    mj_yhss_child1 = --引火烧身_自身
    {
		ignore_all_resist={100,{{1,2},{10,8},{11,9}}},  --忽略最终抗性
		ignore_all_resist_vp={{{1,2},{10,8},{11,9}}},  	--忽略基础抗性
		userdesc_101={{{1,2},{10,8},{11,9}}},  --队友忽略基础抗性
		skill_statetime={{{1,15*8},{10,15*8},{11,15*8}}},
    },
    mj_yhss_child2 = --引火烧身_队友
    {
		ignore_all_resist_vp={{{1,2},{10,8},{11,9}}},  	--忽略基础抗性
		skill_statetime={{{1,15*8},{10,15*8},{11,15*8}}},
    },
    mj_xhly = --星火燎原-70级被动5--10级
    {
		autoskill={176,{{1,1},{10,10},{11,11}}},
		userdesc_000={5531},
		userdesc_101={{{1,40},{10,90},{11,95}}},				--描述用，实际触发几率请查看autoskill.tab中的星火燎原
		userdesc_102={{{1,15*30},{10,15*30},{11,15*30}}},		--描述用，实际触发间隔请查看autoskill.tab中的星火燎原
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    mj_xhly_child1 = --星火燎原_免控与回复生命--10级
    {
		ignore_series_state={},							--免疫、清除属性效果
		ignore_abnor_state={},							--免疫、清除负面效果
	 	dir_recover_life_pp={{{1,200},{10,1200},{11,1200}},1},		--生命上限万分比,自身数值
		skill_statetime={{{1,15*3},{10,15*3},{11,15*3}}},
    },
    mj_xhly_child2 = --星火燎原_清除CD--10级
    {
		reduce_cd_time1={5515,{{1,15*60},{10,15*60},{11,15*60}}},			--清除毁天灭地CD
		reduce_cd_time2={5518,{{1,15*60},{10,15*60},{11,15*60}}},			--清除毁天灭地CD
    },

    mj_mzst = --明尊圣体-80级被动6--20级
    {
		physics_potentialdamage_p={{{1,2},{20,35},{24,35*1.2}}},
		lifemax_p={{{1,4},{20,80},{24,80*1.2}}},
		attackspeed_v={{{1,5},{20,20},{24,20*1.2}}},
		defense_p={{{1,3},{20,45},{24,45*1.2}}},
		state_palsy_attackrate={{{1,10},{20,200},{24,200*1.2}}},
		state_hurt_resisttime={{{1,10},{20,200},{24,200*1.2}}},
		skill_statetime={-1},
    },
	mj_hwlt = --火舞凌天-90级被动7--10级
    {
		add_mult_proc_sate1={5535,{{1,6},{10,6},{11,6}},60},  --技能ID,叠加层数，自身为圆心格子半径
		userdesc_000={5535},
		skill_statetime={{{1,-1},{10,-1}}},
    },
	mj_hwlt_child = --火舞凌天_子
    {
		skill_mult_relation={1}, --对应的NPC类型，从skillsetting.ini上查看
		physics_potentialdamage_p={{{1,3},{10,12},{15,18}}},
		defense_p={{{1,2},{10,20},{15,30}}},
		skill_statetime={{{1,15*5},{10,15*5}}},
    },
    mj_nq = --净世破魔击-怒气
    {
		attack_usebasedamage_p={{{1,800},{30,800}}},
		attack_firedamage_v={
			[1]={{1,2000*0.9},{30,2000*0.9},{31,2000*0.9}},
			[3]={{1,2000*1.1},{30,2000*1.1},{31,2000*1.1}}
			},
    },
    mj_nq_child = --净世破魔击_子（免疫）
    {
		ignore_series_state={},		--免疫属性效果
		ignore_abnor_state={},		--免疫负面效果
		skill_statetime={{{1,34},{30,34}}},
    },
}

FightSkill:AddMagicData(tb)