
local tb    = {
    sl_pg1 = {--少林棍法--普攻1式--20级
		attack_attackrate_v={100},
		attack_usebasedamage_p={{{1,60},{20,85},{30,125},{31,129}}},
		attack_metaldamage_v={
			[1]={{1,60*2*0.9},{20,85*2*0.9},{30,125*2*0.9},{31,129*2*0.9}},
			[3]={{1,60*2*1.1},{20,85*2*1.1},{30,125*2*1.1},{31,129*2*1.1}}
			},
		state_hurt_attack={{{1,40},{20,40},{30,40},{31,40}},{{1,4},{20,4},{30,4},{31,4}}},
		state_npcknock_attack={100,7,25},
		spe_knock_param={6 , 4, 9},
		
		missile_hitcount={6,0,0},
    },
    sl_pg2 = {--少林棍法--普攻2式--20级
		attack_attackrate_v={100},
		attack_usebasedamage_p={{{1,60},{20,85},{30,125},{31,129}}},
		attack_metaldamage_v={
			[1]={{1,60*2*0.9},{20,85*2*0.9},{30,125*2*0.9},{31,129*2*0.9}},
			[3]={{1,60*2*1.1},{20,85*2*1.1},{30,125*2*1.1},{31,129*2*1.1}}
			},
		state_hurt_attack={{{1,50},{20,50},{30,50},{31,50}},{{1,4},{20,4},{30,4},{31,4}}},

		state_npcknock_attack={100,7,45},
		spe_knock_param={6 , 4, 9},
		
		missile_hitcount={6,0,0},
    },

    sl_pg3 = {--少林棍法--普攻3式--20级
		attack_attackrate_v={100},
		attack_usebasedamage_p={{{1,60},{20,85},{30,125},{31,129}}},
		attack_metaldamage_v={
			[1]={{1,60*2*0.9},{20,85*2*0.9},{30,125*2*0.9},{31,129*2*0.9}},
			[3]={{1,60*2*1.1},{20,85*2*1.1},{30,125*2*1.1},{31,129*2*1.1}}
			},
		state_hurt_attack={{{1,70},{20,70},{30,70},{31,70}},{{1,6},{20,6},{30,6},{31,6}}},

		state_npcknock_attack={100,7,35},
		spe_knock_param={6 , 4, 9},
		
		missile_hitcount={6,0,0},
    },
    sl_pg4 = {--少林棍法--普攻4式--20级
		attack_attackrate_v={100},
		attack_usebasedamage_p={{{1,60*1.5},{20,85*1.5},{30,125*1.5},{31,129*1.5}}},
		attack_metaldamage_v={
			[1]={{1,60*1.5*2*0.9},{20,85*1.5*2*0.9},{30,125*1.5*2*0.9},{31,129*1.5*2*0.9}},
			[3]={{1,60*1.5*2*1.1},{20,85*1.5*2*1.1},{30,125*1.5*2*1.1},{31,129*1.5*2*1.1}}
			},
		state_hurt_attack={{{1,100},{20,100},{30,100},{31,100}},{{1,8},{20,8},{30,8},{31,8}}},

		state_npcknock_attack={100,14,30},
		spe_knock_param={11 , 4, 26},
		spe_knock_param1={1},
		
		missile_hitcount={6,0,0},
    },

    sl_xlg = {--降龙棍--1级主动1--15级
		attack_usebasedamage_p={{{1,200},{15,356},{20,412}}},
		attack_metaldamage_v={
			[1]={{1,200*2*0.9},{15,356*2*0.9},{20,412*2*0.9}},
			[3]={{1,200*2*1.1},{15,356*2*1.1},{20,412*2*1.1}}
		},
		state_hurt_attack={{{1,30},{15,60},{16,70},{21,70}},{{1,15*1.5},{15,15*2},{16,15*2},{21,15*2}}},

		state_npcknock_attack={100,14,35},			--概率，时间，速度
		spe_knock_param={11 , 4, 26},				--停留时间，玩家动作，npc动作
		spe_knock_param1={1},

		missile_hitcount={6,0,0},

		skill_mintimepercast_v={12*15},
    },
    sl_book1 = {--降龙棍秘籍
		add_usebasedmg_p1={266,{{1,5},{10,56},{20,56}}},		--增加降龙棍攻击力

		add_steallife_p={266,{{1,0},{10,0},{11,1000},{15,5000},{20,10000}}},				--技能ID，吸血万分比

		add_hurt_r={266,{{1,0},{15,0},{16,10},{20,30}}},  					--增加受伤几率
		add_hurt_t={266,{{1,0},{15,0},{16,0.5*15},{20,1*15}}},  			--增加受伤时间
		skill_statetime={-1},
    },

    sl_dljgz = {--大力金刚指--4级主动2--15级
		attack_usebasedamage_p={{{1,257},{15,348},{20,585}}},
		attack_metaldamage_v={
			[1]={{1,257*2*0.9},{15,348*2*0.9},{20,585*2*0.9}},
			[3]={{1,257*2*1.1},{15,348*2*1.1},{20,585*2*1.1}}
		},
		state_hurt_attack={{{1,50},{15,80},{20,100}},{{1,2*15},{15,2.5*15},{20,2.5*15}}},				--配合秘籍
		state_fixed_attack={0,0},
		state_npcknock_attack={100,7,35},
		spe_knock_param={6 , 4, 9},
		spe_knock_param1={1},

		missile_hitcount={0,0,1},

		skill_mintimepercast_v={{{1,12*15},{15,6*15},{20,6*15}}},
    },

	sl_book2 = {	--大力金刚指秘籍
		add_usebasedmg_p1={268,{{1,3},{10,36},{15,72},{20,72}}},		--增加攻击力,原本定身就算进了价值量,所以这里要补回

		add_fixed_r={268,{{1,0},{10,0},{11,20},{15,100},{20,100}}},				--增加造成定身的概率
		add_fixed_t={268,{{1,0},{10,0},{11,2.5*15},{15,2.5*15},{20,2.5*15}}},		--增加造成定身的时间

		add_deadlystrike_p1={268,{{1,0},{15,0},{16,5},{20,25}}},  		--增加会心一击
		skill_statetime={-1},
	},

	sl_jgfm = {--金刚伏魔-10级主动3--15级
		deadlystrike_damage_p		={{{1,10},{15,45},{20,80}}},
		weaken_deadlystrike_damage_p={{{1,10},{15,45},{20,80}}},
		ignore_abnor_state={},
		ignore_series_state={},
		skill_statetime={15*15},
		skill_mintimepercast_v={{{1,45*15},{15,30*15},{20,30*15}}},
    },

    sl_book3 = {--高级金刚伏魔
		addstartskill={274,295,{{1,1},{10,10},{15,15},{20,20}}},		--罗汉阵触发时缩短金刚伏魔cd
		
		add_state_time1={270,{{1,0},{10,0},{11,1*15},{15,5*15},{20,6*15}}},  				--增加金刚伏魔持续时间

		addstartskill2={270,{{1,0},{15,0},{16,3458},{20,3458}},{{1,0},{15,0},{16,16},{20,20}}},	--金刚伏魔过程中大力金刚指aoe攻击

		skill_statetime={-1},

		userdesc_000={295,3458},
    },
    sl_book3_child1 = {--初级金刚伏魔,罗汉阵触发时缩短金刚伏魔的cd
		reduce_cd_time1={270,{{1,1},{10,5},{11,5}}},
    },
    sl_book3_child3 = {--高级金刚伏魔_子
		--weaken_deadlystrike_damage_p={{{1,6},{10,60},{20,60}}},
		addms_hittotal_c1={268,{{1,0},{15,0},{16,1},{20,5}}},  								--增加子弹最大攻击人数
		skill_statetime={{{1,0},{15,0},{16,20.2*15},{20,21*15}}},
    },

    sl_dmwj = {--达摩武经-20级被动1--10级
		lifemax_p={{{1,20},{10,60},{11,86}}},
		resist_allseriesstate_rate_v={{{1,50},{10,150},{11,165}}},
		state_zhican_resistrate={{{1,50},{10,150},{11,165}}},
		skill_statetime={-1},
    },
    sl_seqls = {--十二擒龙手--30级主动4--15级
		attack_usebasedamage_p={{{1,292},{15,807},{20,990}}},
		attack_metaldamage_v={
			[1]={{1,292*2*0.9},{15,807*2*0.9},{20,990*2*0.9}},
			[3]={{1,292*2*1.1},{15,807*2*1.1},{20,990*2*1.1}}
		},
		state_drag_attack={{{1,100},{15,100},{16,100},{21,100}},8,70},
		skill_drag_npclen={90},
		state_fixed_attack={{{1,100},{15,100},{16,100},{21,100}},{{1,15*2},{15,15*2.5},{16,15*2.5},{21,15*2.5}}},
		skill_mintimepercast_v={{{1,35*15},{15,30*15},{20,30*15}}},
		missile_hitcount={6,0,0},
    },

    sl_book4 = {--十二擒龙手秘籍
		addstartskill={272,297,{{1,1},{10,10},{20,20}}},
		
		--中级减敌人攻击力效果在初级的11级以后里
		add_usebasedmg_p1={272,{{1,0},{10,0},{11,37},{15,185},{20,185}}},
		
		add_hitskill1={268,{{1,0},{15,0},{16,3460},{20,3460}},{{1,0},{15,0},{16,16},{20,20}}},					--大力金刚指击中缩短擒龙手cd

		skill_statetime={-1},

		userdesc_000={3460,297},
    },
    sl_book4_child1 = {--初级和中级擒龙手秘籍
		state_forceatk_attack={{{1,50},{10,90},{15,100},{20,100}},{{1,15*1.5},{10,15*3.5},{15,15*4},{20,15*4.5}}},
		missile_hitcount={6,0,0},
		
		physics_potentialdamage_p={{{1,0},{10,0},{11,-17},{15,-85},{20,-85}}},
		skill_statetime={{{1,0},{10,0},{11,10*15},{20,10*15}}},
    },
    sl_book4_child3 = {--高级十二擒龙手_子
		reduce_cd_time1={272,{{1,0},{15,0},{16,0.3*15},{20,1.5*15}}},
		skill_statetime={1},
    },

    sl_lhz = {--罗汉阵-40级被动2--10级
		autoskill={23,{{1,1},{10,10},{11,11}}},
		skill_statetime={-1},

		userdesc_000={274},
    },
    sl_lhz_child = {--罗汉阵_子
		damage_maxlife_p={{{1,200},{10,450},{11,495}},1},--目标生命上限,目标生命上限视为不超过自身生命上限*p2/100
		--attack_usebasedamage_p={{{1,50},{10,90},{11,99}}},
		attack_metaldamage_v={
			[1]={{1,100*1},{10,240*0.95},{11,454*0.95}},
			[3]={{1,100*1},{10,240*1.05},{11,454*1.05}}
			},
		missile_hitcount={5,0,0},
    },
    sl_gjgf = {--高级棍法-50级被动3--10级
		add_skill_level={261,{{1,1},{10,10},{11,11}},0},
		add_skill_level2={262,{{1,1},{10,10},{11,11}},0},
		add_skill_level3={263,{{1,1},{10,10},{11,11}},0},
		add_skill_level4={264,{{1,1},{10,10},{11,11}},0},
		skill_statetime={-1},

		userdesc_000={277},
    },
    sl_gjgf_child = {--高级棍法_子（仅用作显示，无实际效果加成。实际效果查看普攻的21-30级）--10级
		attack_usebasedamage_p={{{1,4},{10,40},{11,44}}},
		attack_metaldamage_v={
			[1]={{1,4*2*0.9},{10,40*2*0.9},{11,44*2*0.9}},
			[3]={{1,4*2*1.1},{10,40*2*1.1},{11,44*2*1.1}}
		},
    },
    sl_ldcf = {--立地成佛-60级被动4--10级
		autoskill={25,{{1,1},{10,10},{11,11}}},
		skill_statetime={-1},
		
		userdesc_000={279},
    },
    sl_ldcf_child = {--立地成佛_子
		all_series_resist_p={{{1,30},{10,50},{11,55}}},
		superposemagic={8},					--叠加层数
		skill_statetime={5*15},
    },
    sl_jgnm = {--金刚怒目-70级被动5--10级
		autoskill={24,{{1,1},{10,10},{11,11}}},
		skill_statetime={-1},
		
		userdesc_000={281},
		userdesc_101={{{1,40},{10,90},{11,95}}},						--描述用，实际触发几率请查看autoskill.tab中的金刚怒目
		userdesc_102={{{1,15*30},{10,15*30},{11,15*30}}},              	--描述用，实际触发间隔请查看autoskill.tab中的金刚怒目
    },
    sl_jgnm_child = {--金刚怒目_子
		all_series_resist_p={{{1,900},{10,1500},{11,1590}}},
		add_usebasedmg_p1={274,{{1,100},{10,250},{11,365}}},			--增加罗汉阵攻击力
		skill_statetime={{{1,15*3},{10,15*5},{11,15*5}}},
    },
    sl_yjj = {--易筋经-80级被动6--20级
		physics_potentialdamage_p={{{1,10},{20,30},{24,50*1.2}}},
		lifemax_p={{{1,6},{20,110},{24,150*1.2}}},
		all_series_resist_p={{{1,2},{20,40},{24,80*1.2}}},
		attackspeed_v={{{1,5},{20,20},{24,30*1.2}}},
		state_hurt_attackrate={{{1,10},{20,200},{24,300*1.2}}},
		state_zhican_resisttime={{{1,10},{20,200},{24,250*1.2}}},
		skill_statetime={-1},
    },
    sl_90_lhjs = {--罗汉金身-90级被动7--10级
		physics_potentialdamage_p={{{1,6},{10,60},{11,86}}},
		autoskill={27,{{1,1},{10,10},{11,11}}},
		skill_statetime={-1},
		
		userdesc_000={299},
		userdesc_101={{{1,15*6},{10,15*3},{11,15*3}}},			--描述用，触发间隔时间，实际效果查看autoskill.tab中的罗汉金身
    },
    sl_90_lhjs_child = {--罗汉金身_子
		state_fixed_attack={{{1,30},{10,50},{11,55}},{{1,15*1},{10,15*2.5},{11,15*2.5}}},
		missile_hitcount={0,0,1},
    },
    sl_rysxm = {--如影随形灭-怒气
		userdesc_000={0},
    },
    sl_rysxm_child1 = {--如影随形灭_子1
		attack_usebasedamage_p={{{1,300},{30,500}}},
		attack_metaldamage_v={
			[1]={{1,100*0.9},{30,200*0.9},{31,200*0.9}},
			[3]={{1,100*1.1},{30,200*1.1},{31,200*1.1}}
			},
    },
    sl_rysxm_child2 = {--如影随形灭_子2
		attack_usebasedamage_p={{{1,1000},{30,1000}}},
		attack_metaldamage_v={
			[1]={{1,1000*0.9},{30,2000*0.9},{31,2000*0.9}},
			[3]={{1,1000*1.1},{30,2000*1.1},{31,2000*1.1}}
			},
    },
	sl_rysxm_child3 = {--如影随形灭_子2
		ignore_series_state={},		--免疫属性效果
		ignore_abnor_state={},		--免疫负面效果
		skill_statetime={{{1,15*4},{30,15*4}}},
    },
}

FightSkill:AddMagicData(tb)