--
--                   _ooOoo_
--                  o8888888o
--                  88" . "88
--                  (| -_- |)
--                  O\  =  /O
--               ____/`---'\____
--             .'  \\|     |//  `.
--            /  \\|||  :  |||//  \
--           /  _||||| -:- |||||-  \
--           |   | \\\  -  /// |   |
--           | \_|  ''\---/''  |   |
--           \  .-\__  `-`  ___/-. /
--         ___`. .'  /--.--\  `. . __
--      ."" '<  `.___\_<|>_/___.'  >'"".
--     | | :  `- \`.;`\ _ /`;.`/ - ` : | |
--     \  \ `-.   \_ __\ /__ _/   .-` /  /
--======`-.____`-.___\_____/___.-`____.-'======
--                   `=---='
--^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
--                 Buddha bless
--
-- 日期：14-10-3
--

-- game debug modeversion
-- debug开关，线上版本，渠道版本都需要设置为false
GAME_DEBUG = false


-- 开发版本，默认为true，线上版本为false
-- dev build or release build
DEV_BUILD = false


-- 专门为渠道提供版本，默认为false
CHANNEL_BUILD = false


-- 显示使用：从服务器获取，如果没有才从本地读取
DISPLAY_VERSION = "1.5.1"

-- 更新使用
VERSION = "1011"

ANDROID_DEBUG = true
