
UIStrConfig:Add(
{
	['quest1'] = '主线',
	['quest2'] = '支线',
	['quest3'] = '日环',
	['quest4'] = '奇遇',
	['quest5'] = '(可接)',
	['quest6'] = '(未完成)',
	['quest7'] = '(可交)',
	['quest8'] = '任务奖励：',
	['quest9'] = '完成本章剧情可激活属性：',
	['quest10'] = '下一章',
	['quest11'] = '<font size="12" color="#29cc00"><u>返回本章</u></font>',
	['quest12'] = '已接任务',
	['quest13'] = '可接任务',
	['quest14'] = '接取',
	['quest15'] = '前往',
	['quest16'] = '任务',
	['quest17'] = '(不可接)',
	['quest18'] = '立即前往',
	['quest19'] = '(已完成)',
	['quest20'] = '退出',
	['quest21'] = '确   认',

	-- 日环
	['quest101'] = '一键完成',
	['quest102'] = '升  星',
	['quest103'] = '请选择一键完成所需倍率',
	['quest104'] = '确   定',
	['quest105'] = '确   认',
	['quest106'] = '单倍领取',
	['quest107'] = '银两双倍领',
	['quest108'] = '元宝三倍领',
	['quest109'] = '确  定',
	['quest110'] = '取  消',
	['quest111'] = "升星",
	['quest112'] = "立即前往",
	['quest113'] = "稍后再说",
	['quest121'] = "我知道了",

}
)