
UIStrConfig:Add(
{
	['realm1'] = '攻    击',
	['realm2'] = '防    御',
	['realm3'] = '生    命',
	['realm4'] = '韧    性',
	['realm5'] = '暴    击',
	['realm6'] = '命    中',
	['realm7'] = '灌    注',
	['realm8'] = '境界突破',
	['realm9'] = '礼金渡劫',
	['realm10'] = "VIP灌注";
	['realm11'] = '元宝渡劫',
	['realm12'] = '退  出',
	['realm13'] = '闪    避',
	['realm14'] = '<u>前往获取</u>',
	['realm15'] = '境  界',
	['realm16'] = '境界进阶',
	

	['realm101'] = '感应境',
	['realm102'] = '灵动境',
	['realm103'] = '灵轮境',
	['realm104'] = '神魄境',
	['realm105'] = '融天境',
	['realm106'] = '化天境',
	['realm107'] = '通天境',
	['realm108'] = '肉身难',
	['realm109'] = '灵力难',
	['realm110'] = '神魄难',
	
	['realm1001'] = '境界巩固',
	['realm1002'] = '境界突破',
	['realm1003'] = '启用该境界',
}
)