return {
{"TypeId","Type","Unlock","lock","lv","Quest","awardKey",},
{10,"山城除妖",0,1,1,1001,"rank01:1,winglb-1:1,gold50w:1,cash1:100,",},
{20,"仙盟问道",0,1,1,1001,"gold50w:1,rank02:1,pet1001-p:100,cash1:100",},
{30,"魔劫成道",0,1,1,1001,"ridesk02:1,rank03:1,pet1001-p:150,cash1:200",},
{40,"古甲初现",0,1,1,1001,"pet3003-p:20,rank04:1,pet2002-p:100,cash1:200",},
{50,"楼兰夺甲",0,1,1,1001,"pet3003-p:30,rank05:1,pet2002-p:100,cash1:400",},
{60,"突袭异乡",0,1,1,1001,"pet3003-p:40,rank06:1,pet2002-p:150,cash1:600",},
{70,"天魔问情",0,1,1,1001,"pet3003-p:50,rank07:1,pet3002-p:200,cash1:800",},
{80,"问道者临",0,1,1,1001,"pet3003-p:60,rank08:1,winglb-2:1,cash1:1000",},
}
