return {
["_key_"] = {"WingsID","WingsName","WingsQuality","WingsLevel","DefaultStar","NextRideLevel","UpStarItemCode","UpStarMaxExp","Icon","ModelFile","Prop","Par","Min","Max","Prop1","Par1","Min1","Max1","Prop2","Par2","Min2","Max2","Prop3","Par3","Min3","Max3","Prop4","Par4","Min4","Max4",},
[1] = {1,"一阶 命运之翼",1,1,0,2,"wing1",7500,"#dynamic/dynamic_new/wings_new/wings.xml|wings|12","53107","生命百分比加成",0,200,200,"生命",0,7500,7500,"物防",0,600,600,"魔防",0,600,600,"抗暴",0,210,210,},
[2] = {2,"二阶 清风之翼",1,2,0,3,"wing1",15000,"#dynamic/dynamic_new/wings_new/wings.xml|wings|13","53108","攻击百分比加成",0,200,200,"生命",0,45000,45000,"物防",0,3600,3600,"魔防",0,3600,3600,"抗暴",0,1300,1300,},
[3] = {3,"三阶 天使之翼",2,3,0,4,"wing1",30000,"#dynamic/dynamic_new/wings_new/wings.xml|wings|9","53106","物防百分比加成",0,200,200,"生命",0,120000,120000,"物防",0,9600,9600,"魔防",0,9600,9600,"抗暴",0,3400,3400,},
[4] = {4,"四阶 魅蓝之翼",2,4,0,5,"wing1",50000,"#dynamic/dynamic_new/wings_new/wings.xml|wings|11","53104","魔防百分比加成",0,200,200,"生命",0,270000,270000,"物防",0,22000,22000,"魔防",0,22000,22000,"抗暴",0,7600,7600,},
[5] = {5,"五阶 凤凰之翼",2,5,0,6,"wing1",75000,"#dynamic/dynamic_new/wings_new/wings.xml|wings|10","53105","生命百分比加成",0,300,300,"生命",0,500000,500000,"物防",0,40000,40000,"魔防",0,40000,40000,"抗暴",0,14000,14000,},
[6] = {6,"六阶 赤炎之翼",3,6,0,7,"wing1",100000,"#dynamic/dynamic_new/wings_new/wings.xml|wings|16","53109","攻击百分比加成",0,300,300,"生命",0,740000,740000,"物防",0,59000,59000,"魔防",0,59000,59000,"抗暴",0,21000,21000,},
[7] = {7,"七阶 苍蓝之翼",3,7,0,8,"wing1",125000,"#dynamic/dynamic_new/wings_new/wings.xml|wings|17","53110","物防百分比加成",0,300,300,"生命",0,990000,990000,"物防",0,79000,79000,"魔防",0,79000,79000,"抗暴",0,28000,28000,},
[8] = {8,"八阶 希望之翼",4,8,0,-1,"wing1",240000,"#dynamic/dynamic_new/wings_new/wings.xml|wings|19","53111","魔防百分比加成",0,300,300,"生命",0,1300000,1300000,"物防",0,110000,110000,"魔防",0,110000,110000,"抗暴",0,36000,36000,},
}
