return {
["_key_"] = {"OrderId","Round","Id","Name","NextRound","NameRemarks","Item1code","Item1Model","Item1count","Script",},
[1] = {1,1,1,"第1天",2,"第一轮连续登录7天奖励","cash1","",100,0,},
[2] = {2,1,2,"第2天",2,"第一轮连续登录7天奖励","pet1002-p","",200,0,},
[3] = {3,1,3,"第3天",2,"第一轮连续登录7天奖励","winglb-7","",1,0,},
[4] = {4,1,4,"第4天",2,"第一轮连续登录7天奖励","spbx-50","",1,0,},
[5] = {5,1,5,"第5天",2,"第一轮连续登录7天奖励","cash1","",500,0,},
[6] = {6,1,6,"第6天",2,"第一轮连续登录7天奖励","sx-box","",1,0,},
[7] = {7,1,7,"第7天",2,"第一轮连续登录7天奖励","zbbx-60-cj-fl","/res/unit/item/itm_baoxiang_04.assetbundles",1,0,},
}
