return {
["_key_"] = {"SuitID2","SortID1","Quality","SortName","SuitName","Icon1","PartCount","IsValid","SuitDesc","PartCodeList","Occupation","BloodType",},
[1001] = {1001,"101",4,"神兽","神兽·青龙套","blood5001",4,1,"四大神兽血脉印记，极其稀有，装备后将激活远古传承，获得血脉提升","5001,5002,5003,5004","3,5",1,},
[1002] = {1002,"101",4,"神兽","神兽·白虎套","blood5005",4,1,"四大神兽血脉印记，极其稀有，装备后将激活远古传承，获得血脉提升","5005,5006,5007,5008","1,2,4",1,},
[1003] = {1003,"101",4,"神兽","神兽·玄武套","blood5201",4,1,"四大神兽血脉印记，极其稀有，装备后将激活远古传承，获得血脉提升","5201,5202,5203,5204","1,2,3,4,5",1,},
[1004] = {1004,"101",4,"神兽","神兽·朱雀套","blood5401",4,1,"四大神兽血脉印记，极其稀有，装备后将激活远古传承，获得血脉提升","5401,5402,5403,5404","1,2,3,4,5",1,},
[2001] = {2001,"201",4,"凶兽","凶兽·梼杌套","blood5009",4,1,"四大凶兽血脉印记，极其稀有，装备后将激活远古传承，获得血脉提升","5009,5010,5011,5012","1,2,3,4,5",2,},
[2002] = {2002,"201",4,"凶兽","凶兽·穷奇套","blood5013",4,1,"四大凶兽血脉印记，极其稀有，装备后将激活远古传承，获得血脉提升","5013,5014,5015,5016","1,2,3,4,5",2,},
[2003] = {2003,"201",4,"凶兽","凶兽·混沌套","blood5205",4,1,"四大凶兽血脉印记，极其稀有，装备后将激活远古传承，获得血脉提升","5205,5206,5207,5208","1,2,3,4,5",2,},
[2004] = {2004,"201",4,"凶兽","凶兽·饕餮套","blood5405",4,1,"四大凶兽血脉印记，极其稀有，装备后将激活远古传承，获得血脉提升","5405,5406,5407,5408","1,2,3,4,5",2,},
}
