return {
{"SchID","SchName","IsValid","TimeDesc","StartDay","StartTime","EndTime","FirstTime","SecondTime","ShowNotice","SpaceTime2","ShowNotice2","FirstTime2","SecondTime2","ShowNotice3",},
{1,"镇妖塔",1,"每天","1,2,3,4,5,6,7","10:00","23:00",120,0,"【镇妖塔】丰厚奖励尽在镇妖塔,可通过【活动】-【镇妖塔】即可参与",120,"【镇妖塔】丰厚奖励尽在镇妖塔,可通过【活动】-【镇妖塔】即可参与",0,0,"【镇妖塔】丰厚奖励尽在镇妖塔,可通过【活动】-【镇妖塔】即可参与",},
{2,"问道大会",1,"周一、三、五、六\n12:00-13:00及19:30-20:30","1,3,5,6","12:30,20:30","13:00,21:00",10,5,"【问道大会】将于%d分钟后开启",10,"【问道大会】正在火热进行中，海量宗师币，奖励等你来拿，宗师币还可在竞技商店兑换稀有物品哦！",10,5,"【问道大会】将于%d分钟后结束",},
{3,"五岳一战",1,"周二、四、六、日\n12:00-13:00及19:30-20:30","2,4,6,7","21:30","22:00",10,5,"【五岳一战】将于%d分钟后开启",10,"【五岳一战】正在火热进行中，海量宗师币，奖励等你来拿，宗师币还可在竞技商店兑换稀有物品哦！",10,5,"【五岳一战】将于%d分钟后结束",},
{4,"试练大赛",1,"周一、三、五、六、日\n21:00-21:10","1,3,5,6,7","13:00,21:00","13:30,21:30",10,5,"【试炼大赛】将于%d分钟后开启",5,"【试炼大赛】正在火热进行中，海量宗师币，奖励等你来拿，宗师币还可在竞技商店兑换稀有物品哦！",5,1,"【试炼大赛】将于%d分钟后结束",},
{5,"BOSS活动",1,"每天","1,2,3,4,5,6,7","12:00,18:30","12:30,19:00",10,5,"【妖族入侵】强大的妖族BOSS将在%d分钟后入侵门派地图和野外区域，击杀BOSS可获得绑元，海量天材地宝！",5,"【妖族入侵】妖族BOSS正在各门派和野外肆虐，请各位问道者再接再厉！",5,1,"【妖族入侵】活动即将在%d分钟后结束，尚未参与的问道者们请速速前往门派地图和野外区域，击杀BOSS将获取海量奖励哦~",},
{6,"仙盟BOSS",1,"每天","1,2,3,4,5,6,7","20:00","20:30",10,5,"【仙盟降魔】仙盟BOSS狂沙妖尊将在%d分钟后降临仙盟内，击杀BOSS有机会获得稀有宠物和海量材料！",5,"【仙盟降魔】仙盟BOSS正在仙盟内肆虐，请各位问道者再接再厉！",5,1,"【仙盟降魔】活动即将在%d分钟后结束，尚未参与的问道者们请速速前往仙盟，击杀BOSS将获取海量奖励哦~",},
}
