
Require("CommonScript/BossLeader/BossLeaderDef.lua");

BossLeader.nCrossDayTime = 1; --周一更新数据

BossLeader.tbCrossKinJiFenRank = --跨服积分
{
    [1] = 10;
    [2] = 8;
    [3] = 7;
    [4] = 5;
	[5] = 4;
};
BossLeader.nCanCrossFront = 3; --前几名可以跨服

BossLeader.tbCrossKinDmgRankValue =
{
    ["OpenLevel119"] =
    {
        [-1] = 
        {
            ["Boss"] = 
            {
                [1] = 4000000 * 1.5;
                [2] = 4000000 * 1.5;
                [3] = 4000000 * 1.5;
                [4] = 4000000 * 1.5;
                [5] = 4000000 * 1.5;
            };
            ["FalseBoss"] =
            {
                [1] = 2000000 * 1.5;
                [2] = 2000000 * 1.5;
                [3] = 2000000 * 1.5;
                [4] = 2000000 * 1.5;
                [5] = 2000000 * 1.5;
            }
        };
        [1] =
        {
            ["Boss"] =  --80级名将·真
            {
                [1] = 25000000;
                [2] = 25000000;
                [3] = 25000000;
                [4] = 25000000;
                [5] = 25000000;
            };
            ["FalseBoss"] =  --80级名将·假
            {
                [1] = 12000000;
                [2] = 12000000;
                [3] = 12000000;
                [4] = 12000000;
                [5] = 12000000;
            }
        };
        [2] =
        {
            ["Boss"] =  --110级名将·真
            {
                [1] = 35000000;
                [2] = 35000000;
                [3] = 35000000;
                [4] = 35000000;
                [5] = 35000000;
            };
            ["FalseBoss"] =  --110级名将·假
            {
                [1] = 20000000;
                [2] = 20000000;
                [3] = 20000000;
                [4] = 20000000;
                [5] = 20000000;
            }
        };
        [3] =
        {
            ["Boss"] =  --60级名将·真
            {
                [1] = 25000000;
                [2] = 25000000;
                [3] = 25000000;
                [4] = 25000000;
                [5] = 25000000;
            };
            ["FalseBoss"] =  --60级名将·假
            {
                [1] = 12000000;
                [2] = 12000000;
                [3] = 12000000;
                [4] = 12000000;
                [5] = 12000000;
            }
        };
    };
}


BossLeader.tbEndJiFenCrossKinMail =
{
    szTitle = "跨服历代名将资格获取";
    szFrom = "家族总管";
    szContent = 
[[
      恭喜侠士，您所在的家族[FFFE0D]%s[-]于普通历代名将中表现优异，战绩超群！现已获得跨服历代名将的参与资格。此次跨服历代名将的开启时间为[FFFE0D]%s[-]，请你务必准时参加，携手家族兄弟再拔头筹，夺取更加丰厚的奖励！
]];
}

BossLeader.szEndJiFenKinNotice = "恭喜本家族在普通历代名将中表现优异，战绩超群！现已获得跨服历代名将的参与资格，可喜可贺！#49"; 
BossLeader.szEndJiFenWorldNotice = "恭喜本服家族[FFFE0D]%s[-]在普通历代名将中表现优异，战绩超群！现已获得跨服历代名将的参与资格，可喜可贺！"; 


