local armorshop ={
    multiSelectType = true,
    [1]={
        sortid=227,
        type=1,
        --充值送比例
        backRate=0.1,
        --返还折扣券需要充值
        rechargeNum=5000,
        --折扣券折扣比例（即四折券=0.4，五折券=0.5）
        discountRate=0.5,
        --折扣券次数限制
        discountLimit=3,
        serverreward={
            --vip折扣区间
            vip={
                {0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15},
                {{0.7,0.75,0.8,0.85,0.9},{0.6,0.65,0.7,0.75,0.8},{0.6,0.65,0.7,0.75,0.8},{0.5,0.55,0.6,0.65,0.7},{0.5,0.55,0.6,0.65,0.7},{0.5,0.55,0.6,0.65,0.7},{0.45,0.5,0.55,0.6,0.65},{0.45,0.5,0.55,0.6,0.65},{0.45,0.5,0.55,0.6,0.65},{0.45,0.5,0.55,0.6,0.65},{0.4,0.45,0.5,0.55,0.6},{0.4,0.45,0.5,0.55,0.6},{0.4,0.45,0.5,0.55,0.6},{0.4,0.45,0.5,0.55,0.6},{0.4,0.45,0.5,0.55,0.6},{0.4,0.45,0.5,0.55,0.6}},
            },
            --品质切换需求（例如：3，则>=3时，为高级货物，<3时为低级货物）
            changePoint=3,
            --读取位置
            location=1,
            --折扣券商店固定折扣
            getCount=0.9,
            goods={{{{props_p4513=1},{props_p4514=1},{props_p4515=1},{props_p4516=1},{props_p4517=1},{props_p4518=1}},{200,200,200,300,300,200}},{{{props_p4519=1},{props_p4520=1},{props_p4521=1},{props_p4516=1},{props_p4517=1},{props_p4524=1}},{1800,1800,1800,300,300,1800}}},
            --可用折扣券的货物
            disGoods={{{props_p4522=1},{props_p4523=1},{armor_exp=50000}},{2800,2800,2500}},
        },
    },
}

return armorshop 
