local bzdh ={
    multiSelectType = true,
    [1]={
        sortid=231,
        type=1,
        --单抽价格
        cost1=58,
        --十连价格
        cost2=522,
        serverreward={
            --目标奖池
            pool_s1={
                {100,100,100},
                {10,10,10,10,5},
                {1,2,3,4,5},
            },
            
            --随机奖池
            pool_s2={
                {100,100,100},
                {10,10,10,10,5},
                {1,2,3,4,5},
            },
            
            --保底奖池
            basePool={
                {100},
                {50,10},
                {{"props_p601",1},{"props_p447",1}},
            },
            
            --奖池1
            pool_g1={
                {100},
                {50,50},
                {{"hero_s4",2},{"hero_s9",3}},
            },
            
            --奖池2
            pool_g2={
                {100},
                {50,50},
                {{"hero_s15",2},{"hero_s9",3}},
            },
            
            --奖池3
            pool_g3={
                {100},
                {50,50},
                {{"hero_s4",2},{"hero_s10",3}},
            },
            
            --奖池4
            pool_g4={
                {100},
                {50,50},
                {{"hero_s15",2},{"hero_s10",3}},
            },
            
            --奖池5
            pool_g5={
                {100},
                {10,10},
                {{"hero_s4",2},{"hero_s15",2}},
            },
            
        },
        rewardTb={
            --保底奖池
            basePool={p={{p601=1},{p447=1}}},
            
            --奖池1
            pool_g1={h={{s4=2},{s9=3}}},
            
            --奖池2
            pool_g2={h={{s15=2},{s9=3}}},
            
            --奖池3
            pool_g3={h={{s4=2},{s10=3}}},
            
            --奖池4
            pool_g4={h={{s15=2},{s10=3}}},
            
            --奖池5
            pool_g5={h={{s4=2},{s15=2}}},
            
        },
    },
    [2]={
        sortid=231,
        type=1,
        --单抽价格
        cost1=58,
        --十连价格
        cost2=522,
        serverreward={
            --目标奖池
            pool_s1={
                {100,100,100},
                {10,10,10,10,5},
                {1,2,3,4,5},
            },
            
            --随机奖池
            pool_s2={
                {100,100,100},
                {10,10,10,10,5},
                {1,2,3,4,5},
            },
            
            --保底奖池
            basePool={
                {100},
                {50,10},
                {{"props_p601",1},{"props_p447",1}},
            },
            
            --奖池1
            pool_g1={
                {100},
                {50,50},
                {{"hero_s6",2},{"hero_s20",3}},
            },
            
            --奖池2
            pool_g2={
                {100},
                {50,50},
                {{"hero_s16",2},{"hero_s20",3}},
            },
            
            --奖池3
            pool_g3={
                {100},
                {50,50},
                {{"hero_s6",2},{"hero_s22",3}},
            },
            
            --奖池4
            pool_g4={
                {100},
                {50,50},
                {{"hero_s16",2},{"hero_s22",3}},
            },
            
            --奖池5
            pool_g5={
                {100},
                {10,10},
                {{"hero_s6",2},{"hero_s16",2}},
            },
            
        },
        rewardTb={
            --保底奖池
            basePool={p={{p601=1},{p447=1}}},
            
            --奖池1
            pool_g1={h={{s6=2},{s20=3}}},
            
            --奖池2
            pool_g2={h={{s16=2},{s20=3}}},
            
            --奖池3
            pool_g3={h={{s6=2},{s22=3}}},
            
            --奖池4
            pool_g4={h={{s16=2},{s22=3}}},
            
            --奖池5
            pool_g5={h={{s6=2},{s16=2}}},
            
        },
    },
    [3]={
        sortid=231,
        type=1,
        --单抽价格
        cost1=58,
        --十连价格
        cost2=522,
        serverreward={
            --目标奖池
            pool_s1={
                {100,100,100},
                {10,10,10,10,5},
                {1,2,3,4,5},
            },
            
            --随机奖池
            pool_s2={
                {100,100,100},
                {10,10,10,10,5},
                {1,2,3,4,5},
            },
            
            --保底奖池
            basePool={
                {100},
                {50,10},
                {{"props_p601",1},{"props_p447",1}},
            },
            
            --奖池1
            pool_g1={
                {100},
                {50,50},
                {{"hero_s2",2},{"hero_s19",3}},
            },
            
            --奖池2
            pool_g2={
                {100},
                {50,50},
                {{"hero_s13",2},{"hero_s19",3}},
            },
            
            --奖池3
            pool_g3={
                {100},
                {50,50},
                {{"hero_s2",2},{"hero_s35",3}},
            },
            
            --奖池4
            pool_g4={
                {100},
                {50,50},
                {{"hero_s13",2},{"hero_s35",3}},
            },
            
            --奖池5
            pool_g5={
                {100},
                {10,10},
                {{"hero_s2",2},{"hero_s13",2}},
            },
            
        },
        rewardTb={
            --保底奖池
            basePool={p={{p601=1},{p447=1}}},
            
            --奖池1
            pool_g1={h={{s2=2},{s19=3}}},
            
            --奖池2
            pool_g2={h={{s13=2},{s19=3}}},
            
            --奖池3
            pool_g3={h={{s2=2},{s35=3}}},
            
            --奖池4
            pool_g4={h={{s13=2},{s35=3}}},
            
            --奖池5
            pool_g5={h={{s2=2},{s13=2}}},
            
        },
    },
    [4]={
        sortid=231,
        type=1,
        --单抽价格
        cost1=58,
        --十连价格
        cost2=522,
        serverreward={
            --目标奖池
            pool_s1={
                {100,100,100},
                {10,10,10,10,5},
                {1,2,3,4,5},
            },
            
            --随机奖池
            pool_s2={
                {100,100,100},
                {10,10,10,10,5},
                {1,2,3,4,5},
            },
            
            --保底奖池
            basePool={
                {100},
                {50,10},
                {{"props_p601",1},{"props_p447",1}},
            },
            
            --奖池1
            pool_g1={
                {100},
                {50,50},
                {{"hero_s32",2},{"hero_s18",3}},
            },
            
            --奖池2
            pool_g2={
                {100},
                {50,50},
                {{"hero_s39",2},{"hero_s18",3}},
            },
            
            --奖池3
            pool_g3={
                {100},
                {50,50},
                {{"hero_s32",2},{"hero_s27",3}},
            },
            
            --奖池4
            pool_g4={
                {100},
                {50,50},
                {{"hero_s39",2},{"hero_s27",3}},
            },
            
            --奖池5
            pool_g5={
                {100},
                {10,10},
                {{"hero_s32",2},{"hero_s39",2}},
            },
            
        },
        rewardTb={
            --保底奖池
            basePool={p={{p601=1},{p447=1}}},
            
            --奖池1
            pool_g1={h={{s32=2},{s18=3}}},
            
            --奖池2
            pool_g2={h={{s39=2},{s18=3}}},
            
            --奖池3
            pool_g3={h={{s32=2},{s27=3}}},
            
            --奖池4
            pool_g4={h={{s39=2},{s27=3}}},
            
            --奖池5
            pool_g5={h={{s32=2},{s39=2}}},
            
        },
    },
    [5]={
        sortid=231,
        type=1,
        --单抽价格
        cost1=58,
        --十连价格
        cost2=522,
        serverreward={
            --目标奖池
            pool_s1={
                {100,100,100},
                {10,10,10,10,5},
                {1,2,3,4,5},
            },
            
            --随机奖池
            pool_s2={
                {100,100,100},
                {10,10,10,10,5},
                {1,2,3,4,5},
            },
            
            --保底奖池
            basePool={
                {100},
                {50,10},
                {{"props_p601",1},{"props_p447",1}},
            },
            
            --奖池1
            pool_g1={
                {100},
                {50,50},
                {{"hero_s7",2},{"hero_s29",3}},
            },
            
            --奖池2
            pool_g2={
                {100},
                {50,50},
                {{"hero_s30",2},{"hero_s29",3}},
            },
            
            --奖池3
            pool_g3={
                {100},
                {50,50},
                {{"hero_s7",2},{"hero_s37",3}},
            },
            
            --奖池4
            pool_g4={
                {100},
                {50,50},
                {{"hero_s30",2},{"hero_s37",3}},
            },
            
            --奖池5
            pool_g5={
                {100},
                {10,10},
                {{"hero_s7",2},{"hero_s30",2}},
            },
            
        },
        rewardTb={
            --保底奖池
            basePool={p={{p601=1},{p447=1}}},
            
            --奖池1
            pool_g1={h={{s7=2},{s29=3}}},
            
            --奖池2
            pool_g2={h={{s30=2},{s29=3}}},
            
            --奖池3
            pool_g3={h={{s7=2},{s37=3}}},
            
            --奖池4
            pool_g4={h={{s30=2},{s37=3}}},
            
            --奖池5
            pool_g5={h={{s7=2},{s30=2}}},
            
        },
    },
}

return bzdh 
