local chdl={
    multiSelectType = true,
    [1]={
        sortid=231,
        type=1,
        ----奖池数量（根据奖池数量控制按钮数量）
        pNum=3,
        ----单抽消耗
        cost1={18,38,58},
        ----十连消耗
        cost2={160,340,520},
        ----单次抽奖赠转换券数量
        ticketGet={1,3,5},
        ----和谐版各按钮给的数量
        lotteryNum={1,1,1},
        --改造折扣
        discount=0.8,
        --兑换券道具
        exItem="chdl_a1",
        ----漂浮物个数
        lightNum=10,
        ----各组互兑比例（N兑换1）
        exchangeNum1=1,
        exchangeNum2=1,
        exchangeNum3=1,
        ----兑换需要转换券数量
        ticketNeed={1,3,5},
        ----初始兑换价格
        exCost={3,6,9},
        --兑换N次后涨价（三组分别计数）
        exUpNum={200,200,200},
        --涨价价格
        upValue={1,2,3},
        --封顶价格
        upLimit={8,16,24},
        ----A组船
        groupA={"20153","10082","10073","10093","10123","10043","10063","10053","10113"},
        ----B组船
        groupB={"20154","10083","10074","10094","10124","10044","10064","10054","10114"},
        ----C组船
        groupC={"20155","10084","10075","10095","20125","10045","20065","20055","20115"},
        ----解锁改造的船
        gaizao={"a20153","a10082","a10073","a10093","a10123","a10043","a10063","a10053","a10113","a20154","a10083","a10074","a10094","a10124","a10044","a10064","a10054","a10114","a20155","a10084","a10075","a10095","a20125","a10045","a20065","a20055","a20115"},
        serverreward={
            --奖池1
            pool1={
                {100},
                {7,7,8,8,8,9,9,10,10},
                {{"troops_a20153",1},{"troops_a10082",1},{"troops_a10073",1},{"troops_a10093",1},{"troops_a10123",1},{"troops_a10043",1},{"troops_a10063",1},{"troops_a10053",1},{"troops_a10113",1}},
            },
            --奖池2
            pool2={
                {100},
                {7,7,8,8,8,9,9,10,10},
                {{"troops_a20154",1},{"troops_a10083",1},{"troops_a10074",1},{"troops_a10094",1},{"troops_a10124",1},{"troops_a10044",1},{"troops_a10064",1},{"troops_a10054",1},{"troops_a10114",1}},
            },
            --奖池3
            pool3={
                {100},
                {7,7,8,8,8,9,9,10,10},
                {{"troops_a20155",1},{"troops_a10084",1},{"troops_a10075",1},{"troops_a10095",1},{"troops_a20125",1},{"troops_a10045",1},{"troops_a20065",1},{"troops_a20055",1},{"troops_a20115",1}},
            },
        },
        rewardTb={
            --奖池1
            pool1={o={{a20153=1,index=1},{a10082=1,index=2},{a10073=1,index=3},{a10093=1,index=4},{a10123=1,index=5},{a10043=1,index=6},{a10063=1,index=7},{a10053=1,index=8},{a10113=1,index=9}}},
            
            --奖池2
            pool2={o={{a20154=1,index=1},{a10083=1,index=2},{a10074=1,index=3},{a10094=1,index=4},{a10124=1,index=5},{a10044=1,index=6},{a10064=1,index=7},{a10054=1,index=8},{a10114=1,index=9}}},
            
            --奖池3
            pool3={o={{a20155=1,index=1},{a10084=1,index=2},{a10075=1,index=3},{a10095=1,index=4},{a20125=1,index=5},{a10045=1,index=6},{a20065=1,index=7},{a20055=1,index=8},{a20115=1,index=9}}},
            
        },
    },
}

return chdl
