local luckcard2018={
    multiSelectType=true,  --支持多版本
    
    [1]={
        --重牙鲷级潜艇
        
        version=1,
        sortId=200,
        type=1,
        acIcon="IconTank_20055.png",
        
        cost1=58,  --单抽所需金币
        cost2=522,  --十倍奖励所需金币
        
        value=0.8,  --已激活改造折扣
        
        luckyReward={serverreward={troops_a20055=5},reward={o={{a20055=5}}}},  --幸运大奖
        
        report={
            a20055='{"ocean":[1,2,2],"h":[{},{}],"d":[["98010-279"],["897683-0-F0"],["98010-257"],["98010-235"],["907335-0-F0"]],"t":[[["a10035",300],["a10035",300],{},{},{},{}],[["a20055",300],{},{},{},{},{}]],"p":[["PLAYER2",70,1,1000],["PLAYER1",70,0,1000]],"r":1}'
        },  --坦克预览的战报
        
        nextRequire={"troops_a10054","troops_a20055",""},  --翻下一张牌的条件
        
        serverreward={  --8个奖池
            randomPool1={
                {100},
                {90,10},
                {{"troops_a10054",1},{"props_p411",3}},
            },
            randomPool2={
                {100},
                {80,20},
                {{"troops_a10054",1},{"props_p411",3}},
            },
            randomPool3={
                {100},
                {60,40},
                {{"troops_a10054",1},{"props_p411",3}},
            },
            randomPool4={
                {100},
                {50,50},
                {{"troops_a10054",1},{"props_p411",3}},
            },
            randomPool5={
                {100},
                {50,50},
                {{"troops_a20055",1},{"props_p411",3}},
            },
            randomPool6={
                {100},
                {50,50},
                {{"troops_a20055",1},{"props_p411",3}},
            },
            randomPool7={
                {100},
                {34,66},
                {{"troops_a20055",1},{"props_p411",3}},
            },
            randomPool8={
                {100},
                {30,70},
                {{"troops_a20055",1},{"props_p411",3}},
            },
        },
        clientReward={  --前端翻牌显示
            [1]={
                o={{a10054=1,index=1}},p={{p411=3,index=2}}
            },
            [2]={
                o={{a10054=1,index=1}},p={{p411=3,index=2}}
            },
            [3]={
                o={{a10054=1,index=1}},p={{p411=3,index=2}}
            },
            [4]={
                o={{a10054=1,index=1}},p={{p411=3,index=2}}
            },
            [5]={
                o={{a20055=1,index=1}},p={{p411=3,index=2}}
            },
            [6]={
                o={{a20055=1,index=1}},p={{p411=3,index=2}}
            },
            [7]={
                o={{a20055=1,index=1}},p={{p411=3,index=2}}
            },
            [8]={
                o={{a20055=1,index=1}},p={{p411=3,index=2}}
            },
        },
    },
    [2]={
        --食人鲨级潜艇
        
        version=2,
        sortId=200,
        type=1,
        acIcon="IconTank_20115.png",
        
        cost1=58,  --单抽所需金币
        cost2=522,  --十倍奖励所需金币
        
        value=0.6,  --已激活改造折扣
        
        luckyReward={serverreward={troops_a20115=5},reward={o={{a20115=5}}}},  --幸运大奖
        
        report={
            a20115='{"ocean":[1,1,2],"h":[{},{}],"d":[["156816-275-1"],["686070-0"],["$","K"],["1029106-0-1"]],"t":[[["a10035",300],["a10035",300],{},{},{},{}],[["a20115",300],{},{},{},{},{}]],"p":[["PLAYER2",70,1,1000],["PLAYER1",70,0,1000]],"r":1}'
        },  --坦克预览的战报
        
        nextRequire={"troops_a10114","troops_a20115",""},  --翻下一张牌的条件
        
        serverreward={  --8个奖池
            randomPool1={
                {100},
                {90,10},
                {{"troops_a10114",1},{"props_p836",3}},
            },
            randomPool2={
                {100},
                {80,20},
                {{"troops_a10114",1},{"props_p836",3}},
            },
            randomPool3={
                {100},
                {60,40},
                {{"troops_a10114",1},{"props_p836",3}},
            },
            randomPool4={
                {100},
                {50,50},
                {{"troops_a10114",1},{"props_p836",3}},
            },
            randomPool5={
                {100},
                {50,50},
                {{"troops_a20115",1},{"props_p836",3}},
            },
            randomPool6={
                {100},
                {50,50},
                {{"troops_a20115",1},{"props_p836",3}},
            },
            randomPool7={
                {100},
                {34,66},
                {{"troops_a20115",1},{"props_p836",3}},
            },
            randomPool8={
                {100},
                {30,70},
                {{"troops_a20115",1},{"props_p836",3}},
            },
        },
        clientReward={  --前端翻牌显示
            [1]={
                o={{a10114=1,index=1}},p={{p836=3,index=2}}
            },
            [2]={
                o={{a10114=1,index=1}},p={{p836=3,index=2}}
            },
            [3]={
                o={{a10114=1,index=1}},p={{p836=3,index=2}}
            },
            [4]={
                o={{a10114=1,index=1}},p={{p836=3,index=2}}
            },
            [5]={
                o={{a20115=1,index=1}},p={{p836=3,index=2}}
            },
            [6]={
                o={{a20115=1,index=1}},p={{p836=3,index=2}}
            },
            [7]={
                o={{a20115=1,index=1}},p={{p836=3,index=2}}
            },
            [8]={
                o={{a20115=1,index=1}},p={{p836=3,index=2}}
            },
        },
    },
    [3]={
        --江凯级护卫舰
        
        version=3,
        sortId=200,
        type=1,
        acIcon="IconTank_10045.png",
        
        cost1=58,  --单抽所需金币
        cost2=522,  --十倍奖励所需金币
        
        value=0.8,  --已激活改造折扣
        
        luckyReward={serverreward={troops_a10045=5},reward={o={{a10045=5}}}},  --幸运大奖
        
        report={
            a10045='{"ocean":[1,2,3],"h":[{},{}],"d":[["98010-284-0E"],["351450-146"],["0"],["23850-279-0e"],["345263-0"],["78408-266-0E"],["0"],["329175-96"],["15682-263-0e"],["325463-0"]],"t":[[["a10035",300],{},["a10035",240],{},{},{}],[["a10045",300],{},{},{},{},{}]],"p":[["PLAYER2",70,1,1000],["PLAYER1",70,0,1000]],"r":1}'
        },  --坦克预览的战报
        
        nextRequire={"troops_a10044","troops_a10045",""},  --翻下一张牌的条件
        
        serverreward={  --8个奖池
            randomPool1={
                {100},
                {90,10},
                {{"troops_a10044",1},{"props_p410",3}},
            },
            randomPool2={
                {100},
                {75,25},
                {{"troops_a10044",1},{"props_p410",3}},
            },
            randomPool3={
                {100},
                {60,40},
                {{"troops_a10044",1},{"props_p410",3}},
            },
            randomPool4={
                {100},
                {50,50},
                {{"troops_a10044",1},{"props_p410",3}},
            },
            randomPool5={
                {100},
                {45,55},
                {{"troops_a10045",1},{"props_p410",3}},
            },
            randomPool6={
                {100},
                {34,66},
                {{"troops_a10045",1},{"props_p410",3}},
            },
            randomPool7={
                {100},
                {33,67},
                {{"troops_a10045",1},{"props_p410",3}},
            },
            randomPool8={
                {100},
                {30,70},
                {{"troops_a10045",1},{"props_p410",3}},
            },
        },
        clientReward={  --前端翻牌显示
            [1]={
                o={{a10044=1,index=1}},p={{p410=3,index=2}}
            },
            [2]={
                o={{a10044=1,index=1}},p={{p410=3,index=2}}
            },
            [3]={
                o={{a10044=1,index=1}},p={{p410=3,index=2}}
            },
            [4]={
                o={{a10044=1,index=1}},p={{p410=3,index=2}}
            },
            [5]={
                o={{a10045=1,index=1}},p={{p410=3,index=2}}
            },
            [6]={
                o={{a10045=1,index=1}},p={{p410=3,index=2}}
            },
            [7]={
                o={{a10045=1,index=1}},p={{p410=3,index=2}}
            },
            [8]={
                o={{a10045=1,index=1}},p={{p410=3,index=2}}
            },
        },
    },
    [4]={
        --守卫级护卫舰
        
        version=4,
        sortId=200,
        type=1,
        acIcon="IconTank_20065.png",
        
        cost1=58,  --单抽所需金币
        cost2=522,  --十倍奖励所需金币
        
        value=0.8,  --已激活改造折扣
        
        luckyReward={serverreward={troops_a20065=5},reward={o={{a20065=5}}}},  --幸运大奖
        
        report={
            a20065='{"ocean":[1,1,1],"h":[{},{}],"d":[["98010-283"],["917053-0-G0g"],["98010-266"],["196020-231-1"],["748549-0-G0g"]],"t":[[["a10035",300],{},["a10035",300],{},{},{}],[["a20065",300],{},{},{},{},{}]],"p":[["PLAYER2",70,1,1000],["PLAYER1",70,0,1000]],"r":1}'
        },  --坦克预览的战报
        
        nextRequire={"troops_a10064","troops_a20065",""},  --翻下一张牌的条件
        
        serverreward={  --8个奖池
            randomPool1={
                {100},
                {90,10},
                {{"troops_a10064",1},{"props_p412",3}},
            },
            randomPool2={
                {100},
                {75,25},
                {{"troops_a10064",1},{"props_p412",3}},
            },
            randomPool3={
                {100},
                {60,40},
                {{"troops_a10064",1},{"props_p412",3}},
            },
            randomPool4={
                {100},
                {50,50},
                {{"troops_a10064",1},{"props_p412",3}},
            },
            randomPool5={
                {100},
                {45,55},
                {{"troops_a20065",1},{"props_p412",3}},
            },
            randomPool6={
                {100},
                {34,66},
                {{"troops_a20065",1},{"props_p412",3}},
            },
            randomPool7={
                {100},
                {33,67},
                {{"troops_a20065",1},{"props_p412",3}},
            },
            randomPool8={
                {100},
                {30,70},
                {{"troops_a20065",1},{"props_p412",3}},
            },
        },
        clientReward={  --前端翻牌显示
            [1]={
                o={{a10064=1,index=1}},p={{p412=3,index=2}}
            },
            [2]={
                o={{a10064=1,index=1}},p={{p412=3,index=2}}
            },
            [3]={
                o={{a10064=1,index=1}},p={{p412=3,index=2}}
            },
            [4]={
                o={{a10064=1,index=1}},p={{p412=3,index=2}}
            },
            [5]={
                o={{a20065=1,index=1}},p={{p412=3,index=2}}
            },
            [6]={
                o={{a20065=1,index=1}},p={{p412=3,index=2}}
            },
            [7]={
                o={{a20065=1,index=1}},p={{p412=3,index=2}}
            },
            [8]={
                o={{a20065=1,index=1}},p={{p412=3,index=2}}
            },
        },
    },
    [5]={
        --兴登堡级战列舰
        
        version=5,
        sortId=200,
        type=1,
        acIcon="IconTank_10075.png",
        
        cost1=58,  --单抽所需金币
        cost2=522,  --十倍奖励所需金币
        
        value=0.8,  --已激活改造折扣
        
        luckyReward={serverreward={troops_a10075=5},reward={o={{a10075=5}}}},  --幸运大奖
        
        report={
            a10075='{"ocean":[1,2,3],"h":[{},{}],"d":[["124714-285-1"],["189605-217-h0-0","189605-217-h0-0","189605-217-h0-0"],["45105-279"],["45105-274"],["45105-268"],["187847-135-h0-0","187847-135-h0-0","187847-135-h0-0"],["0"],["0"],["0"],["159192-65","159192-65","159192-65"],["13511-266"],["13511-265"],["0"],["176300-0-h0-0","176300-0-h0-0","176300-0-h0-0"]],"t":[[["a10035",300],["a10035",300],["a10035",300],{},{},{}],[["a10075",300],{},{},{},{},{}]],"p":[["PLAYER2",70,1,1000],["PLAYER1",70,0,1000]],"r":1}'
        },  --坦克预览的战报
        
        nextRequire={"troops_a10074","troops_a10075",""},  --翻下一张牌的条件
        
        serverreward={  --8个奖池
            randomPool1={
                {100},
                {90,10},
                {{"troops_a10074",1},{"props_p413",3}},
            },
            randomPool2={
                {100},
                {70,30},
                {{"troops_a10074",1},{"props_p413",3}},
            },
            randomPool3={
                {100},
                {55,45},
                {{"troops_a10074",1},{"props_p413",3}},
            },
            randomPool4={
                {100},
                {50,50},
                {{"troops_a10074",1},{"props_p413",3}},
            },
            randomPool5={
                {100},
                {45,55},
                {{"troops_a10075",1},{"props_p413",3}},
            },
            randomPool6={
                {100},
                {34,66},
                {{"troops_a10075",1},{"props_p413",3}},
            },
            randomPool7={
                {100},
                {33,67},
                {{"troops_a10075",1},{"props_p413",3}},
            },
            randomPool8={
                {100},
                {30,70},
                {{"troops_a10075",1},{"props_p413",3}},
            },
        },
        clientReward={  --前端翻牌显示
            [1]={
                o={{a10074=1,index=1}},p={{p413=3,index=2}}
            },
            [2]={
                o={{a10074=1,index=1}},p={{p413=3,index=2}}
            },
            [3]={
                o={{a10074=1,index=1}},p={{p413=3,index=2}}
            },
            [4]={
                o={{a10074=1,index=1}},p={{p413=3,index=2}}
            },
            [5]={
                o={{a10075=1,index=1}},p={{p413=3,index=2}}
            },
            [6]={
                o={{a10075=1,index=1}},p={{p413=3,index=2}}
            },
            [7]={
                o={{a10075=1,index=1}},p={{p413=3,index=2}}
            },
            [8]={
                o={{a10075=1,index=1}},p={{p413=3,index=2}}
            },
        },
    },
    [6]={
        --黎赛留级战列舰
        
        version=6,
        sortId=200,
        type=1,
        acIcon="IconTank_10095.png",
        
        cost1=58,  --单抽所需金币
        cost2=522,  --十倍奖励所需金币
        
        value=0.8,  --已激活改造折扣
        
        luckyReward={serverreward={troops_a10095=5},reward={o={{a10095=5}}}},  --幸运大奖
        
        report={
            a10095='{"ocean":[1,2,1],"h":[{},{}],"d":[["98010-290"],["163647-229-j0","163647-229-j0","163647-229-j0"],["74815-282"],["71823-274"],["68830-266"],["150104-163-j0","150104-163-j0","150104-163-j0"],["53253-260"],["51123-255"],["48993-249"],["140511-101-j0","140511-101-j0","140511-101-j0"],["32997-246"],["31678-242"],["30358-239"],["134868-42-j0","134868-42-j0","134868-42-j0"],["13722-238"],["13174-236"],["12625-235"],["132611-0-j0","132611-0-j0","132611-0-j0"]],"t":[[["a10035",300],["a10035",300],["a10035",300],{},{},{}],[["a10095",300],{},{},{},{},{}]],"p":[["PLAYER2",70,1,1000],["PLAYER1",70,0,1000]],"r":1}'
        },  --坦克预览的战报
        
        nextRequire={"troops_a10094","troops_a10095",""},  --翻下一张牌的条件
        
        serverreward={  --8个奖池
            randomPool1={
                {100},
                {90,10},
                {{"troops_a10094",1},{"props_p835",3}},
            },
            randomPool2={
                {100},
                {70,30},
                {{"troops_a10094",1},{"props_p835",3}},
            },
            randomPool3={
                {100},
                {55,45},
                {{"troops_a10094",1},{"props_p835",3}},
            },
            randomPool4={
                {100},
                {50,50},
                {{"troops_a10094",1},{"props_p835",3}},
            },
            randomPool5={
                {100},
                {45,55},
                {{"troops_a10095",1},{"props_p835",3}},
            },
            randomPool6={
                {100},
                {34,66},
                {{"troops_a10095",1},{"props_p835",3}},
            },
            randomPool7={
                {100},
                {33,67},
                {{"troops_a10095",1},{"props_p835",3}},
            },
            randomPool8={
                {100},
                {30,70},
                {{"troops_a10095",1},{"props_p835",3}},
            },
        },
        clientReward={  --前端翻牌显示
            [1]={
                o={{a10094=1,index=1}},p={{p835=3,index=2}}
            },
            [2]={
                o={{a10094=1,index=1}},p={{p835=3,index=2}}
            },
            [3]={
                o={{a10094=1,index=1}},p={{p835=3,index=2}}
            },
            [4]={
                o={{a10094=1,index=1}},p={{p835=3,index=2}}
            },
            [5]={
                o={{a10095=1,index=1}},p={{p835=3,index=2}}
            },
            [6]={
                o={{a10095=1,index=1}},p={{p835=3,index=2}}
            },
            [7]={
                o={{a10095=1,index=1}},p={{p835=3,index=2}}
            },
            [8]={
                o={{a10095=1,index=1}},p={{p835=3,index=2}}
            },
        },
    },
    [7]={
        --凯撒级战列舰
        
        version=7,
        sortId=200,
        type=1,
        acIcon="IconTank_20125.png",
        
        cost1=58,  --单抽所需金币
        cost2=522,  --十倍奖励所需金币
        
        value=0.8,  --已激活改造折扣
        
        luckyReward={serverreward={troops_a20125=5},reward={o={{a20125=5}}}},  --幸运大奖
        
        report={
            a20125='{"ocean":[1,2,3],"h":[{},{}],"d":[["78409-292"],["277517-179-0L","277517-179-0L","277517-179-0L"],["0-0-l0"],["46784-286-l0"],["0-0-l0"],["271815-60-0L","271815-60-0L","271815-60-0L"],["15682-284-l0"],["29012-281-l1"],["15682-279-l0"],["265162-0","265162-0","265162-0"]],"t":[[["a10035",300],["a10035",300],["a10035",300],{},{},{}],[["a20125",300],{},{},{},{},{}]],"p":[["PLAYER2",70,1,1000],["PLAYER1",70,0,1000]],"r":1}'
        },  --坦克预览的战报
        
        nextRequire={"troops_a10124","troops_a20125",""},  --翻下一张牌的条件
        
        serverreward={  --8个奖池
            randomPool1={
                {100},
                {90,10},
                {{"troops_a10124",1},{"props_p837",3}},
            },
            randomPool2={
                {100},
                {70,30},
                {{"troops_a10124",1},{"props_p837",3}},
            },
            randomPool3={
                {100},
                {55,45},
                {{"troops_a10124",1},{"props_p837",3}},
            },
            randomPool4={
                {100},
                {50,50},
                {{"troops_a10124",1},{"props_p837",3}},
            },
            randomPool5={
                {100},
                {45,55},
                {{"troops_a20125",1},{"props_p837",3}},
            },
            randomPool6={
                {100},
                {34,66},
                {{"troops_a20125",1},{"props_p837",3}},
            },
            randomPool7={
                {100},
                {33,67},
                {{"troops_a20125",1},{"props_p837",3}},
            },
            randomPool8={
                {100},
                {30,70},
                {{"troops_a20125",1},{"props_p837",3}},
            },
        },
        clientReward={  --前端翻牌显示
            [1]={
                o={{a10124=1,index=1}},p={{p837=3,index=2}}
            },
            [2]={
                o={{a10124=1,index=1}},p={{p837=3,index=2}}
            },
            [3]={
                o={{a10124=1,index=1}},p={{p837=3,index=2}}
            },
            [4]={
                o={{a10124=1,index=1}},p={{p837=3,index=2}}
            },
            [5]={
                o={{a20125=1,index=1}},p={{p837=3,index=2}}
            },
            [6]={
                o={{a20125=1,index=1}},p={{p837=3,index=2}}
            },
            [7]={
                o={{a20125=1,index=1}},p={{p837=3,index=2}}
            },
            [8]={
                o={{a20125=1,index=1}},p={{p837=3,index=2}}
            },
        },
    },
    [8]={
        --戈尔什科夫级航空母舰
        
        version=8,
        sortId=200,
        type=1,
        acIcon="IconTank_10084.png",
        
        cost1=58,  --单抽所需金币
        cost2=522,  --十倍奖励所需金币
        
        value=0.8,  --已激活改造折扣
        
        luckyReward={serverreward={troops_a10084=5},reward={o={{a10084=5}}}},  --幸运大奖
        
        report={
            a10084='{"ocean":[1,1,4],"h":[{},{}],"d":[["32670-294"],["253224-0-1","126612-45","253224-0-1","126612-45","126612-45","253224-0-1"],["14702-291"],["14702-289"],["29404-283-1"],["14702-280"],["120582-0","241164-0-1","120582-0"]],"t":[[["a10035",100],["a10035",100],["a10035",100],["a10035",100],["a10035",100],["a10035",100]],[["a10084",300],{},{},{},{},{}]],"p":[["PLAYER2",70,1,1000],["PLAYER1",70,0,1000]],"r":1}'
        },  --坦克预览的战报
        
        nextRequire={"troops_a10083","troops_a10084",""},  --翻下一张牌的条件
        
        serverreward={  --8个奖池
            randomPool1={
                {100},
                {80,20},
                {{"troops_a10083",1},{"props_p414",3}},
            },
            randomPool2={
                {100},
                {60,40},
                {{"troops_a10083",1},{"props_p414",3}},
            },
            randomPool3={
                {100},
                {50,50},
                {{"troops_a10083",1},{"props_p414",3}},
            },
            randomPool4={
                {100},
                {45,55},
                {{"troops_a10083",1},{"props_p414",3}},
            },
            randomPool5={
                {100},
                {40,60},
                {{"troops_a10084",1},{"props_p414",3}},
            },
            randomPool6={
                {100},
                {35,65},
                {{"troops_a10084",1},{"props_p414",3}},
            },
            randomPool7={
                {100},
                {30,70},
                {{"troops_a10084",1},{"props_p414",3}},
            },
            randomPool8={
                {100},
                {30,70},
                {{"troops_a10084",1},{"props_p414",3}},
            },
        },
        clientReward={  --前端翻牌显示
            [1]={
                o={{a10083=1,index=1}},p={{p414=3,index=2}}
            },
            [2]={
                o={{a10083=1,index=1}},p={{p414=3,index=2}}
            },
            [3]={
                o={{a10083=1,index=1}},p={{p414=3,index=2}}
            },
            [4]={
                o={{a10083=1,index=1}},p={{p414=3,index=2}}
            },
            [5]={
                o={{a10084=1,index=1}},p={{p414=3,index=2}}
            },
            [6]={
                o={{a10084=1,index=1}},p={{p414=3,index=2}}
            },
            [7]={
                o={{a10084=1,index=1}},p={{p414=3,index=2}}
            },
            [8]={
                o={{a10084=1,index=1}},p={{p414=3,index=2}}
            },
        },
    },
    [9]={
        --小鹰级航空母舰
        
        version=9,
        sortId=200,
        type=1,
        acIcon="IconTank_20155.png",
        
        cost1=58,  --单抽所需金币
        cost2=522,  --十倍奖励所需金币
        
        value=0.8,  --已激活改造折扣
        
        luckyReward={serverreward={troops_a20155=5},reward={o={{a20155=5}}}},  --幸运大奖
        
        report={
            a20155='{"ocean":[1,2,3],"h":[{},{}],"d":[["245025-750","245025-750","245025-750"],["699576-294-1O","559660-357-1O","349788-463-0O"],["167659-716","167659-716","167659-716"],["333931-147-0O","267145-288-0O","333931-332-0O"],["283487-657"],["306414-13-0O","245131-226-0O","306414-212-0O"],["5309-714","5309-714","10618-655-1"],["665996-0-1","355198-135","887994-0-1"],["63401-701","63401-701","63401-642"],["464974-15"],["851678-0-1"]],"t":[[["a10035",600],["a10005",500],["a10025",600],{},{},{}],[["a20155",800],["a20155",800],["a20155",800],{},{},{}]],"p":[["PLAYER2",70,1,1000],["PLAYER1",70,0,1000]],"r":1}'
        },  --坦克预览的战报
        
        nextRequire={"troops_a20154","troops_a20155",""},  --翻下一张牌的条件
        
        serverreward={  --8个奖池
            randomPool1={
                {100},
                {80,20},
                {{"troops_a20154",1},{"props_p875",3}},
            },
            randomPool2={
                {100},
                {60,40},
                {{"troops_a20154",1},{"props_p875",3}},
            },
            randomPool3={
                {100},
                {50,50},
                {{"troops_a20154",1},{"props_p875",3}},
            },
            randomPool4={
                {100},
                {45,55},
                {{"troops_a20154",1},{"props_p875",3}},
            },
            randomPool5={
                {100},
                {40,60},
                {{"troops_a20155",1},{"props_p875",3}},
            },
            randomPool6={
                {100},
                {35,65},
                {{"troops_a20155",1},{"props_p875",3}},
            },
            randomPool7={
                {100},
                {30,70},
                {{"troops_a20155",1},{"props_p875",3}},
            },
            randomPool8={
                {100},
                {30,70},
                {{"troops_a20155",1},{"props_p875",3}},
            },
        },
        clientReward={  --前端翻牌显示
            [1]={
                o={{a20154=1,index=1}},p={{p875=3,index=2}}
            },
            [2]={
                o={{a20154=1,index=1}},p={{p875=3,index=2}}
            },
            [3]={
                o={{a20154=1,index=1}},p={{p875=3,index=2}}
            },
            [4]={
                o={{a20154=1,index=1}},p={{p875=3,index=2}}
            },
            [5]={
                o={{a20155=1,index=1}},p={{p875=3,index=2}}
            },
            [6]={
                o={{a20155=1,index=1}},p={{p875=3,index=2}}
            },
            [7]={
                o={{a20155=1,index=1}},p={{p875=3,index=2}}
            },
            [8]={
                o={{a20155=1,index=1}},p={{p875=3,index=2}}
            },
        },
    },
}

return luckcard2018
