local luckcard={
    multiSelectType=true,  --支持多版本
    
    [1]={
        --丁鲷级潜艇
        
        version=1,
        sortId=200,
        type=1,
        acIcon="IconTujiu.png",
        
        cost1=58,  --单抽所需金币
        cost2=522,  --十倍奖励所需金币
        
        value=0.8,  --已激活改造折扣
        
        luckyReward={serverreward={troops_a10054=5},reward={o={{a10054=5}}}},  --幸运大奖
        
        report={
            a10054='{"ocean":[1,1,4],"h":[{},{}],"d":[["150282-163"],["443768-266-F0"],["86903-141"],["441454-72-F0"],["23523-135"],["477799-0-F0"]],"t":[[{},["a10035",460],{},{},{},{}],[{},["a10054",200],{},{},{},{}]],"p":[["PLAYER1",70,1,1000],["PLAYER2",70,0,1000]],"r":1}'
        },  --坦克预览的战报
        
        nextRequire={"troops_a10053","troops_a10054",""},  --翻下一张牌的条件
        
        serverreward={  --8个奖池
            randomPool1={
                {100},
                {85,15},
                {{"troops_a10053",1},{"props_p411",3}},
            },
            randomPool2={
                {100},
                {75,25},
                {{"troops_a10053",1},{"props_p411",3}},
            },
            randomPool3={
                {100},
                {56,40},
                {{"troops_a10053",1},{"props_p411",3}},
            },
            randomPool4={
                {100},
                {50,50},
                {{"troops_a10053",1},{"props_p411",3}},
            },
            randomPool5={
                {100},
                {45,55},
                {{"troops_a10054",1},{"props_p411",3}},
            },
            randomPool6={
                {100},
                {40,60},
                {{"troops_a10054",1},{"props_p411",3}},
            },
            randomPool7={
                {100},
                {34,66},
                {{"troops_a10054",1},{"props_p411",3}},
            },
            randomPool8={
                {100},
                {30,70},
                {{"troops_a10054",1},{"props_p411",3}},
            },
        },
        clientReward={  --前端翻牌显示
            [1]={
                o={{a10053=1,index=1}},p={{p411=3,index=2}}
            },
            [2]={
                o={{a10053=1,index=1}},p={{p411=3,index=2}}
            },
            [3]={
                o={{a10053=1,index=1}},p={{p411=3,index=2}}
            },
            [4]={
                o={{a10053=1,index=1}},p={{p411=3,index=2}}
            },
            [5]={
                o={{a10054=1,index=1}},p={{p411=3,index=2}}
            },
            [6]={
                o={{a10054=1,index=1}},p={{p411=3,index=2}}
            },
            [7]={
                o={{a10054=1,index=1}},p={{p411=3,index=2}}
            },
            [8]={
                o={{a10054=1,index=1}},p={{p411=3,index=2}}
            },
        },
    },
    [2]={
        --海妖级潜艇
        
        version=2,
        sortId=200,
        type=1,
        acIcon="IconTank_10094.png",
        
        cost1=58,  --单抽所需金币
        cost2=522,  --十倍奖励所需金币
        
        value=0.8,  --已激活改造折扣
        
        luckyReward={serverreward={troops_a10114=5},reward={o={{a10114=5}}}},  --幸运大奖
        
        report={
            a10114='{"ocean":[1,1,3],"h":[{},{}],"d":[["26346-196"],["401663-0"],["$","K"],["200832-372"],["97226-178"],["97226-160"],["327888-229"],["59852-149"],["305346-95"],["24830-145"],["297149-0"]],"t":[[["a10035",100],["a10035",460],{},{},{},{}],[["a10114",200],{},{},{},{},{}]],"p":[["PLAYER1",70,1,1000],["PLAYER2",70,0,1000]],"r":1}'
        },  --坦克预览的战报
        
        nextRequire={"troops_a10113","troops_a10114",""},  --翻下一张牌的条件
        
        serverreward={  --8个奖池
            randomPool1={
                {100},
                {85,15},
                {{"troops_a10113",1},{"props_p836",3}},
            },
            randomPool2={
                {100},
                {75,25},
                {{"troops_a10113",1},{"props_p836",3}},
            },
            randomPool3={
                {100},
                {56,40},
                {{"troops_a10113",1},{"props_p836",3}},
            },
            randomPool4={
                {100},
                {50,50},
                {{"troops_a10113",1},{"props_p836",3}},
            },
            randomPool5={
                {100},
                {45,55},
                {{"troops_a10114",1},{"props_p836",3}},
            },
            randomPool6={
                {100},
                {40,60},
                {{"troops_a10114",1},{"props_p836",3}},
            },
            randomPool7={
                {100},
                {34,66},
                {{"troops_a10114",1},{"props_p836",3}},
            },
            randomPool8={
                {100},
                {30,70},
                {{"troops_a10114",1},{"props_p836",3}},
            },
        },
        clientReward={  --前端翻牌显示
            [1]={
                o={{a10113=1,index=1}},p={{p836=3,index=2}}
            },
            [2]={
                o={{a10113=1,index=1}},p={{p836=3,index=2}}
            },
            [3]={
                o={{a10113=1,index=1}},p={{p836=3,index=2}}
            },
            [4]={
                o={{a10113=1,index=1}},p={{p836=3,index=2}}
            },
            [5]={
                o={{a10114=1,index=1}},p={{p836=3,index=2}}
            },
            [6]={
                o={{a10114=1,index=1}},p={{p836=3,index=2}}
            },
            [7]={
                o={{a10114=1,index=1}},p={{p836=3,index=2}}
            },
            [8]={
                o={{a10114=1,index=1}},p={{p836=3,index=2}}
            },
        },
    },
    [3]={
        --江卫级护卫舰
        
        version=3,
        sortId=200,
        type=1,
        acIcon="IconT99.png",
        
        cost1=58,  --单抽所需金币
        cost2=522,  --十倍奖励所需金币
        
        value=0.8,  --已激活改造折扣
        
        luckyReward={serverreward={troops_a10044=5},reward={o={{a10044=5}}}},  --幸运大奖
        
        report={
            a10044='{"ocean":[1,1,4],"h":[{},{}],"d":[["32932-244-0E"],["241560-0"],["90170-225-0e"],["150282-194-0E"],["192060-376"],["73704-178-0e"],["176220-299"],["97684-158-0E"],["156420-230"],["90170-139-1e"],["137610-170"],["55539-127-0E"],["125730-115"],["45086-118-1e"],["116820-64"],["20909-114-0E"],["112860-14"],["2745-113-0e"],["111870-0"]],"t":[[["a10035",100],["a10035",460],{},{},{},{}],[["a10044",250],{},{},{},{},{}]],"p":[["PLAYER1",64,1,1000],["PLAYER2",73,0,1000]],"r":1}'
        },  --坦克预览的战报
        
        nextRequire={"troops_a10043","troops_a10044",""},  --翻下一张牌的条件
        
        serverreward={  --8个奖池
            randomPool1={
                {100},
                {85,15},
                {{"troops_a10043",1},{"props_p410",3}},
            },
            randomPool2={
                {100},
                {72,25},
                {{"troops_a10043",1},{"props_p410",3}},
            },
            randomPool3={
                {100},
                {59,40},
                {{"troops_a10043",1},{"props_p410",3}},
            },
            randomPool4={
                {100},
                {50,50},
                {{"troops_a10043",1},{"props_p410",3}},
            },
            randomPool5={
                {100},
                {45,55},
                {{"troops_a10044",1},{"props_p410",3}},
            },
            randomPool6={
                {100},
                {34,60},
                {{"troops_a10044",1},{"props_p410",3}},
            },
            randomPool7={
                {100},
                {33,66},
                {{"troops_a10044",1},{"props_p410",3}},
            },
            randomPool8={
                {100},
                {30,70},
                {{"troops_a10044",1},{"props_p410",3}},
            },
        },
        clientReward={  --前端翻牌显示
            [1]={
                o={{a10043=1,index=1}},p={{p410=3,index=2}}
            },
            [2]={
                o={{a10043=1,index=1}},p={{p410=3,index=2}}
            },
            [3]={
                o={{a10043=1,index=1}},p={{p410=3,index=2}}
            },
            [4]={
                o={{a10043=1,index=1}},p={{p410=3,index=2}}
            },
            [5]={
                o={{a10044=1,index=1}},p={{p410=3,index=2}}
            },
            [6]={
                o={{a10044=1,index=1}},p={{p410=3,index=2}}
            },
            [7]={
                o={{a10044=1,index=1}},p={{p410=3,index=2}}
            },
            [8]={
                o={{a10044=1,index=1}},p={{p410=3,index=2}}
            },
        },
    },
    [4]={
        --暴徒级护卫舰
        
        version=4,
        sortId=200,
        type=1,
        acIcon="fightingElephantTank.png",
        
        cost1=58,  --单抽所需金币
        cost2=522,  --十倍奖励所需金币
        
        value=0.8,  --已激活改造折扣
        
        luckyReward={serverreward={troops_a10064=5},reward={o={{a10064=5}}}},  --幸运大奖
        
        report={
            a10064='{"ocean":[1,1,4],"h":[{},{}],"d":[["32932-293"],["448333-0","448333-264"],["86249-274"],["172498-236-1"],["541671-26-G0g"],["8495-234"],["537081-0-G0g"]],"t":[[["a10035",100],{},{},["a10035",460],{},{}],[["a10064",300],{},{},{},{},{}]],"p":[["PLAYER1",70,1,1000],["PLAYER2",70,0,1000]],"r":1}'
        },  --坦克预览的战报
        
        nextRequire={"troops_a10063","troops_a10064",""},  --翻下一张牌的条件
        
        serverreward={  --8个奖池
            randomPool1={
                {100},
                {85,15},
                {{"troops_a10063",1},{"props_p412",3}},
            },
            randomPool2={
                {100},
                {73,25},
                {{"troops_a10063",1},{"props_p412",3}},
            },
            randomPool3={
                {100},
                {56,40},
                {{"troops_a10063",1},{"props_p412",3}},
            },
            randomPool4={
                {100},
                {52,50},
                {{"troops_a10063",1},{"props_p412",3}},
            },
            randomPool5={
                {100},
                {45,55},
                {{"troops_a10064",1},{"props_p412",3}},
            },
            randomPool6={
                {100},
                {40,60},
                {{"troops_a10064",1},{"props_p412",3}},
            },
            randomPool7={
                {100},
                {30,66},
                {{"troops_a10064",1},{"props_p412",3}},
            },
            randomPool8={
                {100},
                {30,70},
                {{"troops_a10064",1},{"props_p412",3}},
            },
        },
        clientReward={  --前端翻牌显示
            [1]={
                o={{a10063=1,index=1}},p={{p412=3,index=2}}
            },
            [2]={
                o={{a10063=1,index=1}},p={{p412=3,index=2}}
            },
            [3]={
                o={{a10063=1,index=1}},p={{p412=3,index=2}}
            },
            [4]={
                o={{a10063=1,index=1}},p={{p412=3,index=2}}
            },
            [5]={
                o={{a10064=1,index=1}},p={{p412=3,index=2}}
            },
            [6]={
                o={{a10064=1,index=1}},p={{p412=3,index=2}}
            },
            [7]={
                o={{a10064=1,index=1}},p={{p412=3,index=2}}
            },
            [8]={
                o={{a10064=1,index=1}},p={{p412=3,index=2}}
            },
        },
    },
    [5]={
        --提尔皮茨级战列舰
        
        version=5,
        sortId=200,
        type=1,
        acIcon="largeMouseTank.png",
        
        cost1=58,  --单抽所需金币
        cost2=522,  --十倍奖励所需金币
        
        value=0.8,  --已激活改造折扣
        
        luckyReward={serverreward={troops_a10074=5},reward={o={{a10074=5}}}},  --幸运大奖
        
        report={
            a10074='{"ocean":[1,2,2],"h":[{},{}],"d":[["21695-297"],["151426-35-hh0","151426-394-hh0"],["169896-273-1"],["7594-272"],["146758-0-hh0","146758-330-hh0"],["71149-262"],["142298-242-1"],["130572-272-h0"],["58644-233"],["118796-220-h0"],["94866-220-1"],["115434-170-h0"],["36653-214"],["109108-122-h0"],["52608-207-1"],["108613-74-h0"],["31910-202-1"],["105990-28-h0"],["6037-201"],["102480-0-h0"]],"t":[[["a10035",100],["a10035",460],{},{},{},{}],[["a10074",300],{},{},{},{},{}]],"p":[["PLAYER1",64,1,1000],["PLAYER2",73,0,1000]],"r":1}'
        },  --坦克预览的战报
        
        nextRequire={"troops_a10073","troops_a10074",""},  --翻下一张牌的条件
        
        serverreward={  --8个奖池
            randomPool1={
                {100},
                {85,15},
                {{"troops_a10073",1},{"props_p413",3}},
            },
            randomPool2={
                {100},
                {70,25},
                {{"troops_a10073",1},{"props_p413",3}},
            },
            randomPool3={
                {100},
                {56,40},
                {{"troops_a10073",1},{"props_p413",3}},
            },
            randomPool4={
                {100},
                {50,50},
                {{"troops_a10073",1},{"props_p413",3}},
            },
            randomPool5={
                {100},
                {40,55},
                {{"troops_a10074",1},{"props_p413",3}},
            },
            randomPool6={
                {100},
                {40,60},
                {{"troops_a10074",1},{"props_p413",3}},
            },
            randomPool7={
                {100},
                {34,66},
                {{"troops_a10074",1},{"props_p413",3}},
            },
            randomPool8={
                {100},
                {30,70},
                {{"troops_a10074",1},{"props_p413",3}},
            },
        },
        clientReward={  --前端翻牌显示
            [1]={
                o={{a10073=1,index=1}},p={{p413=3,index=2}}
            },
            [2]={
                o={{a10073=1,index=1}},p={{p413=3,index=2}}
            },
            [3]={
                o={{a10073=1,index=1}},p={{p413=3,index=2}}
            },
            [4]={
                o={{a10073=1,index=1}},p={{p413=3,index=2}}
            },
            [5]={
                o={{a10074=1,index=1}},p={{p413=3,index=2}}
            },
            [6]={
                o={{a10074=1,index=1}},p={{p413=3,index=2}}
            },
            [7]={
                o={{a10074=1,index=1}},p={{p413=3,index=2}}
            },
            [8]={
                o={{a10074=1,index=1}},p={{p413=3,index=2}}
            },
        },
    },
    [6]={
        --甘古特级战列舰
        
        version=6,
        sortId=200,
        type=1,
        acIcon="IconTank_10094.png",
        
        cost1=58,  --单抽所需金币
        cost2=522,  --十倍奖励所需金币
        
        value=0.8,  --已激活改造折扣
        
        luckyReward={serverreward={troops_a10094=5},reward={o={{a10094=5}}}},  --幸运大奖
        
        report={
            a10094='{"ocean":[1,2,3],"h":[{},{}],"d":[["32932-296"],["164103-29-j0","164103-389-j0"],["127087-277"],["9265-276"],["153015-0-j0","153015-321-j0"],["104871-260"],["101725-245"],["135828-262-j0"],["85596-233"],["129176-205-j0"],["66974-223"],["123632-151-j0"],["49332-216"],["119751-98-j0"],["32017-211"],["116979-47-j0"],["15355-209"],["115870-0-j0"]],"t":[[["a10035",100],["a10035",460],{},{},{},{}],[["a10094",300],{},{},{},{},{}]],"p":[["PLAYER1",64,1,1000],["PLAYER2",73,0,1000]],"r":1}'
        },  --坦克预览的战报
        
        nextRequire={"troops_a10093","troops_a10094",""},  --翻下一张牌的条件
        
        serverreward={  --8个奖池
            randomPool1={
                {100},
                {85,15},
                {{"troops_a10093",1},{"props_p835",3}},
            },
            randomPool2={
                {100},
                {70,25},
                {{"troops_a10093",1},{"props_p835",3}},
            },
            randomPool3={
                {100},
                {56,40},
                {{"troops_a10093",1},{"props_p835",3}},
            },
            randomPool4={
                {100},
                {48,50},
                {{"troops_a10093",1},{"props_p835",3}},
            },
            randomPool5={
                {100},
                {45,55},
                {{"troops_a10094",1},{"props_p835",3}},
            },
            randomPool6={
                {100},
                {40,60},
                {{"troops_a10094",1},{"props_p835",3}},
            },
            randomPool7={
                {100},
                {34,66},
                {{"troops_a10094",1},{"props_p835",3}},
            },
            randomPool8={
                {100},
                {30,70},
                {{"troops_a10094",1},{"props_p835",3}},
            },
        },
        clientReward={  --前端翻牌显示
            [1]={
                o={{a10093=1,index=1}},p={{p835=3,index=2}}
            },
            [2]={
                o={{a10093=1,index=1}},p={{p835=3,index=2}}
            },
            [3]={
                o={{a10093=1,index=1}},p={{p835=3,index=2}}
            },
            [4]={
                o={{a10093=1,index=1}},p={{p835=3,index=2}}
            },
            [5]={
                o={{a10094=1,index=1}},p={{p835=3,index=2}}
            },
            [6]={
                o={{a10094=1,index=1}},p={{p835=3,index=2}}
            },
            [7]={
                o={{a10094=1,index=1}},p={{p835=3,index=2}}
            },
            [8]={
                o={{a10094=1,index=1}},p={{p835=3,index=2}}
            },
        },
    },
    [7]={
        --国王级战列舰
        
        version=7,
        sortId=200,
        type=1,
        acIcon="IconTank_10124.png",
        
        cost1=58,  --单抽所需金币
        cost2=522,  --十倍奖励所需金币
        
        value=0.8,  --已激活改造折扣
        
        luckyReward={serverreward={troops_a10124=5},reward={o={{a10124=5}}}},  --幸运大奖
        
        report={
            a10124='{"ocean":[1,1,3],"h":[{},{}],"p":[["PLAYER1",64,1,1000],["PLAYER2",73,0,1000]],"d":[["27992-297"],["211702-9-0L","211702-368-0L"],["102192-285-l0"],["2520-285-l0"],["203148-0","203148-279-0L"],["77477-276-l0"],["77477-267"],["190318-195-0L"],["54151-260-l0"],["185328-114-0L"],["31658-257-l0"],["183190-33-0L"],["9164-255-l0"],["181764-0"]],"t":[[["a10035",100],["a10035",460],{},{},{},{}],[["a10124",300],{},{},{},{},{}]],"r":1}'
        },  --坦克预览的战报
        
        nextRequire={"troops_a10123","troops_a10124",""},  --翻下一张牌的条件
        
        serverreward={  --8个奖池
            randomPool1={
                {100},
                {85,15},
                {{"troops_a10123",1},{"props_p837",3}},
            },
            randomPool2={
                {100},
                {71,25},
                {{"troops_a10123",1},{"props_p837",3}},
            },
            randomPool3={
                {100},
                {57,40},
                {{"troops_a10123",1},{"props_p837",3}},
            },
            randomPool4={
                {100},
                {48,50},
                {{"troops_a10123",1},{"props_p837",3}},
            },
            randomPool5={
                {100},
                {37,55},
                {{"troops_a10124",1},{"props_p837",3}},
            },
            randomPool6={
                {100},
                {40,60},
                {{"troops_a10124",1},{"props_p837",3}},
            },
            randomPool7={
                {100},
                {34,66},
                {{"troops_a10124",1},{"props_p837",3}},
            },
            randomPool8={
                {100},
                {30,70},
                {{"troops_a10124",1},{"props_p837",3}},
            },
        },
        clientReward={  --前端翻牌显示
            [1]={
                o={{a10123=1,index=1}},p={{p837=3,index=2}}
            },
            [2]={
                o={{a10123=1,index=1}},p={{p837=3,index=2}}
            },
            [3]={
                o={{a10123=1,index=1}},p={{p837=3,index=2}}
            },
            [4]={
                o={{a10123=1,index=1}},p={{p837=3,index=2}}
            },
            [5]={
                o={{a10124=1,index=1}},p={{p837=3,index=2}}
            },
            [6]={
                o={{a10124=1,index=1}},p={{p837=3,index=2}}
            },
            [7]={
                o={{a10124=1,index=1}},p={{p837=3,index=2}}
            },
            [8]={
                o={{a10124=1,index=1}},p={{p837=3,index=2}}
            },
        },
    },
    [8]={
        --库兹涅佐夫级航空母舰
        
        version=8,
        sortId=200,
        type=1,
        acIcon="SandstormIcon.png",
        
        cost1=58,  --单抽所需金币
        cost2=522,  --十倍奖励所需金币
        
        value=0.8,  --已激活改造折扣
        
        luckyReward={serverreward={troops_a10083=5},reward={o={{a10083=5}}}},  --幸运大奖
        
        report={
            a10083='{"ocean":[1,1,2],"h":[{},{}],"d":[["800-70"],["38500-0","38500-16-0E","38500-0","38500-0","38500-0","38500-0"],["16000-67"],["16000-64"],["21120-12-0e","21120-8-0E","7604-6-0e","7604-5-0E","2738-4-0e","2738-3-0E"],["3000-63"],["20790-0"]],"t":[[["a10043",1],["a10044",24],["a10043",1],["a10043",1],["a10043",1],["a10043",1]],[{},{},{},["a10083",70],{},{}]],"p":[["PLAYER1",6,1,1000],["PLAYER2",60,0,1000]],"r":1}'
        },  --坦克预览的战报
        
        nextRequire={"troops_a10082","troops_a10083",""},  --翻下一张牌的条件
        
        serverreward={  --8个奖池
            randomPool1={
                {100},
                {85,15},
                {{"troops_a10082",1},{"props_p414",3}},
            },
            randomPool2={
                {100},
                {73,25},
                {{"troops_a10082",1},{"props_p414",3}},
            },
            randomPool3={
                {100},
                {55,40},
                {{"troops_a10082",1},{"props_p414",3}},
            },
            randomPool4={
                {100},
                {50,50},
                {{"troops_a10082",1},{"props_p414",3}},
            },
            randomPool5={
                {100},
                {45,55},
                {{"troops_a10083",1},{"props_p414",3}},
            },
            randomPool6={
                {100},
                {40,60},
                {{"troops_a10083",1},{"props_p414",3}},
            },
            randomPool7={
                {100},
                {34,66},
                {{"troops_a10083",1},{"props_p414",3}},
            },
            randomPool8={
                {100},
                {30,70},
                {{"troops_a10083",1},{"props_p414",3}},
            },
        },
        clientReward={  --前端翻牌显示
            [1]={
                o={{a10082=1,index=1}},p={{p414=3,index=2}}
            },
            [2]={
                o={{a10082=1,index=1}},p={{p414=3,index=2}}
            },
            [3]={
                o={{a10082=1,index=1}},p={{p414=3,index=2}}
            },
            [4]={
                o={{a10082=1,index=1}},p={{p414=3,index=2}}
            },
            [5]={
                o={{a10083=1,index=1}},p={{p414=3,index=2}}
            },
            [6]={
                o={{a10083=1,index=1}},p={{p414=3,index=2}}
            },
            [7]={
                o={{a10083=1,index=1}},p={{p414=3,index=2}}
            },
            [8]={
                o={{a10083=1,index=1}},p={{p414=3,index=2}}
            },
        },
    },
    [9]={
        --胡蜂级航空母舰
        
        version=9,
        sortId=200,
        type=1,
        acIcon="SandstormIcon.png",
        
        cost1=58,  --单抽所需金币
        cost2=522,  --十倍奖励所需金币
        
        value=0.8,  --已激活改造折扣
        
        luckyReward={serverreward={troops_a20154=5},reward={o={{a20154=5}}}},  --幸运大奖
        
        report={
            a20154='{"ocean":[1,1,4],"h":[{},{}],"d":[["204188-745","204188-745","204188-745"],["295597-371-0O","236477-340-0O","591194-269-1O"],["159675-702","159675-702","159675-702"],["557070-127-1O","222828-283-0O","557070-50-1O"],["42694-691"],["548342-0-1","292449-208-0O","731122-0-1"],["97684-676","97684-676","97684-664"],["381467-110"],["381467-12"],["374696-0"]],"t":[[["a10035",500],["a10005",400],["a10025",500],{},{},{}],[["a20154",800],["a20154",800],["a20154",800],{},{},{}]],"p":[["PLAYER2",70,1,1000],["PLAYER1",70,0,1000]],"r":1}'
        },  --坦克预览的战报
        
        nextRequire={"troops_a20153","troops_a20154",""},  --翻下一张牌的条件
        
        serverreward={  --8个奖池
            randomPool1={
                {100},
                {85,15},
                {{"troops_a20153",1},{"props_p875",3}},
            },
            randomPool2={
                {100},
                {70,30},
                {{"troops_a20153",1},{"props_p875",3}},
            },
            randomPool3={
                {100},
                {55,45},
                {{"troops_a20153",1},{"props_p875",3}},
            },
            randomPool4={
                {100},
                {50,50},
                {{"troops_a20153",1},{"props_p875",3}},
            },
            randomPool5={
                {100},
                {45,55},
                {{"troops_a20154",1},{"props_p875",3}},
            },
            randomPool6={
                {100},
                {40,60},
                {{"troops_a20154",1},{"props_p875",3}},
            },
            randomPool7={
                {100},
                {34,66},
                {{"troops_a20154",1},{"props_p875",3}},
            },
            randomPool8={
                {100},
                {30,70},
                {{"troops_a20154",1},{"props_p875",3}},
            },
        },
        clientReward={  --前端翻牌显示
            [1]={
                o={{a20153=1,index=1}},p={{p875=3,index=2}}
            },
            [2]={
                o={{a20153=1,index=1}},p={{p875=3,index=2}}
            },
            [3]={
                o={{a20153=1,index=1}},p={{p875=3,index=2}}
            },
            [4]={
                o={{a20153=1,index=1}},p={{p875=3,index=2}}
            },
            [5]={
                o={{a20154=1,index=1}},p={{p875=3,index=2}}
            },
            [6]={
                o={{a20154=1,index=1}},p={{p875=3,index=2}}
            },
            [7]={
                o={{a20154=1,index=1}},p={{p875=3,index=2}}
            },
            [8]={
                o={{a20154=1,index=1}},p={{p875=3,index=2}}
            },
        },
    },
}

return luckcard
