local olympic={
    multiSelectType=true,
    [1]={ --奥运五环 -- 4/5/5.5 全军舰大放送 嘉年华升级版本
        type=1,
        sortId=200,
        version=1,
        
        cost=48,    --单抽所需金币
        value=0.9,    --十倍模式折扣
        
        scoreLimit=13,    --公告分数限制
        line={1,2,3,4,5},     --五环位置和颜色
        point={3,2,1},     --3种情况对应分数
        score={9,10,11,12,13,15},     --总共能出现的分数情况
        
        reward={     --分数对应的奖励
            {p={{p4012=1,index=1}}},
            {p={{p4012=3,index=1}}},
            {p={{p4012=5,index=1}}},
            {p={{p4013=10,index=1}}},
            {p={{p4013=25,index=1}}},
            {p={{p4013=65,index=1}}},
        },
        serverreward={
            pool={   --颜色库
                {100},
                {1,1,1,1,1,1},
                {{1,1},{2,2},{3,3},{4,4},{5,5},{6,6}},
            },
            pool9={
                {100},
                {11,11,10,9},
                {{"troops_a10005",1},{"troops_a10015",1},{"troops_a10025",1},{"troops_a10035",1}},
            },
            pool10={
                {100},
                {11,11,10,9},
                {{"troops_a10005",3},{"troops_a10015",3},{"troops_a10025",3},{"troops_a10035",3}},
            },
            pool11={
                {100},
                {13,10,8,7},
                {{"troops_a10005",5},{"troops_a10015",5},{"troops_a10025",5},{"troops_a10035",5}},
            },
            pool12={
                {100},
                {9,6,6,13,8,11,10,8},
                {{"troops_a10073",10},{"troops_a10123",10},{"troops_a10093",10},{"troops_a10053",10},{"troops_a10113",10},{"troops_a10043",10},{"troops_a10063",10},{"troops_a10082",10}},
            },
            pool13={
                {100},
                {9,6,6,13,8,11,10,8},
                {{"troops_a10073",25},{"troops_a10123",25},{"troops_a10093",25},{"troops_a10053",25},{"troops_a10113",25},{"troops_a10043",25},{"troops_a10063",25},{"troops_a10082",25}},
            },
            pool14={
                {100},
                {9,12,12,7,9,12,6,12},
                {{"troops_a10073",20},{"troops_a10123",20},{"troops_a10093",20},{"troops_a10053",20},{"troops_a10113",20},{"troops_a10043",20},{"troops_a10063",20},{"troops_a10082",20}},
            },
            pool15={
                {100},
                {9,6,6,13,8,11,10,8},
                {{"troops_a10073",65},{"troops_a10123",65},{"troops_a10093",65},{"troops_a10053",65},{"troops_a10113",65},{"troops_a10043",65},{"troops_a10063",65},{"troops_a10082",65}},
            },
        },
    },
}

return olympic
