-- 疯狂抢购
local orgiasticday ={
    multiSelectType = true ,
    [1] = {
        type=1,
        sortId=301,
        version=1,
        timeShow={9,21}, -- 开放的整点段
        refreshTime=120,  --单位（分钟）
        serverreward={
        shopItems={
                --(bn:购买数量限制 p:原价 g:购买价格 秒杀商店    商店1   基础
                i1={bn=5,p=560,g=168,r={p={p49=1}},sr={props_p49=1}},
                i2={bn=10,p=420,g=126,r={p={p5=2}},sr={props_p5=2}},
                i3={bn=10,p=140,g=42,r={p={p15=5}},sr={props_p15=5}},
                i4={bn=10,p=190,g=57,r={p={p11=5}},sr={props_p11=5}},
                i5={bn=10,p=190,g=57,r={p={p12=5}},sr={props_p12=5}},
                i6={bn=5,p=98,g=30,r={p={p16=1}},sr={props_p16=1}},
                i7={bn=10,p=90,g=27,r={p={p13=5}},sr={props_p13=5}},
                i8={bn=10,p=2000,g=600,r={p={p401=1}},sr={props_p401=1}},
                i9={bn=10,p=2000,g=600,r={p={p402=1}},sr={props_p402=1}},
                i10={bn=10,p=2000,g=600,r={p={p403=1}},sr={props_p403=1}},
                i11={bn=10,p=2000,g=600,r={p={p404=1}},sr={props_p404=1}},
                i12={bn=3,p=480,g=144,r={p={p1=1}},sr={props_p1=1}},
           },
        buyShop={
                -- 打折商店    商店1   基础
                i1={bn=100,p=480,g=240,r={p={p1=1}},sr={props_p1=1}},
                i2={bn=100,p=560,g=280,r={p={p49=1}},sr={props_p49=1}},
                i3={bn=100,p=210,g=105,r={p={p5=1}},sr={props_p5=1}},
                i4={bn=100,p=28,g=14,r={p={p15=1}},sr={props_p15=1}},
                i5={bn=100,p=98,g=49,r={p={p16=1}},sr={props_p16=1}},
                i6={bn=100,p=500,g=250,r={p={p397=1}},sr={props_p397=1}},
                i7={bn=100,p=500,g=250,r={p={p398=1}},sr={props_p398=1}},
                i8={bn=100,p=500,g=250,r={p={p399=1}},sr={props_p399=1}},
                i9={bn=100,p=500,g=250,r={p={p400=1}},sr={props_p400=1}},
                i10={bn=100,p=480,g=240,r={p={p3404=1}},sr={props_p3404=1}},
                i11={bn=100,p=480,g=240,r={p={p3409=1}},sr={props_p3409=1}},
                i12={bn=100,p=480,g=240,r={p={p3414=1}},sr={props_p3414=1}},
                i13={bn=100,p=50,g=25,r={p={p3431=1}},sr={props_p3431=1}},
           },
        },
    },
    [2] = {
        type=1,
        sortId=301,
        version=2,
        timeShow={9,21}, -- 开放的整点段
        refreshTime=120,  --单位（分钟）
        serverreward={
        shopItems={
                --(bn:购买数量限制 p:原价 g:购买价格 秒杀商店    商店1   配件
                i1={bn=3,p=5000,g=1500,r={p={p90=1}},sr={props_p90=1}},
                i2={bn=2,p=12000,g=3600,r={p={p270=1}},sr={props_p270=1}},
                i3={bn=5,p=1100,g=330,r={p={p267=1}},sr={props_p267=1}},
                i4={bn=5,p=4000,g=1200,r={e={p3=1000}},sr={accessory_p3=1000}},
                i5={bn=5,p=4000,g=1200,r={e={p2=200}},sr={accessory_p2=200}},
                i6={bn=5,p=4000,g=1200,r={e={p1=100}},sr={accessory_p1=100}},
                i7={bn=5,p=1600,g=480,r={e={p4=20000}},sr={accessory_p4=20000}},
                i8={bn=5,p=1250,g=375,r={p={p867=1}},sr={props_p867=1}},
                i9={bn=5,p=1000,g=300,r={p={p868=1}},sr={props_p868=1}},
                i10={bn=5,p=2000,g=600,r={p={p870=1}},sr={props_p870=1}},
                i11={bn=5,p=2200,g=660,r={p={p871=1}},sr={props_p871=1}},
                i12={bn=3,p=5000,g=1500,r={p={p872=1}},sr={props_p872=1}},
           },
        buyShop={
                -- 打折商店    商店1   配件
                i1={bn=20,p=5000,g=2500,r={p={p90=1}},sr={props_p90=1}},
                i2={bn=10,p=12000,g=6000,r={p={p270=1}},sr={props_p270=1}},
                i3={bn=200,p=200,g=100,r={e={p3=50}},sr={accessory_p3=50}},
                i4={bn=200,p=200,g=100,r={e={p2=10}},sr={accessory_p2=10}},
                i5={bn=200,p=200,g=100,r={e={p1=5}},sr={accessory_p1=5}},
                i6={bn=20,p=240,g=120,r={e={p4=3000}},sr={accessory_p4=3000}},
                i7={bn=100,p=100,g=50,r={p={p278=1}},sr={props_p278=1}},
                i8={bn=100,p=100,g=50,r={p={p279=5}},sr={props_p279=5}},
                i9={bn=50,p=1250,g=625,r={p={p867=1}},sr={props_p867=1}},
                i10={bn=50,p=1000,g=500,r={p={p868=1}},sr={props_p868=1}},
                i11={bn=50,p=2000,g=1000,r={p={p870=1}},sr={props_p870=1}},
                i12={bn=50,p=2200,g=1100,r={p={p871=1}},sr={props_p871=1}},
                i13={bn=30,p=5000,g=2500,r={p={p872=1}},sr={props_p872=1}},
           },
        },
    },
    [3] = {
        type=1,
        sortId=301,
        version=3,
        timeShow={9,21}, -- 开放的整点段
        refreshTime=120,  --单位（分钟）
        serverreward={
        shopItems={
                --(bn:购买数量限制 p:原价 g:购买价格 秒杀商店    商店1   基础
                i1={bn=5,p=5000,g=1500,r={o={a20154=50}},sr={troops_a20154=50}},
                i2={bn=5,p=5000,g=1500,r={o={a10083=50}},sr={troops_a10083=50}},
                i3={bn=5,p=3750,g=1125,r={o={a10124=50}},sr={troops_a10124=50}},
                i4={bn=5,p=3750,g=1125,r={o={a10074=50}},sr={troops_a10074=50}},
                i5={bn=5,p=3500,g=1050,r={o={a10064=50}},sr={troops_a10064=50}},
                i6={bn=5,p=3500,g=1050,r={o={a10044=50}},sr={troops_a10044=50}},
                i7={bn=5,p=3250,g=975,r={o={a10054=50}},sr={troops_a10054=50}},
                i8={bn=5,p=3250,g=975,r={o={a10114=50}},sr={troops_a10114=50}},
                i9={bn=5,p=3400,g=1020,r={o={a20153=50}},sr={troops_a20153=50}},
                i10={bn=5,p=3400,g=1020,r={o={a10082=50}},sr={troops_a10082=50}},
                i11={bn=5,p=3000,g=900,r={o={a10123=50}},sr={troops_a10123=50}},
                i12={bn=5,p=2750,g=825,r={o={a10063=50}},sr={troops_a10063=50}},
           },
        buyShop={
                -- 打折商店    商店1   战舰
                i1={bn=40,p=1000,g=500,r={o={a20154=10}},sr={troops_a20154=10}},
                i2={bn=40,p=1000,g=500,r={o={a10083=10}},sr={troops_a10083=10}},
                i3={bn=80,p=750,g=375,r={o={a10124=10}},sr={troops_a10124=10}},
                i4={bn=80,p=750,g=375,r={o={a10074=10}},sr={troops_a10074=10}},
                i5={bn=100,p=700,g=350,r={o={a10064=10}},sr={troops_a10064=10}},
                i6={bn=100,p=700,g=350,r={o={a10044=10}},sr={troops_a10044=10}},
                i7={bn=100,p=650,g=325,r={o={a10054=10}},sr={troops_a10054=10}},
                i8={bn=100,p=650,g=325,r={o={a10114=10}},sr={troops_a10114=10}},
                i9={bn=100,p=680,g=340,r={o={a20153=10}},sr={troops_a20153=10}},
                i10={bn=100,p=680,g=340,r={o={a10082=10}},sr={troops_a10082=10}},
                i11={bn=100,p=600,g=300,r={o={a10123=10}},sr={troops_a10123=10}},
                i12={bn=100,p=550,g=275,r={o={a10063=10}},sr={troops_a10063=10}},
           },
        },
    },
    [4] = {
        type=1,
        sortId=301,
        version=4,
        timeShow={9,21}, -- 开放的整点段
        refreshTime=120,  --单位（分钟）
        serverreward={
        shopItems={
                --(bn:购买数量限制 p:原价 g:购买价格 秒杀商店    商店1   基础
                i1={bn=5,p=640,g=192,r={p={p601=80}},sr={props_p601=80}},
                i2={bn=5,p=3000,g=900,r={h={s103=30}},sr={hero_s103=30}},
                i3={bn=5,p=3000,g=900,r={h={s108=30}},sr={hero_s108=30}},
                i4={bn=5,p=2940,g=882,r={h={s26=30}},sr={hero_s26=30}},
                i5={bn=5,p=2940,g=882,r={h={s25=30}},sr={hero_s25=30}},
                i6={bn=5,p=2940,g=882,r={h={s13=30}},sr={hero_s13=30}},
                i7={bn=5,p=2940,g=882,r={h={s32=30}},sr={hero_s32=30}},
                i8={bn=5,p=2940,g=882,r={h={s6=30}},sr={hero_s6=30}},
                i9={bn=5,p=2940,g=882,r={h={s7=30}},sr={hero_s7=30}},
                i10={bn=5,p=2940,g=882,r={h={s16=30}},sr={hero_s16=30}},
                i11={bn=5,p=2940,g=882,r={h={s15=30}},sr={hero_s15=30}},
                i12={bn=5,p=1140,g=342,r={h={s27=30}},sr={hero_s27=30}},
           },
        buyShop={
                -- 打折商店    商店1   将领
                i1={bn=100,p=400,g=200,r={p={p601=50}},sr={props_p601=50}},
                i2={bn=50,p=100,g=50,r={p={p606=10}},sr={props_p606=10}},
                i3={bn=50,p=210,g=105,r={p={p607=10}},sr={props_p607=10}},
                i4={bn=10,p=1000,g=500,r={h={s103=10}},sr={hero_s103=10}},
                i5={bn=10,p=1000,g=500,r={h={s108=10}},sr={hero_s108=10}},
                i6={bn=100,p=490,g=245,r={h={s26=5}},sr={hero_s26=5}},
                i7={bn=100,p=490,g=245,r={h={s25=5}},sr={hero_s25=5}},
                i8={bn=100,p=490,g=245,r={h={s13=5}},sr={hero_s13=5}},
                i9={bn=100,p=490,g=245,r={h={s32=5}},sr={hero_s32=5}},
                i10={bn=100,p=490,g=245,r={h={s6=5}},sr={hero_s6=5}},
                i11={bn=100,p=490,g=245,r={h={s7=5}},sr={hero_s7=5}},
                i12={bn=100,p=490,g=245,r={h={s16=5}},sr={hero_s16=5}},
                i13={bn=100,p=490,g=245,r={h={s15=5}},sr={hero_s15=5}},
                i14={bn=100,p=190,g=95,r={h={s27=5}},sr={hero_s27=5}},
           },
        },
    },
    [5] = {
        type=1,
        sortId=301,
        version=5,
        timeShow={9,21}, -- 开放的整点段
        refreshTime=120,  --单位（分钟）
        serverreward={
        shopItems={
                --(bn:购买数量限制 p:原价 g:购买价格 秒杀商店    商店1   基础
                i1={bn=20,p=1000,g=300,r={p={p472=20}},sr={props_p472=20}},
                i2={bn=20,p=1000,g=300,r={p={p473=20}},sr={props_p473=20}},
                i3={bn=20,p=1000,g=300,r={p={p474=20}},sr={props_p474=20}},
                i4={bn=5,p=1000,g=300,r={p={p475=10}},sr={props_p475=10}},
                i5={bn=5,p=1000,g=300,r={p={p476=10}},sr={props_p476=10}},
                i6={bn=5,p=1000,g=300,r={p={p477=10}},sr={props_p477=10}},
                i7={bn=10,p=1000,g=300,r={p={p454=10}},sr={props_p454=10}},
                i8={bn=10,p=1000,g=300,r={p={p455=10}},sr={props_p455=10}},
                i9={bn=10,p=1000,g=300,r={p={p456=10}},sr={props_p456=10}},
                i10={bn=10,p=1000,g=300,r={p={p457=10}},sr={props_p457=10}},
                i11={bn=5,p=1000,g=300,r={p={p458=5}},sr={props_p458=5}},
                i12={bn=5,p=1200,g=360,r={p={p481=2}},sr={props_p481=2}},
           },
        buyShop={
                -- 打折商店    商店1   将领装备
                i1={bn=300,p=125,g=63,r={p={p469=5}},sr={props_p469=5}},
                i2={bn=300,p=125,g=63,r={p={p470=5}},sr={props_p470=5}},
                i3={bn=300,p=125,g=63,r={p={p471=5}},sr={props_p471=5}},
                i4={bn=300,p=150,g=75,r={p={p472=3}},sr={props_p472=3}},
                i5={bn=300,p=150,g=75,r={p={p473=3}},sr={props_p473=3}},
                i6={bn=300,p=150,g=75,r={p={p474=3}},sr={props_p474=3}},
                i7={bn=300,p=100,g=50,r={p={p451=2}},sr={props_p451=2}},
                i8={bn=300,p=100,g=50,r={p={p452=2}},sr={props_p452=2}},
                i9={bn=300,p=100,g=50,r={p={p453=2}},sr={props_p453=2}},
                i10={bn=300,p=100,g=50,r={p={p454=1}},sr={props_p454=1}},
                i11={bn=300,p=100,g=50,r={p={p455=1}},sr={props_p455=1}},
                i12={bn=300,p=100,g=50,r={p={p456=1}},sr={props_p456=1}},
                i13={bn=300,p=100,g=50,r={p={p457=1}},sr={props_p457=1}},
           },
        },
    },
    [6] = {
        type=1,
        sortId=301,
        version=6,
        timeShow={9,21}, -- 开放的整点段
        refreshTime=120,  --单位（分钟）
        serverreward={
        shopItems={
                --(bn:购买数量限制 p:原价 g:购买价格 秒杀商店    商店1   基础
                i1={bn=5,p=560,g=168,r={p={p49=1}},sr={props_p49=1}},
                i2={bn=10,p=420,g=126,r={p={p5=2}},sr={props_p5=2}},
                i3={bn=10,p=140,g=42,r={p={p15=5}},sr={props_p15=5}},
                i4={bn=10,p=190,g=57,r={p={p11=5}},sr={props_p11=5}},
                i5={bn=10,p=190,g=57,r={p={p12=5}},sr={props_p12=5}},
                i6={bn=5,p=960,g=288,r={p={p3=1}},sr={props_p3=1}},
                i7={bn=5,p=2800,g=840,r={p={p4=1}},sr={props_p4=1}},
                i8={bn=3,p=480,g=144,r={p={p1=1}},sr={props_p1=1}},
                i9={bn=5,p=98,g=30,r={p={p16=1}},sr={props_p16=1}},
           },
        buyShop={
                -- 打折商店    商店1   基础
                i1={bn=100,p=480,g=240,r={p={p1=1}},sr={props_p1=1}},
                i2={bn=100,p=560,g=280,r={p={p49=1}},sr={props_p49=1}},
                i3={bn=100,p=210,g=105,r={p={p5=1}},sr={props_p5=1}},
                i4={bn=100,p=28,g=14,r={p={p15=1}},sr={props_p15=1}},
                i5={bn=100,p=98,g=49,r={p={p16=1}},sr={props_p16=1}},
                i6={bn=100,p=160,g=80,r={p={p32=1}},sr={props_p32=1}},
                i7={bn=100,p=160,g=80,r={p={p33=1}},sr={props_p33=1}},
                i8={bn=100,p=160,g=80,r={p={p34=1}},sr={props_p34=1}},
                i9={bn=100,p=160,g=80,r={p={p35=1}},sr={props_p35=1}},
                i10={bn=100,p=160,g=80,r={p={p36=1}},sr={props_p36=1}},
                i11={bn=100,p=480,g=240,r={p={p3404=1}},sr={props_p3404=1}},
                i12={bn=100,p=480,g=240,r={p={p3409=1}},sr={props_p3409=1}},
                i13={bn=100,p=480,g=240,r={p={p3414=1}},sr={props_p3414=1}},
                i14={bn=100,p=50,g=25,r={p={p3431=1}},sr={props_p3431=1}},
           },
        },
    },
    [7] = {
        type=1,
        sortId=301,
        version=7,
        timeShow={9,21}, -- 开放的整点段
        refreshTime=120,  --单位（分钟）
        serverreward={
        shopItems={
                --(bn:购买数量限制 p:原价 g:购买价格 秒杀商店    商店1   配件
                i1={bn=3,p=5000,g=1500,r={p={p90=1}},sr={props_p90=1}},
                i2={bn=2,p=12000,g=3600,r={p={p270=1}},sr={props_p270=1}},
                i3={bn=5,p=1100,g=330,r={p={p267=1}},sr={props_p267=1}},
                i4={bn=5,p=4000,g=1200,r={e={p3=1000}},sr={accessory_p3=1000}},
                i5={bn=5,p=4000,g=1200,r={e={p2=200}},sr={accessory_p2=200}},
                i6={bn=5,p=4000,g=1200,r={e={p1=100}},sr={accessory_p1=100}},
                i7={bn=5,p=1600,g=480,r={e={p4=20000}},sr={accessory_p4=20000}},
                i8={bn=5,p=1250,g=375,r={p={p867=1}},sr={props_p867=1}},
                i9={bn=5,p=1000,g=300,r={p={p868=1}},sr={props_p868=1}},
                i10={bn=5,p=2000,g=600,r={p={p870=1}},sr={props_p870=1}},
                i11={bn=5,p=2200,g=660,r={p={p871=1}},sr={props_p871=1}},
                i12={bn=3,p=5000,g=1500,r={p={p872=1}},sr={props_p872=1}},
           },
        buyShop={
                -- 打折商店    商店1   配件
                i1={bn=20,p=5000,g=2500,r={p={p90=1}},sr={props_p90=1}},
                i2={bn=10,p=12000,g=6000,r={p={p270=1}},sr={props_p270=1}},
                i3={bn=100,p=400,g=200,r={e={p3=100}},sr={accessory_p3=100}},
                i4={bn=100,p=400,g=200,r={e={p2=20}},sr={accessory_p2=20}},
                i5={bn=100,p=400,g=200,r={e={p1=10}},sr={accessory_p1=10}},
                i6={bn=20,p=240,g=120,r={e={p4=3000}},sr={accessory_p4=3000}},
                i7={bn=100,p=100,g=50,r={p={p278=1}},sr={props_p278=1}},
                i8={bn=100,p=100,g=50,r={p={p279=5}},sr={props_p279=5}},
                i9={bn=50,p=1250,g=625,r={p={p867=1}},sr={props_p867=1}},
                i10={bn=50,p=1000,g=500,r={p={p868=1}},sr={props_p868=1}},
                i11={bn=50,p=2000,g=1000,r={p={p870=1}},sr={props_p870=1}},
                i12={bn=50,p=2200,g=1100,r={p={p871=1}},sr={props_p871=1}},
                i13={bn=50,p=5000,g=2500,r={p={p872=1}},sr={props_p872=1}},
           },
        },
    },
    [8] = {
        type=1,
        sortId=301,
        version=8,
        timeShow={9,21}, -- 开放的整点段
        refreshTime=120,  --单位（分钟）
        serverreward={
        shopItems={
                --(bn:购买数量限制 p:原价 g:购买价格 秒杀商店    商店1   基础
                i1={bn=5,p=3750,g=1125,r={o={a10124=50}},sr={troops_a10124=50}},
                i2={bn=5,p=3750,g=1125,r={o={a10074=50}},sr={troops_a10074=50}},
                i3={bn=5,p=3500,g=1050,r={o={a10064=50}},sr={troops_a10064=50}},
                i4={bn=5,p=3500,g=1050,r={o={a10044=50}},sr={troops_a10044=50}},
                i5={bn=5,p=3250,g=975,r={o={a10054=50}},sr={troops_a10054=50}},
                i6={bn=5,p=3250,g=975,r={o={a10114=50}},sr={troops_a10114=50}},
                i7={bn=5,p=3400,g=1020,r={o={a10082=50}},sr={troops_a10082=50}},
                i8={bn=5,p=3000,g=900,r={o={a10123=50}},sr={troops_a10123=50}},
                i9={bn=5,p=2750,g=825,r={o={a10063=50}},sr={troops_a10063=50}},
           },
        buyShop={
                -- 打折商店    商店1   
                i1={bn=80,p=750,g=375,r={o={a10124=10}},sr={troops_a10124=10}},
                i2={bn=80,p=750,g=375,r={o={a10074=10}},sr={troops_a10074=10}},
                i3={bn=100,p=700,g=350,r={o={a10064=10}},sr={troops_a10064=10}},
                i4={bn=100,p=700,g=350,r={o={a10044=10}},sr={troops_a10044=10}},
                i5={bn=100,p=650,g=325,r={o={a10054=10}},sr={troops_a10054=10}},
                i6={bn=100,p=650,g=325,r={o={a10114=10}},sr={troops_a10114=10}},
                i7={bn=80,p=680,g=340,r={o={a10082=10}},sr={troops_a10082=10}},
                i8={bn=100,p=600,g=300,r={o={a10123=10}},sr={troops_a10123=10}},
                i9={bn=100,p=550,g=275,r={o={a10063=10}},sr={troops_a10063=10}},
           },
        },
    },
    [9] = {
        type=1,
        sortId=301,
        version=9,
        timeShow={9,21}, -- 开放的整点段
        refreshTime=120,  --单位（分钟）
        serverreward={
        shopItems={
                --(bn:购买数量限制 p:原价 g:购买价格 秒杀商店    商店1   基础
                i1={bn=5,p=640,g=192,r={p={p601=80}},sr={props_p601=80}},
                i2={bn=5,p=4000,g=1200,r={h={s103=40}},sr={hero_s103=40}},
                i3={bn=5,p=4000,g=1200,r={h={s108=40}},sr={hero_s108=40}},
                i4={bn=5,p=2940,g=882,r={h={s7=30}},sr={hero_s7=30}},
                i5={bn=5,p=1140,g=342,r={h={s11=30}},sr={hero_s11=30}},
                i6={bn=5,p=2940,g=882,r={h={s13=30}},sr={hero_s13=30}},
                i7={bn=5,p=2940,g=882,r={h={s16=30}},sr={hero_s16=30}},
                i8={bn=5,p=1140,g=342,r={h={s19=30}},sr={hero_s19=30}},
                i9={bn=5,p=1140,g=342,r={h={s20=30}},sr={hero_s20=30}},
                i10={bn=5,p=1140,g=342,r={h={s21=30}},sr={hero_s21=30}},
                i11={bn=5,p=1140,g=342,r={h={s27=30}},sr={hero_s27=30}},
                i12={bn=5,p=2940,g=882,r={h={s32=30}},sr={hero_s32=30}},
           },
        buyShop={
                -- 打折商店    商店1   将领
                i1={bn=100,p=400,g=200,r={p={p601=50}},sr={props_p601=50}},
                i2={bn=10,p=490,g=245,r={h={s26=5}},sr={hero_s26=5}},
                i3={bn=10,p=490,g=245,r={h={s25=5}},sr={hero_s25=5}},
                i4={bn=100,p=490,g=245,r={h={s7=5}},sr={hero_s7=5}},
                i5={bn=100,p=190,g=95,r={h={s11=5}},sr={hero_s11=5}},
                i6={bn=100,p=490,g=245,r={h={s13=5}},sr={hero_s13=5}},
                i7={bn=100,p=490,g=245,r={h={s16=5}},sr={hero_s16=5}},
                i8={bn=100,p=190,g=95,r={h={s19=5}},sr={hero_s19=5}},
                i9={bn=100,p=190,g=95,r={h={s20=5}},sr={hero_s20=5}},
                i10={bn=100,p=190,g=95,r={h={s21=5}},sr={hero_s21=5}},
                i11={bn=100,p=190,g=95,r={h={s27=5}},sr={hero_s27=5}},
                i12={bn=100,p=490,g=245,r={h={s32=5}},sr={hero_s32=5}},
           },
        },
    },
    [10] = {
        type=1,
        sortId=301,
        version=10,
        timeShow={9,21}, -- 开放的整点段
        refreshTime=120,  --单位（分钟）
        serverreward={
        shopItems={
                --(bn:购买数量限制 p:原价 g:购买价格 秒杀商店    商店1   基础
                i1={bn=20,p=1000,g=300,r={p={p469=40}},sr={props_p469=40}},
                i2={bn=20,p=1000,g=300,r={p={p470=40}},sr={props_p470=40}},
                i3={bn=20,p=1000,g=300,r={p={p471=40}},sr={props_p471=40}},
                i4={bn=10,p=1000,g=300,r={p={p472=20}},sr={props_p472=20}},
                i5={bn=10,p=1000,g=300,r={p={p473=20}},sr={props_p473=20}},
                i6={bn=10,p=1000,g=300,r={p={p474=20}},sr={props_p474=20}},
                i7={bn=10,p=1000,g=300,r={p={p451=20}},sr={props_p451=20}},
                i8={bn=10,p=1000,g=300,r={p={p452=20}},sr={props_p452=20}},
                i9={bn=10,p=1000,g=300,r={p={p453=20}},sr={props_p453=20}},
                i10={bn=5,p=1000,g=300,r={p={p454=10}},sr={props_p454=10}},
                i11={bn=5,p=1000,g=300,r={p={p455=10}},sr={props_p455=10}},
                i12={bn=5,p=1000,g=300,r={p={p456=10}},sr={props_p456=10}},
                i13={bn=5,p=1000,g=300,r={p={p457=10}},sr={props_p457=10}},
                i14={bn=10,p=600,g=180,r={p={p933=20}},sr={props_p933=20}},
                i15={bn=5,p=1200,g=360,r={p={p481=2}},sr={props_p481=2}},
           },
        buyShop={
                -- 打折商店    商店1   将领装备
                i1={bn=200,p=125,g=63,r={p={p469=5}},sr={props_p469=5}},
                i2={bn=200,p=125,g=63,r={p={p470=5}},sr={props_p470=5}},
                i3={bn=200,p=125,g=63,r={p={p471=5}},sr={props_p471=5}},
                i4={bn=200,p=150,g=75,r={p={p472=3}},sr={props_p472=3}},
                i5={bn=200,p=150,g=75,r={p={p473=3}},sr={props_p473=3}},
                i6={bn=200,p=150,g=75,r={p={p474=3}},sr={props_p474=3}},
                i7={bn=200,p=100,g=50,r={p={p451=2}},sr={props_p451=2}},
                i8={bn=200,p=100,g=50,r={p={p452=2}},sr={props_p452=2}},
                i9={bn=200,p=100,g=50,r={p={p453=2}},sr={props_p453=2}},
                i10={bn=200,p=100,g=50,r={p={p454=1}},sr={props_p454=1}},
                i11={bn=200,p=100,g=50,r={p={p455=1}},sr={props_p455=1}},
                i12={bn=200,p=100,g=50,r={p={p456=1}},sr={props_p456=1}},
                i13={bn=200,p=100,g=50,r={p={p457=1}},sr={props_p457=1}},
           },
        },
    },
}
return orgiasticday
