local seikoStoneShop ={ -- 2016.3.1 精工石商店
    multiSelectType=true,
    [1]={
        type=1,
        sortId=440,
        version=0,
        buyitem="p933",
        props={
             -- 常规显示的折扣型道具
            i1={{p={{p481=1}}},{props_p481=1},15,1,"",5},
            i2={{p={{p482=1}}},{props_p482=1},30,2,"",1},
            i3={{p={{p483=1}}},{props_p483=1},30,3,"",1},
            i4={{p={{p484=1}}},{props_p484=1},30,4,"",1},
            i5={{p={{p485=1}}},{props_p485=1},30,5,"",1},
            i6={{p={{p486=1}}},{props_p486=1},30,6,"",1},
            i7={{p={{p487=1}}},{props_p487=1},30,7,"",1},
             -- 有显示开关的英雄专属道具
             -- 克鲁尔 的专属道具 --> 权威权杖
            i9={{p={{p488=1}}},{props_p488=1},500,9,"h1",1},
             -- 伯莱提克 的专属道具 --> 闪击权杖
            i10={{p={{p490=1}}},{props_p490=1},500,10,"h3",1},
             -- 珀瑟尔 的专属道具 --> 英雄指挥刀
            i11={{p={{p492=1}}},{props_p492=1},500,11,"h13",1},
             -- 寇克斯文 的专属道具 --> 血胆配剑
            i12={{p={{p495=1}}},{props_p495=1},500,12,"h24",1},
             -- 艾伯西曼 的专属道具 --> 改革配剑
            i13={{p={{p497=1}}},{props_p497=1},500,13,"h26",1},
             -- 安特普瑞思 的专属道具 --> 统帅指挥刀
            i14={{p={{p937=1}}},{props_p937=1},600,14,"h101",1},
             -- 斯多姆 的专属道具 --> 扩充权杖
            i15={{p={{p938=1}}},{props_p938=1},600,15,"h102",1},
             -- 赛琳斯塔芙 的专属道具 --> 亲和佩剑
            i16={{p={{p939=1}}},{props_p939=1},600,16,"h103",1},
             -- 安吉妮 的专属道具 --> 决策指挥刀
            i17={{p={{p940=1}}},{props_p940=1},600,17,"h104",1},
             -- 瑟莫弗 的专属道具 --> 睿智指挥刀
            i18={{p={{p941=1}}},{props_p941=1},600,18,"h105",1},
             -- 艾薇瑞克斯 的专属道具 --> 铁血权杖
            i19={{p={{p942=1}}},{props_p942=1},600,19,"h106",1},
             -- 艾恩克兰德 的专属道具 --> 刚毅佩剑
            i20={{p={{p943=1}}},{props_p943=1},600,20,"h107",1},
             -- 格莱法 的专属道具 --> 激进指挥刀
            i21={{p={{p944=1}}},{props_p944=1},600,21,"h108",1},
             -- 比格提彻尔 的专属道具 --> 统领权杖
            i22={{p={{p945=1}}},{props_p945=1},600,22,"h109",1},
             -- 阿特尔雷 的专属道具 --> 机警佩剑
            i23={{p={{p946=1}}},{props_p946=1},600,23,"h110",1},
        },
    },
    [2]={
        type=1,
        sortId=440,
        version=1,
        buyitem="p933",
        props={
             -- 常规显示的折扣型道具
            i1={{p={{p481=1}}},{props_p481=1},15,1,"",5},
            i2={{p={{p482=1}}},{props_p482=1},30,2,"",1},
            i3={{p={{p483=1}}},{props_p483=1},30,3,"",1},
            i4={{p={{p484=1}}},{props_p484=1},30,4,"",1},
            i5={{p={{p485=1}}},{props_p485=1},30,5,"",1},
            i6={{p={{p486=1}}},{props_p486=1},30,6,"",1},
            i7={{p={{p487=1}}},{props_p487=1},30,7,"",1},
             -- 有显示开关的英雄专属道具
             -- 克鲁尔 的专属道具 --> 权威权杖
            i9={{p={{p488=1}}},{props_p488=1},500,9,"h1",1},
             -- 伯莱提克 的专属道具 --> 闪击权杖
            i10={{p={{p490=1}}},{props_p490=1},500,10,"h3",1},
             -- 珀瑟尔 的专属道具 --> 英雄指挥刀
            i11={{p={{p492=1}}},{props_p492=1},500,11,"h13",1},
             -- 寇克斯文 的专属道具 --> 血胆配剑
            i12={{p={{p495=1}}},{props_p495=1},500,12,"h24",1},
             -- 艾伯西曼 的专属道具 --> 改革配剑
            i13={{p={{p497=1}}},{props_p497=1},500,13,"h26",1},
             -- 安特普瑞思 的专属道具 --> 统帅指挥刀
            i14={{p={{p937=1}}},{props_p937=1},600,14,"h101",1},
             -- 斯多姆 的专属道具 --> 扩充权杖
            i15={{p={{p938=1}}},{props_p938=1},600,15,"h102",1},
             -- 赛琳斯塔芙 的专属道具 --> 亲和佩剑
            i16={{p={{p939=1}}},{props_p939=1},600,16,"h103",1},
             -- 安吉妮 的专属道具 --> 决策指挥刀
            i17={{p={{p940=1}}},{props_p940=1},600,17,"h104",1},
             -- 瑟莫弗 的专属道具 --> 睿智指挥刀
            i18={{p={{p941=1}}},{props_p941=1},600,18,"h105",1},
             -- 艾薇瑞克斯 的专属道具 --> 铁血权杖
            i19={{p={{p942=1}}},{props_p942=1},600,19,"h106",1},
             -- 艾恩克兰德 的专属道具 --> 刚毅佩剑
            i20={{p={{p943=1}}},{props_p943=1},600,20,"h107",1},
             -- 格莱法 的专属道具 --> 激进指挥刀
            i21={{p={{p944=1}}},{props_p944=1},600,21,"h108",1},
             -- 比格提彻尔 的专属道具 --> 统领权杖
            i22={{p={{p945=1}}},{props_p945=1},600,22,"h109",1},
             -- 阿特尔雷 的专属道具 --> 机警佩剑
            i23={{p={{p946=1}}},{props_p946=1},600,23,"h110",1},
             -- 拜勒维斯 的专属道具 --> 统率指挥刀
            i24={{p={{p1571=1}}},{props_p1571=1},600,24,"h111",1},
             -- 詹姆那斯 的专属道具 --> 铁血指挥刀
            i25={{p={{p1572=1}}},{props_p1572=1},600,25,"h112",1},
             -- 卡尔丁 的专属道具 --> 远洋指挥刀
            i26={{p={{p1573=1}}},{props_p1573=1},600,26,"h113",1},
             -- 拉克萨斯 的专属道具 --> 智慧佩剑
            i27={{p={{p1574=1}}},{props_p1574=1},600,27,"h114",1},
             -- 泽里克西恩 的专属道具 --> 守备佩剑
            i28={{p={{p1575=1}}},{props_p1575=1},600,28,"h115",1},
             -- 德梅克斯 的专属道具 --> 援护佩剑
            i29={{p={{p1576=1}}},{props_p1576=1},600,29,"h116",1},
             -- 马尔夏 的专属道具 --> 谋略权杖
            i30={{p={{p1577=1}}},{props_p1577=1},600,30,"h117",1},
             -- 特丽莎 的专属道具 --> 果敢权杖
            i31={{p={{p1578=1}}},{props_p1578=1},600,31,"h118",1},
             -- 罗斯玛丽 的专属道具 --> 不屈权杖
            i32={{p={{p1579=1}}},{props_p1579=1},600,32,"h119",1},
             -- 普利西亚 的专属道具 --> 机敏权杖
            i33={{p={{p1580=1}}},{props_p1580=1},600,33,"h120",1},
        },
    },
}
return seikoStoneShop
