StrConfig:Add(
{
	
	
	
	['setsys0100'] = '此键已被使用，确定要替换掉现有的快捷键？',
	['setsys0105'] = '您的修改设置尚未保存，是否不保存关闭？',
	['setsys0120'] = '系统将为您推荐一套技能键位设置,是否确认？',
	['setsys0125'] = '您离开游戏时间过长，GM小妹已帮您切换到低配状态减少了电脑的耗电量哦！',	
	
	['setsys0200'] = "<font color='#29cc00'>保存成功</font>",
	['setsys0300'] = '技能%s',
	['setsys0350'] = '技能%s',
	['setsys0400'] = '该键不可用',
	
	--技能介绍字符串
	['setsys1'] = '技能1',
	['setsys2'] = '技能2',
	['setsys3'] = '技能3',
	['setsys4'] = '技能4',
	['setsys5'] = '技能5',
	['setsys6'] = '技能6',
	['setsys7'] = '技能7',
	['setsys8'] = '技能8',
	['setsys9'] = '技能9',
	['setsys10'] = '技能10',
	['setsys11'] = '技能11',
	['setsys12'] = '技能12',
	['setsys13'] = '技能13',
	['setsys14'] = '技能14',
	['setsys15'] = '灵兽技能1',
	['setsys16'] = '灵兽技能2',
	['setsys17'] = '灵阵技能',
	['setsys18'] = '圣器技能',
	
	
	['setsys50'] = '空格',
	['setsys51'] = '左',
	['setsys52'] = '右',
	['setsys61'] = '技能',
	['setsys62'] = '快捷键',
	
	['setsys71'] = '效果设置',
	['setsys72'] = '显示设置',
	['setsys73'] = '交互设置',
	['setsys74'] = '屏蔽设置',
	['setsys75'] = '不保存',
	['setsys76'] = '点错了',
	['setsys77'] = '我回来了',	
}
)