
StrConfig:Add(
{
	["yunying001"] = "请先登录安全卫士，领取对应特权，获得礼包领取资格！";
	["yunying002"] = "领取奖励";
	["yunying003"] = "已领取";
	["yunying004"] = "系统繁忙，请您稍后再来领取特权！";
	["yunying005"] = "请先登录安全卫士，领取对应特权，获得礼包领取资格";
	["yunying006"] = "您的安全卫士等级不满足领取条件，请提升卫士等级";
	["yunying007"] = "系统错误，请您稍后再来领取特权！";
	["yunying008"] = "特权活动未上线，请等待上线后再来领取;";
	["yunying009"] = "很遗憾！360卫士特权活动已结束，敬请期待下次活动！";
	["yunying010"] = "系统异常，请您稍后再来领取特权！";
	["yunying011"] = "请先登录安全卫士，领取对应特权，分享特权活动到指定社交平台获得分享礼包";
	["yunying012"] = "礼包审核中，我们将于您分享特权活动48小时之后给您发送礼包，请耐心等待！";
	["yunying013"] = "活动未开启";
	["yunying014"] = "已领取";
	["yunying015"] = "成功领取";
	["yunying016"] = "等级不足，无法领取！";
	["yunying017"] = "可领取%s/7次奖励<font size='14' color ='#c8c8c8'>(每日可领取一次)</font>";
	["yunying018"] = "类型错误";
	["yunying019"] = "已领取";
	["yunying020"] = "您已领取过该奖励!";
	["yunying021"] = "了解更多平台vip规则";
	["yunying022"] = "未达到领取等级";
	["yunying023"] = "请从游戏大厅入口登录游戏。";
	["yunying024"] = "专属客服QQ：%s";
	["yunying025"] = "";
	["yunying026"] = "";
	["yunying027"] = "";
	["yunying028"] = "";
	["yunying029"] = "";

	
	--挂机助手
	["phoneHelp1"] = "版本: V1.0 for android";
	["phoneHelp2"] = "版本: V1.0 for iphone";
}
)