StrConfig:Add(
{
	['chat100'] = '%s线,%s(X:%s,Y:%s)',
	['chat101'] = '【%s】',
	
	['chat102'] = '点击锁定当前屏幕',
	['chat103'] = '收起',
	['chat104'] = '打开',
	['chat105'] = '点击打开聊天设置',
	['chat106'] = '发送我的位置<br/>每%s秒使用一次',
	['chat107'] = '喇叭',
	['chat108'] = '[我的位置]',
	['chat109'] = "本次喇叭发言将会消耗<font color='#00FF00'>1</font>个%s",
	['chat110'] = "道具不足时，自动花费<font color='#ffcc33'>%s</font>元宝发送",	
	['chat111'] = "选择表情",	
	['chat112'] = "不在同一条线，无法到达",
	['chat113'] = "发送内容不能为空",
	['chat114'] = "喇叭数量不足",
	['chat115'] = "元宝不足",
	['chat116'] = "当前场景无法向外发送坐标",
	['chat117'] = "当前地图不可到达",
	['chat118'] = "您说话太快了！",
	['chat119'] = "<font color='#00FF00'>举报成功</font>",
	
	--频道名
	['chat200'] = '综合',
	['chat201'] = '世界',
	['chat202'] = '区域',
	['chat203'] = '阵营',
	['chat204'] = '帮派',
	['chat205'] = '组队',
	['chat206'] = '喇叭',
	['chat207'] = '跨服',
	['chat208'] = '收益',
	
	--私聊
	['chat300'] = '等级：%s级',
	['chat301'] = '组队邀请',
	['chat302'] = '添加好友',
	['chat303'] = '复制名字',
	['chat304'] = '加入黑名单',
	['chat305'] = '还可输入%s个字',
	['chat306'] = '与%s聊天中',
	
	--菜单
	['chat400'] = '私聊',
	['chat401'] = '查看资料',
	['chat402'] = '加为好友',
	['chat403'] = '屏蔽此人',
	['chat404'] = '邀请入帮',
	['chat405'] = '申请入帮',
	['chat406'] = '创建队伍',
	['chat407'] = '申请入队',
	['chat408'] = '邀请入队',
	['chat409'] = '复制名称',
	['chat410'] = '举报玩家',
	
	--城主职位
	['chat500'] = '大千神王',
	['chat501'] = '天地尊者',
	['chat502'] = '护法',
	['chat503'] = '至尊天盟',

	['chat601'] = '私聊',
	['chat602'] = '本服',
	['chat603'] = '区域',
	
	['chat604'] = "%s年%s月%s日",

}
);