
StrConfig:Add(
{
	-- 主界面 特权介绍
	["vplan001"] = "V计划，烧钱。烧钱";

	-- 新手礼包
	["vplan201"] = "开通V会员";
	["vplan202"] = "续费V会员";
	["vplan203"] = "已领取";
	["vplan204"] = "立即领取";
	["vplan206"] = "成功领取！";
	["vplan207"] = "您已经领取过该礼包！";
	["vplan208"] = "您还不是会员，无法领取！";
	["vplan209"] = "新手礼包";
	["vplan210"] = "新手礼包";
	["vplan211"] = "新手礼包";

	--每日礼包
	["vplan301"] = "每日礼包";
	["vplan302"] = "开通月费会员";
	["vplan303"] = "开通年费会员";
	["vplan304"] = "领取月费";
	["vplan305"] = "领取年费";
	["vplan306"] = "已领取";
	["vplan307"] = "";
	["vplan308"] = "";

	-- 等级礼包
	["vplan401"] = "等级礼包";
	["vplan402"] = "一键领取";
	["vplan403"] = "开通V会员";
	["vplan404"] = "已领取";
	["vplan405"] = "领取";

	--专属称号
	["vplan501"] = "专属称号";
	["vplan502"] = "开通月费会员";
	["vplan503"] = "开通年费会员";
	["vplan504"] = "已领取";
	["vplan505"] = "您还不是年费会员!";
	["vplan506"] = "领取年费称号";

	--独家道具
	["vplan601"] = "独家道具";

	--会员威力
	["vplan701"] = "会员威力";
	["vplan702"] = "开通会员";
	["vplan703"] = "开通年费会员";
	["vplan704"] = "已获取";

	-- 商城打折
	["vplan801"] = "商城打折";
	["vplan802"] = "<font color='#47C0FF'>现价：<font color='#BCCA03'>%s</font></font>";
	["vplan803"] = "<font color='#47C0FF'>原价：<font color='#333333'>%s</font></font>";
	["vplan804"] = "%s/%s";
	["vplan805"] = "商城打折";
	["vplan806"] = "商城打折";

	--年费特权
	["vplan901"] = "年费特权";
	["vplan902"] = "立即领取";
	["vplan903"] = "开通年费会员";

	--我的v信息
	["vplan1001"] = "%s级 (%s/%s)";
	["vplan1002"] = "月费会员";
	["vplan1003"] = "年费会员";
	["vplan1004"] = "不是会员";
	["vplan1005"] = "点/天";
	["vplan1006"] = "";
	["vplan1007"] = "";
	["vplan1008"] = "";
	["vplan1009"] = "";
	
	--消费礼包
	["vplan12001"] = '本期礼包领取重置时间剩余： <font color="#00ff00">%s天%s时%s分%s秒</font>',
	["vplan12002"] = '本期已累计消耗元宝： <font color="#ff0000">%s</font>',
	["vplan12003"] = '',--'V2-V3累计消费要求<font size = "24">8折</font>优惠',
	["vplan12004"] = '',--'V4-V5累计消费要求<font size = "24">5折</font>优惠',
	["vplan12005"] = '累计消费%s元宝',
}
)