dataConfig.configs.filterConfig ={
	[1] = {
		['id'] = 1,
		['filter'] = '胡锦涛'
	},
	[2] = {
		['id'] = 2,
		['filter'] = '温家宝'
	},
	[3] = {
		['id'] = 3,
		['filter'] = 'fuck'
	},
	[4] = {
		['id'] = 4,
		['filter'] = '俊龙百美缘下载'
	},
	[5] = {
		['id'] = 5,
		['filter'] = '猎艳天下下载'
	},
	[6] = {
		['id'] = 6,
		['filter'] = '龙吟百美缘下载'
	},
	[7] = {
		['id'] = 7,
		['filter'] = '农夫导航最新地址'
	},
	[8] = {
		['id'] = 8,
		['filter'] = '一个色导航'
	},
	[9] = {
		['id'] = 9,
		['filter'] = '真人视频'
	},
	[10] = {
		['id'] = 10,
		['filter'] = '裸聊'
	},
	[11] = {
		['id'] = 11,
		['filter'] = '淫叫'
	},
	[12] = {
		['id'] = 12,
		['filter'] = '小穴肉棒插进'
	},
	[13] = {
		['id'] = 13,
		['filter'] = '套弄鸡巴'
	},
	[14] = {
		['id'] = 14,
		['filter'] = '浪叫'
	},
	[15] = {
		['id'] = 15,
		['filter'] = '美女裸体'
	},
	[16] = {
		['id'] = 16,
		['filter'] = '美女qq裸体'
	},
	[17] = {
		['id'] = 17,
		['filter'] = '成人裸聊'
	},
	[18] = {
		['id'] = 18,
		['filter'] = '午夜成人裸聊'
	},
	[19] = {
		['id'] = 19,
		['filter'] = '少年大宝全本'
	},
	[20] = {
		['id'] = 20,
		['filter'] = '爱上师娘的床全文'
	},
	[21] = {
		['id'] = 21,
		['filter'] = '风月大陆全文下载'
	},
	[22] = {
		['id'] = 22,
		['filter'] = '一个色导航最新地址'
	},
	[23] = {
		['id'] = 23,
		['filter'] = '色友霸三国全文'
	},
	[24] = {
		['id'] = 24,
		['filter'] = '玲珑孽怨全本'
	},
	[25] = {
		['id'] = 25,
		['filter'] = '色导航最新地址'
	},
	[26] = {
		['id'] = 26,
		['filter'] = '潘金莲导航最新地址'
	},
	[27] = {
		['id'] = 27,
		['filter'] = '美女激情裸聊室'
	},
	[28] = {
		['id'] = 28,
		['filter'] = '大丑风流记全文阅读'
	},
	[29] = {
		['id'] = 29,
		['filter'] = '风流教皇全文阅读'
	},
	[30] = {
		['id'] = 30,
		['filter'] = '出售18P2P账号'
	},
	[31] = {
		['id'] = 31,
		['filter'] = '激情倮聊网'
	},
	[32] = {
		['id'] = 32,
		['filter'] = '一品楼VIP高级帐号'
	},
	[33] = {
		['id'] = 33,
		['filter'] = '美女裸聊室'
	},
	[34] = {
		['id'] = 34,
		['filter'] = '猎艳江湖梦txt全集'
	},
	[35] = {
		['id'] = 35,
		['filter'] = '风月大陆全文阅读'
	},
	[36] = {
		['id'] = 36,
		['filter'] = '成人电影'
	},
	[37] = {
		['id'] = 37,
		['filter'] = '伦理电影'
	},
	[38] = {
		['id'] = 38,
		['filter'] = '色图'
	},
	[39] = {
		['id'] = 39,
		['filter'] = '美女激情裸聊视频'
	},
	[40] = {
		['id'] = 40,
		['filter'] = 'qq裸聊视频'
	},
	[41] = {
		['id'] = 41,
		['filter'] = 'qvod伦理情色'
	},
	[42] = {
		['id'] = 42,
		['filter'] = '收费裸聊'
	},
	[43] = {
		['id'] = 43,
		['filter'] = '裸体聊天室'
	},
	[44] = {
		['id'] = 44,
		['filter'] = '顶级激情裸聊'
	},
	[45] = {
		['id'] = 45,
		['filter'] = '呻吟'
	},
	[46] = {
		['id'] = 46,
		['filter'] = '抽插'
	},
	[47] = {
		['id'] = 47,
		['filter'] = '伦理电影qvod'
	},
	[48] = {
		['id'] = 48,
		['filter'] = '一本道ed2k'
	},
	[49] = {
		['id'] = 49,
		['filter'] = '激情裸聊室'
	},
	[50] = {
		['id'] = 50,
		['filter'] = '裸聊聊天室'
	},
	[51] = {
		['id'] = 51,
		['filter'] = '艳香迷醉'
	},
	[52] = {
		['id'] = 52,
		['filter'] = '美女裸聊网站'
	},
	[53] = {
		['id'] = 53,
		['filter'] = '美女裸聊视频'
	},
	[54] = {
		['id'] = 54,
		['filter'] = '美女裸聊视频室'
	},
	[55] = {
		['id'] = 55,
		['filter'] = '出售日本成人DVD'
	},
	[56] = {
		['id'] = 56,
		['filter'] = '美女脱衣激情裸聊室'
	},
	[57] = {
		['id'] = 57,
		['filter'] = '卧底官方网站'
	},
	[58] = {
		['id'] = 58,
		['filter'] = '卧底软件官网'
	},
	[59] = {
		['id'] = 59,
		['filter'] = '卧底官网'
	},
	[60] = {
		['id'] = 60,
		['filter'] = '自慰器'
	},
	[61] = {
		['id'] = 61,
		['filter'] = '催情迷幻药'
	},
	[62] = {
		['id'] = 62,
		['filter'] = '自慰器供应'
	},
	[63] = {
		['id'] = 63,
		['filter'] = '香水型迷奸药'
	},
	[64] = {
		['id'] = 64,
		['filter'] = '蒙汗药迷奸药'
	},
	[65] = {
		['id'] = 65,
		['filter'] = '蒙汗药'
	},
	[66] = {
		['id'] = 66,
		['filter'] = '迷奸药'
	},
	[67] = {
		['id'] = 67,
		['filter'] = '速效迷奸药'
	},
	[68] = {
		['id'] = 68,
		['filter'] = '催情药'
	},
	[69] = {
		['id'] = 69,
		['filter'] = '三唑仑蒙汗药'
	},
	[70] = {
		['id'] = 70,
		['filter'] = '失身粉'
	},
	[71] = {
		['id'] = 71,
		['filter'] = '三唑仑'
	},
	[72] = {
		['id'] = 72,
		['filter'] = '少女迷情药'
	},
	[73] = {
		['id'] = 73,
		['filter'] = '苍蝇水'
	},
	[74] = {
		['id'] = 74,
		['filter'] = '迷情药'
	},
	[75] = {
		['id'] = 75,
		['filter'] = '西班牙苍蝇水'
	},
	[76] = {
		['id'] = 76,
		['filter'] = 'GHB迷奸药水'
	},
	[77] = {
		['id'] = 77,
		['filter'] = '拍肩迷药'
	},
	[78] = {
		['id'] = 78,
		['filter'] = '强奸丸'
	},
	[79] = {
		['id'] = 79,
		['filter'] = '拍肩药'
	},
	[80] = {
		['id'] = 80,
		['filter'] = '迷奸'
	},
	[81] = {
		['id'] = 81,
		['filter'] = '迷情'
	},
	[82] = {
		['id'] = 82,
		['filter'] = '迷情粉'
	},
	[83] = {
		['id'] = 83,
		['filter'] = 'GHB'
	},
	[84] = {
		['id'] = 84,
		['filter'] = '美国GHB液'
	},
	[85] = {
		['id'] = 85,
		['filter'] = 'ghb迷情药'
	},
	[86] = {
		['id'] = 86,
		['filter'] = '催情'
	},
	[87] = {
		['id'] = 87,
		['filter'] = '乖乖水'
	},
	[88] = {
		['id'] = 88,
		['filter'] = '金苍蝇迷情液'
	},
	[89] = {
		['id'] = 89,
		['filter'] = '催眠催情水'
	},
	[90] = {
		['id'] = 90,
		['filter'] = '黑寡妇催情水'
	},
	[91] = {
		['id'] = 91,
		['filter'] = '红樱桃苍蝇水'
	},
	[92] = {
		['id'] = 92,
		['filter'] = '苍蝇水乖乖水蒙汗药'
	},
	[93] = {
		['id'] = 93,
		['filter'] = 'ghb迷奸药'
	},
	[94] = {
		['id'] = 94,
		['filter'] = '失身粉专卖'
	},
	[95] = {
		['id'] = 95,
		['filter'] = 'SexInSex网站'
	},
	[96] = {
		['id'] = 96,
		['filter'] = '出售西班牙苍蝇粉'
	},
	[97] = {
		['id'] = 97,
		['filter'] = '少女迷情药苍蝇粉专卖'
	},
	[98] = {
		['id'] = 98,
		['filter'] = '苍蝇水失身粉专卖'
	},
	[99] = {
		['id'] = 99,
		['filter'] = '激情美女视频聊天'
	},
	[100] = {
		['id'] = 100,
		['filter'] = '失身粉迷情水供应'
	},
	[101] = {
		['id'] = 101,
		['filter'] = '出售冰毒'
	},
	[102] = {
		['id'] = 102,
		['filter'] = '麻黄素'
	},
	[103] = {
		['id'] = 103,
		['filter'] = '硝甲西泮'
	},
	[104] = {
		['id'] = 104,
		['filter'] = 'K粉'
	},
	[105] = {
		['id'] = 105,
		['filter'] = '海洛因'
	},
	[106] = {
		['id'] = 106,
		['filter'] = '冰毒'
	},
	[107] = {
		['id'] = 107,
		['filter'] = '去氧麻黄素配方'
	},
	[108] = {
		['id'] = 108,
		['filter'] = '办证'
	},
	[109] = {
		['id'] = 109,
		['filter'] = '6.4事件'
	},
	[110] = {
		['id'] = 110,
		['filter'] = '64大屠杀'
	},
	[111] = {
		['id'] = 111,
		['filter'] = '64学潮'
	},
	[112] = {
		['id'] = 112,
		['filter'] = '6合彩'
	},
	[113] = {
		['id'] = 113,
		['filter'] = '89死难'
	},
	[114] = {
		['id'] = 114,
		['filter'] = 'AV麻将'
	},
	[115] = {
		['id'] = 115,
		['filter'] = 'AV麻將'
	},
	[116] = {
		['id'] = 116,
		['filter'] = 'AV女'
	},
	[117] = {
		['id'] = 117,
		['filter'] = 'A级'
	},
	[118] = {
		['id'] = 118,
		['filter'] = 'A片'
	},
	[119] = {
		['id'] = 119,
		['filter'] = 'b-阻断剂'
	},
	[120] = {
		['id'] = 120,
		['filter'] = 'C4塑胶TNT'
	},
	[121] = {
		['id'] = 121,
		['filter'] = 'C4炸药制作'
	},
	[122] = {
		['id'] = 122,
		['filter'] = 'c4制作方法'
	},
	[123] = {
		['id'] = 123,
		['filter'] = 'CIBS海外移民投资'
	},
	[124] = {
		['id'] = 124,
		['filter'] = 'DalaiLama自傳'
	},
	[125] = {
		['id'] = 125,
		['filter'] = 'DIY原子弹'
	},
	[126] = {
		['id'] = 126,
		['filter'] = 'Fa轮功'
	},
	[127] = {
		['id'] = 127,
		['filter'] = 'MC军团'
	},
	[128] = {
		['id'] = 128,
		['filter'] = 'MC軍團'
	},
	[129] = {
		['id'] = 129,
		['filter'] = 'sex'
	},
	[130] = {
		['id'] = 130,
		['filter'] = 'TMD=>真美妙'
	},
	[131] = {
		['id'] = 131,
		['filter'] = 'TND'
	},
	[132] = {
		['id'] = 132,
		['filter'] = 'TNND'
	},
	[133] = {
		['id'] = 133,
		['filter'] = 'TNT炸弹制作方法'
	},
	[134] = {
		['id'] = 134,
		['filter'] = 'tnt炸药'
	},
	[135] = {
		['id'] = 135,
		['filter'] = 'TNT炸药制作方法'
	},
	[136] = {
		['id'] = 136,
		['filter'] = '百家乐'
	},
	[137] = {
		['id'] = 137,
		['filter'] = '办毕业证'
	},
	[138] = {
		['id'] = 138,
		['filter'] = '办假证'
	},
	[139] = {
		['id'] = 139,
		['filter'] = '办理大专'
	},
	[140] = {
		['id'] = 140,
		['filter'] = '办理文凭'
	},
	[141] = {
		['id'] = 141,
		['filter'] = '办理无抵押贷款'
	},
	[142] = {
		['id'] = 142,
		['filter'] = '办理真实文凭'
	},
	[143] = {
		['id'] = 143,
		['filter'] = '办学历文凭'
	},
	[144] = {
		['id'] = 144,
		['filter'] = '办证件'
	},
	[145] = {
		['id'] = 145,
		['filter'] = '包送车'
	},
	[146] = {
		['id'] = 146,
		['filter'] = '北京模特'
	},
	[147] = {
		['id'] = 147,
		['filter'] = '北京小姐'
	},
	[148] = {
		['id'] = 148,
		['filter'] = '不良少女日记'
	},
	[149] = {
		['id'] = 149,
		['filter'] = '步枪'
	},
	[150] = {
		['id'] = 150,
		['filter'] = '查别人手机短信'
	},
	[151] = {
		['id'] = 151,
		['filter'] = '陈金龙'
	},
	[152] = {
		['id'] = 152,
		['filter'] = '陈雄彪'
	},
	[153] = {
		['id'] = 153,
		['filter'] = '陈志坤'
	},
	[154] = {
		['id'] = 154,
		['filter'] = '成人用品'
	},
	[155] = {
		['id'] = 155,
		['filter'] = '程方鹏'
	},
	[156] = {
		['id'] = 156,
		['filter'] = '出墙红杏'
	},
	[157] = {
		['id'] = 157,
		['filter'] = '出售手枪'
	},
	[158] = {
		['id'] = 158,
		['filter'] = '创世之子猎艳之旅'
	},
	[159] = {
		['id'] = 159,
		['filter'] = '崔英杰'
	},
	[160] = {
		['id'] = 160,
		['filter'] = '大紀元'
	},
	[161] = {
		['id'] = 161,
		['filter'] = '大揭露'
	},
	[162] = {
		['id'] = 162,
		['filter'] = '代办'
	},
	[163] = {
		['id'] = 163,
		['filter'] = '代办各种毕业证'
	},
	[164] = {
		['id'] = 164,
		['filter'] = '代发广告'
	},
	[165] = {
		['id'] = 165,
		['filter'] = '代发贴'
	},
	[166] = {
		['id'] = 166,
		['filter'] = '代考'
	},
	[167] = {
		['id'] = 167,
		['filter'] = '代刻印章'
	},
	[168] = {
		['id'] = 168,
		['filter'] = '代人发帖'
	},
	[169] = {
		['id'] = 169,
		['filter'] = '弹夹'
	},
	[170] = {
		['id'] = 170,
		['filter'] = '盗电'
	},
	[171] = {
		['id'] = 171,
		['filter'] = '道县公安'
	},
	[172] = {
		['id'] = 172,
		['filter'] = '德国进口宝马'
	},
	[173] = {
		['id'] = 173,
		['filter'] = '的哥和交警'
	},
	[174] = {
		['id'] = 174,
		['filter'] = '点对点裸聊'
	},
	[175] = {
		['id'] = 175,
		['filter'] = '叼你'
	},
	[176] = {
		['id'] = 176,
		['filter'] = '叼你妈'
	},
	[177] = {
		['id'] = 177,
		['filter'] = '东北风情熟女之惑'
	},
	[178] = {
		['id'] = 178,
		['filter'] = '冻干粉'
	},
	[179] = {
		['id'] = 179,
		['filter'] = '短信猫'
	},
	[180] = {
		['id'] = 180,
		['filter'] = '多s党执政'
	},
	[181] = {
		['id'] = 181,
		['filter'] = '多难兴邦'
	},
	[182] = {
		['id'] = 182,
		['filter'] = '二奶大'
	},
	[183] = {
		['id'] = 183,
		['filter'] = '二奶大赛'
	},
	[184] = {
		['id'] = 184,
		['filter'] = '发票'
	},
	[185] = {
		['id'] = 185,
		['filter'] = '發票'
	},
	[186] = {
		['id'] = 186,
		['filter'] = '法功'
	},
	[187] = {
		['id'] = 187,
		['filter'] = '法轮功'
	},
	[188] = {
		['id'] = 188,
		['filter'] = '法輪功'
	},
	[189] = {
		['id'] = 189,
		['filter'] = '法论功'
	},
	[190] = {
		['id'] = 190,
		['filter'] = '反右题材'
	},
	[191] = {
		['id'] = 191,
		['filter'] = '反中游行'
	},
	[192] = {
		['id'] = 192,
		['filter'] = '仿真'
	},
	[193] = {
		['id'] = 193,
		['filter'] = '仿真枪'
	},
	[194] = {
		['id'] = 194,
		['filter'] = '飞机票'
	},
	[195] = {
		['id'] = 195,
		['filter'] = '肥东交警'
	},
	[196] = {
		['id'] = 196,
		['filter'] = '风尘劫'
	},
	[197] = {
		['id'] = 197,
		['filter'] = '风骚侍女'
	},
	[198] = {
		['id'] = 198,
		['filter'] = '风月大陆'
	},
	[199] = {
		['id'] = 199,
		['filter'] = '夫妇乐园'
	},
	[200] = {
		['id'] = 200,
		['filter'] = '服务上门'
	},
	[201] = {
		['id'] = 201,
		['filter'] = '富人与农民工'
	},
	[202] = {
		['id'] = 202,
		['filter'] = '富士'
	},
	[203] = {
		['id'] = 203,
		['filter'] = '干你姐'
	},
	[204] = {
		['id'] = 204,
		['filter'] = '干你妈'
	},
	[205] = {
		['id'] = 205,
		['filter'] = '干扰器'
	},
	[206] = {
		['id'] = 206,
		['filter'] = '敢坐飞机吗'
	},
	[207] = {
		['id'] = 207,
		['filter'] = '钢珠枪'
	},
	[208] = {
		['id'] = 208,
		['filter'] = '胡哥看奥运'
	},
	[209] = {
		['id'] = 209,
		['filter'] = '胡錦濤'
	},
	[210] = {
		['id'] = 210,
		['filter'] = '胡新宇'
	},
	[211] = {
		['id'] = 211,
		['filter'] = '华茗代考网'
	},
	[212] = {
		['id'] = 212,
		['filter'] = '混蛋神风流史'
	},
	[213] = {
		['id'] = 213,
		['filter'] = '鸡8'
	},
	[214] = {
		['id'] = 214,
		['filter'] = '鸡巴'
	},
	[215] = {
		['id'] = 215,
		['filter'] = '鸡吧'
	},
	[216] = {
		['id'] = 216,
		['filter'] = '鸡拔'
	},
	[217] = {
		['id'] = 217,
		['filter'] = '激情聊天'
	},
	[218] = {
		['id'] = 218,
		['filter'] = '激情裸聊'
	},
	[219] = {
		['id'] = 219,
		['filter'] = '激情视频'
	},
	[220] = {
		['id'] = 220,
		['filter'] = '济南建设路'
	},
	[221] = {
		['id'] = 221,
		['filter'] = '佳龙it'
	},
	[222] = {
		['id'] = 222,
		['filter'] = '假人民币'
	},
	[223] = {
		['id'] = 223,
		['filter'] = '监控器'
	},
	[224] = {
		['id'] = 224,
		['filter'] = '减肥药'
	},
	[225] = {
		['id'] = 225,
		['filter'] = '践踏中国女性'
	},
	[226] = {
		['id'] = 226,
		['filter'] = '江湖淫娘'
	},
	[227] = {
		['id'] = 227,
		['filter'] = '江姐问'
	},
	[228] = {
		['id'] = 228,
		['filter'] = '江青丈夫'
	},
	[229] = {
		['id'] = 229,
		['filter'] = '江氏'
	},
	[230] = {
		['id'] = 230,
		['filter'] = '蒋彦永'
	},
	[231] = {
		['id'] = 231,
		['filter'] = '狡猾的风水相师'
	},
	[232] = {
		['id'] = 232,
		['filter'] = '教师资格证'
	},
	[233] = {
		['id'] = 233,
		['filter'] = '她姐姐'
	},
	[234] = {
		['id'] = 234,
		['filter'] = '她奶奶'
	},
	[235] = {
		['id'] = 235,
		['filter'] = '解码器'
	},
	[236] = {
		['id'] = 236,
		['filter'] = '金伯帆'
	},
	[237] = {
		['id'] = 237,
		['filter'] = '进口车'
	},
	[238] = {
		['id'] = 238,
		['filter'] = '精密减速器'
	},
	[239] = {
		['id'] = 239,
		['filter'] = '警察证'
	},
	[240] = {
		['id'] = 240,
		['filter'] = '警用钱包'
	},
	[241] = {
		['id'] = 241,
		['filter'] = '警用设备'
	},
	[242] = {
		['id'] = 242,
		['filter'] = '狙击步枪'
	},
	[243] = {
		['id'] = 243,
		['filter'] = '菊花洞'
	},
	[244] = {
		['id'] = 244,
		['filter'] = '开发票'
	},
	[245] = {
		['id'] = 245,
		['filter'] = '开机信息'
	},
	[246] = {
		['id'] = 246,
		['filter'] = '开锁工具'
	},
	[247] = {
		['id'] = 247,
		['filter'] = '開發票'
	},
	[248] = {
		['id'] = 248,
		['filter'] = '開髮票'
	},
	[249] = {
		['id'] = 249,
		['filter'] = '烤试'
	},
	[250] = {
		['id'] = 250,
		['filter'] = '靠你爸'
	},
	[251] = {
		['id'] = 251,
		['filter'] = '科技精英遇难'
	},
	[252] = {
		['id'] = 252,
		['filter'] = '刻章'
	},
	[253] = {
		['id'] = 253,
		['filter'] = '控制器'
	},
	[254] = {
		['id'] = 254,
		['filter'] = '酷睿2双核T7200'
	},
	[255] = {
		['id'] = 255,
		['filter'] = '狂风暴雨'
	},
	[256] = {
		['id'] = 256,
		['filter'] = '乐彩开奖'
	},
	[257] = {
		['id'] = 257,
		['filter'] = '六合彩'
	},
	[258] = {
		['id'] = 258,
		['filter'] = '六决不'
	},
	[259] = {
		['id'] = 259,
		['filter'] = '卢跃刚'
	},
	[260] = {
		['id'] = 260,
		['filter'] = '绿叶电器'
	},
	[261] = {
		['id'] = 261,
		['filter'] = '轮盘机'
	},
	[262] = {
		['id'] = 262,
		['filter'] = '裸聊合法'
	},
	[263] = {
		['id'] = 263,
		['filter'] = '骆冰淫传'
	},
	[264] = {
		['id'] = 264,
		['filter'] = '妈B'
	},
	[265] = {
		['id'] = 265,
		['filter'] = '妈逼'
	},
	[266] = {
		['id'] = 266,
		['filter'] = '妈比'
	},
	[267] = {
		['id'] = 267,
		['filter'] = '妈庇'
	},
	[268] = {
		['id'] = 268,
		['filter'] = '麻古'
	},
	[269] = {
		['id'] = 269,
		['filter'] = '麻醉'
	},
	[270] = {
		['id'] = 270,
		['filter'] = '麻醉狗'
	},
	[271] = {
		['id'] = 271,
		['filter'] = '马加爵'
	},
	[272] = {
		['id'] = 272,
		['filter'] = '马自达'
	},
	[273] = {
		['id'] = 273,
		['filter'] = '没屁眼'
	},
	[274] = {
		['id'] = 274,
		['filter'] = '玫瑰园'
	},
	[275] = {
		['id'] = 275,
		['filter'] = '美国凯德'
	},
	[276] = {
		['id'] = 276,
		['filter'] = '美国之音'
	},
	[277] = {
		['id'] = 277,
		['filter'] = '美女视频'
	},
	[278] = {
		['id'] = 278,
		['filter'] = '美少妇的哀羞'
	},
	[279] = {
		['id'] = 279,
		['filter'] = '门小姐'
	},
	[280] = {
		['id'] = 280,
		['filter'] = '迷昏药'
	},
	[281] = {
		['id'] = 281,
		['filter'] = '迷魂药'
	},
	[282] = {
		['id'] = 282,
		['filter'] = '蜜洞'
	},
	[283] = {
		['id'] = 283,
		['filter'] = '灭绝罪'
	},
	[284] = {
		['id'] = 284,
		['filter'] = '模拟机'
	},
	[285] = {
		['id'] = 285,
		['filter'] = '模特上门'
	},
	[286] = {
		['id'] = 286,
		['filter'] = '木制工艺品'
	},
	[287] = {
		['id'] = 287,
		['filter'] = '奶粉里都有毒'
	},
	[288] = {
		['id'] = 288,
		['filter'] = '奶粉有毒'
	},
	[289] = {
		['id'] = 289,
		['filter'] = '南京大'
	},
	[290] = {
		['id'] = 290,
		['filter'] = '你爸'
	},
	[291] = {
		['id'] = 291,
		['filter'] = '你老母'
	},
	[292] = {
		['id'] = 292,
		['filter'] = '你妈'
	},
	[293] = {
		['id'] = 293,
		['filter'] = '你奶奶'
	},
	[294] = {
		['id'] = 294,
		['filter'] = '你全家'
	},
	[295] = {
		['id'] = 295,
		['filter'] = '你权家'
	},
	[296] = {
		['id'] = 296,
		['filter'] = '你泉家'
	},
	[297] = {
		['id'] = 297,
		['filter'] = '你拳家'
	},
	[298] = {
		['id'] = 298,
		['filter'] = '你爷爷'
	},
	[299] = {
		['id'] = 299,
		['filter'] = '帕萨特'
	},
	[300] = {
		['id'] = 300,
		['filter'] = '皮指纹测'
	},
	[301] = {
		['id'] = 301,
		['filter'] = '品牌香烟'
	},
	[302] = {
		['id'] = 302,
		['filter'] = '品质香烟'
	},
	[303] = {
		['id'] = 303,
		['filter'] = '气狗'
	},
	[304] = {
		['id'] = 304,
		['filter'] = '气枪'
	},
	[305] = {
		['id'] = 305,
		['filter'] = '汽车爆炸案'
	},
	[306] = {
		['id'] = 306,
		['filter'] = '汽狗'
	},
	[307] = {
		['id'] = 307,
		['filter'] = '强开工具'
	},
	[308] = {
		['id'] = 308,
		['filter'] = '抢盐'
	},
	[309] = {
		['id'] = 309,
		['filter'] = '窃听器'
	},
	[310] = {
		['id'] = 310,
		['filter'] = '秦青的幸福生活'
	},
	[311] = {
		['id'] = 311,
		['filter'] = '清华网管'
	},
	[312] = {
		['id'] = 312,
		['filter'] = '情色5月天'
	},
	[313] = {
		['id'] = 313,
		['filter'] = '求救遭拒'
	},
	[314] = {
		['id'] = 314,
		['filter'] = '全新银行卡'
	},
	[315] = {
		['id'] = 315,
		['filter'] = '人民报'
	},
	[316] = {
		['id'] = 316,
		['filter'] = '仁寿警方'
	},
	[317] = {
		['id'] = 317,
		['filter'] = '日本小泉'
	},
	[318] = {
		['id'] = 318,
		['filter'] = '肉绑'
	},
	[319] = {
		['id'] = 319,
		['filter'] = '肉削'
	},
	[320] = {
		['id'] = 320,
		['filter'] = '三挫仑'
	},
	[321] = {
		['id'] = 321,
		['filter'] = '色空寺'
	},
	[322] = {
		['id'] = 322,
		['filter'] = '色情5月天'
	},
	[323] = {
		['id'] = 323,
		['filter'] = '汕頭頻傳擄童割器官'
	},
	[324] = {
		['id'] = 324,
		['filter'] = '汕尾事件'
	},
	[325] = {
		['id'] = 325,
		['filter'] = '商务时空'
	},
	[326] = {
		['id'] = 326,
		['filter'] = '上门服务'
	},
	[327] = {
		['id'] = 327,
		['filter'] = '上门小'
	},
	[328] = {
		['id'] = 328,
		['filter'] = '上门小姐'
	},
	[329] = {
		['id'] = 329,
		['filter'] = '最淫官员'
	},
	[330] = {
		['id'] = 330,
		['filter'] = '“震撼”视频文件'
	},
	[331] = {
		['id'] = 331,
		['filter'] = '“震撼中”文件'
	},
	[332] = {
		['id'] = 332,
		['filter'] = '12个春秋'
	},
	[333] = {
		['id'] = 333,
		['filter'] = '《风波记》'
	},
	[334] = {
		['id'] = 334,
		['filter'] = '目睹中国改革开放28年之怪现状'
	},
	[335] = {
		['id'] = 335,
		['filter'] = '《天音》'
	},
	[336] = {
		['id'] = 336,
		['filter'] = '《天音》专辑'
	},
	[337] = {
		['id'] = 337,
		['filter'] = '《中国民主》'
	},
	[338] = {
		['id'] = 338,
		['filter'] = '６10办公室'
	},
	[339] = {
		['id'] = 339,
		['filter'] = '８.9事件'
	},
	[340] = {
		['id'] = 340,
		['filter'] = '阿兵哥言语录'
	},
	[341] = {
		['id'] = 341,
		['filter'] = '阿不来提'
	},
	[342] = {
		['id'] = 342,
		['filter'] = '阿娇艳照下载'
	},
	[343] = {
		['id'] = 343,
		['filter'] = '阿里布达年代记'
	},
	[344] = {
		['id'] = 344,
		['filter'] = '阿姨的偷窥'
	},
	[345] = {
		['id'] = 345,
		['filter'] = '阿姨诱奸'
	},
	[346] = {
		['id'] = 346,
		['filter'] = '啊扁涛哥'
	},
	[347] = {
		['id'] = 347,
		['filter'] = '艾司唑仑'
	},
	[348] = {
		['id'] = 348,
		['filter'] = '艾斯海提'
	},
	[349] = {
		['id'] = 349,
		['filter'] = '八九'
	},
	[350] = {
		['id'] = 350,
		['filter'] = '八九见证'
	},
	[351] = {
		['id'] = 351,
		['filter'] = '八九学潮'
	},
	[352] = {
		['id'] = 352,
		['filter'] = '巴拉斯'
	},
	[353] = {
		['id'] = 353,
		['filter'] = '巴音朝鲁'
	},
	[354] = {
		['id'] = 354,
		['filter'] = '白立朴'
	},
	[355] = {
		['id'] = 355,
		['filter'] = '百度空间有奖活动'
	},
	[356] = {
		['id'] = 356,
		['filter'] = '办高利贷'
	},
	[357] = {
		['id'] = 357,
		['filter'] = '办理商业发票'
	},
	[358] = {
		['id'] = 358,
		['filter'] = '办理证件'
	},
	[359] = {
		['id'] = 359,
		['filter'] = '办证刻章发票'
	},
	[360] = {
		['id'] = 360,
		['filter'] = '伴我淫'
	},
	[361] = {
		['id'] = 361,
		['filter'] = '辦理文憑'
	},
	[362] = {
		['id'] = 362,
		['filter'] = '辦理證件'
	},
	[363] = {
		['id'] = 363,
		['filter'] = '包养情妇'
	},
	[364] = {
		['id'] = 364,
		['filter'] = '鲍戈'
	},
	[365] = {
		['id'] = 365,
		['filter'] = '鲍彤'
	},
	[366] = {
		['id'] = 366,
		['filter'] = '暴政'
	},
	[367] = {
		['id'] = 367,
		['filter'] = '北大三角地论坛'
	},
	[368] = {
		['id'] = 368,
		['filter'] = '北韩'
	},
	[369] = {
		['id'] = 369,
		['filter'] = '北京帮'
	},
	[370] = {
		['id'] = 370,
		['filter'] = '贝领'
	},
	[371] = {
		['id'] = 371,
		['filter'] = '背着父亲偷搞母亲'
	},
	[372] = {
		['id'] = 372,
		['filter'] = '被逼'
	},
	[373] = {
		['id'] = 373,
		['filter'] = '被立王'
	},
	[374] = {
		['id'] = 374,
		['filter'] = '被婶子当鸭子的我'
	},
	[375] = {
		['id'] = 375,
		['filter'] = '苯巴比妥'
	},
	[376] = {
		['id'] = 376,
		['filter'] = '苯乙酸诺龙'
	},
	[377] = {
		['id'] = 377,
		['filter'] = '逼样'
	},
	[378] = {
		['id'] = 378,
		['filter'] = '避孕套'
	},
	[379] = {
		['id'] = 379,
		['filter'] = '边坝时间'
	},
	[380] = {
		['id'] = 380,
		['filter'] = '变革之风'
	},
	[381] = {
		['id'] = 381,
		['filter'] = '变声电话'
	},
	[382] = {
		['id'] = 382,
		['filter'] = '变声器'
	},
	[383] = {
		['id'] = 383,
		['filter'] = '变态'
	},
	[384] = {
		['id'] = 384,
		['filter'] = '變聲電話'
	},
	[385] = {
		['id'] = 385,
		['filter'] = '變聲器'
	},
	[386] = {
		['id'] = 386,
		['filter'] = '婊子'
	},
	[387] = {
		['id'] = 387,
		['filter'] = '宾致网'
	},
	[388] = {
		['id'] = 388,
		['filter'] = '冰毒配方'
	},
	[389] = {
		['id'] = 389,
		['filter'] = '冰毒制作配方'
	},
	[390] = {
		['id'] = 390,
		['filter'] = '冰火'
	},
	[391] = {
		['id'] = 391,
		['filter'] = '兵种教材'
	},
	[392] = {
		['id'] = 392,
		['filter'] = '藏春阁'
	},
	[393] = {
		['id'] = 393,
		['filter'] = '藏春閣'
	},
	[394] = {
		['id'] = 394,
		['filter'] = '藏獨'
	},
	[395] = {
		['id'] = 395,
		['filter'] = '藏独'
	},
	[396] = {
		['id'] = 396,
		['filter'] = '藏妇会'
	},
	[397] = {
		['id'] = 397,
		['filter'] = '藏青会'
	},
	[398] = {
		['id'] = 398,
		['filter'] = '操B'
	},
	[399] = {
		['id'] = 399,
		['filter'] = '操逼'
	},
	[400] = {
		['id'] = 400,
		['filter'] = '操比'
	},
	[401] = {
		['id'] = 401,
		['filter'] = '操蛋'
	},
	[402] = {
		['id'] = 402,
		['filter'] = '操你'
	},
	[403] = {
		['id'] = 403,
		['filter'] = '操你妈'
	},
	[404] = {
		['id'] = 404,
		['filter'] = '操你媽'
	},
	[405] = {
		['id'] = 405,
		['filter'] = '操你娘'
	},
	[406] = {
		['id'] = 406,
		['filter'] = '操死'
	},
	[407] = {
		['id'] = 407,
		['filter'] = '操他'
	},
	[408] = {
		['id'] = 408,
		['filter'] = '曹长青'
	},
	[409] = {
		['id'] = 409,
		['filter'] = '曹刚川'
	},
	[410] = {
		['id'] = 410,
		['filter'] = '草莓牛奶'
	},
	[411] = {
		['id'] = 411,
		['filter'] = '草你妈'
	},
	[412] = {
		['id'] = 412,
		['filter'] = '策屁'
	},
	[413] = {
		['id'] = 413,
		['filter'] = '插B'
	},
	[414] = {
		['id'] = 414,
		['filter'] = '插插'
	},
	[415] = {
		['id'] = 415,
		['filter'] = '插她'
	},
	[416] = {
		['id'] = 416,
		['filter'] = '插你'
	},
	[417] = {
		['id'] = 417,
		['filter'] = '插他'
	},
	[418] = {
		['id'] = 418,
		['filter'] = '插我'
	},
	[419] = {
		['id'] = 419,
		['filter'] = '茶余饭后'
	},
	[420] = {
		['id'] = 420,
		['filter'] = '柴玲'
	},
	[421] = {
		['id'] = 421,
		['filter'] = '禅密功'
	},
	[422] = {
		['id'] = 422,
		['filter'] = '長瀨愛'
	},
	[423] = {
		['id'] = 423,
		['filter'] = '常劲'
	},
	[424] = {
		['id'] = 424,
		['filter'] = '常委'
	},
	[425] = {
		['id'] = 425,
		['filter'] = '常委汪兆钧'
	},
	[426] = {
		['id'] = 426,
		['filter'] = '超声波'
	},
	[427] = {
		['id'] = 427,
		['filter'] = '超常科学'
	},
	[428] = {
		['id'] = 428,
		['filter'] = '超淫杂交女'
	},
	[429] = {
		['id'] = 429,
		['filter'] = '超越红墙'
	},
	[430] = {
		['id'] = 430,
		['filter'] = '朝河蘭'
	},
	[431] = {
		['id'] = 431,
		['filter'] = '潮吹'
	},
	[432] = {
		['id'] = 432,
		['filter'] = '炒股国歌'
	},
	[433] = {
		['id'] = 433,
		['filter'] = '炒股國歌'
	},
	[434] = {
		['id'] = 434,
		['filter'] = '车牌反光'
	},
	[435] = {
		['id'] = 435,
		['filter'] = '沉默杀手'
	},
	[436] = {
		['id'] = 436,
		['filter'] = '成都户口代办'
	},
	[437] = {
		['id'] = 437,
		['filter'] = '成佛做主'
	},
	[438] = {
		['id'] = 438,
		['filter'] = '成人表演'
	},
	[439] = {
		['id'] = 439,
		['filter'] = '成人导航'
	},
	[440] = {
		['id'] = 440,
		['filter'] = '成人电影网'
	},
	[441] = {
		['id'] = 441,
		['filter'] = '成人電影'
	},
	[442] = {
		['id'] = 442,
		['filter'] = '成人激情'
	},
	[443] = {
		['id'] = 443,
		['filter'] = '成人交友'
	},
	[444] = {
		['id'] = 444,
		['filter'] = '成人卡通'
	},
	[445] = {
		['id'] = 445,
		['filter'] = '成人录像'
	},
	[446] = {
		['id'] = 446,
		['filter'] = '成人论坛'
	},
	[447] = {
		['id'] = 447,
		['filter'] = '成人論壇'
	},
	[448] = {
		['id'] = 448,
		['filter'] = '成人漫画'
	},
	[449] = {
		['id'] = 449,
		['filter'] = '成人配色'
	},
	[450] = {
		['id'] = 450,
		['filter'] = '成人片'
	},
	[451] = {
		['id'] = 451,
		['filter'] = '成人书库'
	},
	[452] = {
		['id'] = 452,
		['filter'] = '成人贴图'
	},
	[453] = {
		['id'] = 453,
		['filter'] = '成人貼圖'
	},
	[454] = {
		['id'] = 454,
		['filter'] = '成人图片'
	},
	[455] = {
		['id'] = 455,
		['filter'] = '成人图片激情图片情色图片'
	},
	[456] = {
		['id'] = 456,
		['filter'] = '成人圖片'
	},
	[457] = {
		['id'] = 457,
		['filter'] = '成人网站'
	},
	[458] = {
		['id'] = 458,
		['filter'] = '成人網站'
	},
	[459] = {
		['id'] = 459,
		['filter'] = '成人文学'
	},
	[460] = {
		['id'] = 460,
		['filter'] = '成人午夜场'
	},
	[461] = {
		['id'] = 461,
		['filter'] = '成人小说'
	},
	[462] = {
		['id'] = 462,
		['filter'] = '成人小說'
	},
	[463] = {
		['id'] = 463,
		['filter'] = '成人笑话'
	},
	[464] = {
		['id'] = 464,
		['filter'] = '成人杂志'
	},
	[465] = {
		['id'] = 465,
		['filter'] = '成人雜誌'
	},
	[466] = {
		['id'] = 466,
		['filter'] = '城市激情聊天室'
	},
	[467] = {
		['id'] = 467,
		['filter'] = '痴汉是犯罪'
	},
	[468] = {
		['id'] = 468,
		['filter'] = '痴男发威'
	},
	[469] = {
		['id'] = 469,
		['filter'] = '癡漢是犯罪'
	},
	[470] = {
		['id'] = 470,
		['filter'] = '迟浩田'
	},
	[471] = {
		['id'] = 471,
		['filter'] = '迟来的救灾'
	},
	[472] = {
		['id'] = 472,
		['filter'] = '持不同政见'
	},
	[473] = {
		['id'] = 473,
		['filter'] = '赤匪'
	},
	[474] = {
		['id'] = 474,
		['filter'] = '赤化'
	},
	[475] = {
		['id'] = 475,
		['filter'] = '丑化'
	},
	[476] = {
		['id'] = 476,
		['filter'] = '臭作'
	},
	[477] = {
		['id'] = 477,
		['filter'] = '臭作尾行'
	},
	[478] = {
		['id'] = 478,
		['filter'] = '除湿机'
	},
	[479] = {
		['id'] = 479,
		['filter'] = '处女'
	},
	[480] = {
		['id'] = 480,
		['filter'] = '处女终结者'
	},
	[481] = {
		['id'] = 481,
		['filter'] = '川島和津實'
	},
	[482] = {
		['id'] = 482,
		['filter'] = '传九退三'
	},
	[483] = {
		['id'] = 483,
		['filter'] = '传说的胡曾联手是一种假象'
	},
	[484] = {
		['id'] = 484,
		['filter'] = '传真群发'
	},
	[485] = {
		['id'] = 485,
		['filter'] = '传中共中央关于17大的人事安排意见'
	},
	[486] = {
		['id'] = 486,
		['filter'] = '吹萧'
	},
	[487] = {
		['id'] = 487,
		['filter'] = '春节晚会正统文化'
	},
	[488] = {
		['id'] = 488,
		['filter'] = '春夏之交'
	},
	[489] = {
		['id'] = 489,
		['filter'] = '春夏自由论坛'
	},
	[490] = {
		['id'] = 490,
		['filter'] = '春药'
	},
	[491] = {
		['id'] = 491,
		['filter'] = '春藥'
	},
	[492] = {
		['id'] = 492,
		['filter'] = '慈悲功'
	},
	[493] = {
		['id'] = 493,
		['filter'] = '从圣地寻求财富'
	},
	[494] = {
		['id'] = 494,
		['filter'] = '粗口歌'
	},
	[495] = {
		['id'] = 495,
		['filter'] = '促红细胞生成素'
	},
	[496] = {
		['id'] = 496,
		['filter'] = '催情春药'
	},
	[497] = {
		['id'] = 497,
		['filter'] = '催情粉'
	},
	[498] = {
		['id'] = 498,
		['filter'] = '催情迷昏药'
	},
	[499] = {
		['id'] = 499,
		['filter'] = '催情水'
	},
	[500] = {
		['id'] = 500,
		['filter'] = '催情藥'
	},
	[501] = {
		['id'] = 501,
		['filter'] = '催情液'
	},
	[502] = {
		['id'] = 502,
		['filter'] = '痤疮'
	},
	[503] = {
		['id'] = 503,
		['filter'] = '达赖'
	},
	[504] = {
		['id'] = 504,
		['filter'] = '达赖过封锁'
	},
	[505] = {
		['id'] = 505,
		['filter'] = '达赖喇嘛'
	},
	[506] = {
		['id'] = 506,
		['filter'] = '达赖领奖'
	},
	[507] = {
		['id'] = 507,
		['filter'] = '达米宣教会'
	},
	[508] = {
		['id'] = 508,
		['filter'] = '答案卫星接收机'
	},
	[509] = {
		['id'] = 509,
		['filter'] = '打倒共产党'
	},
	[510] = {
		['id'] = 510,
		['filter'] = '打保单'
	},
	[511] = {
		['id'] = 511,
		['filter'] = '打倒'
	},
	[512] = {
		['id'] = 512,
		['filter'] = '打飞机'
	},
	[513] = {
		['id'] = 513,
		['filter'] = '打炮'
	},
	[514] = {
		['id'] = 514,
		['filter'] = '打坦克手册'
	},
	[515] = {
		['id'] = 515,
		['filter'] = '打砸抢'
	},
	[516] = {
		['id'] = 516,
		['filter'] = '大b'
	},
	[517] = {
		['id'] = 517,
		['filter'] = '大逼'
	},
	[518] = {
		['id'] = 518,
		['filter'] = '大比'
	},
	[519] = {
		['id'] = 519,
		['filter'] = '大彩'
	},
	[520] = {
		['id'] = 520,
		['filter'] = '大参考'
	},
	[521] = {
		['id'] = 521,
		['filter'] = '大法'
	},
	[522] = {
		['id'] = 522,
		['filter'] = '大法大福'
	},
	[523] = {
		['id'] = 523,
		['filter'] = '大法大纪园'
	},
	[524] = {
		['id'] = 524,
		['filter'] = '大法弟子'
	},
	[525] = {
		['id'] = 525,
		['filter'] = '大法洪传'
	},
	[526] = {
		['id'] = 526,
		['filter'] = '大法师傅'
	},
	[527] = {
		['id'] = 527,
		['filter'] = '大法新闻社'
	},
	[528] = {
		['id'] = 528,
		['filter'] = '大法修炼者'
	},
	[529] = {
		['id'] = 529,
		['filter'] = '大法之声'
	},
	[530] = {
		['id'] = 530,
		['filter'] = '大砝弟子'
	},
	[531] = {
		['id'] = 531,
		['filter'] = '大珐'
	},
	[532] = {
		['id'] = 532,
		['filter'] = '大盖帽'
	},
	[533] = {
		['id'] = 533,
		['filter'] = '大蓋帽'
	},
	[534] = {
		['id'] = 534,
		['filter'] = '大花逼'
	},
	[535] = {
		['id'] = 535,
		['filter'] = '大鸡巴'
	},
	[536] = {
		['id'] = 536,
		['filter'] = '大记元'
	},
	[537] = {
		['id'] = 537,
		['filter'] = '大纪'
	},
	[538] = {
		['id'] = 538,
		['filter'] = '大纪元'
	},
	[539] = {
		['id'] = 539,
		['filter'] = '大纪元法轮功'
	},
	[540] = {
		['id'] = 540,
		['filter'] = '大纪元时报'
	},
	[541] = {
		['id'] = 541,
		['filter'] = '大纪元新闻网'
	},
	[542] = {
		['id'] = 542,
		['filter'] = '大纪元杂志'
	},
	[543] = {
		['id'] = 543,
		['filter'] = '大纪园'
	},
	[544] = {
		['id'] = 544,
		['filter'] = '大家论坛'
	},
	[545] = {
		['id'] = 545,
		['filter'] = '大禁'
	},
	[546] = {
		['id'] = 546,
		['filter'] = '大陆'
	},
	[547] = {
		['id'] = 547,
		['filter'] = '大陆当局'
	},
	[548] = {
		['id'] = 548,
		['filter'] = '大陆当权者'
	},
	[549] = {
		['id'] = 549,
		['filter'] = '大陆独裁者'
	},
	[550] = {
		['id'] = 550,
		['filter'] = '大陆官员'
	},
	[551] = {
		['id'] = 551,
		['filter'] = '大陆同修'
	},
	[552] = {
		['id'] = 552,
		['filter'] = '大片'
	},
	[553] = {
		['id'] = 553,
		['filter'] = '大庆工潮'
	},
	[554] = {
		['id'] = 554,
		['filter'] = '大荣'
	},
	[555] = {
		['id'] = 555,
		['filter'] = '大史'
	},
	[556] = {
		['id'] = 556,
		['filter'] = '大史记'
	},
	[557] = {
		['id'] = 557,
		['filter'] = '大史纪'
	},
	[558] = {
		['id'] = 558,
		['filter'] = '大田高山茶'
	},
	[559] = {
		['id'] = 559,
		['filter'] = '大型地网'
	},
	[560] = {
		['id'] = 560,
		['filter'] = '大熊猫被猎杀'
	},
	[561] = {
		['id'] = 561,
		['filter'] = '大学暴动'
	},
	[562] = {
		['id'] = 562,
		['filter'] = '大学骚乱'
	},
	[563] = {
		['id'] = 563,
		['filter'] = '大學騷亂'
	},
	[564] = {
		['id'] = 564,
		['filter'] = '大圆满法'
	},
	[565] = {
		['id'] = 565,
		['filter'] = '大跃进'
	},
	[566] = {
		['id'] = 566,
		['filter'] = '大澤惠'
	},
	[567] = {
		['id'] = 567,
		['filter'] = '大扎荣'
	},
	[568] = {
		['id'] = 568,
		['filter'] = '大中国论坛'
	},
	[569] = {
		['id'] = 569,
		['filter'] = '大中华论坛'
	},
	[570] = {
		['id'] = 570,
		['filter'] = '大众真人真事'
	},
	[571] = {
		['id'] = 571,
		['filter'] = '大祚荣'
	},
	[572] = {
		['id'] = 572,
		['filter'] = '代-办-证件'
	},
	[573] = {
		['id'] = 573,
		['filter'] = '代办国外文凭'
	},
	[574] = {
		['id'] = 574,
		['filter'] = '代办签证'
	},
	[575] = {
		['id'] = 575,
		['filter'] = '代办文凭'
	},
	[576] = {
		['id'] = 576,
		['filter'] = '代办证件'
	},
	[577] = {
		['id'] = 577,
		['filter'] = '代辦'
	},
	[578] = {
		['id'] = 578,
		['filter'] = '代发帖'
	},
	[579] = {
		['id'] = 579,
		['filter'] = '代缴发票'
	},
	[580] = {
		['id'] = 580,
		['filter'] = '代缴税'
	},
	[581] = {
		['id'] = 581,
		['filter'] = '代开发票'
	},
	[582] = {
		['id'] = 582,
		['filter'] = '代开商业发票'
	},
	[583] = {
		['id'] = 583,
		['filter'] = '代开增值税'
	},
	[584] = {
		['id'] = 584,
		['filter'] = '代開'
	},
	[585] = {
		['id'] = 585,
		['filter'] = '代開發票'
	},
	[586] = {
		['id'] = 586,
		['filter'] = '代卖发票'
	},
	[587] = {
		['id'] = 587,
		['filter'] = '代售发票'
	},
	[588] = {
		['id'] = 588,
		['filter'] = '代写'
	},
	[589] = {
		['id'] = 589,
		['filter'] = '代孕'
	},
	[590] = {
		['id'] = 590,
		['filter'] = '待开发票'
	},
	[591] = {
		['id'] = 591,
		['filter'] = '戴海静'
	},
	[592] = {
		['id'] = 592,
		['filter'] = '戴海靜'
	},
	[593] = {
		['id'] = 593,
		['filter'] = '戴相龙'
	},
	[594] = {
		['id'] = 594,
		['filter'] = '耽美'
	},
	[595] = {
		['id'] = 595,
		['filter'] = '当代八乱办公室手官场日志'
	},
	[596] = {
		['id'] = 596,
		['filter'] = '当代八乱办公室守则官场日志'
	},
	[597] = {
		['id'] = 597,
		['filter'] = '当代十大无耻语录'
	},
	[598] = {
		['id'] = 598,
		['filter'] = '当代无耻语录排行榜'
	},
	[599] = {
		['id'] = 599,
		['filter'] = '当代中国无耻语录排行榜'
	},
	[600] = {
		['id'] = 600,
		['filter'] = '当今六大谎言'
	},
	[601] = {
		['id'] = 601,
		['filter'] = '当今三大扯蛋'
	},
	[602] = {
		['id'] = 602,
		['filter'] = '当今四大扯蛋'
	},
	[603] = {
		['id'] = 603,
		['filter'] = '挡坦克'
	},
	[604] = {
		['id'] = 604,
		['filter'] = '党保平安'
	},
	[605] = {
		['id'] = 605,
		['filter'] = '党棍'
	},
	[606] = {
		['id'] = 606,
		['filter'] = '党国'
	},
	[607] = {
		['id'] = 607,
		['filter'] = '党禁'
	},
	[608] = {
		['id'] = 608,
		['filter'] = '党魁'
	},
	[609] = {
		['id'] = 609,
		['filter'] = '党妈妈'
	},
	[610] = {
		['id'] = 610,
		['filter'] = '党内内部资料'
	},
	[611] = {
		['id'] = 611,
		['filter'] = '党内权力'
	},
	[612] = {
		['id'] = 612,
		['filter'] = '党内权争'
	},
	[613] = {
		['id'] = 613,
		['filter'] = '党内危机'
	},
	[614] = {
		['id'] = 614,
		['filter'] = '党内言事潮'
	},
	[615] = {
		['id'] = 615,
		['filter'] = '党委书记'
	},
	[616] = {
		['id'] = 616,
		['filter'] = '党文化'
	},
	[617] = {
		['id'] = 617,
		['filter'] = '党政人事'
	},
	[618] = {
		['id'] = 618,
		['filter'] = '荡妇'
	},
	[619] = {
		['id'] = 619,
		['filter'] = '导演专访'
	},
	[620] = {
		['id'] = 620,
		['filter'] = '登辉'
	},
	[621] = {
		['id'] = 621,
		['filter'] = '等级答案'
	},
	[622] = {
		['id'] = 622,
		['filter'] = '邓二世'
	},
	[623] = {
		['id'] = 623,
		['filter'] = '邓力群自述'
	},
	[624] = {
		['id'] = 624,
		['filter'] = '邓派'
	},
	[625] = {
		['id'] = 625,
		['filter'] = '邓小平'
	},
	[626] = {
		['id'] = 626,
		['filter'] = '邓小平的英文'
	},
	[627] = {
		['id'] = 627,
		['filter'] = '邓小平的预言'
	},
	[628] = {
		['id'] = 628,
		['filter'] = '邓小平讲英语'
	},
	[629] = {
		['id'] = 629,
		['filter'] = '邓笑贫'
	},
	[630] = {
		['id'] = 630,
		['filter'] = '邓颖超日记'
	},
	[631] = {
		['id'] = 631,
		['filter'] = '鄧小平'
	},
	[632] = {
		['id'] = 632,
		['filter'] = '狄玉明'
	},
	[633] = {
		['id'] = 633,
		['filter'] = '迪里夏提'
	},
	[634] = {
		['id'] = 634,
		['filter'] = '底裤'
	},
	[635] = {
		['id'] = 635,
		['filter'] = '抵押免担保'
	},
	[636] = {
		['id'] = 636,
		['filter'] = '抵制'
	},
	[637] = {
		['id'] = 637,
		['filter'] = '抵制家乐福'
	},
	[638] = {
		['id'] = 638,
		['filter'] = '地磅调解器'
	},
	[639] = {
		['id'] = 639,
		['filter'] = '地磅遥控器解码器'
	},
	[640] = {
		['id'] = 640,
		['filter'] = '地磅仪'
	},
	[641] = {
		['id'] = 641,
		['filter'] = '地磅儀'
	},
	[642] = {
		['id'] = 642,
		['filter'] = '地方召会'
	},
	[643] = {
		['id'] = 643,
		['filter'] = '地块规划'
	},
	[644] = {
		['id'] = 644,
		['filter'] = '地西泮片'
	},
	[645] = {
		['id'] = 645,
		['filter'] = '地下教会'
	},
	[646] = {
		['id'] = 646,
		['filter'] = '地下刊物'
	},
	[647] = {
		['id'] = 647,
		['filter'] = '地下先烈'
	},
	[648] = {
		['id'] = 648,
		['filter'] = '地下先烈们纷纷来电询问'
	},
	[649] = {
		['id'] = 649,
		['filter'] = '地震天谴'
	},
	[650] = {
		['id'] = 650,
		['filter'] = '弟疼'
	},
	[651] = {
		['id'] = 651,
		['filter'] = '弟痛'
	},
	[652] = {
		['id'] = 652,
		['filter'] = '弟子'
	},
	[653] = {
		['id'] = 653,
		['filter'] = '帝国之梦'
	},
	[654] = {
		['id'] = 654,
		['filter'] = '帝國之夢'
	},
	[655] = {
		['id'] = 655,
		['filter'] = '递进民主'
	},
	[656] = {
		['id'] = 656,
		['filter'] = '第二代身份证'
	},
	[657] = {
		['id'] = 657,
		['filter'] = '第三党'
	},
	[658] = {
		['id'] = 658,
		['filter'] = '第三道路党'
	},
	[659] = {
		['id'] = 659,
		['filter'] = '第十六次代表'
	},
	[660] = {
		['id'] = 660,
		['filter'] = '第四代'
	},
	[661] = {
		['id'] = 661,
		['filter'] = '第五代红人'
	},
	[662] = {
		['id'] = 662,
		['filter'] = '第五代接班梯队'
	},
	[663] = {
		['id'] = 663,
		['filter'] = '第五代中央领导人'
	},
	[664] = {
		['id'] = 664,
		['filter'] = '第一书记'
	},
	[665] = {
		['id'] = 665,
		['filter'] = '颠覆中国政权'
	},
	[666] = {
		['id'] = 666,
		['filter'] = '颠覆中华人民共和国政'
	},
	[667] = {
		['id'] = 667,
		['filter'] = '电子狗'
	},
	[668] = {
		['id'] = 668,
		['filter'] = '电车之狼'
	},
	[669] = {
		['id'] = 669,
		['filter'] = '电动葫芦'
	},
	[670] = {
		['id'] = 670,
		['filter'] = '电话拦截'
	},
	[671] = {
		['id'] = 671,
		['filter'] = '电视流氓'
	},
	[672] = {
		['id'] = 672,
		['filter'] = '电信路藏民'
	},
	[673] = {
		['id'] = 673,
		['filter'] = '電車之狼'
	},
	[674] = {
		['id'] = 674,
		['filter'] = '電話攔截'
	},
	[675] = {
		['id'] = 675,
		['filter'] = '電子狗'
	},
	[676] = {
		['id'] = 676,
		['filter'] = '钓鱼岛'
	},
	[677] = {
		['id'] = 677,
		['filter'] = '调试家用卫星'
	},
	[678] = {
		['id'] = 678,
		['filter'] = '調教'
	},
	[679] = {
		['id'] = 679,
		['filter'] = '丁关根'
	},
	[680] = {
		['id'] = 680,
		['filter'] = '丁元'
	},
	[681] = {
		['id'] = 681,
		['filter'] = '丁子霖'
	},
	[682] = {
		['id'] = 682,
		['filter'] = '叮丙诺菲'
	},
	[683] = {
		['id'] = 683,
		['filter'] = '顶级'
	},
	[684] = {
		['id'] = 684,
		['filter'] = '定情粉'
	},
	[685] = {
		['id'] = 685,
		['filter'] = '定情药'
	},
	[686] = {
		['id'] = 686,
		['filter'] = '东北独立'
	},
	[687] = {
		['id'] = 687,
		['filter'] = '动*态*网'
	},
	[688] = {
		['id'] = 688,
		['filter'] = '动乱'
	},
	[689] = {
		['id'] = 689,
		['filter'] = '动态代理'
	},
	[690] = {
		['id'] = 690,
		['filter'] = '动态网'
	},
	[691] = {
		['id'] = 691,
		['filter'] = '動乱'
	},
	[692] = {
		['id'] = 692,
		['filter'] = '毒气赌具'
	},
	[693] = {
		['id'] = 693,
		['filter'] = '独裁'
	},
	[694] = {
		['id'] = 694,
		['filter'] = '独裁政治'
	},
	[695] = {
		['id'] = 695,
		['filter'] = '独夫'
	},
	[696] = {
		['id'] = 696,
		['filter'] = '独立台湾会'
	},
	[697] = {
		['id'] = 697,
		['filter'] = '独立中文笔会'
	},
	[698] = {
		['id'] = 698,
		['filter'] = '赌博粉'
	},
	[699] = {
		['id'] = 699,
		['filter'] = '赌博透视器'
	},
	[700] = {
		['id'] = 700,
		['filter'] = '赌博专用'
	},
	[701] = {
		['id'] = 701,
		['filter'] = '赌球'
	},
	[702] = {
		['id'] = 702,
		['filter'] = '赌球网站'
	},
	[703] = {
		['id'] = 703,
		['filter'] = '賭博粉'
	},
	[704] = {
		['id'] = 704,
		['filter'] = '賭博專用'
	},
	[705] = {
		['id'] = 705,
		['filter'] = '杜智富'
	},
	[706] = {
		['id'] = 706,
		['filter'] = '渡海登陆作战选编'
	},
	[707] = {
		['id'] = 707,
		['filter'] = '对共产党清算'
	},
	[708] = {
		['id'] = 708,
		['filter'] = '对华广播'
	},
	[709] = {
		['id'] = 709,
		['filter'] = '对日强硬'
	},
	[710] = {
		['id'] = 710,
		['filter'] = '对外高层人事'
	},
	[711] = {
		['id'] = 711,
		['filter'] = '对中共的姑息就是对死难者的残忍'
	},
	[712] = {
		['id'] = 712,
		['filter'] = '多党'
	},
	[713] = {
		['id'] = 713,
		['filter'] = '多党执政'
	},
	[714] = {
		['id'] = 714,
		['filter'] = '多黨'
	},
	[715] = {
		['id'] = 715,
		['filter'] = '多吉才让'
	},
	[716] = {
		['id'] = 716,
		['filter'] = '多美康'
	},
	[717] = {
		['id'] = 717,
		['filter'] = '多维'
	},
	[718] = {
		['id'] = 718,
		['filter'] = '多维新闻'
	},
	[719] = {
		['id'] = 719,
		['filter'] = '堕落指南'
	},
	[720] = {
		['id'] = 720,
		['filter'] = '屙民'
	},
	[721] = {
		['id'] = 721,
		['filter'] = '俄国'
	},
	[722] = {
		['id'] = 722,
		['filter'] = '恶党'
	},
	[723] = {
		['id'] = 723,
		['filter'] = '恶搞'
	},
	[724] = {
		['id'] = 724,
		['filter'] = '恶搞人民币'
	},
	[725] = {
		['id'] = 725,
		['filter'] = '恶搞晚会'
	},
	[726] = {
		['id'] = 726,
		['filter'] = '恶警'
	},
	[727] = {
		['id'] = 727,
		['filter'] = '恩诺欣'
	},
	[728] = {
		['id'] = 728,
		['filter'] = '二B'
	},
	[729] = {
		['id'] = 729,
		['filter'] = '二逼'
	},
	[730] = {
		['id'] = 730,
		['filter'] = '发-票'
	},
	[731] = {
		['id'] = 731,
		['filter'] = '发/票/代/开'
	},
	[732] = {
		['id'] = 732,
		['filter'] = '发愣'
	},
	[733] = {
		['id'] = 733,
		['filter'] = '发抡'
	},
	[734] = {
		['id'] = 734,
		['filter'] = '发抡功'
	},
	[735] = {
		['id'] = 735,
		['filter'] = '发仑'
	},
	[736] = {
		['id'] = 736,
		['filter'] = '发仑da发'
	},
	[737] = {
		['id'] = 737,
		['filter'] = '发伦'
	},
	[738] = {
		['id'] = 738,
		['filter'] = '发伦工'
	},
	[739] = {
		['id'] = 739,
		['filter'] = '发伦功'
	},
	[740] = {
		['id'] = 740,
		['filter'] = '发囵'
	},
	[741] = {
		['id'] = 741,
		['filter'] = '发沦'
	},
	[742] = {
		['id'] = 742,
		['filter'] = '发纶'
	},
	[743] = {
		['id'] = 743,
		['filter'] = '发轮'
	},
	[744] = {
		['id'] = 744,
		['filter'] = '发轮功'
	},
	[745] = {
		['id'] = 745,
		['filter'] = '发轮功陈果'
	},
	[746] = {
		['id'] = 746,
		['filter'] = '发论'
	},
	[747] = {
		['id'] = 747,
		['filter'] = '发论公'
	},
	[748] = {
		['id'] = 748,
		['filter'] = '发论功'
	},
	[749] = {
		['id'] = 749,
		['filter'] = '发票代开'
	},
	[750] = {
		['id'] = 750,
		['filter'] = '发正念'
	},
	[751] = {
		['id'] = 751,
		['filter'] = '發-票'
	},
	[752] = {
		['id'] = 752,
		['filter'] = '發倫'
	},
	[753] = {
		['id'] = 753,
		['filter'] = '發淪'
	},
	[754] = {
		['id'] = 754,
		['filter'] = '發輪'
	},
	[755] = {
		['id'] = 755,
		['filter'] = '發論'
	},
	[756] = {
		['id'] = 756,
		['filter'] = '法 轮 功'
	},
	[757] = {
		['id'] = 757,
		['filter'] = '法\'轮'
	},
	[758] = {
		['id'] = 758,
		['filter'] = '法*功'
	},
	[759] = {
		['id'] = 759,
		['filter'] = '法+轮+功'
	},
	[760] = {
		['id'] = 760,
		['filter'] = '法+輪+功'
	},
	[761] = {
		['id'] = 761,
		['filter'] = '法-轮-功'
	},
	[762] = {
		['id'] = 762,
		['filter'] = '法.轮.}功'
	},
	[763] = {
		['id'] = 763,
		['filter'] = '法.輪.功'
	},
	[764] = {
		['id'] = 764,
		['filter'] = '法.轮'
	},
	[765] = {
		['id'] = 765,
		['filter'] = '法.轮.功'
	},
	[766] = {
		['id'] = 766,
		['filter'] = '法/轮'
	},
	[767] = {
		['id'] = 767,
		['filter'] = '法/轮/功'
	},
	[768] = {
		['id'] = 768,
		['filter'] = '法'
	},
	[769] = {
		['id'] = 769,
		['filter'] = '法?'
	},
	[770] = {
		['id'] = 770,
		['filter'] = '法@轮'
	},
	[771] = {
		['id'] = 771,
		['filter'] = '法lun功'
	},
	[772] = {
		['id'] = 772,
		['filter'] = '法L功'
	},
	[773] = {
		['id'] = 773,
		['filter'] = '法\轮'
	},
	[774] = {
		['id'] = 774,
		['filter'] = '法？轮？功'
	},
	[775] = {
		['id'] = 775,
		['filter'] = '法车仑工力'
	},
	[776] = {
		['id'] = 776,
		['filter'] = '法拉盛'
	},
	[777] = {
		['id'] = 777,
		['filter'] = '法拉盛缅街'
	},
	[778] = {
		['id'] = 778,
		['filter'] = '法愣'
	},
	[779] = {
		['id'] = 779,
		['filter'] = '法抡'
	},
	[780] = {
		['id'] = 780,
		['filter'] = '法抡功'
	},
	[781] = {
		['id'] = 781,
		['filter'] = '法仑'
	},
	[782] = {
		['id'] = 782,
		['filter'] = '法伦'
	},
	[783] = {
		['id'] = 783,
		['filter'] = '法囵'
	},
	[784] = {
		['id'] = 784,
		['filter'] = '法沦'
	},
	[785] = {
		['id'] = 785,
		['filter'] = '法纶'
	},
	[786] = {
		['id'] = 786,
		['filter'] = '法轮'
	},
	[787] = {
		['id'] = 787,
		['filter'] = '法轮{5}'
	},
	[788] = {
		['id'] = 788,
		['filter'] = '法轮大法'
	},
	[789] = {
		['id'] = 789,
		['filter'] = '法轮弟子'
	},
	[790] = {
		['id'] = 790,
		['filter'] = '法轮佛法'
	},
	[791] = {
		['id'] = 791,
		['filter'] = '法倫'
	},
	[792] = {
		['id'] = 792,
		['filter'] = '法淪'
	},
	[793] = {
		['id'] = 793,
		['filter'] = '法輪'
	},
	[794] = {
		['id'] = 794,
		['filter'] = '法论'
	},
	[795] = {
		['id'] = 795,
		['filter'] = '法論'
	},
	[796] = {
		['id'] = 796,
		['filter'] = '法十轮十功'
	},
	[797] = {
		['id'] = 797,
		['filter'] = '法一轮'
	},
	[798] = {
		['id'] = 798,
		['filter'] = '法谪'
	},
	[799] = {
		['id'] = 799,
		['filter'] = '法谪功'
	},
	[800] = {
		['id'] = 800,
		['filter'] = '法正'
	},
	[801] = {
		['id'] = 801,
		['filter'] = '法正乾坤'
	},
	[802] = {
		['id'] = 802,
		['filter'] = '法正人间'
	},
	[803] = {
		['id'] = 803,
		['filter'] = '砝仑'
	},
	[804] = {
		['id'] = 804,
		['filter'] = '砝伦'
	},
	[805] = {
		['id'] = 805,
		['filter'] = '砝轮'
	},
	[806] = {
		['id'] = 806,
		['filter'] = '珐(工力)学T'
	},
	[807] = {
		['id'] = 807,
		['filter'] = '珐.輪功'
	},
	[808] = {
		['id'] = 808,
		['filter'] = '樊守志'
	},
	[809] = {
		['id'] = 809,
		['filter'] = '反党'
	},
	[810] = {
		['id'] = 810,
		['filter'] = '反动'
	},
	[811] = {
		['id'] = 811,
		['filter'] = '反对08奥运会'
	},
	[812] = {
		['id'] = 812,
		['filter'] = '反对共产党'
	},
	[813] = {
		['id'] = 813,
		['filter'] = '反对共产主义'
	},
	[814] = {
		['id'] = 814,
		['filter'] = '反封锁'
	},
	[815] = {
		['id'] = 815,
		['filter'] = '反封锁技术'
	},
	[816] = {
		['id'] = 816,
		['filter'] = '反腐败论坛'
	},
	[817] = {
		['id'] = 817,
		['filter'] = '反腐总攻'
	},
	[818] = {
		['id'] = 818,
		['filter'] = '反革命政变纲领'
	},
	[819] = {
		['id'] = 819,
		['filter'] = '反攻'
	},
	[820] = {
		['id'] = 820,
		['filter'] = '反攻大陆'
	},
	[821] = {
		['id'] = 821,
		['filter'] = '反共'
	},
	[822] = {
		['id'] = 822,
		['filter'] = '反共传单'
	},
	[823] = {
		['id'] = 823,
		['filter'] = '反共言论'
	},
	[824] = {
		['id'] = 824,
		['filter'] = '反华'
	},
	[825] = {
		['id'] = 825,
		['filter'] = '反雷达测速'
	},
	[826] = {
		['id'] = 826,
		['filter'] = '反雷達測速'
	},
	[827] = {
		['id'] = 827,
		['filter'] = '反民主'
	},
	[828] = {
		['id'] = 828,
		['filter'] = '反人类'
	},
	[829] = {
		['id'] = 829,
		['filter'] = '反人类罪'
	},
	[830] = {
		['id'] = 830,
		['filter'] = '反社会'
	},
	[831] = {
		['id'] = 831,
		['filter'] = '反政府'
	},
	[832] = {
		['id'] = 832,
		['filter'] = '反中'
	},
	[833] = {
		['id'] = 833,
		['filter'] = '反中共黑色暴力'
	},
	[834] = {
		['id'] = 834,
		['filter'] = '饭岛爱'
	},
	[835] = {
		['id'] = 835,
		['filter'] = '飯島愛'
	},
	[836] = {
		['id'] = 836,
		['filter'] = '方励之'
	},
	[837] = {
		['id'] = 837,
		['filter'] = '方丈哭曰'
	},
	[838] = {
		['id'] = 838,
		['filter'] = '方针定调'
	},
	[839] = {
		['id'] = 839,
		['filter'] = '方舟子'
	},
	[840] = {
		['id'] = 840,
		['filter'] = '方祖岐'
	},
	[841] = {
		['id'] = 841,
		['filter'] = '芳香型智悟气功'
	},
	[842] = {
		['id'] = 842,
		['filter'] = '防拍器'
	},
	[843] = {
		['id'] = 843,
		['filter'] = '防身药水'
	},
	[844] = {
		['id'] = 844,
		['filter'] = '仿云石'
	},
	[845] = {
		['id'] = 845,
		['filter'] = '仿真假钞'
	},
	[846] = {
		['id'] = 846,
		['filter'] = '放荡青春'
	},
	[847] = {
		['id'] = 847,
		['filter'] = '放光明电视制作中心'
	},
	[848] = {
		['id'] = 848,
		['filter'] = '放下生死'
	},
	[849] = {
		['id'] = 849,
		['filter'] = '飞天舞蹈学校'
	},
	[850] = {
		['id'] = 850,
		['filter'] = '飞扬论坛'
	},
	[851] = {
		['id'] = 851,
		['filter'] = '斐得勒'
	},
	[852] = {
		['id'] = 852,
		['filter'] = '废除劳教签名'
	},
	[853] = {
		['id'] = 853,
		['filter'] = '废统'
	},
	[854] = {
		['id'] = 854,
		['filter'] = '费良勇'
	},
	[855] = {
		['id'] = 855,
		['filter'] = '分家在'
	},
	[856] = {
		['id'] = 856,
		['filter'] = '分裂'
	},
	[857] = {
		['id'] = 857,
		['filter'] = '分析王'
	},
	[858] = {
		['id'] = 858,
		['filter'] = '粉刺'
	},
	[859] = {
		['id'] = 859,
		['filter'] = '粉嫩小洞'
	},
	[860] = {
		['id'] = 860,
		['filter'] = '粉饰太平'
	},
	[861] = {
		['id'] = 861,
		['filter'] = '粉碎林陈材料'
	},
	[862] = {
		['id'] = 862,
		['filter'] = '粉碎林陈反党集团反革命政变的斗争'
	},
	[863] = {
		['id'] = 863,
		['filter'] = '风雷游戏登陆'
	},
	[864] = {
		['id'] = 864,
		['filter'] = '风流名妓苏小小'
	},
	[865] = {
		['id'] = 865,
		['filter'] = '风骚'
	},
	[866] = {
		['id'] = 866,
		['filter'] = '封从德'
	},
	[867] = {
		['id'] = 867,
		['filter'] = '封杀'
	},
	[868] = {
		['id'] = 868,
		['filter'] = '風花'
	},
	[869] = {
		['id'] = 869,
		['filter'] = '冯勇彬'
	},
	[870] = {
		['id'] = 870,
		['filter'] = '冯东海'
	},
	[871] = {
		['id'] = 871,
		['filter'] = '冯素英'
	},
	[872] = {
		['id'] = 872,
		['filter'] = '佛怀煽仇录'
	},
	[873] = {
		['id'] = 873,
		['filter'] = '佛展千手法'
	},
	[874] = {
		['id'] = 874,
		['filter'] = '扶不起的阿斗'
	},
	[875] = {
		['id'] = 875,
		['filter'] = '服务器托管'
	},
	[876] = {
		['id'] = 876,
		['filter'] = '服务人员'
	},
	[877] = {
		['id'] = 877,
		['filter'] = '服务小姐'
	},
	[878] = {
		['id'] = 878,
		['filter'] = '浮情浪子'
	},
	[879] = {
		['id'] = 879,
		['filter'] = '府软弱'
	},
	[880] = {
		['id'] = 880,
		['filter'] = '付申奇'
	},
	[881] = {
		['id'] = 881,
		['filter'] = '妇的哀羞'
	},
	[882] = {
		['id'] = 882,
		['filter'] = '复员军官代表'
	},
	[883] = {
		['id'] = 883,
		['filter'] = '复员军官诉求书'
	},
	[884] = {
		['id'] = 884,
		['filter'] = '复转军人'
	},
	[885] = {
		['id'] = 885,
		['filter'] = '副书记'
	},
	[886] = {
		['id'] = 886,
		['filter'] = '副主席'
	},
	[887] = {
		['id'] = 887,
		['filter'] = '傅成玉'
	},
	[888] = {
		['id'] = 888,
		['filter'] = '傅申奇'
	},
	[889] = {
		['id'] = 889,
		['filter'] = '傅志寰'
	},
	[890] = {
		['id'] = 890,
		['filter'] = '噶玛吧'
	},
	[891] = {
		['id'] = 891,
		['filter'] = '改革六大成绩'
	},
	[892] = {
		['id'] = 892,
		['filter'] = '改革阵痛'
	},
	[893] = {
		['id'] = 893,
		['filter'] = '干 你 妈'
	},
	[894] = {
		['id'] = 894,
		['filter'] = '干她'
	},
	[895] = {
		['id'] = 895,
		['filter'] = '干妳'
	},
	[896] = {
		['id'] = 896,
		['filter'] = '干妳老母'
	},
	[897] = {
		['id'] = 897,
		['filter'] = '干妳妈'
	},
	[898] = {
		['id'] = 898,
		['filter'] = '干妳娘'
	},
	[899] = {
		['id'] = 899,
		['filter'] = '干你'
	},
	[900] = {
		['id'] = 900,
		['filter'] = '干你妈b'
	},
	[901] = {
		['id'] = 901,
		['filter'] = '干你妈逼'
	},
	[902] = {
		['id'] = 902,
		['filter'] = '干你娘'
	},
	[903] = {
		['id'] = 903,
		['filter'] = '干扰赈灾募捐事件回放'
	},
	[904] = {
		['id'] = 904,
		['filter'] = '干死你'
	},
	[905] = {
		['id'] = 905,
		['filter'] = '干他'
	},
	[906] = {
		['id'] = 906,
		['filter'] = '干以胜'
	},
	[907] = {
		['id'] = 907,
		['filter'] = '甘油'
	},
	[908] = {
		['id'] = 908,
		['filter'] = '感动中国乱弹人物揭晓'
	},
	[909] = {
		['id'] = 909,
		['filter'] = '幹擾器'
	},
	[910] = {
		['id'] = 910,
		['filter'] = '赣江学院'
	},
	[911] = {
		['id'] = 911,
		['filter'] = '肛交'
	},
	[912] = {
		['id'] = 912,
		['filter'] = '肛门'
	},
	[913] = {
		['id'] = 913,
		['filter'] = '港澳博球网'
	},
	[914] = {
		['id'] = 914,
		['filter'] = '高立新'
	},
	[915] = {
		['id'] = 915,
		['filter'] = '高压锅炉'
	},
	[916] = {
		['id'] = 916,
		['filter'] = '高潮'
	},
	[917] = {
		['id'] = 917,
		['filter'] = '高低温交变湿热试验箱'
	},
	[918] = {
		['id'] = 918,
		['filter'] = '高干'
	},
	[919] = {
		['id'] = 919,
		['filter'] = '高干新子弟'
	},
	[920] = {
		['id'] = 920,
		['filter'] = '高干子弟'
	},
	[921] = {
		['id'] = 921,
		['filter'] = '高干子弟名单'
	},
	[922] = {
		['id'] = 922,
		['filter'] = '高干子女'
	},
	[923] = {
		['id'] = 923,
		['filter'] = '高幹'
	},
	[924] = {
		['id'] = 924,
		['filter'] = '高幹子弟'
	},
	[925] = {
		['id'] = 925,
		['filter'] = '高幹子女'
	},
	[926] = {
		['id'] = 926,
		['filter'] = '高官'
	},
	[927] = {
		['id'] = 927,
		['filter'] = '高价转让火车票'
	},
	[928] = {
		['id'] = 928,
		['filter'] = '高品质香烟'
	},
	[929] = {
		['id'] = 929,
		['filter'] = '高文谦'
	},
	[930] = {
		['id'] = 930,
		['filter'] = '高效春药'
	},
	[931] = {
		['id'] = 931,
		['filter'] = '高校罢餐'
	},
	[932] = {
		['id'] = 932,
		['filter'] = '高校暴乱'
	},
	[933] = {
		['id'] = 933,
		['filter'] = '高校暴亂'
	},
	[934] = {
		['id'] = 934,
		['filter'] = '高校群体事件'
	},
	[935] = {
		['id'] = 935,
		['filter'] = '高校骚乱'
	},
	[936] = {
		['id'] = 936,
		['filter'] = '高校騷亂'
	},
	[937] = {
		['id'] = 937,
		['filter'] = '高薪养廉'
	},
	[938] = {
		['id'] = 938,
		['filter'] = '高莺莺'
	},
	[939] = {
		['id'] = 939,
		['filter'] = '高瞻'
	},
	[940] = {
		['id'] = 940,
		['filter'] = '高智晟'
	},
	[941] = {
		['id'] = 941,
		['filter'] = '高自联'
	},
	[942] = {
		['id'] = 942,
		['filter'] = '睾丸'
	},
	[943] = {
		['id'] = 943,
		['filter'] = '睾丸素'
	},
	[944] = {
		['id'] = 944,
		['filter'] = '搞晚会'
	},
	[945] = {
		['id'] = 945,
		['filter'] = '搞晚會'
	},
	[946] = {
		['id'] = 946,
		['filter'] = '告别蒸笼车'
	},
	[947] = {
		['id'] = 947,
		['filter'] = '告全国股民同胞书'
	},
	[948] = {
		['id'] = 948,
		['filter'] = '告全国人大书'
	},
	[949] = {
		['id'] = 949,
		['filter'] = '告全体网民书'
	},
	[950] = {
		['id'] = 950,
		['filter'] = '告中国人民解放军广大官兵书'
	},
	[951] = {
		['id'] = 951,
		['filter'] = '戈扬'
	},
	[952] = {
		['id'] = 952,
		['filter'] = '哥疼'
	},
	[953] = {
		['id'] = 953,
		['filter'] = '哥痛'
	},
	[954] = {
		['id'] = 954,
		['filter'] = '哥言语录'
	},
	[955] = {
		['id'] = 955,
		['filter'] = '鸽派'
	},
	[956] = {
		['id'] = 956,
		['filter'] = '割肉人'
	},
	[957] = {
		['id'] = 957,
		['filter'] = '歌功颂德'
	},
	[958] = {
		['id'] = 958,
		['filter'] = '革命'
	},
	[959] = {
		['id'] = 959,
		['filter'] = '革命无罪'
	},
	[960] = {
		['id'] = 960,
		['filter'] = '葛振峰'
	},
	[961] = {
		['id'] = 961,
		['filter'] = '蛤蟆转世'
	},
	[962] = {
		['id'] = 962,
		['filter'] = '个人崇拜'
	},
	[963] = {
		['id'] = 963,
		['filter'] = '个人圆满说'
	},
	[964] = {
		['id'] = 964,
		['filter'] = '个邪的党'
	},
	[965] = {
		['id'] = 965,
		['filter'] = '工商银行用户登陆'
	},
	[966] = {
		['id'] = 966,
		['filter'] = '工业炸药配方设计'
	},
	[967] = {
		['id'] = 967,
		['filter'] = '工自联'
	},
	[968] = {
		['id'] = 968,
		['filter'] = '公安部'
	},
	[969] = {
		['id'] = 969,
		['filter'] = '公安文件'
	},
	[970] = {
		['id'] = 970,
		['filter'] = '公安与武警的区别'
	},
	[971] = {
		['id'] = 971,
		['filter'] = '公产王朝'
	},
	[972] = {
		['id'] = 972,
		['filter'] = '公产小丑'
	},
	[973] = {
		['id'] = 973,
		['filter'] = '公产专制'
	},
	[974] = {
		['id'] = 974,
		['filter'] = '公民大联盟'
	},
	[975] = {
		['id'] = 975,
		['filter'] = '公务员的工资'
	},
	[976] = {
		['id'] = 976,
		['filter'] = '公务员调资'
	},
	[977] = {
		['id'] = 977,
		['filter'] = '公务员工资'
	},
	[978] = {
		['id'] = 978,
		['filter'] = '公子党'
	},
	[979] = {
		['id'] = 979,
		['filter'] = '公子族'
	},
	[980] = {
		['id'] = 980,
		['filter'] = '功德圆满'
	},
	[981] = {
		['id'] = 981,
		['filter'] = '功法'
	},
	[982] = {
		['id'] = 982,
		['filter'] = '功学'
	},
	[983] = {
		['id'] = 983,
		['filter'] = '功学员'
	},
	[984] = {
		['id'] = 984,
		['filter'] = '功友'
	},
	[985] = {
		['id'] = 985,
		['filter'] = '功友弟子'
	},
	[986] = {
		['id'] = 986,
		['filter'] = '攻台'
	},
	[987] = {
		['id'] = 987,
		['filter'] = '龚平?'
	},
	[988] = {
		['id'] = 988,
		['filter'] = '共+产+党'
	},
	[989] = {
		['id'] = 989,
		['filter'] = '共+產+黨'
	},
	[990] = {
		['id'] = 990,
		['filter'] = '共+铲+党'
	},
	[991] = {
		['id'] = 991,
		['filter'] = '共.产.党'
	},
	[992] = {
		['id'] = 992,
		['filter'] = '共.產.黨'
	},
	[993] = {
		['id'] = 993,
		['filter'] = '共.铲.党'
	},
	[994] = {
		['id'] = 994,
		['filter'] = '共.产党'
	},
	[995] = {
		['id'] = 995,
		['filter'] = '共chang党'
	},
	[996] = {
		['id'] = 996,
		['filter'] = '共残党'
	},
	[997] = {
		['id'] = 997,
		['filter'] = '共惨党'
	},
	[998] = {
		['id'] = 998,
		['filter'] = '共产'
	},
	[999] = {
		['id'] = 999,
		['filter'] = '共产.党'
	},
	[1000] = {
		['id'] = 1000,
		['filter'] = '共产党'
	},
	[1001] = {
		['id'] = 1001,
		['filter'] = '共产党的报应'
	},
	[1002] = {
		['id'] = 1002,
		['filter'] = '共产党的末日'
	},
	[1003] = {
		['id'] = 1003,
		['filter'] = '共产极权'
	},
	[1004] = {
		['id'] = 1004,
		['filter'] = '共产王朝'
	},
	[1005] = {
		['id'] = 1005,
		['filter'] = '共产无赖'
	},
	[1006] = {
		['id'] = 1006,
		['filter'] = '共产小丑'
	},
	[1007] = {
		['id'] = 1007,
		['filter'] = '共产主义'
	},
	[1008] = {
		['id'] = 1008,
		['filter'] = '共产主义黑皮书'
	},
	[1009] = {
		['id'] = 1009,
		['filter'] = '共产专制'
	},
	[1010] = {
		['id'] = 1010,
		['filter'] = '共铲党'
	},
	[1011] = {
		['id'] = 1011,
		['filter'] = '共党'
	},
	[1012] = {
		['id'] = 1012,
		['filter'] = '共黨'
	},
	[1013] = {
		['id'] = 1013,
		['filter'] = '共匪'
	},
	[1014] = {
		['id'] = 1014,
		['filter'] = '共狗'
	},
	[1015] = {
		['id'] = 1015,
		['filter'] = '共和国之怒'
	},
	[1016] = {
		['id'] = 1016,
		['filter'] = '共军'
	},
	[1017] = {
		['id'] = 1017,
		['filter'] = '共奴'
	},
	[1018] = {
		['id'] = 1018,
		['filter'] = '勾清明'
	},
	[1019] = {
		['id'] = 1019,
		['filter'] = '狗b'
	},
	[1020] = {
		['id'] = 1020,
		['filter'] = '狗粮'
	},
	[1021] = {
		['id'] = 1021,
		['filter'] = '狗逼'
	},
	[1022] = {
		['id'] = 1022,
		['filter'] = '狗操'
	},
	[1023] = {
		['id'] = 1023,
		['filter'] = '狗卵子'
	},
	[1024] = {
		['id'] = 1024,
		['filter'] = '狗娘'
	},
	[1025] = {
		['id'] = 1025,
		['filter'] = '古方迷香'
	},
	[1026] = {
		['id'] = 1026,
		['filter'] = '古怪歌'
	},
	[1027] = {
		['id'] = 1027,
		['filter'] = '古拉格'
	},
	[1028] = {
		['id'] = 1028,
		['filter'] = '股市民谣'
	},
	[1029] = {
		['id'] = 1029,
		['filter'] = '乖乖药'
	},
	[1030] = {
		['id'] = 1030,
		['filter'] = '关机房'
	},
	[1031] = {
		['id'] = 1031,
		['filter'] = '关于对敌斗争中有关政政策界限汇编'
	},
	[1032] = {
		['id'] = 1032,
		['filter'] = '关于堂明皇与杨贵姬'
	},
	[1033] = {
		['id'] = 1033,
		['filter'] = '关于做好定案材料工作的意见'
	},
	[1034] = {
		['id'] = 1034,
		['filter'] = '关卓中'
	},
	[1035] = {
		['id'] = 1035,
		['filter'] = '观音法门'
	},
	[1036] = {
		['id'] = 1036,
		['filter'] = '官逼民反'
	},
	[1037] = {
		['id'] = 1037,
		['filter'] = '官场段子'
	},
	[1038] = {
		['id'] = 1038,
		['filter'] = '官场潜规则'
	},
	[1039] = {
		['id'] = 1039,
		['filter'] = '官场日志'
	},
	[1040] = {
		['id'] = 1040,
		['filter'] = '官场顺口溜'
	},
	[1041] = {
		['id'] = 1041,
		['filter'] = '官商勾结'
	},
	[1042] = {
		['id'] = 1042,
		['filter'] = '官员成为政治新星'
	},
	[1043] = {
		['id'] = 1043,
		['filter'] = '贯通两极法'
	},
	[1044] = {
		['id'] = 1044,
		['filter'] = '光端机'
	},
	[1045] = {
		['id'] = 1045,
		['filter'] = '光盘与真相'
	},
	[1046] = {
		['id'] = 1046,
		['filter'] = '广安第二人民医院'
	},
	[1047] = {
		['id'] = 1047,
		['filter'] = '广安事件'
	},
	[1048] = {
		['id'] = 1048,
		['filter'] = '广东饶平钱东镇'
	},
	[1049] = {
		['id'] = 1049,
		['filter'] = '广东王'
	},
	[1050] = {
		['id'] = 1050,
		['filter'] = '广闻'
	},
	[1051] = {
		['id'] = 1051,
		['filter'] = '广州火车春运'
	},
	[1052] = {
		['id'] = 1052,
		['filter'] = '廣安事件'
	},
	[1053] = {
		['id'] = 1053,
		['filter'] = '龟头'
	},
	[1054] = {
		['id'] = 1054,
		['filter'] = '硅谷民主促进会'
	},
	[1055] = {
		['id'] = 1055,
		['filter'] = '龜頭'
	},
	[1056] = {
		['id'] = 1056,
		['filter'] = '鬼村'
	},
	[1057] = {
		['id'] = 1057,
		['filter'] = '桂世镛'
	},
	[1058] = {
		['id'] = 1058,
		['filter'] = '郭伯雄'
	},
	[1059] = {
		['id'] = 1059,
		['filter'] = '郭罗基'
	},
	[1060] = {
		['id'] = 1060,
		['filter'] = '郭平'
	},
	[1061] = {
		['id'] = 1061,
		['filter'] = '郭岩华'
	},
	[1062] = {
		['id'] = 1062,
		['filter'] = '国歌股歌'
	},
	[1063] = {
		['id'] = 1063,
		['filter'] = '国际声援西藏'
	},
	[1064] = {
		['id'] = 1064,
		['filter'] = '国际西藏运动'
	},
	[1065] = {
		['id'] = 1065,
		['filter'] = '国际援藏网'
	},
	[1066] = {
		['id'] = 1066,
		['filter'] = '国际足坛五大'
	},
	[1067] = {
		['id'] = 1067,
		['filter'] = '国家安全'
	},
	[1068] = {
		['id'] = 1068,
		['filter'] = '国家机密'
	},
	[1069] = {
		['id'] = 1069,
		['filter'] = '国家粮油统计报表'
	},
	[1070] = {
		['id'] = 1070,
		['filter'] = '国家政府档案'
	},
	[1071] = {
		['id'] = 1071,
		['filter'] = '国军'
	},
	[1072] = {
		['id'] = 1072,
		['filter'] = '国民党'
	},
	[1073] = {
		['id'] = 1073,
		['filter'] = '国民党名单'
	},
	[1074] = {
		['id'] = 1074,
		['filter'] = '国色天香网'
	},
	[1075] = {
		['id'] = 1075,
		['filter'] = '国新办主任'
	},
	[1076] = {
		['id'] = 1076,
		['filter'] = '国研新闻邮件'
	},
	[1077] = {
		['id'] = 1077,
		['filter'] = '国贼'
	},
	[1078] = {
		['id'] = 1078,
		['filter'] = '国之利刃'
	},
	[1079] = {
		['id'] = 1079,
		['filter'] = '哈批'
	},
	[1080] = {
		['id'] = 1080,
		['filter'] = '海乐神'
	},
	[1081] = {
		['id'] = 1081,
		['filter'] = '海量论坛群发'
	},
	[1082] = {
		['id'] = 1082,
		['filter'] = '海外护法'
	},
	[1083] = {
		['id'] = 1083,
		['filter'] = '酣乐欣'
	},
	[1084] = {
		['id'] = 1084,
		['filter'] = '含PX的空气'
	},
	[1085] = {
		['id'] = 1085,
		['filter'] = '号码生成器'
	},
	[1086] = {
		['id'] = 1086,
		['filter'] = '浩方对站平台活动'
	},
	[1087] = {
		['id'] = 1087,
		['filter'] = '何德普'
	},
	[1088] = {
		['id'] = 1088,
		['filter'] = '何勇'
	},
	[1089] = {
		['id'] = 1089,
		['filter'] = '和谐你全家'
	},
	[1090] = {
		['id'] = 1090,
		['filter'] = '和奸成瘾'
	},
	[1091] = {
		['id'] = 1091,
		['filter'] = '和解的智慧'
	},
	[1092] = {
		['id'] = 1092,
		['filter'] = '和平请愿书'
	},
	[1093] = {
		['id'] = 1093,
		['filter'] = '和平修练'
	},
	[1094] = {
		['id'] = 1094,
		['filter'] = '和平演变道路已被中共堵死'
	},
	[1095] = {
		['id'] = 1095,
		['filter'] = '和弦'
	},
	[1096] = {
		['id'] = 1096,
		['filter'] = '河殇'
	},
	[1097] = {
		['id'] = 1097,
		['filter'] = '河殇核污染'
	},
	[1098] = {
		['id'] = 1098,
		['filter'] = '核设施'
	},
	[1099] = {
		['id'] = 1099,
		['filter'] = '核污染'
	},
	[1100] = {
		['id'] = 1100,
		['filter'] = '贺邦靖'
	},
	[1101] = {
		['id'] = 1101,
		['filter'] = '褐铁矿选矿设备'
	},
	[1102] = {
		['id'] = 1102,
		['filter'] = '黑车'
	},
	[1103] = {
		['id'] = 1103,
		['filter'] = '黑灯舞厅'
	},
	[1104] = {
		['id'] = 1104,
		['filter'] = '黑幕重重腐败到底'
	},
	[1105] = {
		['id'] = 1105,
		['filter'] = '黑皮书'
	},
	[1106] = {
		['id'] = 1106,
		['filter'] = '黑枪'
	},
	[1107] = {
		['id'] = 1107,
		['filter'] = '黑社会'
	},
	[1108] = {
		['id'] = 1108,
		['filter'] = '黑社會'
	},
	[1109] = {
		['id'] = 1109,
		['filter'] = '黑手党'
	},
	[1110] = {
		['id'] = 1110,
		['filter'] = '黑天使'
	},
	[1111] = {
		['id'] = 1111,
		['filter'] = '黑瞎子岛'
	},
	[1112] = {
		['id'] = 1112,
		['filter'] = '黑星女侠'
	},
	[1113] = {
		['id'] = 1113,
		['filter'] = '黑窑工母亲网上寻助'
	},
	[1114] = {
		['id'] = 1114,
		['filter'] = '黑窑母亲群体募捐'
	},
	[1115] = {
		['id'] = 1115,
		['filter'] = '黑窑奴役'
	},
	[1116] = {
		['id'] = 1116,
		['filter'] = '嘿咻'
	},
	[1117] = {
		['id'] = 1117,
		['filter'] = '弘法会'
	},
	[1118] = {
		['id'] = 1118,
		['filter'] = '红楼绮梦'
	},
	[1119] = {
		['id'] = 1119,
		['filter'] = '红病历'
	},
	[1120] = {
		['id'] = 1120,
		['filter'] = '红朝谎言录'
	},
	[1121] = {
		['id'] = 1121,
		['filter'] = '红潮谎言录'
	},
	[1122] = {
		['id'] = 1122,
		['filter'] = '红潮艳史'
	},
	[1123] = {
		['id'] = 1123,
		['filter'] = '红灯区'
	},
	[1124] = {
		['id'] = 1124,
		['filter'] = '红海湾'
	},
	[1125] = {
		['id'] = 1125,
		['filter'] = '红河谷论坛'
	},
	[1126] = {
		['id'] = 1126,
		['filter'] = '红魂网站'
	},
	[1127] = {
		['id'] = 1127,
		['filter'] = '红旗漫漫'
	},
	[1128] = {
		['id'] = 1128,
		['filter'] = '红色贵族'
	},
	[1129] = {
		['id'] = 1129,
		['filter'] = '红色角落'
	},
	[1130] = {
		['id'] = 1130,
		['filter'] = '红色恐怖'
	},
	[1131] = {
		['id'] = 1131,
		['filter'] = '红兽'
	},
	[1132] = {
		['id'] = 1132,
		['filter'] = '红太阳是怎样升起的'
	},
	[1133] = {
		['id'] = 1133,
		['filter'] = '红头文件'
	},
	[1134] = {
		['id'] = 1134,
		['filter'] = '红卫兵'
	},
	[1135] = {
		['id'] = 1135,
		['filter'] = '红血丝'
	},
	[1136] = {
		['id'] = 1136,
		['filter'] = '红志'
	},
	[1137] = {
		['id'] = 1137,
		['filter'] = '红智'
	},
	[1138] = {
		['id'] = 1138,
		['filter'] = '宏踏鞋'
	},
	[1139] = {
		['id'] = 1139,
		['filter'] = '宏恩'
	},
	[1140] = {
		['id'] = 1140,
		['filter'] = '宏法'
	},
	[1141] = {
		['id'] = 1141,
		['filter'] = '宏志'
	},
	[1142] = {
		['id'] = 1142,
		['filter'] = '宏治'
	},
	[1143] = {
		['id'] = 1143,
		['filter'] = '洪传'
	},
	[1144] = {
		['id'] = 1144,
		['filter'] = '洪法交流'
	},
	[1145] = {
		['id'] = 1145,
		['filter'] = '洪巨平'
	},
	[1146] = {
		['id'] = 1146,
		['filter'] = '洪水的志向'
	},
	[1147] = {
		['id'] = 1147,
		['filter'] = '洪吟'
	},
	[1148] = {
		['id'] = 1148,
		['filter'] = '洪哲胜'
	},
	[1149] = {
		['id'] = 1149,
		['filter'] = '洪志'
	},
	[1150] = {
		['id'] = 1150,
		['filter'] = '洪治'
	},
	[1151] = {
		['id'] = 1151,
		['filter'] = '洪智'
	},
	[1152] = {
		['id'] = 1152,
		['filter'] = '紅河谷論壇'
	},
	[1153] = {
		['id'] = 1153,
		['filter'] = '紅志'
	},
	[1154] = {
		['id'] = 1154,
		['filter'] = '紅智'
	},
	[1155] = {
		['id'] = 1155,
		['filter'] = '后方想定的编写'
	},
	[1156] = {
		['id'] = 1156,
		['filter'] = '后勤资料手册'
	},
	[1157] = {
		['id'] = 1157,
		['filter'] = '呼喊派'
	},
	[1158] = {
		['id'] = 1158,
		['filter'] = '胡core和刘德华'
	},
	[1159] = {
		['id'] = 1159,
		['filter'] = '胡J涛'
	},
	[1160] = {
		['id'] = 1160,
		['filter'] = '胡春华'
	},
	[1161] = {
		['id'] = 1161,
		['filter'] = '胡的接班人'
	},
	[1162] = {
		['id'] = 1162,
		['filter'] = '胡江'
	},
	[1163] = {
		['id'] = 1163,
		['filter'] = '胡紧掏'
	},
	[1164] = {
		['id'] = 1164,
		['filter'] = '胡紧套'
	},
	[1165] = {
		['id'] = 1165,
		['filter'] = '胡锦滔'
	},
	[1166] = {
		['id'] = 1166,
		['filter'] = '胡锦淘'
	},
	[1167] = {
		['id'] = 1167,
		['filter'] = '胡进涛'
	},
	[1168] = {
		['id'] = 1168,
		['filter'] = '胡景涛'
	},
	[1169] = {
		['id'] = 1169,
		['filter'] = '胡派'
	},
	[1170] = {
		['id'] = 1170,
		['filter'] = '胡平'
	},
	[1171] = {
		['id'] = 1171,
		['filter'] = '胡书记'
	},
	[1172] = {
		['id'] = 1172,
		['filter'] = '胡温'
	},
	[1173] = {
		['id'] = 1173,
		['filter'] = '胡温怒批政法系统'
	},
	[1174] = {
		['id'] = 1174,
		['filter'] = '胡溫怒批政法系統'
	},
	[1175] = {
		['id'] = 1175,
		['filter'] = '胡瘟'
	},
	[1176] = {
		['id'] = 1176,
		['filter'] = '胡系'
	},
	[1177] = {
		['id'] = 1177,
		['filter'] = '胡下台'
	},
	[1178] = {
		['id'] = 1178,
		['filter'] = '胡耀邦'
	},
	[1179] = {
		['id'] = 1179,
		['filter'] = '胡耀帮'
	},
	[1180] = {
		['id'] = 1180,
		['filter'] = '胡中央'
	},
	[1181] = {
		['id'] = 1181,
		['filter'] = '胡主席'
	},
	[1182] = {
		['id'] = 1182,
		['filter'] = '胡主席刘德华'
	},
	[1183] = {
		['id'] = 1183,
		['filter'] = '胡总书记'
	},
	[1184] = {
		['id'] = 1184,
		['filter'] = '虎胆雄心'
	},
	[1185] = {
		['id'] = 1185,
		['filter'] = '虎膽雄心'
	},
	[1186] = {
		['id'] = 1186,
		['filter'] = '虎机'
	},
	[1187] = {
		['id'] = 1187,
		['filter'] = '护法'
	},
	[1188] = {
		['id'] = 1188,
		['filter'] = '护士24点'
	},
	[1189] = {
		['id'] = 1189,
		['filter'] = '護士24點'
	},
	[1190] = {
		['id'] = 1190,
		['filter'] = '花花公子'
	},
	[1191] = {
		['id'] = 1191,
		['filter'] = '华藏功'
	},
	[1192] = {
		['id'] = 1192,
		['filter'] = '华国锋'
	},
	[1193] = {
		['id'] = 1193,
		['filter'] = '华建敏'
	},
	[1194] = {
		['id'] = 1194,
		['filter'] = '华通时事论坛'
	},
	[1195] = {
		['id'] = 1195,
		['filter'] = '华夏文摘'
	},
	[1196] = {
		['id'] = 1196,
		['filter'] = '华语世界论坛'
	},
	[1197] = {
		['id'] = 1197,
		['filter'] = '华岳时事论坛'
	},
	[1198] = {
		['id'] = 1198,
		['filter'] = '话在肉身显现'
	},
	[1199] = {
		['id'] = 1199,
		['filter'] = '话紫禁城'
	},
	[1200] = {
		['id'] = 1200,
		['filter'] = '换届隐忧'
	},
	[1201] = {
		['id'] = 1201,
		['filter'] = '换偶'
	},
	[1202] = {
		['id'] = 1202,
		['filter'] = '换妻'
	},
	[1203] = {
		['id'] = 1203,
		['filter'] = '换妻俱乐部'
	},
	[1204] = {
		['id'] = 1204,
		['filter'] = '換妻'
	},
	[1205] = {
		['id'] = 1205,
		['filter'] = '皇冠投注'
	},
	[1206] = {
		['id'] = 1206,
		['filter'] = '黃海暗殺事件'
	},
	[1207] = {
		['id'] = 1207,
		['filter'] = '黃菊'
	},
	[1208] = {
		['id'] = 1208,
		['filter'] = '黃麗滿'
	},
	[1209] = {
		['id'] = 1209,
		['filter'] = '黃色電影'
	},
	[1210] = {
		['id'] = 1210,
		['filter'] = '黃色圖片'
	},
	[1211] = {
		['id'] = 1211,
		['filter'] = '黃色小電影'
	},
	[1212] = {
		['id'] = 1212,
		['filter'] = '黄JU'
	},
	[1213] = {
		['id'] = 1213,
		['filter'] = '黄慈萍'
	},
	[1214] = {
		['id'] = 1214,
		['filter'] = '黄海暗杀'
	},
	[1215] = {
		['id'] = 1215,
		['filter'] = '黄海暗杀事件'
	},
	[1216] = {
		['id'] = 1216,
		['filter'] = '黄海事件'
	},
	[1217] = {
		['id'] = 1217,
		['filter'] = '黄褐斑'
	},
	[1218] = {
		['id'] = 1218,
		['filter'] = '黄华华'
	},
	[1219] = {
		['id'] = 1219,
		['filter'] = '黄祸'
	},
	[1220] = {
		['id'] = 1220,
		['filter'] = '黄金书'
	},
	[1221] = {
		['id'] = 1221,
		['filter'] = '黄局'
	},
	[1222] = {
		['id'] = 1222,
		['filter'] = '黄菊'
	},
	[1223] = {
		['id'] = 1223,
		['filter'] = '黄菊　'
	},
	[1224] = {
		['id'] = 1224,
		['filter'] = '黄菊遗孀'
	},
	[1225] = {
		['id'] = 1225,
		['filter'] = '黄丽满'
	},
	[1226] = {
		['id'] = 1226,
		['filter'] = '黄霉素'
	},
	[1227] = {
		['id'] = 1227,
		['filter'] = '黄色'
	},
	[1228] = {
		['id'] = 1228,
		['filter'] = '黄色{5}'
	},
	[1229] = {
		['id'] = 1229,
		['filter'] = '黄色电影'
	},
	[1230] = {
		['id'] = 1230,
		['filter'] = '黄色激情小电影'
	},
	[1231] = {
		['id'] = 1231,
		['filter'] = '黄色漫画'
	},
	[1232] = {
		['id'] = 1232,
		['filter'] = '黄色图片'
	},
	[1233] = {
		['id'] = 1233,
		['filter'] = '黄色网站'
	},
	[1234] = {
		['id'] = 1234,
		['filter'] = '黄色文学'
	},
	[1235] = {
		['id'] = 1235,
		['filter'] = '黄色小电影'
	},
	[1236] = {
		['id'] = 1236,
		['filter'] = '黄色小说'
	},
	[1237] = {
		['id'] = 1237,
		['filter'] = '黄色小说黄色图片'
	},
	[1238] = {
		['id'] = 1238,
		['filter'] = '黄色影视'
	},
	[1239] = {
		['id'] = 1239,
		['filter'] = '黄网导航'
	},
	[1240] = {
		['id'] = 1240,
		['filter'] = '黄翔'
	},
	[1241] = {
		['id'] = 1241,
		['filter'] = '黄作兴'
	},
	[1242] = {
		['id'] = 1242,
		['filter'] = '簧片'
	},
	[1243] = {
		['id'] = 1243,
		['filter'] = '挥发型迷药'
	},
	[1244] = {
		['id'] = 1244,
		['filter'] = '回良玉'
	},
	[1245] = {
		['id'] = 1245,
		['filter'] = '回民暴'
	},
	[1246] = {
		['id'] = 1246,
		['filter'] = '回民暴动'
	},
	[1247] = {
		['id'] = 1247,
		['filter'] = '回民猪'
	},
	[1248] = {
		['id'] = 1248,
		['filter'] = '回忆六四'
	},
	[1249] = {
		['id'] = 1249,
		['filter'] = '悔过书'
	},
	[1250] = {
		['id'] = 1250,
		['filter'] = '会计电算化'
	},
	[1251] = {
		['id'] = 1251,
		['filter'] = '惠澤社群'
	},
	[1252] = {
		['id'] = 1252,
		['filter'] = '慧网'
	},
	[1253] = {
		['id'] = 1253,
		['filter'] = '昏迷剂'
	},
	[1254] = {
		['id'] = 1254,
		['filter'] = '昏药'
	},
	[1255] = {
		['id'] = 1255,
		['filter'] = '昏藥'
	},
	[1256] = {
		['id'] = 1256,
		['filter'] = '活佛'
	},
	[1257] = {
		['id'] = 1257,
		['filter'] = '活体'
	},
	[1258] = {
		['id'] = 1258,
		['filter'] = '活摘器'
	},
	[1259] = {
		['id'] = 1259,
		['filter'] = '火车出轨'
	},
	[1260] = {
		['id'] = 1260,
		['filter'] = '火药制作'
	},
	[1261] = {
		['id'] = 1261,
		['filter'] = '霍英东'
	},
	[1262] = {
		['id'] = 1262,
		['filter'] = '鸡八'
	},
	[1263] = {
		['id'] = 1263,
		['filter'] = '鸡吧鸡巴'
	},
	[1264] = {
		['id'] = 1264,
		['filter'] = '鸡奸'
	},
	[1265] = {
		['id'] = 1265,
		['filter'] = '鸡奸骚穴骚水'
	},
	[1266] = {
		['id'] = 1266,
		['filter'] = '鸡毛信文汇'
	},
	[1267] = {
		['id'] = 1267,
		['filter'] = '姬胜德'
	},
	[1268] = {
		['id'] = 1268,
		['filter'] = '积克馆'
	},
	[1269] = {
		['id'] = 1269,
		['filter'] = '基地组织校园招聘'
	},
	[1270] = {
		['id'] = 1270,
		['filter'] = '基督'
	},
	[1271] = {
		['id'] = 1271,
		['filter'] = '基督灵恩布道团'
	},
	[1272] = {
		['id'] = 1272,
		['filter'] = '激流中国'
	},
	[1273] = {
		['id'] = 1273,
		['filter'] = '激情'
	},
	[1274] = {
		['id'] = 1274,
		['filter'] = '激情大片'
	},
	[1275] = {
		['id'] = 1275,
		['filter'] = '激情电影'
	},
	[1276] = {
		['id'] = 1276,
		['filter'] = '激情電影'
	},
	[1277] = {
		['id'] = 1277,
		['filter'] = '激情美女'
	},
	[1278] = {
		['id'] = 1278,
		['filter'] = '激情視頻'
	},
	[1279] = {
		['id'] = 1279,
		['filter'] = '激情图片'
	},
	[1280] = {
		['id'] = 1280,
		['filter'] = '激情圖片'
	},
	[1281] = {
		['id'] = 1281,
		['filter'] = '激情文学'
	},
	[1282] = {
		['id'] = 1282,
		['filter'] = '激情小电影'
	},
	[1283] = {
		['id'] = 1283,
		['filter'] = '激情小電影'
	},
	[1284] = {
		['id'] = 1284,
		['filter'] = '激情一刻现场脱'
	},
	[1285] = {
		['id'] = 1285,
		['filter'] = '激情自拍'
	},
	[1286] = {
		['id'] = 1286,
		['filter'] = '及川奈央'
	},
	[1287] = {
		['id'] = 1287,
		['filter'] = '吉炳轩'
	},
	[1288] = {
		['id'] = 1288,
		['filter'] = '吉祥宝贝'
	},
	[1289] = {
		['id'] = 1289,
		['filter'] = '极度诱惑'
	},
	[1290] = {
		['id'] = 1290,
		['filter'] = '极景'
	},
	[1291] = {
		['id'] = 1291,
		['filter'] = '急聘兼职打字员'
	},
	[1292] = {
		['id'] = 1292,
		['filter'] = '急聘兼职文字录入'
	},
	[1293] = {
		['id'] = 1293,
		['filter'] = '疾病业债说'
	},
	[1294] = {
		['id'] = 1294,
		['filter'] = '集体上访'
	},
	[1295] = {
		['id'] = 1295,
		['filter'] = '集体做爱'
	},
	[1296] = {
		['id'] = 1296,
		['filter'] = '计生风暴'
	},
	[1297] = {
		['id'] = 1297,
		['filter'] = '记者原子弹的DIY制作'
	},
	[1298] = {
		['id'] = 1298,
		['filter'] = '纪股票市场五卅惨案'
	},
	[1299] = {
		['id'] = 1299,
		['filter'] = '纪律检查'
	},
	[1300] = {
		['id'] = 1300,
		['filter'] = '纪元'
	},
	[1301] = {
		['id'] = 1301,
		['filter'] = '妓女=>jnv'
	},
	[1302] = {
		['id'] = 1302,
		['filter'] = '妓女的口号'
	},
	[1303] = {
		['id'] = 1303,
		['filter'] = '加非猫：现实世界历险记'
	},
	[1304] = {
		['id'] = 1304,
		['filter'] = '加府'
	},
	[1305] = {
		['id'] = 1305,
		['filter'] = '加盖机密××××'
	},
	[1306] = {
		['id'] = 1306,
		['filter'] = '加油机干扰器'
	},
	[1307] = {
		['id'] = 1307,
		['filter'] = '佳静安定片'
	},
	[1308] = {
		['id'] = 1308,
		['filter'] = '家乐福'
	},
	[1309] = {
		['id'] = 1309,
		['filter'] = '家用天线'
	},
	[1310] = {
		['id'] = 1310,
		['filter'] = '家用卫星'
	},
	[1311] = {
		['id'] = 1311,
		['filter'] = '甲基苯丙胺合成工艺'
	},
	[1312] = {
		['id'] = 1312,
		['filter'] = '贾庆林'
	},
	[1313] = {
		['id'] = 1313,
		['filter'] = '贾廷安'
	},
	[1314] = {
		['id'] = 1314,
		['filter'] = '贾系'
	},
	[1315] = {
		['id'] = 1315,
		['filter'] = '贾育台'
	},
	[1316] = {
		['id'] = 1316,
		['filter'] = '贾治邦'
	},
	[1317] = {
		['id'] = 1317,
		['filter'] = '賈慶林'
	},
	[1318] = {
		['id'] = 1318,
		['filter'] = '假币=>>'
	},
	[1319] = {
		['id'] = 1319,
		['filter'] = '假币出售'
	},
	[1320] = {
		['id'] = 1320,
		['filter'] = '假钞'
	},
	[1321] = {
		['id'] = 1321,
		['filter'] = '假鈔'
	},
	[1322] = {
		['id'] = 1322,
		['filter'] = '假教育'
	},
	[1323] = {
		['id'] = 1323,
		['filter'] = '奸魔Ⅱ'
	},
	[1324] = {
		['id'] = 1324,
		['filter'] = '监狱管理局'
	},
	[1325] = {
		['id'] = 1325,
		['filter'] = '监狱里的斗争'
	},
	[1326] = {
		['id'] = 1326,
		['filter'] = '監聽寶'
	},
	[1327] = {
		['id'] = 1327,
		['filter'] = '監聽器'
	},
	[1328] = {
		['id'] = 1328,
		['filter'] = '監聽王'
	},
	[1329] = {
		['id'] = 1329,
		['filter'] = '简鸿章'
	},
	[1330] = {
		['id'] = 1330,
		['filter'] = '简易原子弹制作'
	},
	[1331] = {
		['id'] = 1331,
		['filter'] = '简易炸药制作'
	},
	[1332] = {
		['id'] = 1332,
		['filter'] = '简易制作C4炸弹教程'
	},
	[1333] = {
		['id'] = 1333,
		['filter'] = '建定防火'
	},
	[1334] = {
		['id'] = 1334,
		['filter'] = '建国党'
	},
	[1335] = {
		['id'] = 1335,
		['filter'] = '剑教材'
	},
	[1336] = {
		['id'] = 1336,
		['filter'] = '贱逼'
	},
	[1337] = {
		['id'] = 1337,
		['filter'] = '贱比'
	},
	[1338] = {
		['id'] = 1338,
		['filter'] = '江core'
	},
	[1339] = {
		['id'] = 1339,
		['filter'] = '江ze民'
	},
	[1340] = {
		['id'] = 1340,
		['filter'] = '江z民'
	},
	[1341] = {
		['id'] = 1341,
		['filter'] = '江{1}泽民'
	},
	[1342] = {
		['id'] = 1342,
		['filter'] = '江八点'
	},
	[1343] = {
		['id'] = 1343,
		['filter'] = '江独裁'
	},
	[1344] = {
		['id'] = 1344,
		['filter'] = '江恶人'
	},
	[1345] = {
		['id'] = 1345,
		['filter'] = '江二世'
	},
	[1346] = {
		['id'] = 1346,
		['filter'] = '江蛤蟆'
	},
	[1347] = {
		['id'] = 1347,
		['filter'] = '江公子'
	},
	[1348] = {
		['id'] = 1348,
		['filter'] = '江核心'
	},
	[1349] = {
		['id'] = 1349,
		['filter'] = '江黑心'
	},
	[1350] = {
		['id'] = 1350,
		['filter'] = '江胡'
	},
	[1351] = {
		['id'] = 1351,
		['filter'] = '江昏君'
	},
	[1352] = {
		['id'] = 1352,
		['filter'] = '江祸心'
	},
	[1353] = {
		['id'] = 1353,
		['filter'] = '江家帮'
	},
	[1354] = {
		['id'] = 1354,
		['filter'] = '江姐問'
	},
	[1355] = {
		['id'] = 1355,
		['filter'] = '江锦恒'
	},
	[1356] = {
		['id'] = 1356,
		['filter'] = '江老贼'
	},
	[1357] = {
		['id'] = 1357,
		['filter'] = '江理论'
	},
	[1358] = {
		['id'] = 1358,
		['filter'] = '江流氓'
	},
	[1359] = {
		['id'] = 1359,
		['filter'] = '江路线'
	},
	[1360] = {
		['id'] = 1360,
		['filter'] = '江驴'
	},
	[1361] = {
		['id'] = 1361,
		['filter'] = '江罗'
	},
	[1362] = {
		['id'] = 1362,
		['filter'] = '江罗集团'
	},
	[1363] = {
		['id'] = 1363,
		['filter'] = '江绵恒'
	},
	[1364] = {
		['id'] = 1364,
		['filter'] = '江魔头'
	},
	[1365] = {
		['id'] = 1365,
		['filter'] = '江牌'
	},
	[1366] = {
		['id'] = 1366,
		['filter'] = '江派'
	},
	[1367] = {
		['id'] = 1367,
		['filter'] = '江派和胡派'
	},
	[1368] = {
		['id'] = 1368,
		['filter'] = '江派人马'
	},
	[1369] = {
		['id'] = 1369,
		['filter'] = '江青'
	},
	[1370] = {
		['id'] = 1370,
		['filter'] = '江青××'
	},
	[1371] = {
		['id'] = 1371,
		['filter'] = '江青同志在批林整风汇报会议华东组和中南组会上的讲话'
	},
	[1372] = {
		['id'] = 1372,
		['filter'] = '江青在批林反孔会议上的讲话=×××'
	},
	[1373] = {
		['id'] = 1373,
		['filter'] = '江泉集团'
	},
	[1374] = {
		['id'] = 1374,
		['filter'] = '江人马'
	},
	[1375] = {
		['id'] = 1375,
		['filter'] = '江三条腿'
	},
	[1376] = {
		['id'] = 1376,
		['filter'] = '江三秀'
	},
	[1377] = {
		['id'] = 1377,
		['filter'] = '江山美人志'
	},
	[1378] = {
		['id'] = 1378,
		['filter'] = '江神经'
	},
	[1379] = {
		['id'] = 1379,
		['filter'] = '江氏集团'
	},
	[1380] = {
		['id'] = 1380,
		['filter'] = '江氏家族'
	},
	[1381] = {
		['id'] = 1381,
		['filter'] = '江梳头'
	},
	[1382] = {
		['id'] = 1382,
		['filter'] = '江宋'
	},
	[1383] = {
		['id'] = 1383,
		['filter'] = '江西田园置业集团'
	},
	[1384] = {
		['id'] = 1384,
		['filter'] = '江戏子'
	},
	[1385] = {
		['id'] = 1385,
		['filter'] = '江系'
	},
	[1386] = {
		['id'] = 1386,
		['filter'] = '江系人马'
	},
	[1387] = {
		['id'] = 1387,
		['filter'] = '江宰民'
	},
	[1388] = {
		['id'] = 1388,
		['filter'] = '江则民'
	},
	[1389] = {
		['id'] = 1389,
		['filter'] = '江择min'
	},
	[1390] = {
		['id'] = 1390,
		['filter'] = '江泽公审'
	},
	[1391] = {
		['id'] = 1391,
		['filter'] = '江泽慧'
	},
	[1392] = {
		['id'] = 1392,
		['filter'] = '江泽民'
	},
	[1393] = {
		['id'] = 1393,
		['filter'] = '江泽民瑞士'
	},
	[1394] = {
		['id'] = 1394,
		['filter'] = '江泽民宋祖英'
	},
	[1395] = {
		['id'] = 1395,
		['filter'] = '江澤民'
	},
	[1396] = {
		['id'] = 1396,
		['filter'] = '江贼'
	},
	[1397] = {
		['id'] = 1397,
		['filter'] = '江贼民'
	},
	[1398] = {
		['id'] = 1398,
		['filter'] = '江折民'
	},
	[1399] = {
		['id'] = 1399,
		['filter'] = '江者民'
	},
	[1400] = {
		['id'] = 1400,
		['filter'] = '江浙民'
	},
	[1401] = {
		['id'] = 1401,
		['filter'] = '江朱'
	},
	[1402] = {
		['id'] = 1402,
		['filter'] = '江猪'
	},
	[1403] = {
		['id'] = 1403,
		['filter'] = '江猪媳'
	},
	[1404] = {
		['id'] = 1404,
		['filter'] = '江主席'
	},
	[1405] = {
		['id'] = 1405,
		['filter'] = '江作秀'
	},
	[1406] = {
		['id'] = 1406,
		['filter'] = '姜春云'
	},
	[1407] = {
		['id'] = 1407,
		['filter'] = '姜凤阁'
	},
	[1408] = {
		['id'] = 1408,
		['filter'] = '将则民'
	},
	[1409] = {
		['id'] = 1409,
		['filter'] = '僵贼'
	},
	[1410] = {
		['id'] = 1410,
		['filter'] = '僵贼民'
	},
	[1411] = {
		['id'] = 1411,
		['filter'] = '疆獨'
	},
	[1412] = {
		['id'] = 1412,
		['filter'] = '疆独'
	},
	[1413] = {
		['id'] = 1413,
		['filter'] = '疆独藏独'
	},
	[1414] = {
		['id'] = 1414,
		['filter'] = '讲法'
	},
	[1415] = {
		['id'] = 1415,
		['filter'] = '讲事实 要说法'
	},
	[1416] = {
		['id'] = 1416,
		['filter'] = '蒋匪军陆军部队师以上主官情况调查'
	},
	[1417] = {
		['id'] = 1417,
		['filter'] = '降灾民'
	},
	[1418] = {
		['id'] = 1418,
		['filter'] = '酱猪媳'
	},
	[1419] = {
		['id'] = 1419,
		['filter'] = '交班'
	},
	[1420] = {
		['id'] = 1420,
		['filter'] = '交媾'
	},
	[1421] = {
		['id'] = 1421,
		['filter'] = '交换夫妻'
	},
	[1422] = {
		['id'] = 1422,
		['filter'] = '交警'
	},
	[1423] = {
		['id'] = 1423,
		['filter'] = '交友网'
	},
	[1424] = {
		['id'] = 1424,
		['filter'] = '胶质炸弹'
	},
	[1425] = {
		['id'] = 1425,
		['filter'] = '焦焕成'
	},
	[1426] = {
		['id'] = 1426,
		['filter'] = '角落里的枪'
	},
	[1427] = {
		['id'] = 1427,
		['filter'] = '叫床'
	},
	[1428] = {
		['id'] = 1428,
		['filter'] = '叫春'
	},
	[1429] = {
		['id'] = 1429,
		['filter'] = '教徒'
	},
	[1430] = {
		['id'] = 1430,
		['filter'] = '教徒人权'
	},
	[1431] = {
		['id'] = 1431,
		['filter'] = '教养院'
	},
	[1432] = {
		['id'] = 1432,
		['filter'] = '阶级敌人'
	},
	[1433] = {
		['id'] = 1433,
		['filter'] = '接班'
	},
	[1434] = {
		['id'] = 1434,
		['filter'] = '接班群体'
	},
	[1435] = {
		['id'] = 1435,
		['filter'] = '揭个黑幕'
	},
	[1436] = {
		['id'] = 1436,
		['filter'] = '揭批书'
	},
	[1437] = {
		['id'] = 1437,
		['filter'] = '姐姐开苞'
	},
	[1438] = {
		['id'] = 1438,
		['filter'] = '姐疼'
	},
	[1439] = {
		['id'] = 1439,
		['filter'] = '姐痛'
	},
	[1440] = {
		['id'] = 1440,
		['filter'] = '解厚铨'
	},
	[1441] = {
		['id'] = 1441,
		['filter'] = '解碼器'
	},
	[1442] = {
		['id'] = 1442,
		['filter'] = '解体的命运'
	},
	[1443] = {
		['id'] = 1443,
		['filter'] = '解体中共'
	},
	[1444] = {
		['id'] = 1444,
		['filter'] = '解学智'
	},
	[1445] = {
		['id'] = 1445,
		['filter'] = '解振华'
	},
	[1446] = {
		['id'] = 1446,
		['filter'] = '今有广东'
	},
	[1447] = {
		['id'] = 1447,
		['filter'] = '金舜禹'
	},
	[1448] = {
		['id'] = 1448,
		['filter'] = '金道铭'
	},
	[1449] = {
		['id'] = 1449,
		['filter'] = '金鳞岂是池中物'
	},
	[1450] = {
		['id'] = 1450,
		['filter'] = '金尧如'
	},
	[1451] = {
		['id'] = 1451,
		['filter'] = '金银焕'
	},
	[1452] = {
		['id'] = 1452,
		['filter'] = '金澤文子'
	},
	[1453] = {
		['id'] = 1453,
		['filter'] = '津人治津'
	},
	[1454] = {
		['id'] = 1454,
		['filter'] = '锦涛'
	},
	[1455] = {
		['id'] = 1455,
		['filter'] = '近平'
	},
	[1456] = {
		['id'] = 1456,
		['filter'] = '近親'
	},
	[1457] = {
		['id'] = 1457,
		['filter'] = '禁断少女'
	},
	[1458] = {
		['id'] = 1458,
		['filter'] = '禁忌试玩'
	},
	[1459] = {
		['id'] = 1459,
		['filter'] = '禁忌試玩'
	},
	[1460] = {
		['id'] = 1460,
		['filter'] = '禁看'
	},
	[1461] = {
		['id'] = 1461,
		['filter'] = '禁室培欲6赤色杀意'
	},
	[1462] = {
		['id'] = 1462,
		['filter'] = '禁书'
	},
	[1463] = {
		['id'] = 1463,
		['filter'] = '禁网禁片'
	},
	[1464] = {
		['id'] = 1464,
		['filter'] = '京夫子'
	},
	[1465] = {
		['id'] = 1465,
		['filter'] = '京郊旅游'
	},
	[1466] = {
		['id'] = 1466,
		['filter'] = '经典语录'
	},
	[1467] = {
		['id'] = 1467,
		['filter'] = '经文'
	},
	[1468] = {
		['id'] = 1468,
		['filter'] = '经租房'
	},
	[1469] = {
		['id'] = 1469,
		['filter'] = '惊暴双乳'
	},
	[1470] = {
		['id'] = 1470,
		['filter'] = '惊悚空间'
	},
	[1471] = {
		['id'] = 1471,
		['filter'] = '晶白体'
	},
	[1472] = {
		['id'] = 1472,
		['filter'] = '精液'
	},
	[1473] = {
		['id'] = 1473,
		['filter'] = '驚悚空間'
	},
	[1474] = {
		['id'] = 1474,
		['filter'] = '警/用钱包'
	},
	[1475] = {
		['id'] = 1475,
		['filter'] = '警花肉搏强奸党'
	},
	[1476] = {
		['id'] = 1476,
		['filter'] = '警用教材'
	},
	[1477] = {
		['id'] = 1477,
		['filter'] = '净白体'
	},
	[1478] = {
		['id'] = 1478,
		['filter'] = '净水器'
	},
	[1479] = {
		['id'] = 1479,
		['filter'] = '靖志远'
	},
	[1480] = {
		['id'] = 1480,
		['filter'] = '静坐'
	},
	[1481] = {
		['id'] = 1481,
		['filter'] = '九-评'
	},
	[1482] = {
		['id'] = 1482,
		['filter'] = '九.评'
	},
	[1483] = {
		['id'] = 1483,
		['filter'] = '九jiu评'
	},
	[1484] = {
		['id'] = 1484,
		['filter'] = '九·十·三运动'
	},
	[1485] = {
		['id'] = 1485,
		['filter'] = '九评'
	},
	[1486] = {
		['id'] = 1486,
		['filter'] = '九评{5}'
	},
	[1487] = {
		['id'] = 1487,
		['filter'] = '九评××'
	},
	[1488] = {
		['id'] = 1488,
		['filter'] = '九评公产党'
	},
	[1489] = {
		['id'] = 1489,
		['filter'] = '九评共产党'
	},
	[1490] = {
		['id'] = 1490,
		['filter'] = '九十三运动'
	},
	[1491] = {
		['id'] = 1491,
		['filter'] = '旧金山总领馆'
	},
	[1492] = {
		['id'] = 1492,
		['filter'] = '旧民运'
	},
	[1493] = {
		['id'] = 1493,
		['filter'] = '巨额骗储'
	},
	[1494] = {
		['id'] = 1494,
		['filter'] = '具有中国特色的魔鬼辞典'
	},
	[1495] = {
		['id'] = 1495,
		['filter'] = '绝人寰的暴行'
	},
	[1496] = {
		['id'] = 1496,
		['filter'] = '觉醒了的中国'
	},
	[1497] = {
		['id'] = 1497,
		['filter'] = '军长发威=PK'
	},
	[1498] = {
		['id'] = 1498,
		['filter'] = '军队干部转业复员工作文件汇编'
	},
	[1499] = {
		['id'] = 1499,
		['filter'] = '军队走私'
	},
	[1500] = {
		['id'] = 1500,
		['filter'] = '军火价格'
	},
	[1501] = {
		['id'] = 1501,
		['filter'] = '军妓'
	},
	[1502] = {
		['id'] = 1502,
		['filter'] = '军警靴'
	},
	[1503] = {
		['id'] = 1503,
		['filter'] = '军事标号'
	},
	[1504] = {
		['id'] = 1504,
		['filter'] = '军事地图'
	},
	[1505] = {
		['id'] = 1505,
		['filter'] = '军事训练大纲'
	},
	[1506] = {
		['id'] = 1506,
		['filter'] = '军事训练评定标准'
	},
	[1507] = {
		['id'] = 1507,
		['filter'] = '口技'
	},
	[1508] = {
		['id'] = 1508,
		['filter'] = '口交'
	},
	[1509] = {
		['id'] = 1509,
		['filter'] = '口头检查'
	},
	[1510] = {
		['id'] = 1510,
		['filter'] = '口香糖炸弹'
	},
	[1511] = {
		['id'] = 1511,
		['filter'] = '口淫'
	},
	[1512] = {
		['id'] = 1512,
		['filter'] = '扣应队'
	},
	[1513] = {
		['id'] = 1513,
		['filter'] = '酷刑罪'
	},
	[1514] = {
		['id'] = 1514,
		['filter'] = '跨世纪的良心犯'
	},
	[1515] = {
		['id'] = 1515,
		['filter'] = '快操我'
	},
	[1516] = {
		['id'] = 1516,
		['filter'] = '狂操'
	},
	[1517] = {
		['id'] = 1517,
		['filter'] = '狂插'
	},
	[1518] = {
		['id'] = 1518,
		['filter'] = '狂干'
	},
	[1519] = {
		['id'] = 1519,
		['filter'] = '狂搞'
	},
	[1520] = {
		['id'] = 1520,
		['filter'] = '邝锦文'
	},
	[1521] = {
		['id'] = 1521,
		['filter'] = '昆仑女神功'
	},
	[1522] = {
		['id'] = 1522,
		['filter'] = '捆绑'
	},
	[1523] = {
		['id'] = 1523,
		['filter'] = '拉帮游说'
	},
	[1524] = {
		['id'] = 1524,
		['filter'] = '拉登'
	},
	[1525] = {
		['id'] = 1525,
		['filter'] = '拉登熟知中国'
	},
	[1526] = {
		['id'] = 1526,
		['filter'] = '拉登熟知中國'
	},
	[1527] = {
		['id'] = 1527,
		['filter'] = '拉登中国'
	},
	[1528] = {
		['id'] = 1528,
		['filter'] = '拉凳'
	},
	[1529] = {
		['id'] = 1529,
		['filter'] = '拉票贿选'
	},
	[1530] = {
		['id'] = 1530,
		['filter'] = '拉萨骚乱'
	},
	[1531] = {
		['id'] = 1531,
		['filter'] = '拉萨僧人接连抗议'
	},
	[1532] = {
		['id'] = 1532,
		['filter'] = '拉萨事件'
	},
	[1533] = {
		['id'] = 1533,
		['filter'] = '喇嘛'
	},
	[1534] = {
		['id'] = 1534,
		['filter'] = '赖昌星'
	},
	[1535] = {
		['id'] = 1535,
		['filter'] = '拦截器'
	},
	[1536] = {
		['id'] = 1536,
		['filter'] = '攔截器'
	},
	[1537] = {
		['id'] = 1537,
		['filter'] = '烂逼'
	},
	[1538] = {
		['id'] = 1538,
		['filter'] = '烂比'
	},
	[1539] = {
		['id'] = 1539,
		['filter'] = '烂货'
	},
	[1540] = {
		['id'] = 1540,
		['filter'] = '郎咸平'
	},
	[1541] = {
		['id'] = 1541,
		['filter'] = '劳动教养所'
	},
	[1542] = {
		['id'] = 1542,
		['filter'] = '劳改'
	},
	[1543] = {
		['id'] = 1543,
		['filter'] = '劳工观察'
	},
	[1544] = {
		['id'] = 1544,
		['filter'] = '劳教'
	},
	[1545] = {
		['id'] = 1545,
		['filter'] = '劳教基金'
	},
	[1546] = {
		['id'] = 1546,
		['filter'] = '老 婊 子'
	},
	[1547] = {
		['id'] = 1547,
		['filter'] = '老虎机'
	},
	[1548] = {
		['id'] = 1548,
		['filter'] = '老虎机定位器'
	},
	[1549] = {
		['id'] = 1549,
		['filter'] = '老虎机上分器'
	},
	[1550] = {
		['id'] = 1550,
		['filter'] = '老虎機'
	},
	[1551] = {
		['id'] = 1551,
		['filter'] = '老江'
	},
	[1552] = {
		['id'] = 1552,
		['filter'] = '老毛'
	},
	[1553] = {
		['id'] = 1553,
		['filter'] = '老衲痛经啊'
	},
	[1554] = {
		['id'] = 1554,
		['filter'] = '老人政治'
	},
	[1555] = {
		['id'] = 1555,
		['filter'] = '雷达测速器'
	},
	[1556] = {
		['id'] = 1556,
		['filter'] = '雷達測速器'
	},
	[1557] = {
		['id'] = 1557,
		['filter'] = '雷管'
	},
	[1558] = {
		['id'] = 1558,
		['filter'] = '雷管制造技术'
	},
	[1559] = {
		['id'] = 1559,
		['filter'] = '雷鸣球'
	},
	[1560] = {
		['id'] = 1560,
		['filter'] = '冷宽'
	},
	[1561] = {
		['id'] = 1561,
		['filter'] = '黎安友'
	},
	[1562] = {
		['id'] = 1562,
		['filter'] = '黎阳平'
	},
	[1563] = {
		['id'] = 1563,
		['filter'] = '黎阳评'
	},
	[1564] = {
		['id'] = 1564,
		['filter'] = '黎陽評'
	},
	[1565] = {
		['id'] = 1565,
		['filter'] = '黎智英'
	},
	[1566] = {
		['id'] = 1566,
		['filter'] = '李 洪 志'
	},
	[1567] = {
		['id'] = 1567,
		['filter'] = '李洪志'
	},
	[1568] = {
		['id'] = 1568,
		['filter'] = '里藏春'
	},
	[1569] = {
		['id'] = 1569,
		['filter'] = '历史篡改者'
	},
	[1570] = {
		['id'] = 1570,
		['filter'] = '历史上的真实故事'
	},
	[1571] = {
		['id'] = 1571,
		['filter'] = '俪影蝎心'
	},
	[1572] = {
		['id'] = 1572,
		['filter'] = '连线机'
	},
	[1573] = {
		['id'] = 1573,
		['filter'] = '连队资料'
	},
	[1574] = {
		['id'] = 1574,
		['filter'] = '连胜德'
	},
	[1575] = {
		['id'] = 1575,
		['filter'] = '莲花艺术团'
	},
	[1576] = {
		['id'] = 1576,
		['filter'] = '連發'
	},
	[1577] = {
		['id'] = 1577,
		['filter'] = '联国专员'
	},
	[1578] = {
		['id'] = 1578,
		['filter'] = '联合起诉廉政大论坛'
	},
	[1579] = {
		['id'] = 1579,
		['filter'] = '联合起诉最高人民法院'
	},
	[1580] = {
		['id'] = 1580,
		['filter'] = '联名上书'
	},
	[1581] = {
		['id'] = 1581,
		['filter'] = '联总'
	},
	[1582] = {
		['id'] = 1582,
		['filter'] = '联总这声传单'
	},
	[1583] = {
		['id'] = 1583,
		['filter'] = '联总之声'
	},
	[1584] = {
		['id'] = 1584,
		['filter'] = '联总之声传单'
	},
	[1585] = {
		['id'] = 1585,
		['filter'] = '廉政大论坛'
	},
	[1586] = {
		['id'] = 1586,
		['filter'] = '练功群众'
	},
	[1587] = {
		['id'] = 1587,
		['filter'] = '练习器'
	},
	[1588] = {
		['id'] = 1588,
		['filter'] = '炼功'
	},
	[1589] = {
		['id'] = 1589,
		['filter'] = '梁保华'
	},
	[1590] = {
		['id'] = 1590,
		['filter'] = '梁光烈'
	},
	[1591] = {
		['id'] = 1591,
		['filter'] = '梁擎墩'
	},
	[1592] = {
		['id'] = 1592,
		['filter'] = '两岸才子对话'
	},
	[1593] = {
		['id'] = 1593,
		['filter'] = '两岸关系'
	},
	[1594] = {
		['id'] = 1594,
		['filter'] = '两岸三地论坛'
	},
	[1595] = {
		['id'] = 1595,
		['filter'] = '两个中国'
	},
	[1596] = {
		['id'] = 1596,
		['filter'] = '两会'
	},
	[1597] = {
		['id'] = 1597,
		['filter'] = '两会报道'
	},
	[1598] = {
		['id'] = 1598,
		['filter'] = '两会新闻'
	},
	[1599] = {
		['id'] = 1599,
		['filter'] = '两派争斗'
	},
	[1600] = {
		['id'] = 1600,
		['filter'] = '两性狂情'
	},
	[1601] = {
		['id'] = 1601,
		['filter'] = '两性淫乱'
	},
	[1602] = {
		['id'] = 1602,
		['filter'] = '兩性淫亂'
	},
	[1603] = {
		['id'] = 1603,
		['filter'] = '辽阳工潮'
	},
	[1604] = {
		['id'] = 1604,
		['filter'] = '廖锡龙'
	},
	[1605] = {
		['id'] = 1605,
		['filter'] = '劣等人种博彩'
	},
	[1606] = {
		['id'] = 1606,
		['filter'] = '烈火凤凰'
	},
	[1607] = {
		['id'] = 1607,
		['filter'] = '烈火凤凰舍生取义'
	},
	[1608] = {
		['id'] = 1608,
		['filter'] = '猎枪'
	},
	[1609] = {
		['id'] = 1609,
		['filter'] = '猎杀熊猫'
	},
	[1610] = {
		['id'] = 1610,
		['filter'] = '林海唐'
	},
	[1611] = {
		['id'] = 1611,
		['filter'] = '领导班子名单外泄'
	},
	[1612] = {
		['id'] = 1612,
		['filter'] = '领导财产公示'
	},
	[1613] = {
		['id'] = 1613,
		['filter'] = '领导层预备人选'
	},
	[1614] = {
		['id'] = 1614,
		['filter'] = '领导人'
	},
	[1615] = {
		['id'] = 1615,
		['filter'] = '领导人最强大阵容'
	},
	[1616] = {
		['id'] = 1616,
		['filter'] = '领导人最强阵容'
	},
	[1617] = {
		['id'] = 1617,
		['filter'] = '領導財產公示'
	},
	[1618] = {
		['id'] = 1618,
		['filter'] = '令狐安'
	},
	[1619] = {
		['id'] = 1619,
		['filter'] = '令狐计划'
	},
	[1620] = {
		['id'] = 1620,
		['filter'] = '令计划'
	},
	[1621] = {
		['id'] = 1621,
		['filter'] = '流氓警察'
	},
	[1622] = {
		['id'] = 1622,
		['filter'] = '流氓民运'
	},
	[1623] = {
		['id'] = 1623,
		['filter'] = '流氓无产者'
	},
	[1624] = {
		['id'] = 1624,
		['filter'] = '流脑'
	},
	[1625] = {
		['id'] = 1625,
		['filter'] = '流水穴'
	},
	[1626] = {
		['id'] = 1626,
		['filter'] = '流亡'
	},
	[1627] = {
		['id'] = 1627,
		['filter'] = '流亡藏人'
	},
	[1628] = {
		['id'] = 1628,
		['filter'] = '流亡政府'
	},
	[1629] = {
		['id'] = 1629,
		['filter'] = '流亡中的自在'
	},
	[1630] = {
		['id'] = 1630,
		['filter'] = '留四进三'
	},
	[1631] = {
		['id'] = 1631,
		['filter'] = '劉奇葆'
	},
	[1632] = {
		['id'] = 1632,
		['filter'] = '六●四'
	},
	[1633] = {
		['id'] = 1633,
		['filter'] = '露阴'
	},
	[1634] = {
		['id'] = 1634,
		['filter'] = '鲁俊'
	},
	[1635] = {
		['id'] = 1635,
		['filter'] = '陆空军地图'
	},
	[1636] = {
		['id'] = 1636,
		['filter'] = '陆肆'
	},
	[1637] = {
		['id'] = 1637,
		['filter'] = '陆委'
	},
	[1638] = {
		['id'] = 1638,
		['filter'] = '陆委会'
	},
	[1639] = {
		['id'] = 1639,
		['filter'] = '鹿鼎记趣'
	},
	[1640] = {
		['id'] = 1640,
		['filter'] = '吕京花'
	},
	[1641] = {
		['id'] = 1641,
		['filter'] = '吕秀莲'
	},
	[1642] = {
		['id'] = 1642,
		['filter'] = '铝热剂'
	},
	[1643] = {
		['id'] = 1643,
		['filter'] = '氯胺酮'
	},
	[1644] = {
		['id'] = 1644,
		['filter'] = '氯三苯乙烯'
	},
	[1645] = {
		['id'] = 1645,
		['filter'] = '氯硝安定'
	},
	[1646] = {
		['id'] = 1646,
		['filter'] = '乱交'
	},
	[1647] = {
		['id'] = 1647,
		['filter'] = '乱交的故事乱伦小说'
	},
	[1648] = {
		['id'] = 1648,
		['filter'] = '乱交乱淫乱伦'
	},
	[1649] = {
		['id'] = 1649,
		['filter'] = '乱伦'
	},
	[1650] = {
		['id'] = 1650,
		['filter'] = '亂倫'
	},
	[1651] = {
		['id'] = 1651,
		['filter'] = '抡功'
	},
	[1652] = {
		['id'] = 1652,
		['filter'] = '轮奸'
	},
	[1653] = {
		['id'] = 1653,
		['filter'] = '轮奸虐杀'
	},
	[1654] = {
		['id'] = 1654,
		['filter'] = '轮子小报'
	},
	[1655] = {
		['id'] = 1655,
		['filter'] = '倫公'
	},
	[1656] = {
		['id'] = 1656,
		['filter'] = '倫功'
	},
	[1657] = {
		['id'] = 1657,
		['filter'] = '倫攻'
	},
	[1658] = {
		['id'] = 1658,
		['filter'] = '淪公'
	},
	[1659] = {
		['id'] = 1659,
		['filter'] = '淪功'
	},
	[1660] = {
		['id'] = 1660,
		['filter'] = '淪攻'
	},
	[1661] = {
		['id'] = 1661,
		['filter'] = '輪公'
	},
	[1662] = {
		['id'] = 1662,
		['filter'] = '輪功'
	},
	[1663] = {
		['id'] = 1663,
		['filter'] = '輪攻'
	},
	[1664] = {
		['id'] = 1664,
		['filter'] = '论公'
	},
	[1665] = {
		['id'] = 1665,
		['filter'] = '论功'
	},
	[1666] = {
		['id'] = 1666,
		['filter'] = '论攻'
	},
	[1667] = {
		['id'] = 1667,
		['filter'] = '论坛群发王下载'
	},
	[1668] = {
		['id'] = 1668,
		['filter'] = '论坛自动发贴机'
	},
	[1669] = {
		['id'] = 1669,
		['filter'] = '論公'
	},
	[1670] = {
		['id'] = 1670,
		['filter'] = '論功'
	},
	[1671] = {
		['id'] = 1671,
		['filter'] = '論攻'
	},
	[1672] = {
		['id'] = 1672,
		['filter'] = '罗干'
	},
	[1673] = {
		['id'] = 1673,
		['filter'] = '罗礼诗'
	},
	[1674] = {
		['id'] = 1674,
		['filter'] = '羅幹'
	},
	[1675] = {
		['id'] = 1675,
		['filter'] = '裸干'
	},
	[1676] = {
		['id'] = 1676,
		['filter'] = '妈个'
	},
	[1677] = {
		['id'] = 1677,
		['filter'] = '妈妈的=>他*的'
	},
	[1678] = {
		['id'] = 1678,
		['filter'] = '妈批'
	},
	[1679] = {
		['id'] = 1679,
		['filter'] = '媽個'
	},
	[1680] = {
		['id'] = 1680,
		['filter'] = '媽媽的=>他*的'
	},
	[1681] = {
		['id'] = 1681,
		['filter'] = '买春买淫'
	},
	[1682] = {
		['id'] = 1682,
		['filter'] = '买春堂'
	},
	[1683] = {
		['id'] = 1683,
		['filter'] = '买答案'
	},
	[1684] = {
		['id'] = 1684,
		['filter'] = '买卖枪支'
	},
	[1685] = {
		['id'] = 1685,
		['filter'] = '買春堂'
	},
	[1686] = {
		['id'] = 1686,
		['filter'] = '買賣槍支'
	},
	[1687] = {
		['id'] = 1687,
		['filter'] = '麦角酸'
	},
	[1688] = {
		['id'] = 1688,
		['filter'] = '卖逼'
	},
	[1689] = {
		['id'] = 1689,
		['filter'] = '卖比'
	},
	[1690] = {
		['id'] = 1690,
		['filter'] = '卖答案'
	},
	[1691] = {
		['id'] = 1691,
		['filter'] = '卖国'
	},
	[1692] = {
		['id'] = 1692,
		['filter'] = '卖身契系列'
	},
	[1693] = {
		['id'] = 1693,
		['filter'] = '卖淫'
	},
	[1694] = {
		['id'] = 1694,
		['filter'] = '猫肉'
	},
	[1695] = {
		['id'] = 1695,
		['filter'] = '貓肉'
	},
	[1696] = {
		['id'] = 1696,
		['filter'] = '毛泽东'
	},
	[1697] = {
		['id'] = 1697,
		['filter'] = '毛厕东'
	},
	[1698] = {
		['id'] = 1698,
		['filter'] = '毛厕洞'
	},
	[1699] = {
		['id'] = 1699,
		['filter'] = '毛都露出'
	},
	[1700] = {
		['id'] = 1700,
		['filter'] = '毛共'
	},
	[1701] = {
		['id'] = 1701,
		['filter'] = '毛光烈'
	},
	[1702] = {
		['id'] = 1702,
		['filter'] = '毛派'
	},
	[1703] = {
		['id'] = 1703,
		['filter'] = '毛片'
	},
	[1704] = {
		['id'] = 1704,
		['filter'] = '毛如柏'
	},
	[1705] = {
		['id'] = 1705,
		['filter'] = '毛时代大饥荒揭秘'
	},
	[1706] = {
		['id'] = 1706,
		['filter'] = '毛爷爷复活'
	},
	[1707] = {
		['id'] = 1707,
		['filter'] = '毛一鲜'
	},
	[1708] = {
		['id'] = 1708,
		['filter'] = '毛一鮮'
	},
	[1709] = {
		['id'] = 1709,
		['filter'] = '毛泽东复活'
	},
	[1710] = {
		['id'] = 1710,
		['filter'] = '毛泽东复活后'
	},
	[1711] = {
		['id'] = 1711,
		['filter'] = '毛泽东侄子'
	},
	[1712] = {
		['id'] = 1712,
		['filter'] = '毛贼'
	},
	[1713] = {
		['id'] = 1713,
		['filter'] = '毛贼东'
	},
	[1714] = {
		['id'] = 1714,
		['filter'] = '毛主席的嫡孙'
	},
	[1715] = {
		['id'] = 1715,
		['filter'] = '毛主席复活'
	},
	[1716] = {
		['id'] = 1716,
		['filter'] = '毛主席復活'
	},
	[1717] = {
		['id'] = 1717,
		['filter'] = '毛主席关于人民军队人民战争及其战略战术论述的摘录'
	},
	[1718] = {
		['id'] = 1718,
		['filter'] = '毛主席批示'
	},
	[1719] = {
		['id'] = 1719,
		['filter'] = '毛主席有关指示'
	},
	[1720] = {
		['id'] = 1720,
		['filter'] = '毛主席致江青同志的信'
	},
	[1721] = {
		['id'] = 1721,
		['filter'] = '毛主席资料'
	},
	[1722] = {
		['id'] = 1722,
		['filter'] = '美女'
	},
	[1723] = {
		['id'] = 1723,
		['filter'] = '美女黄色'
	},
	[1724] = {
		['id'] = 1724,
		['filter'] = '美女人体艺术'
	},
	[1725] = {
		['id'] = 1725,
		['filter'] = '美女上门'
	},
	[1726] = {
		['id'] = 1726,
		['filter'] = '美女視頻'
	},
	[1727] = {
		['id'] = 1727,
		['filter'] = '美女野球拳'
	},
	[1728] = {
		['id'] = 1728,
		['filter'] = '美女做愛'
	},
	[1729] = {
		['id'] = 1729,
		['filter'] = '美少女麻雀'
	},
	[1730] = {
		['id'] = 1730,
		['filter'] = '美腿'
	},
	[1731] = {
		['id'] = 1731,
		['filter'] = '美腿写真'
	},
	[1732] = {
		['id'] = 1732,
		['filter'] = '美腿寫真'
	},
	[1733] = {
		['id'] = 1733,
		['filter'] = '妹疼'
	},
	[1734] = {
		['id'] = 1734,
		['filter'] = '妹痛'
	},
	[1735] = {
		['id'] = 1735,
		['filter'] = '夢幻麻將館'
	},
	[1736] = {
		['id'] = 1736,
		['filter'] = '猛插'
	},
	[1737] = {
		['id'] = 1737,
		['filter'] = '猛男强奸'
	},
	[1738] = {
		['id'] = 1738,
		['filter'] = '民族分裂'
	},
	[1739] = {
		['id'] = 1739,
		['filter'] = '民族矛盾'
	},
	[1740] = {
		['id'] = 1740,
		['filter'] = '民族问题'
	},
	[1741] = {
		['id'] = 1741,
		['filter'] = '闵耀中'
	},
	[1742] = {
		['id'] = 1742,
		['filter'] = '名山县'
	},
	[1743] = {
		['id'] = 1743,
		['filter'] = '明Hui'
	},
	[1744] = {
		['id'] = 1744,
		['filter'] = '明慧'
	},
	[1745] = {
		['id'] = 1745,
		['filter'] = '明.慧'
	},
	[1746] = {
		['id'] = 1746,
		['filter'] = '明慧网'
	},
	[1747] = {
		['id'] = 1747,
		['filter'] = '魔教'
	},
	[1748] = {
		['id'] = 1748,
		['filter'] = '魔界活动转区'
	},
	[1749] = {
		['id'] = 1749,
		['filter'] = '魔难论'
	},
	[1750] = {
		['id'] = 1750,
		['filter'] = '末世劫难'
	},
	[1751] = {
		['id'] = 1751,
		['filter'] = '末世论'
	},
	[1752] = {
		['id'] = 1752,
		['filter'] = '莫伟强'
	},
	[1753] = {
		['id'] = 1753,
		['filter'] = '漠视生命自私到了极点的中共政权'
	},
	[1754] = {
		['id'] = 1754,
		['filter'] = '牟新生'
	},
	[1755] = {
		['id'] = 1755,
		['filter'] = '某杂志编辑部'
	},
	[1756] = {
		['id'] = 1756,
		['filter'] = '母之欲火'
	},
	[1757] = {
		['id'] = 1757,
		['filter'] = '母子'
	},
	[1758] = {
		['id'] = 1758,
		['filter'] = '母子情欲小说'
	},
	[1759] = {
		['id'] = 1759,
		['filter'] = '木犀地'
	},
	[1760] = {
		['id'] = 1760,
		['filter'] = '木子论坛'
	},
	[1761] = {
		['id'] = 1761,
		['filter'] = '内裤'
	},
	[1762] = {
		['id'] = 1762,
		['filter'] = '内射'
	},
	[1763] = {
		['id'] = 1763,
		['filter'] = '内争人权'
	},
	[1764] = {
		['id'] = 1764,
		['filter'] = '奶头真红'
	},
	[1765] = {
		['id'] = 1765,
		['filter'] = '奶子'
	},
	[1766] = {
		['id'] = 1766,
		['filter'] = '闹事'
	},
	[1767] = {
		['id'] = 1767,
		['filter'] = '嫩穴'
	},
	[1768] = {
		['id'] = 1768,
		['filter'] = '能力主'
	},
	[1769] = {
		['id'] = 1769,
		['filter'] = '尼总务石器吸其目哦轻易'
	},
	[1770] = {
		['id'] = 1770,
		['filter'] = '倪育贤'
	},
	[1771] = {
		['id'] = 1771,
		['filter'] = '倪志福'
	},
	[1772] = {
		['id'] = 1772,
		['filter'] = '你妈逼'
	},
	[1773] = {
		['id'] = 1773,
		['filter'] = '你妈的'
	},
	[1774] = {
		['id'] = 1774,
		['filter'] = '你娘的'
	},
	[1775] = {
		['id'] = 1775,
		['filter'] = '你说我说论坛'
	},
	[1776] = {
		['id'] = 1776,
		['filter'] = '你他妈'
	},
	[1777] = {
		['id'] = 1777,
		['filter'] = '你退了吗'
	},
	[1778] = {
		['id'] = 1778,
		['filter'] = '年春衫薄'
	},
	[1779] = {
		['id'] = 1779,
		['filter'] = '鸟巢缺陷'
	},
	[1780] = {
		['id'] = 1780,
		['filter'] = '牛逼'
	},
	[1781] = {
		['id'] = 1781,
		['filter'] = '牛比'
	},
	[1782] = {
		['id'] = 1782,
		['filter'] = '钮茂生'
	},
	[1783] = {
		['id'] = 1783,
		['filter'] = '农民真正贫困的根源'
	},
	[1784] = {
		['id'] = 1784,
		['filter'] = '奴事件'
	},
	[1785] = {
		['id'] = 1785,
		['filter'] = '奴役童工'
	},
	[1786] = {
		['id'] = 1786,
		['filter'] = '女女'
	},
	[1787] = {
		['id'] = 1787,
		['filter'] = '女色情自拍'
	},
	[1788] = {
		['id'] = 1788,
		['filter'] = '女神教'
	},
	[1789] = {
		['id'] = 1789,
		['filter'] = '女死囚'
	},
	[1790] = {
		['id'] = 1790,
		['filter'] = '女优'
	},
	[1791] = {
		['id'] = 1791,
		['filter'] = '女优片'
	},
	[1792] = {
		['id'] = 1792,
		['filter'] = '女優'
	},
	[1793] = {
		['id'] = 1793,
		['filter'] = '女友坊'
	},
	[1794] = {
		['id'] = 1794,
		['filter'] = '虐待'
	},
	[1795] = {
		['id'] = 1795,
		['filter'] = '诺龙'
	},
	[1796] = {
		['id'] = 1796,
		['filter'] = '锘挎瘺娉戒笢1234'
	},
	[1797] = {
		['id'] = 1797,
		['filter'] = '锘挎瘺娉戒笢12345'
	},
	[1798] = {
		['id'] = 1798,
		['filter'] = '欧美淫乱'
	},
	[1799] = {
		['id'] = 1799,
		['filter'] = '欧泽高'
	},
	[1800] = {
		['id'] = 1800,
		['filter'] = '欧洲圆明网'
	},
	[1801] = {
		['id'] = 1801,
		['filter'] = '拍花子'
	},
	[1802] = {
		['id'] = 1802,
		['filter'] = '拍肩迷'
	},
	[1803] = {
		['id'] = 1803,
		['filter'] = '拍肩神药'
	},
	[1804] = {
		['id'] = 1804,
		['filter'] = '拍肩神藥'
	},
	[1805] = {
		['id'] = 1805,
		['filter'] = '派系斗争'
	},
	[1806] = {
		['id'] = 1806,
		['filter'] = '潘国平'
	},
	[1807] = {
		['id'] = 1807,
		['filter'] = '盘古乐队'
	},
	[1808] = {
		['id'] = 1808,
		['filter'] = '盤古樂隊'
	},
	[1809] = {
		['id'] = 1809,
		['filter'] = '炮兵参谋手册'
	},
	[1810] = {
		['id'] = 1810,
		['filter'] = '炮轰密妃'
	},
	[1811] = {
		['id'] = 1811,
		['filter'] = '炮轰铁道部'
	},
	[1812] = {
		['id'] = 1812,
		['filter'] = '跑官要官'
	},
	[1813] = {
		['id'] = 1813,
		['filter'] = '泡沫经济'
	},
	[1814] = {
		['id'] = 1814,
		['filter'] = '喷剂'
	},
	[1815] = {
		['id'] = 1815,
		['filter'] = '喷精'
	},
	[1816] = {
		['id'] = 1816,
		['filter'] = '喷尿'
	},
	[1817] = {
		['id'] = 1817,
		['filter'] = '喷雾迷药'
	},
	[1818] = {
		['id'] = 1818,
		['filter'] = '喷雾型'
	},
	[1819] = {
		['id'] = 1819,
		['filter'] = '喷雾型迷药'
	},
	[1820] = {
		['id'] = 1820,
		['filter'] = '彭钢'
	},
	[1821] = {
		['id'] = 1821,
		['filter'] = '彭丽媛'
	},
	[1822] = {
		['id'] = 1822,
		['filter'] = '批林整风参考材料'
	},
	[1823] = {
		['id'] = 1823,
		['filter'] = '屁股'
	},
	[1824] = {
		['id'] = 1824,
		['filter'] = '屁眼'
	},
	[1825] = {
		['id'] = 1825,
		['filter'] = '骗局'
	},
	[1826] = {
		['id'] = 1826,
		['filter'] = '騙局'
	},
	[1827] = {
		['id'] = 1827,
		['filter'] = '嫖鸡'
	},
	[1828] = {
		['id'] = 1828,
		['filter'] = '嫖雞'
	},
	[1829] = {
		['id'] = 1829,
		['filter'] = '嫖妓'
	},
	[1830] = {
		['id'] = 1830,
		['filter'] = '平安夜自杀'
	},
	[1831] = {
		['id'] = 1831,
		['filter'] = '平反六四'
	},
	[1832] = {
		['id'] = 1832,
		['filter'] = '平银芳'
	},
	[1833] = {
		['id'] = 1833,
		['filter'] = '迫害'
	},
	[1834] = {
		['id'] = 1834,
		['filter'] = '迫害珐(工力)国际组织'
	},
	[1835] = {
		['id'] = 1835,
		['filter'] = '迫害无辜何时了'
	},
	[1836] = {
		['id'] = 1836,
		['filter'] = '迫害致死'
	},
	[1837] = {
		['id'] = 1837,
		['filter'] = '迫近水危机'
	},
	[1838] = {
		['id'] = 1838,
		['filter'] = '破处'
	},
	[1839] = {
		['id'] = 1839,
		['filter'] = '破碎机'
	},
	[1840] = {
		['id'] = 1840,
		['filter'] = '破网'
	},
	[1841] = {
		['id'] = 1841,
		['filter'] = '破网软件'
	},
	[1842] = {
		['id'] = 1842,
		['filter'] = '菩提功'
	},
	[1843] = {
		['id'] = 1843,
		['filter'] = '蒲海清'
	},
	[1844] = {
		['id'] = 1844,
		['filter'] = '蒲团'
	},
	[1845] = {
		['id'] = 1845,
		['filter'] = '濮洪九'
	},
	[1846] = {
		['id'] = 1846,
		['filter'] = '朴鸣呼'
	},
	[1847] = {
		['id'] = 1847,
		['filter'] = '曝光王'
	},
	[1848] = {
		['id'] = 1848,
		['filter'] = '七宗罪'
	},
	[1849] = {
		['id'] = 1849,
		['filter'] = '祁建'
	},
	[1850] = {
		['id'] = 1850,
		['filter'] = '齐墨'
	},
	[1851] = {
		['id'] = 1851,
		['filter'] = '其他'
	},
	[1852] = {
		['id'] = 1852,
		['filter'] = '企业汇总会计报表'
	},
	[1853] = {
		['id'] = 1853,
		['filter'] = '企业如何建立网站'
	},
	[1854] = {
		['id'] = 1854,
		['filter'] = '强暴'
	},
	[1855] = {
		['id'] = 1855,
		['filter'] = '强奸'
	},
	[1856] = {
		['id'] = 1856,
		['filter'] = '强奸II-制服诱惑'
	},
	[1857] = {
		['id'] = 1857,
		['filter'] = '强奸少妇'
	},
	[1858] = {
		['id'] = 1858,
		['filter'] = '强歼'
	},
	[1859] = {
		['id'] = 1859,
		['filter'] = '强烈抗议中共当局'
	},
	[1860] = {
		['id'] = 1860,
		['filter'] = '强卫'
	},
	[1861] = {
		['id'] = 1861,
		['filter'] = '强效失意药'
	},
	[1862] = {
		['id'] = 1862,
		['filter'] = '强硬发言'
	},
	[1863] = {
		['id'] = 1863,
		['filter'] = '抢/盐'
	},
	[1864] = {
		['id'] = 1864,
		['filter'] = '抢\盐'
	},
	[1865] = {
		['id'] = 1865,
		['filter'] = '抢答器'
	},
	[1866] = {
		['id'] = 1866,
		['filter'] = '抢粮记'
	},
	[1867] = {
		['id'] = 1867,
		['filter'] = '抢圣火'
	},
	[1868] = {
		['id'] = 1868,
		['filter'] = '羟丁酸'
	},
	[1869] = {
		['id'] = 1869,
		['filter'] = '乔波室内滑雪馆'
	},
	[1870] = {
		['id'] = 1870,
		['filter'] = '乔石'
	},
	[1871] = {
		['id'] = 1871,
		['filter'] = '切波特'
	},
	[1872] = {
		['id'] = 1872,
		['filter'] = '窃听'
	},
	[1873] = {
		['id'] = 1873,
		['filter'] = '窃听器材'
	},
	[1874] = {
		['id'] = 1874,
		['filter'] = '窃听设备'
	},
	[1875] = {
		['id'] = 1875,
		['filter'] = '窃听王'
	},
	[1876] = {
		['id'] = 1876,
		['filter'] = '竊聽器'
	},
	[1877] = {
		['id'] = 1877,
		['filter'] = '竊聽器材'
	},
	[1878] = {
		['id'] = 1878,
		['filter'] = '亲爱的爸爸奸淫我'
	},
	[1879] = {
		['id'] = 1879,
		['filter'] = '亲共分子'
	},
	[1880] = {
		['id'] = 1880,
		['filter'] = '亲共媒体'
	},
	[1881] = {
		['id'] = 1881,
		['filter'] = '亲共行动'
	},
	[1882] = {
		['id'] = 1882,
		['filter'] = '亲美'
	},
	[1883] = {
		['id'] = 1883,
		['filter'] = '侵犯国外专利'
	},
	[1884] = {
		['id'] = 1884,
		['filter'] = '钦本立'
	},
	[1885] = {
		['id'] = 1885,
		['filter'] = '钦点接班人'
	},
	[1886] = {
		['id'] = 1886,
		['filter'] = '秦晋'
	},
	[1887] = {
		['id'] = 1887,
		['filter'] = '秦青的幸'
	},
	[1888] = {
		['id'] = 1888,
		['filter'] = '沁园春血'
	},
	[1889] = {
		['id'] = 1889,
		['filter'] = '青岛石化项目引发市民恐慌'
	},
	[1890] = {
		['id'] = 1890,
		['filter'] = '青楼十二房'
	},
	[1891] = {
		['id'] = 1891,
		['filter'] = '青天白日旗'
	},
	[1892] = {
		['id'] = 1892,
		['filter'] = '轻松制作原子弹'
	},
	[1893] = {
		['id'] = 1893,
		['filter'] = '轻舟快讯'
	},
	[1894] = {
		['id'] = 1894,
		['filter'] = '清场内幕'
	},
	[1895] = {
		['id'] = 1895,
		['filter'] = '清纯少妇'
	},
	[1896] = {
		['id'] = 1896,
		['filter'] = '清官团'
	},
	[1897] = {
		['id'] = 1897,
		['filter'] = '清海师父'
	},
	[1898] = {
		['id'] = 1898,
		['filter'] = '清海无上师'
	},
	[1899] = {
		['id'] = 1899,
		['filter'] = '清华帮'
	},
	[1900] = {
		['id'] = 1900,
		['filter'] = '清明节到了'
	},
	[1901] = {
		['id'] = 1901,
		['filter'] = '情妇'
	},
	[1902] = {
		['id'] = 1902,
		['filter'] = '情色'
	},
	[1903] = {
		['id'] = 1903,
		['filter'] = '情色大片'
	},
	[1904] = {
		['id'] = 1904,
		['filter'] = '情色电影'
	},
	[1905] = {
		['id'] = 1905,
		['filter'] = '情色光碟'
	},
	[1906] = {
		['id'] = 1906,
		['filter'] = '情色呻吟'
	},
	[1907] = {
		['id'] = 1907,
		['filter'] = '情色贴图'
	},
	[1908] = {
		['id'] = 1908,
		['filter'] = '情色帖图成人漫画性爱图片'
	},
	[1909] = {
		['id'] = 1909,
		['filter'] = '情色图片'
	},
	[1910] = {
		['id'] = 1910,
		['filter'] = '情色文学'
	},
	[1911] = {
		['id'] = 1911,
		['filter'] = '情色小说'
	},
	[1912] = {
		['id'] = 1912,
		['filter'] = '情色影片'
	},
	[1913] = {
		['id'] = 1913,
		['filter'] = '情色影院'
	},
	[1914] = {
		['id'] = 1914,
		['filter'] = '情欲小说'
	},
	[1915] = {
		['id'] = 1915,
		['filter'] = '请愿'
	},
	[1916] = {
		['id'] = 1916,
		['filter'] = '庆公测幸运抽奖活动'
	},
	[1917] = {
		['id'] = 1917,
		['filter'] = '庆红'
	},
	[1918] = {
		['id'] = 1918,
		['filter'] = '球彩'
	},
	[1919] = {
		['id'] = 1919,
		['filter'] = '去他娘的'
	},
	[1920] = {
		['id'] = 1920,
		['filter'] = '全范围教会'
	},
	[1921] = {
		['id'] = 1921,
		['filter'] = '全国*揭晓二奶'
	},
	[1922] = {
		['id'] = 1922,
		['filter'] = '全国二奶'
	},
	[1923] = {
		['id'] = 1923,
		['filter'] = '全国二奶大奖赛'
	},
	[1924] = {
		['id'] = 1924,
		['filter'] = '全国二奶大赛'
	},
	[1925] = {
		['id'] = 1925,
		['filter'] = '全国两会'
	},
	[1926] = {
		['id'] = 1926,
		['filter'] = '全國二奶'
	},
	[1927] = {
		['id'] = 1927,
		['filter'] = '权斗'
	},
	[1928] = {
		['id'] = 1928,
		['filter'] = '权力瓜分'
	},
	[1929] = {
		['id'] = 1929,
		['filter'] = '权力核心'
	},
	[1930] = {
		['id'] = 1930,
		['filter'] = '确保北京的水利'
	},
	[1931] = {
		['id'] = 1931,
		['filter'] = '确保党国家机密安全规定'
	},
	[1932] = {
		['id'] = 1932,
		['filter'] = '裙底走光'
	},
	[1933] = {
		['id'] = 1933,
		['filter'] = '群发器'
	},
	[1934] = {
		['id'] = 1934,
		['filter'] = '群發器'
	},
	[1935] = {
		['id'] = 1935,
		['filter'] = '群奸'
	},
	[1936] = {
		['id'] = 1936,
		['filter'] = '群交'
	},
	[1937] = {
		['id'] = 1937,
		['filter'] = '群砍血腥时间'
	},
	[1938] = {
		['id'] = 1938,
		['filter'] = '群射'
	},
	[1939] = {
		['id'] = 1939,
		['filter'] = '群体灭绝'
	},
	[1940] = {
		['id'] = 1940,
		['filter'] = '群体灭绝罪'
	},
	[1941] = {
		['id'] = 1941,
		['filter'] = '群体事件'
	},
	[1942] = {
		['id'] = 1942,
		['filter'] = '群體事件'
	},
	[1943] = {
		['id'] = 1943,
		['filter'] = '绕过封锁'
	},
	[1944] = {
		['id'] = 1944,
		['filter'] = '热比娅'
	},
	[1945] = {
		['id'] = 1945,
		['filter'] = '热售英语四六级考试答案'
	},
	[1946] = {
		['id'] = 1946,
		['filter'] = '热血江湖'
	},
	[1947] = {
		['id'] = 1947,
		['filter'] = '热血江湖私服'
	},
	[1948] = {
		['id'] = 1948,
		['filter'] = '热站政论网'
	},
	[1949] = {
		['id'] = 1949,
		['filter'] = '人工少女'
	},
	[1950] = {
		['id'] = 1950,
		['filter'] = '人类罪恶论'
	},
	[1951] = {
		['id'] = 1951,
		['filter'] = '人妻兽虐曲'
	},
	[1952] = {
		['id'] = 1952,
		['filter'] = '人全球春节晚会'
	},
	[1953] = {
		['id'] = 1953,
		['filter'] = '人权'
	},
	[1954] = {
		['id'] = 1954,
		['filter'] = '人权恶棍'
	},
	[1955] = {
		['id'] = 1955,
		['filter'] = '人兽乱交'
	},
	[1956] = {
		['id'] = 1956,
		['filter'] = '人兽性交'
	},
	[1957] = {
		['id'] = 1957,
		['filter'] = '人体艺术'
	},
	[1958] = {
		['id'] = 1958,
		['filter'] = '人与兽乱交图片'
	},
	[1959] = {
		['id'] = 1959,
		['filter'] = '人宇特能功'
	},
	[1960] = {
		['id'] = 1960,
		['filter'] = '仁吉旺姆'
	},
	[1961] = {
		['id'] = 1961,
		['filter'] = '仁青加'
	},
	[1962] = {
		['id'] = 1962,
		['filter'] = '任泽民'
	},
	[1963] = {
		['id'] = 1963,
		['filter'] = '日本变态嫖客'
	},
	[1964] = {
		['id'] = 1964,
		['filter'] = '日逼'
	},
	[1965] = {
		['id'] = 1965,
		['filter'] = '日内瓦金融'
	},
	[1966] = {
		['id'] = 1966,
		['filter'] = '日你'
	},
	[1967] = {
		['id'] = 1967,
		['filter'] = '日你妈=>我是猪'
	},
	[1968] = {
		['id'] = 1968,
		['filter'] = '日您'
	},
	[1969] = {
		['id'] = 1969,
		['filter'] = '日批'
	},
	[1970] = {
		['id'] = 1970,
		['filter'] = '日死你'
	},
	[1971] = {
		['id'] = 1971,
		['filter'] = '日他'
	},
	[1972] = {
		['id'] = 1972,
		['filter'] = '肉棒'
	},
	[1973] = {
		['id'] = 1973,
		['filter'] = '肉穴'
	},
	[1974] = {
		['id'] = 1974,
		['filter'] = '肉洞'
	},
	[1975] = {
		['id'] = 1975,
		['filter'] = '肉棍'
	},
	[1976] = {
		['id'] = 1976,
		['filter'] = '肉穴**'
	},
	[1977] = {
		['id'] = 1977,
		['filter'] = '肉欲'
	},
	[1978] = {
		['id'] = 1978,
		['filter'] = '乳交'
	},
	[1979] = {
		['id'] = 1979,
		['filter'] = '乳交乳伦'
	},
	[1980] = {
		['id'] = 1980,
		['filter'] = '辱师'
	},
	[1981] = {
		['id'] = 1981,
		['filter'] = '入党申请书'
	},
	[1982] = {
		['id'] = 1982,
		['filter'] = '瑞士金融大学'
	},
	[1983] = {
		['id'] = 1983,
		['filter'] = '萨斯病'
	},
	[1984] = {
		['id'] = 1984,
		['filter'] = '赛克网'
	},
	[1985] = {
		['id'] = 1985,
		['filter'] = '赛马'
	},
	[1986] = {
		['id'] = 1986,
		['filter'] = '三级'
	},
	[1987] = {
		['id'] = 1987,
		['filter'] = '三级片'
	},
	[1988] = {
		['id'] = 1988,
		['filter'] = '三级片BT下载'
	},
	[1989] = {
		['id'] = 1989,
		['filter'] = '三級'
	},
	[1990] = {
		['id'] = 1990,
		['filter'] = '三級片=>我該死'
	},
	[1991] = {
		['id'] = 1991,
		['filter'] = '三句硬话'
	},
	[1992] = {
		['id'] = 1992,
		['filter'] = '三面翻'
	},
	[1993] = {
		['id'] = 1993,
		['filter'] = '骚逼'
	},
	[1994] = {
		['id'] = 1994,
		['filter'] = '骚逼小说黄色小说'
	},
	[1995] = {
		['id'] = 1995,
		['filter'] = '骚妇'
	},
	[1996] = {
		['id'] = 1996,
		['filter'] = '骚乱'
	},
	[1997] = {
		['id'] = 1997,
		['filter'] = '骚妹'
	},
	[1998] = {
		['id'] = 1998,
		['filter'] = '骚媚春情'
	},
	[1999] = {
		['id'] = 1999,
		['filter'] = '骚女'
	},
	[2000] = {
		['id'] = 2000,
		['filter'] = '骚水'
	},
	[2001] = {
		['id'] = 2001,
		['filter'] = '骚穴'
	},
	[2002] = {
		['id'] = 2002,
		['filter'] = '色-情'
	},
	[2003] = {
		['id'] = 2003,
		['filter'] = '色狼'
	},
	[2004] = {
		['id'] = 2004,
		['filter'] = '色狼网'
	},
	[2005] = {
		['id'] = 2005,
		['filter'] = '色狼网色狼俱乐部'
	},
	[2006] = {
		['id'] = 2006,
		['filter'] = '色狼網'
	},
	[2007] = {
		['id'] = 2007,
		['filter'] = '色情'
	},
	[2008] = {
		['id'] = 2008,
		['filter'] = '色情{5}'
	},
	[2009] = {
		['id'] = 2009,
		['filter'] = '色情电视'
	},
	[2010] = {
		['id'] = 2010,
		['filter'] = '色情电影'
	},
	[2011] = {
		['id'] = 2011,
		['filter'] = '色情電視'
	},
	[2012] = {
		['id'] = 2012,
		['filter'] = '色情服务'
	},
	[2013] = {
		['id'] = 2013,
		['filter'] = '色情图片'
	},
	[2014] = {
		['id'] = 2014,
		['filter'] = '色情圖片'
	},
	[2015] = {
		['id'] = 2015,
		['filter'] = '色情网站'
	},
	[2016] = {
		['id'] = 2016,
		['filter'] = '色情網站'
	},
	[2017] = {
		['id'] = 2017,
		['filter'] = '色情小电影'
	},
	[2018] = {
		['id'] = 2018,
		['filter'] = '色情小電影'
	},
	[2019] = {
		['id'] = 2019,
		['filter'] = '色情小说'
	},
	[2020] = {
		['id'] = 2020,
		['filter'] = '色友'
	},
	[2021] = {
		['id'] = 2021,
		['filter'] = '色欲'
	},
	[2022] = {
		['id'] = 2022,
		['filter'] = '杀人事件'
	},
	[2023] = {
		['id'] = 2023,
		['filter'] = '沙皇李长春'
	},
	[2024] = {
		['id'] = 2024,
		['filter'] = '傻B'
	},
	[2025] = {
		['id'] = 2025,
		['filter'] = '傻X'
	},
	[2026] = {
		['id'] = 2026,
		['filter'] = '傻逼'
	},
	[2027] = {
		['id'] = 2027,
		['filter'] = '煞笔'
	},
	[2028] = {
		['id'] = 2028,
		['filter'] = '上_门_服_务'
	},
	[2029] = {
		['id'] = 2029,
		['filter'] = '上床'
	},
	[2030] = {
		['id'] = 2030,
		['filter'] = '上访'
	},
	[2031] = {
		['id'] = 2031,
		['filter'] = '少妇'
	},
	[2032] = {
		['id'] = 2032,
		['filter'] = '少妇白洁'
	},
	[2033] = {
		['id'] = 2033,
		['filter'] = '少年阿宾'
	},
	[2034] = {
		['id'] = 2034,
		['filter'] = '少女高潮'
	},
	[2035] = {
		['id'] = 2035,
		['filter'] = '少女俱乐部'
	},
	[2036] = {
		['id'] = 2036,
		['filter'] = '邵家健'
	},
	[2037] = {
		['id'] = 2037,
		['filter'] = '社会民主主义'
	},
	[2038] = {
		['id'] = 2038,
		['filter'] = '社民党'
	},
	[2039] = {
		['id'] = 2039,
		['filter'] = '射精'
	},
	[2040] = {
		['id'] = 2040,
		['filter'] = '涉台政局'
	},
	[2041] = {
		['id'] = 2041,
		['filter'] = '身份证生成'
	},
	[2042] = {
		['id'] = 2042,
		['filter'] = '身份证号码生成器身份证生成器软件'
	},
	[2043] = {
		['id'] = 2043,
		['filter'] = '十大经典谎言'
	},
	[2044] = {
		['id'] = 2044,
		['filter'] = '十七大'
	},
	[2045] = {
		['id'] = 2045,
		['filter'] = '十八大'
	},
	[2046] = {
		['id'] = 2046,
		['filter'] = '十八禁'
	},
	[2047] = {
		['id'] = 2047,
		['filter'] = '十八摸'
	},
	[2048] = {
		['id'] = 2048,
		['filter'] = '十大独裁'
	},
	[2049] = {
		['id'] = 2049,
		['filter'] = '十大恶词'
	},
	[2050] = {
		['id'] = 2050,
		['filter'] = '十大忽悠名言'
	},
	[2051] = {
		['id'] = 2051,
		['filter'] = '十大奖项及中奖名单'
	},
	[2052] = {
		['id'] = 2052,
		['filter'] = '十景缎'
	},
	[2053] = {
		['id'] = 2053,
		['filter'] = '十年动乱××'
	},
	[2054] = {
		['id'] = 2054,
		['filter'] = '十七大代表'
	},
	[2055] = {
		['id'] = 2055,
		['filter'] = '十七大风云'
	},
	[2056] = {
		['id'] = 2056,
		['filter'] = '十七大你转折了吗'
	},
	[2057] = {
		['id'] = 2057,
		['filter'] = '十七大权力争霸战'
	},
	[2058] = {
		['id'] = 2058,
		['filter'] = '十七人事安排'
	},
	[2059] = {
		['id'] = 2059,
		['filter'] = '十七位老部长'
	},
	[2060] = {
		['id'] = 2060,
		['filter'] = '石戈'
	},
	[2061] = {
		['id'] = 2061,
		['filter'] = '石云生'
	},
	[2062] = {
		['id'] = 2062,
		['filter'] = '石宗源'
	},
	[2063] = {
		['id'] = 2063,
		['filter'] = '时时彩'
	},
	[2064] = {
		['id'] = 2064,
		['filter'] = '时代互联'
	},
	[2065] = {
		['id'] = 2065,
		['filter'] = '时代论坛'
	},
	[2066] = {
		['id'] = 2066,
		['filter'] = '时期打了几次我再次哦唯'
	},
	[2067] = {
		['id'] = 2067,
		['filter'] = '时事论坛'
	},
	[2068] = {
		['id'] = 2068,
		['filter'] = '实际神'
	},
	[2069] = {
		['id'] = 2069,
		['filter'] = '史上最强阵容的中国国家领导人'
	},
	[2070] = {
		['id'] = 2070,
		['filter'] = '世界基督教统一神灵协会'
	},
	[2071] = {
		['id'] = 2071,
		['filter'] = '世界经济导报'
	},
	[2072] = {
		['id'] = 2072,
		['filter'] = '世界十大独裁者'
	},
	[2073] = {
		['id'] = 2073,
		['filter'] = '世界以利亚福音宣教会'
	},
	[2074] = {
		['id'] = 2074,
		['filter'] = '世界之门'
	},
	[2075] = {
		['id'] = 2075,
		['filter'] = '示威'
	},
	[2076] = {
		['id'] = 2076,
		['filter'] = '事实独立'
	},
	[2077] = {
		['id'] = 2077,
		['filter'] = '视眼镜'
	},
	[2078] = {
		['id'] = 2078,
		['filter'] = '视频脱衣'
	},
	[2079] = {
		['id'] = 2079,
		['filter'] = '视频自拍'
	},
	[2080] = {
		['id'] = 2080,
		['filter'] = '视频自慰'
	},
	[2081] = {
		['id'] = 2081,
		['filter'] = '是束告项瓷，害电突网解'
	},
	[2082] = {
		['id'] = 2082,
		['filter'] = '是中国社会的爱滋病'
	},
	[2083] = {
		['id'] = 2083,
		['filter'] = '手qiang'
	},
	[2084] = {
		['id'] = 2084,
		['filter'] = '兽交'
	},
	[2085] = {
		['id'] = 2085,
		['filter'] = '售麻醉'
	},
	[2086] = {
		['id'] = 2086,
		['filter'] = '书记'
	},
	[2087] = {
		['id'] = 2087,
		['filter'] = '书记处'
	},
	[2088] = {
		['id'] = 2088,
		['filter'] = '書記'
	},
	[2089] = {
		['id'] = 2089,
		['filter'] = '舒淇'
	},
	[2090] = {
		['id'] = 2090,
		['filter'] = '熟女'
	},
	[2091] = {
		['id'] = 2091,
		['filter'] = '熟女之惑'
	},
	[2092] = {
		['id'] = 2092,
		['filter'] = '树亲民形象不如推动政改'
	},
	[2093] = {
		['id'] = 2093,
		['filter'] = '刷收藏'
	},
	[2094] = {
		['id'] = 2094,
		['filter'] = '刷淘宝'
	},
	[2095] = {
		['id'] = 2095,
		['filter'] = '刷信誉'
	},
	[2096] = {
		['id'] = 2096,
		['filter'] = '刷钻'
	},
	[2097] = {
		['id'] = 2097,
		['filter'] = '双管立式'
	},
	[2098] = {
		['id'] = 2098,
		['filter'] = '双儿篇'
	},
	[2099] = {
		['id'] = 2099,
		['filter'] = '双规'
	},
	[2100] = {
		['id'] = 2100,
		['filter'] = '双十节'
	},
	[2101] = {
		['id'] = 2101,
		['filter'] = '双腿间的禁地'
	},
	[2102] = {
		['id'] = 2102,
		['filter'] = '双鞋的故事'
	},
	[2103] = {
		['id'] = 2103,
		['filter'] = '爽死'
	},
	[2104] = {
		['id'] = 2104,
		['filter'] = '谁是胡的接班人'
	},
	[2105] = {
		['id'] = 2105,
		['filter'] = '谁是新中国'
	},
	[2106] = {
		['id'] = 2106,
		['filter'] = '谁为腐败晚餐买单'
	},
	[2107] = {
		['id'] = 2107,
		['filter'] = '氵去'
	},
	[2108] = {
		['id'] = 2108,
		['filter'] = '氵去车仑工力'
	},
	[2109] = {
		['id'] = 2109,
		['filter'] = '水扁'
	},
	[2110] = {
		['id'] = 2110,
		['filter'] = '税力'
	},
	[2111] = {
		['id'] = 2111,
		['filter'] = '税务总局致歉'
	},
	[2112] = {
		['id'] = 2112,
		['filter'] = '睡着的武神'
	},
	[2113] = {
		['id'] = 2113,
		['filter'] = '顺利通过考'
	},
	[2114] = {
		['id'] = 2114,
		['filter'] = '丝袜'
	},
	[2115] = {
		['id'] = 2115,
		['filter'] = '丝袜聊天室'
	},
	[2116] = {
		['id'] = 2116,
		['filter'] = '丝袜美女'
	},
	[2117] = {
		['id'] = 2117,
		['filter'] = '丝袜写真'
	},
	[2118] = {
		['id'] = 2118,
		['filter'] = '司法警官'
	},
	[2119] = {
		['id'] = 2119,
		['filter'] = '司马晋'
	},
	[2120] = {
		['id'] = 2120,
		['filter'] = '司马璐'
	},
	[2121] = {
		['id'] = 2121,
		['filter'] = '司马璐回忆录'
	},
	[2122] = {
		['id'] = 2122,
		['filter'] = '司马义铁力瓦尔地'
	},
	[2123] = {
		['id'] = 2123,
		['filter'] = '司徒华'
	},
	[2124] = {
		['id'] = 2124,
		['filter'] = '私服'
	},
	[2125] = {
		['id'] = 2125,
		['filter'] = '私营'
	},
	[2126] = {
		['id'] = 2126,
		['filter'] = '私彩'
	},
	[2127] = {
		['id'] = 2127,
		['filter'] = '私处'
	},
	[2128] = {
		['id'] = 2128,
		['filter'] = '斯皮尔博客北京奥运会'
	},
	[2129] = {
		['id'] = 2129,
		['filter'] = '斯鑫良'
	},
	[2130] = {
		['id'] = 2130,
		['filter'] = '絲襪寫真'
	},
	[2131] = {
		['id'] = 2131,
		['filter'] = '死刑过程'
	},
	[2132] = {
		['id'] = 2132,
		['filter'] = '死刑枪毙'
	},
	[2133] = {
		['id'] = 2133,
		['filter'] = '他妈的=>他*的'
	},
	[2134] = {
		['id'] = 2134,
		['filter'] = '他媽的的'
	},
	[2135] = {
		['id'] = 2135,
		['filter'] = '他娘的'
	},
	[2136] = {
		['id'] = 2136,
		['filter'] = '它妈的'
	},
	[2137] = {
		['id'] = 2137,
		['filter'] = '塔形流'
	},
	[2138] = {
		['id'] = 2138,
		['filter'] = '塔克拉玛干人权联合会'
	},
	[2139] = {
		['id'] = 2139,
		['filter'] = '台湾身份证'
	},
	[2140] = {
		['id'] = 2140,
		['filter'] = '台獨'
	},
	[2141] = {
		['id'] = 2141,
		['filter'] = '台独'
	},
	[2142] = {
		['id'] = 2142,
		['filter'] = '台海盾牌'
	},
	[2143] = {
		['id'] = 2143,
		['filter'] = '台海军刀'
	},
	[2144] = {
		['id'] = 2144,
		['filter'] = '台盟'
	},
	[2145] = {
		['id'] = 2145,
		['filter'] = '台湾'
	},
	[2146] = {
		['id'] = 2146,
		['filter'] = '台湾独'
	},
	[2147] = {
		['id'] = 2147,
		['filter'] = '台湾独立'
	},
	[2148] = {
		['id'] = 2148,
		['filter'] = '台湾共合国'
	},
	[2149] = {
		['id'] = 2149,
		['filter'] = '台湾狗'
	},
	[2150] = {
		['id'] = 2150,
		['filter'] = '台湾国'
	},
	[2151] = {
		['id'] = 2151,
		['filter'] = '台湾建国运动组织'
	},
	[2152] = {
		['id'] = 2152,
		['filter'] = '台湾青年独立联盟'
	},
	[2153] = {
		['id'] = 2153,
		['filter'] = '台湾应该独立'
	},
	[2154] = {
		['id'] = 2154,
		['filter'] = '台湾有权独立'
	},
	[2155] = {
		['id'] = 2155,
		['filter'] = '台湾政论区'
	},
	[2156] = {
		['id'] = 2156,
		['filter'] = '台湾自由联盟'
	},
	[2157] = {
		['id'] = 2157,
		['filter'] = '台湾总统'
	},
	[2158] = {
		['id'] = 2158,
		['filter'] = '臺灣獨立'
	},
	[2159] = {
		['id'] = 2159,
		['filter'] = '太王四神记'
	},
	[2160] = {
		['id'] = 2160,
		['filter'] = '太阳城'
	},
	[2161] = {
		['id'] = 2161,
		['filter'] = '太王记'
	},
	[2162] = {
		['id'] = 2162,
		['filter'] = '太王死神记'
	},
	[2163] = {
		['id'] = 2163,
		['filter'] = '太阳圣殿教'
	},
	[2164] = {
		['id'] = 2164,
		['filter'] = '太子党'
	},
	[2165] = {
		['id'] = 2165,
		['filter'] = '太子党名单'
	},
	[2166] = {
		['id'] = 2166,
		['filter'] = '太子黨'
	},
	[2167] = {
		['id'] = 2167,
		['filter'] = '泰州文教局停售通知'
	},
	[2168] = {
		['id'] = 2168,
		['filter'] = '贪官'
	},
	[2169] = {
		['id'] = 2169,
		['filter'] = '覃志刚'
	},
	[2170] = {
		['id'] = 2170,
		['filter'] = '谭力'
	},
	[2171] = {
		['id'] = 2171,
		['filter'] = '探测定位器'
	},
	[2172] = {
		['id'] = 2172,
		['filter'] = '探测狗'
	},
	[2173] = {
		['id'] = 2173,
		['filter'] = '探測狗'
	},
	[2174] = {
		['id'] = 2174,
		['filter'] = '汤光中'
	},
	[2175] = {
		['id'] = 2175,
		['filter'] = '唐柏桥'
	},
	[2176] = {
		['id'] = 2176,
		['filter'] = '唐家璇'
	},
	[2177] = {
		['id'] = 2177,
		['filter'] = '唐捷'
	},
	[2178] = {
		['id'] = 2178,
		['filter'] = '唐人电视台'
	},
	[2179] = {
		['id'] = 2179,
		['filter'] = '涛哥'
	},
	[2180] = {
		['id'] = 2180,
		['filter'] = '滔天大罪'
	},
	[2181] = {
		['id'] = 2181,
		['filter'] = '逃亡艳旅'
	},
	[2182] = {
		['id'] = 2182,
		['filter'] = '陶驷驹'
	},
	[2183] = {
		['id'] = 2183,
		['filter'] = '陶驷驹贪污行贿案'
	},
	[2184] = {
		['id'] = 2184,
		['filter'] = '淘宝白号'
	},
	[2185] = {
		['id'] = 2185,
		['filter'] = '淘宝收藏'
	},
	[2186] = {
		['id'] = 2186,
		['filter'] = '讨伐中宣部'
	},
	[2187] = {
		['id'] = 2187,
		['filter'] = '套牌'
	},
	[2188] = {
		['id'] = 2188,
		['filter'] = '套牌罢吃'
	},
	[2189] = {
		['id'] = 2189,
		['filter'] = '特别党费'
	},
	[2190] = {
		['id'] = 2190,
		['filter'] = '特价国际机票'
	},
	[2191] = {
		['id'] = 2191,
		['filter'] = '特马'
	},
	[2192] = {
		['id'] = 2192,
		['filter'] = '特码'
	},
	[2193] = {
		['id'] = 2193,
		['filter'] = '特碼'
	},
	[2194] = {
		['id'] = 2194,
		['filter'] = '特务机构'
	},
	[2195] = {
		['id'] = 2195,
		['filter'] = '特务民运'
	},
	[2196] = {
		['id'] = 2196,
		['filter'] = '腾文生'
	},
	[2197] = {
		['id'] = 2197,
		['filter'] = '腾讯幸运之星'
	},
	[2198] = {
		['id'] = 2198,
		['filter'] = '滕久明'
	},
	[2199] = {
		['id'] = 2199,
		['filter'] = '滕文生'
	},
	[2200] = {
		['id'] = 2200,
		['filter'] = '提供K粉OR冰毒'
	},
	[2201] = {
		['id'] = 2201,
		['filter'] = '提供甲基苯丙胺'
	},
	[2202] = {
		['id'] = 2202,
		['filter'] = '替.考'
	},
	[2203] = {
		['id'] = 2203,
		['filter'] = '替比夫定'
	},
	[2204] = {
		['id'] = 2204,
		['filter'] = '替考托福'
	},
	[2205] = {
		['id'] = 2205,
		['filter'] = '替考质量工程师'
	},
	[2206] = {
		['id'] = 2206,
		['filter'] = '天鹅之旅'
	},
	[2207] = {
		['id'] = 2207,
		['filter'] = '天上导弹不断'
	},
	[2208] = {
		['id'] = 2208,
		['filter'] = '天宇二手'
	},
	[2209] = {
		['id'] = 2209,
		['filter'] = '天浴'
	},
	[2210] = {
		['id'] = 2210,
		['filter'] = '天安门'
	},
	[2211] = {
		['id'] = 2211,
		['filter'] = '天安门大屠杀'
	},
	[2212] = {
		['id'] = 2212,
		['filter'] = '天安门纪念基金会'
	},
	[2213] = {
		['id'] = 2213,
		['filter'] = '天安门录影带'
	},
	[2214] = {
		['id'] = 2214,
		['filter'] = '天安门时间'
	},
	[2215] = {
		['id'] = 2215,
		['filter'] = '天安门事件'
	},
	[2216] = {
		['id'] = 2216,
		['filter'] = '天安门屠杀'
	},
	[2217] = {
		['id'] = 2217,
		['filter'] = '天安门一代'
	},
	[2218] = {
		['id'] = 2218,
		['filter'] = '天安門'
	},
	[2219] = {
		['id'] = 2219,
		['filter'] = '天府广场集会'
	},
	[2220] = {
		['id'] = 2220,
		['filter'] = '天父的儿女'
	},
	[2221] = {
		['id'] = 2221,
		['filter'] = '天国乐团'
	},
	[2222] = {
		['id'] = 2222,
		['filter'] = '天互数据'
	},
	[2223] = {
		['id'] = 2223,
		['filter'] = '天津事件'
	},
	[2224] = {
		['id'] = 2224,
		['filter'] = '天伦王朝'
	},
	[2225] = {
		['id'] = 2225,
		['filter'] = '天灭中'
	},
	[2226] = {
		['id'] = 2226,
		['filter'] = '天灭中共'
	},
	[2227] = {
		['id'] = 2227,
		['filter'] = '天怒'
	},
	[2228] = {
		['id'] = 2228,
		['filter'] = '天权'
	},
	[2229] = {
		['id'] = 2229,
		['filter'] = '天要灭'
	},
	[2230] = {
		['id'] = 2230,
		['filter'] = '天要灭中'
	},
	[2231] = {
		['id'] = 2231,
		['filter'] = '天要亡'
	},
	[2232] = {
		['id'] = 2232,
		['filter'] = '天音功'
	},
	[2233] = {
		['id'] = 2233,
		['filter'] = '天葬'
	},
	[2234] = {
		['id'] = 2234,
		['filter'] = '田凤山'
	},
	[2235] = {
		['id'] = 2235,
		['filter'] = '田纪云'
	},
	[2236] = {
		['id'] = 2236,
		['filter'] = '田明建时间'
	},
	[2237] = {
		['id'] = 2237,
		['filter'] = '舔奶'
	},
	[2238] = {
		['id'] = 2238,
		['filter'] = '舔私处'
	},
	[2239] = {
		['id'] = 2239,
		['filter'] = '庭  妍'
	},
	[2240] = {
		['id'] = 2240,
		['filter'] = '挺胡'
	},
	[2241] = {
		['id'] = 2241,
		['filter'] = '通示达'
	},
	[2242] = {
		['id'] = 2242,
		['filter'] = '通信维权'
	},
	[2243] = {
		['id'] = 2243,
		['filter'] = '同居社区'
	},
	[2244] = {
		['id'] = 2244,
		['filter'] = '同居社區'
	},
	[2245] = {
		['id'] = 2245,
		['filter'] = '同样的人权'
	},
	[2246] = {
		['id'] = 2246,
		['filter'] = '童奴工'
	},
	[2247] = {
		['id'] = 2247,
		['filter'] = '童屹'
	},
	[2248] = {
		['id'] = 2248,
		['filter'] = '统独'
	},
	[2249] = {
		['id'] = 2249,
		['filter'] = '统独论坛'
	},
	[2250] = {
		['id'] = 2250,
		['filter'] = '统一教'
	},
	[2251] = {
		['id'] = 2251,
		['filter'] = '统战'
	},
	[2252] = {
		['id'] = 2252,
		['filter'] = '统治术'
	},
	[2253] = {
		['id'] = 2253,
		['filter'] = '捅你'
	},
	[2254] = {
		['id'] = 2254,
		['filter'] = '捅我'
	},
	[2255] = {
		['id'] = 2255,
		['filter'] = '痛批政法委'
	},
	[2256] = {
		['id'] = 2256,
		['filter'] = '偷电'
	},
	[2257] = {
		['id'] = 2257,
		['filter'] = '偷听器'
	},
	[2258] = {
		['id'] = 2258,
		['filter'] = '偷窥'
	},
	[2259] = {
		['id'] = 2259,
		['filter'] = '偷窥有罪'
	},
	[2260] = {
		['id'] = 2260,
		['filter'] = '偷窺有罪'
	},
	[2261] = {
		['id'] = 2261,
		['filter'] = '偷拍'
	},
	[2262] = {
		['id'] = 2262,
		['filter'] = '偷情'
	},
	[2263] = {
		['id'] = 2263,
		['filter'] = '头号警花'
	},
	[2264] = {
		['id'] = 2264,
		['filter'] = '投毒杀人'
	},
	[2265] = {
		['id'] = 2265,
		['filter'] = '投毒殺人'
	},
	[2266] = {
		['id'] = 2266,
		['filter'] = '突破封锁'
	},
	[2267] = {
		['id'] = 2267,
		['filter'] = '突破技术'
	},
	[2268] = {
		['id'] = 2268,
		['filter'] = '突破网封索的软件'
	},
	[2269] = {
		['id'] = 2269,
		['filter'] = '突破网络'
	},
	[2270] = {
		['id'] = 2270,
		['filter'] = '突破网络封锁'
	},
	[2271] = {
		['id'] = 2271,
		['filter'] = '图说文化大革命'
	},
	[2272] = {
		['id'] = 2272,
		['filter'] = '涂运普'
	},
	[2273] = {
		['id'] = 2273,
		['filter'] = '屠龙别记'
	},
	[2274] = {
		['id'] = 2274,
		['filter'] = '屠杀'
	},
	[2275] = {
		['id'] = 2275,
		['filter'] = '土制C4'
	},
	[2276] = {
		['id'] = 2276,
		['filter'] = '吐血'
	},
	[2277] = {
		['id'] = 2277,
		['filter'] = '团派'
	},
	[2278] = {
		['id'] = 2278,
		['filter'] = '推翻社会主义制度'
	},
	[2279] = {
		['id'] = 2279,
		['filter'] = '退h集会'
	},
	[2280] = {
		['id'] = 2280,
		['filter'] = '退\\出\\党\\团\\队'
	},
	[2281] = {
		['id'] = 2281,
		['filter'] = '退出共产'
	},
	[2282] = {
		['id'] = 2282,
		['filter'] = '退出共产党'
	},
	[2283] = {
		['id'] = 2283,
		['filter'] = '退出中共'
	},
	[2284] = {
		['id'] = 2284,
		['filter'] = '退党'
	},
	[2285] = {
		['id'] = 2285,
		['filter'] = '退党声明'
	},
	[2286] = {
		['id'] = 2286,
		['filter'] = '退改离'
	},
	[2287] = {
		['id'] = 2287,
		['filter'] = '退团'
	},
	[2288] = {
		['id'] = 2288,
		['filter'] = '退团声明'
	},
	[2289] = {
		['id'] = 2289,
		['filter'] = '脫衣舞'
	},
	[2290] = {
		['id'] = 2290,
		['filter'] = '脱党'
	},
	[2291] = {
		['id'] = 2291,
		['filter'] = '脱光'
	},
	[2292] = {
		['id'] = 2292,
		['filter'] = '脱团'
	},
	[2293] = {
		['id'] = 2293,
		['filter'] = '脱衣'
	},
	[2294] = {
		['id'] = 2294,
		['filter'] = '脱衣舞'
	},
	[2295] = {
		['id'] = 2295,
		['filter'] = '瓦解专制'
	},
	[2296] = {
		['id'] = 2296,
		['filter'] = '王子淫传'
	},
	[2297] = {
		['id'] = 2297,
		['filter'] = '网上淫秽色情游戏'
	},
	[2298] = {
		['id'] = 2298,
		['filter'] = '网游喷血美女左小娜'
	},
	[2299] = {
		['id'] = 2299,
		['filter'] = '往事追忆录'
	},
	[2300] = {
		['id'] = 2300,
		['filter'] = '微型无线隐型耳机'
	},
	[2301] = {
		['id'] = 2301,
		['filter'] = '为党不为国'
	},
	[2302] = {
		['id'] = 2302,
		['filter'] = '围绕土地问题的攻防'
	},
	[2303] = {
		['id'] = 2303,
		['filter'] = '违禁品'
	},
	[2304] = {
		['id'] = 2304,
		['filter'] = '维多利亚包'
	},
	[2305] = {
		['id'] = 2305,
		['filter'] = '维权份子'
	},
	[2306] = {
		['id'] = 2306,
		['filter'] = '维权网'
	},
	[2307] = {
		['id'] = 2307,
		['filter'] = '维吾尔人权'
	},
	[2308] = {
		['id'] = 2308,
		['filter'] = '维吾尔信息社'
	},
	[2309] = {
		['id'] = 2309,
		['filter'] = '維多利亞包'
	},
	[2310] = {
		['id'] = 2310,
		['filter'] = '伪民运'
	},
	[2311] = {
		['id'] = 2311,
		['filter'] = '伪水'
	},
	[2312] = {
		['id'] = 2312,
		['filter'] = '伪装美女'
	},
	[2313] = {
		['id'] = 2313,
		['filter'] = '尾行'
	},
	[2314] = {
		['id'] = 2314,
		['filter'] = '偽裝美女'
	},
	[2315] = {
		['id'] = 2315,
		['filter'] = '隗福临'
	},
	[2316] = {
		['id'] = 2316,
		['filter'] = '文革'
	},
	[2317] = {
		['id'] = 2317,
		['filter'] = '文革××'
	},
	[2318] = {
		['id'] = 2318,
		['filter'] = '文革释放'
	},
	[2319] = {
		['id'] = 2319,
		['filter'] = '文化大革命'
	},
	[2320] = {
		['id'] = 2320,
		['filter'] = '文件秘密'
	},
	[2321] = {
		['id'] = 2321,
		['filter'] = '文字狱'
	},
	[2322] = {
		['id'] = 2322,
		['filter'] = '文字獄'
	},
	[2323] = {
		['id'] = 2323,
		['filter'] = '问候你全家'
	},
	[2324] = {
		['id'] = 2324,
		['filter'] = '翁虹'
	},
	[2325] = {
		['id'] = 2325,
		['filter'] = '瓮安'
	},
	[2326] = {
		['id'] = 2326,
		['filter'] = '瓮安暴乱'
	},
	[2327] = {
		['id'] = 2327,
		['filter'] = '瓮安骚乱'
	},
	[2328] = {
		['id'] = 2328,
		['filter'] = '窝囊的中国'
	},
	[2329] = {
		['id'] = 2329,
		['filter'] = '窝囊中国'
	},
	[2330] = {
		['id'] = 2330,
		['filter'] = '我XX你'
	},
	[2331] = {
		['id'] = 2331,
		['filter'] = '我色'
	},
	[2332] = {
		['id'] = 2332,
		['filter'] = '我淫'
	},
	[2333] = {
		['id'] = 2333,
		['filter'] = '我操'
	},
	[2334] = {
		['id'] = 2334,
		['filter'] = '我操你'
	},
	[2335] = {
		['id'] = 2335,
		['filter'] = '我草'
	},
	[2336] = {
		['id'] = 2336,
		['filter'] = '我的第一次外遇'
	},
	[2337] = {
		['id'] = 2337,
		['filter'] = '我的后讨伐中宣部时代'
	},
	[2338] = {
		['id'] = 2338,
		['filter'] = '我的鳥羽兄弟'
	},
	[2339] = {
		['id'] = 2339,
		['filter'] = '我的性启蒙'
	},
	[2340] = {
		['id'] = 2340,
		['filter'] = '我的性启蒙老师'
	},
	[2341] = {
		['id'] = 2341,
		['filter'] = '我靠=>我*'
	},
	[2342] = {
		['id'] = 2342,
		['filter'] = '我们自杀吧'
	},
	[2343] = {
		['id'] = 2343,
		['filter'] = '我日'
	},
	[2344] = {
		['id'] = 2344,
		['filter'] = '西藏暴乱'
	},
	[2345] = {
		['id'] = 2345,
		['filter'] = '西藏獨立'
	},
	[2346] = {
		['id'] = 2346,
		['filter'] = '西藏独'
	},
	[2347] = {
		['id'] = 2347,
		['filter'] = '西藏独立'
	},
	[2348] = {
		['id'] = 2348,
		['filter'] = '西藏国'
	},
	[2349] = {
		['id'] = 2349,
		['filter'] = '西藏国家民主党'
	},
	[2350] = {
		['id'] = 2350,
		['filter'] = '西藏基金会'
	},
	[2351] = {
		['id'] = 2351,
		['filter'] = '西藏论坛'
	},
	[2352] = {
		['id'] = 2352,
		['filter'] = '西藏青年大会'
	},
	[2353] = {
		['id'] = 2353,
		['filter'] = '西藏人民大起义运动'
	},
	[2354] = {
		['id'] = 2354,
		['filter'] = '西藏人权与民主'
	},
	[2355] = {
		['id'] = 2355,
		['filter'] = '西藏骚乱'
	},
	[2356] = {
		['id'] = 2356,
		['filter'] = '西藏天葬'
	},
	[2357] = {
		['id'] = 2357,
		['filter'] = '西藏天葬仪式'
	},
	[2358] = {
		['id'] = 2358,
		['filter'] = '西藏网'
	},
	[2359] = {
		['id'] = 2359,
		['filter'] = '西藏信息中心'
	},
	[2360] = {
		['id'] = 2360,
		['filter'] = '西藏正义'
	},
	[2361] = {
		['id'] = 2361,
		['filter'] = '西藏之声'
	},
	[2362] = {
		['id'] = 2362,
		['filter'] = '西藏之页'
	},
	[2363] = {
		['id'] = 2363,
		['filter'] = '西藏作家组织'
	},
	[2364] = {
		['id'] = 2364,
		['filter'] = '西单民主墙'
	},
	[2365] = {
		['id'] = 2365,
		['filter'] = '西山会议'
	},
	[2366] = {
		['id'] = 2366,
		['filter'] = '吸储'
	},
	[2367] = {
		['id'] = 2367,
		['filter'] = '吸儲'
	},
	[2368] = {
		['id'] = 2368,
		['filter'] = '先烈的电话'
	},
	[2369] = {
		['id'] = 2369,
		['filter'] = '先天健康法'
	},
	[2370] = {
		['id'] = 2370,
		['filter'] = '现代伊兰特'
	},
	[2371] = {
		['id'] = 2371,
		['filter'] = '现代人的五大悲哀'
	},
	[2372] = {
		['id'] = 2372,
		['filter'] = '现代艳帝'
	},
	[2373] = {
		['id'] = 2373,
		['filter'] = '现代艳帝传奇'
	},
	[2374] = {
		['id'] = 2374,
		['filter'] = '现代英雄传奇'
	},
	[2375] = {
		['id'] = 2375,
		['filter'] = '现代中国'
	},
	[2376] = {
		['id'] = 2376,
		['filter'] = '限制'
	},
	[2377] = {
		['id'] = 2377,
		['filter'] = '小泉恶搞'
	},
	[2378] = {
		['id'] = 2378,
		['filter'] = '小平讲英语'
	},
	[2379] = {
		['id'] = 2379,
		['filter'] = '小穴'
	},
	[2380] = {
		['id'] = 2380,
		['filter'] = '小穴六四'
	},
	[2381] = {
		['id'] = 2381,
		['filter'] = '小泽玛莉亚'
	},
	[2382] = {
		['id'] = 2382,
		['filter'] = '小泽圆'
	},
	[2383] = {
		['id'] = 2383,
		['filter'] = '小澤園'
	},
	[2384] = {
		['id'] = 2384,
		['filter'] = '肖强'
	},
	[2385] = {
		['id'] = 2385,
		['filter'] = '校花沉沦记'
	},
	[2386] = {
		['id'] = 2386,
		['filter'] = '校级复员军官'
	},
	[2387] = {
		['id'] = 2387,
		['filter'] = '校园静坐'
	},
	[2388] = {
		['id'] = 2388,
		['filter'] = '邪恶的党'
	},
	[2389] = {
		['id'] = 2389,
		['filter'] = '邪党'
	},
	[2390] = {
		['id'] = 2390,
		['filter'] = '邪恶?'
	},
	[2391] = {
		['id'] = 2391,
		['filter'] = '邪恶党徒'
	},
	[2392] = {
		['id'] = 2392,
		['filter'] = '邪恶共产党'
	},
	[2393] = {
		['id'] = 2393,
		['filter'] = '邪恶江泽民'
	},
	[2394] = {
		['id'] = 2394,
		['filter'] = '邪教'
	},
	[2395] = {
		['id'] = 2395,
		['filter'] = '写给十七大人大代表一封信'
	},
	[2396] = {
		['id'] = 2396,
		['filter'] = '泄题'
	},
	[2397] = {
		['id'] = 2397,
		['filter'] = '谢安'
	},
	[2398] = {
		['id'] = 2398,
		['filter'] = '谢长廷'
	},
	[2399] = {
		['id'] = 2399,
		['filter'] = '谢选骏'
	},
	[2400] = {
		['id'] = 2400,
		['filter'] = '谢中之'
	},
	[2401] = {
		['id'] = 2401,
		['filter'] = '心藏大恶'
	},
	[2402] = {
		['id'] = 2402,
		['filter'] = '辛灏年'
	},
	[2403] = {
		['id'] = 2403,
		['filter'] = '新xin唐tang'
	},
	[2404] = {
		['id'] = 2404,
		['filter'] = '新景隆'
	},
	[2405] = {
		['id'] = 2405,
		['filter'] = '新八荣八耻'
	},
	[2406] = {
		['id'] = 2406,
		['filter'] = '新党'
	},
	[2407] = {
		['id'] = 2407,
		['filter'] = '新观察论坛'
	},
	[2408] = {
		['id'] = 2408,
		['filter'] = '新国歌'
	},
	[2409] = {
		['id'] = 2409,
		['filter'] = '新华举报'
	},
	[2410] = {
		['id'] = 2410,
		['filter'] = '新华内情'
	},
	[2411] = {
		['id'] = 2411,
		['filter'] = '新华通论坛'
	},
	[2412] = {
		['id'] = 2412,
		['filter'] = '新疆暴乱'
	},
	[2413] = {
		['id'] = 2413,
		['filter'] = '新疆獨立'
	},
	[2414] = {
		['id'] = 2414,
		['filter'] = '新疆独'
	},
	[2415] = {
		['id'] = 2415,
		['filter'] = '新疆独立'
	},
	[2416] = {
		['id'] = 2416,
		['filter'] = '新疆反恐纪实'
	},
	[2417] = {
		['id'] = 2417,
		['filter'] = '新生网'
	},
	[2418] = {
		['id'] = 2418,
		['filter'] = '新诗年鉴'
	},
	[2419] = {
		['id'] = 2419,
		['filter'] = '新式军服'
	},
	[2420] = {
		['id'] = 2420,
		['filter'] = '性伴侣'
	},
	[2421] = {
		['id'] = 2421,
		['filter'] = '性福'
	},
	[2422] = {
		['id'] = 2422,
		['filter'] = '性学教授'
	},
	[2423] = {
		['id'] = 2423,
		['filter'] = '性爱'
	},
	[2424] = {
		['id'] = 2424,
		['filter'] = '性爱电影'
	},
	[2425] = {
		['id'] = 2425,
		['filter'] = '性爱教育'
	},
	[2426] = {
		['id'] = 2426,
		['filter'] = '性爱日记'
	},
	[2427] = {
		['id'] = 2427,
		['filter'] = '性爱文字'
	},
	[2428] = {
		['id'] = 2428,
		['filter'] = '性愛'
	},
	[2429] = {
		['id'] = 2429,
		['filter'] = '性愛電影'
	},
	[2430] = {
		['id'] = 2430,
		['filter'] = '性福人生'
	},
	[2431] = {
		['id'] = 2431,
		['filter'] = '性感'
	},
	[2432] = {
		['id'] = 2432,
		['filter'] = '性感扑克'
	},
	[2433] = {
		['id'] = 2433,
		['filter'] = '性感撲克'
	},
	[2434] = {
		['id'] = 2434,
		['filter'] = '性感沙滩'
	},
	[2435] = {
		['id'] = 2435,
		['filter'] = '性感沙灘'
	},
	[2436] = {
		['id'] = 2436,
		['filter'] = '性高潮'
	},
	[2437] = {
		['id'] = 2437,
		['filter'] = '性交'
	},
	[2438] = {
		['id'] = 2438,
		['filter'] = '性交大赛'
	},
	[2439] = {
		['id'] = 2439,
		['filter'] = '性教官'
	},
	[2440] = {
		['id'] = 2440,
		['filter'] = '性免费电影'
	},
	[2441] = {
		['id'] = 2441,
		['filter'] = '性奴'
	},
	[2442] = {
		['id'] = 2442,
		['filter'] = '性奴营'
	},
	[2443] = {
		['id'] = 2443,
		['filter'] = '性虐待'
	},
	[2444] = {
		['id'] = 2444,
		['filter'] = '性网站'
	},
	[2445] = {
		['id'] = 2445,
		['filter'] = '性網站'
	},
	[2446] = {
		['id'] = 2446,
		['filter'] = '性息'
	},
	[2447] = {
		['id'] = 2447,
		['filter'] = '性息网'
	},
	[2448] = {
		['id'] = 2448,
		['filter'] = '性信息交友'
	},
	[2449] = {
		['id'] = 2449,
		['filter'] = '性游戏'
	},
	[2450] = {
		['id'] = 2450,
		['filter'] = '熊炎'
	},
	[2451] = {
		['id'] = 2451,
		['filter'] = '熊焱'
	},
	[2452] = {
		['id'] = 2452,
		['filter'] = '修改成绩'
	},
	[2453] = {
		['id'] = 2453,
		['filter'] = '修炼之歌'
	},
	[2454] = {
		['id'] = 2454,
		['filter'] = '修煉'
	},
	[2455] = {
		['id'] = 2455,
		['filter'] = '玄`机'
	},
	[2456] = {
		['id'] = 2456,
		['filter'] = '薛伟'
	},
	[2457] = {
		['id'] = 2457,
		['filter'] = '穴口'
	},
	[2458] = {
		['id'] = 2458,
		['filter'] = '穴内'
	},
	[2459] = {
		['id'] = 2459,
		['filter'] = '学生暴动'
	},
	[2460] = {
		['id'] = 2460,
		['filter'] = '学生与警察'
	},
	[2461] = {
		['id'] = 2461,
		['filter'] = '学位证'
	},
	[2462] = {
		['id'] = 2462,
		['filter'] = '学潮'
	},
	[2463] = {
		['id'] = 2463,
		['filter'] = '学潮事件'
	},
	[2464] = {
		['id'] = 2464,
		['filter'] = '学姐和我的故事'
	},
	[2465] = {
		['id'] = 2465,
		['filter'] = '学联'
	},
	[2466] = {
		['id'] = 2466,
		['filter'] = '学生爱国运动正名'
	},
	[2467] = {
		['id'] = 2467,
		['filter'] = '学生静坐'
	},
	[2468] = {
		['id'] = 2468,
		['filter'] = '学生妹'
	},
	[2469] = {
		['id'] = 2469,
		['filter'] = '学生信仰'
	},
	[2470] = {
		['id'] = 2470,
		['filter'] = '学生运动'
	},
	[2471] = {
		['id'] = 2471,
		['filter'] = '学习班'
	},
	[2472] = {
		['id'] = 2472,
		['filter'] = '学院+暴动'
	},
	[2473] = {
		['id'] = 2473,
		['filter'] = '学院暴动'
	},
	[2474] = {
		['id'] = 2474,
		['filter'] = '学运'
	},
	[2475] = {
		['id'] = 2475,
		['filter'] = '学自联'
	},
	[2476] = {
		['id'] = 2476,
		['filter'] = '血溅人民天堂'
	},
	[2477] = {
		['id'] = 2477,
		['filter'] = '血卡'
	},
	[2478] = {
		['id'] = 2478,
		['filter'] = '血色京机'
	},
	[2479] = {
		['id'] = 2479,
		['filter'] = '血色京畿'
	},
	[2480] = {
		['id'] = 2480,
		['filter'] = '血色黎明'
	},
	[2481] = {
		['id'] = 2481,
		['filter'] = '血腥图片'
	},
	[2482] = {
		['id'] = 2482,
		['filter'] = '血腥圖片'
	},
	[2483] = {
		['id'] = 2483,
		['filter'] = '寻找林昭的灵魂'
	},
	[2484] = {
		['id'] = 2484,
		['filter'] = '循环轮回论'
	},
	[2485] = {
		['id'] = 2485,
		['filter'] = '鸦片液'
	},
	[2486] = {
		['id'] = 2486,
		['filter'] = '鸦片渣'
	},
	[2487] = {
		['id'] = 2487,
		['filter'] = '雅马哈'
	},
	[2488] = {
		['id'] = 2488,
		['filter'] = '雅思成绩单'
	},
	[2489] = {
		['id'] = 2489,
		['filter'] = '亚热'
	},
	[2490] = {
		['id'] = 2490,
		['filter'] = '亚太正悟网'
	},
	[2491] = {
		['id'] = 2491,
		['filter'] = '亚洲床上色情'
	},
	[2492] = {
		['id'] = 2492,
		['filter'] = '亚洲美女总'
	},
	[2493] = {
		['id'] = 2493,
		['filter'] = '亚洲自由电台'
	},
	[2494] = {
		['id'] = 2494,
		['filter'] = '亚洲自由之声'
	},
	[2495] = {
		['id'] = 2495,
		['filter'] = '严家其'
	},
	[2496] = {
		['id'] = 2496,
		['filter'] = '严家祺'
	},
	[2497] = {
		['id'] = 2497,
		['filter'] = '言禁'
	},
	[2498] = {
		['id'] = 2498,
		['filter'] = '盐雾试验箱'
	},
	[2499] = {
		['id'] = 2499,
		['filter'] = '阎明复'
	},
	[2500] = {
		['id'] = 2500,
		['filter'] = '颜射'
	},
	[2501] = {
		['id'] = 2501,
		['filter'] = '演绎中国失传正统文化'
	},
	[2502] = {
		['id'] = 2502,
		['filter'] = '艳舞'
	},
	[2503] = {
		['id'] = 2503,
		['filter'] = '燕玲论坛'
	},
	[2504] = {
		['id'] = 2504,
		['filter'] = '燕南评论'
	},
	[2505] = {
		['id'] = 2505,
		['filter'] = '央视内部晚会'
	},
	[2506] = {
		['id'] = 2506,
		['filter'] = '阳具'
	},
	[2507] = {
		['id'] = 2507,
		['filter'] = '阳痿'
	},
	[2508] = {
		['id'] = 2508,
		['filter'] = '杨勇芳'
	},
	[2509] = {
		['id'] = 2509,
		['filter'] = '洋妞上门'
	},
	[2510] = {
		['id'] = 2510,
		['filter'] = '楊思敏'
	},
	[2511] = {
		['id'] = 2511,
		['filter'] = '养殖户的求救书'
	},
	[2512] = {
		['id'] = 2512,
		['filter'] = '姚月谦'
	},
	[2513] = {
		['id'] = 2513,
		['filter'] = '搖頭丸'
	},
	[2514] = {
		['id'] = 2514,
		['filter'] = '摇头丸'
	},
	[2515] = {
		['id'] = 2515,
		['filter'] = '摇头玩'
	},
	[2516] = {
		['id'] = 2516,
		['filter'] = '遥想当年春衫薄'
	},
	[2517] = {
		['id'] = 2517,
		['filter'] = '要射了'
	},
	[2518] = {
		['id'] = 2518,
		['filter'] = '耶稣基督血水圣灵全备福音布道团'
	},
	[2519] = {
		['id'] = 2519,
		['filter'] = '野性淫魔'
	},
	[2520] = {
		['id'] = 2520,
		['filter'] = '业力回报'
	},
	[2521] = {
		['id'] = 2521,
		['filter'] = '业力轮'
	},
	[2522] = {
		['id'] = 2522,
		['filter'] = '叶子楣'
	},
	[2523] = {
		['id'] = 2523,
		['filter'] = '夜半加税'
	},
	[2524] = {
		['id'] = 2524,
		['filter'] = '夜话紫禁城'
	},
	[2525] = {
		['id'] = 2525,
		['filter'] = '夜激情'
	},
	[2526] = {
		['id'] = 2526,
		['filter'] = '夜勤病栋'
	},
	[2527] = {
		['id'] = 2527,
		['filter'] = '夜总会'
	},
	[2528] = {
		['id'] = 2528,
		['filter'] = '夜總會'
	},
	[2529] = {
		['id'] = 2529,
		['filter'] = '液压马达'
	},
	[2530] = {
		['id'] = 2530,
		['filter'] = '一个妓女的年度总结报告'
	},
	[2531] = {
		['id'] = 2531,
		['filter'] = '一个人的奥林匹克'
	},
	[2532] = {
		['id'] = 2532,
		['filter'] = '一级黄电视'
	},
	[2533] = {
		['id'] = 2533,
		['filter'] = '一军两策'
	},
	[2534] = {
		['id'] = 2534,
		['filter'] = '一卡多号'
	},
	[2535] = {
		['id'] = 2535,
		['filter'] = '一码中特'
	},
	[2536] = {
		['id'] = 2536,
		['filter'] = '一夜情'
	},
	[2537] = {
		['id'] = 2537,
		['filter'] = '一夜情俱乐部'
	},
	[2538] = {
		['id'] = 2538,
		['filter'] = '一夜情迷奸'
	},
	[2539] = {
		['id'] = 2539,
		['filter'] = '一夜性网'
	},
	[2540] = {
		['id'] = 2540,
		['filter'] = '一中一台'
	},
	[2541] = {
		['id'] = 2541,
		['filter'] = '一字解特码'
	},
	[2542] = {
		['id'] = 2542,
		['filter'] = '伊波拉瘟疫'
	},
	[2543] = {
		['id'] = 2543,
		['filter'] = '伊東'
	},
	[2544] = {
		['id'] = 2544,
		['filter'] = '伊斯兰运动'
	},
	[2545] = {
		['id'] = 2545,
		['filter'] = '伊扎布特'
	},
	[2546] = {
		['id'] = 2546,
		['filter'] = '医师资格证'
	},
	[2547] = {
		['id'] = 2547,
		['filter'] = '宜昌当阳县级市长'
	},
	[2548] = {
		['id'] = 2548,
		['filter'] = '遗忘药'
	},
	[2549] = {
		['id'] = 2549,
		['filter'] = '乙醚'
	},
	[2550] = {
		['id'] = 2550,
		['filter'] = '以身护法'
	},
	[2551] = {
		['id'] = 2551,
		['filter'] = '以血护法'
	},
	[2552] = {
		['id'] = 2552,
		['filter'] = '蚁力神'
	},
	[2553] = {
		['id'] = 2553,
		['filter'] = '倚天屠龙别记'
	},
	[2554] = {
		['id'] = 2554,
		['filter'] = '义解'
	},
	[2555] = {
		['id'] = 2555,
		['filter'] = '亿龙汽车'
	},
	[2556] = {
		['id'] = 2556,
		['filter'] = '异见人士'
	},
	[2557] = {
		['id'] = 2557,
		['filter'] = '异议人士'
	},
	[2558] = {
		['id'] = 2558,
		['filter'] = '抑制剂'
	},
	[2559] = {
		['id'] = 2559,
		['filter'] = '易购手机'
	},
	[2560] = {
		['id'] = 2560,
		['filter'] = '易切削钢'
	},
	[2561] = {
		['id'] = 2561,
		['filter'] = '易丹轩'
	},
	[2562] = {
		['id'] = 2562,
		['filter'] = '易趣在线购物'
	},
	[2563] = {
		['id'] = 2563,
		['filter'] = '易志熹'
	},
	[2564] = {
		['id'] = 2564,
		['filter'] = '阴唇'
	},
	[2565] = {
		['id'] = 2565,
		['filter'] = '阴道'
	},
	[2566] = {
		['id'] = 2566,
		['filter'] = '阴道被捅'
	},
	[2567] = {
		['id'] = 2567,
		['filter'] = '阴道图'
	},
	[2568] = {
		['id'] = 2568,
		['filter'] = '阴蒂'
	},
	[2569] = {
		['id'] = 2569,
		['filter'] = '阴户'
	},
	[2570] = {
		['id'] = 2570,
		['filter'] = '阴茎'
	},
	[2571] = {
		['id'] = 2571,
		['filter'] = '阴茎插小穴'
	},
	[2572] = {
		['id'] = 2572,
		['filter'] = '阴茎插阴道'
	},
	[2573] = {
		['id'] = 2573,
		['filter'] = '阴胫'
	},
	[2574] = {
		['id'] = 2574,
		['filter'] = '阴毛'
	},
	[2575] = {
		['id'] = 2575,
		['filter'] = '阴毛小穴'
	},
	[2576] = {
		['id'] = 2576,
		['filter'] = '阴门'
	},
	[2577] = {
		['id'] = 2577,
		['filter'] = '阴囊'
	},
	[2578] = {
		['id'] = 2578,
		['filter'] = '阴水'
	},
	[2579] = {
		['id'] = 2579,
		['filter'] = '陰蒂'
	},
	[2580] = {
		['id'] = 2580,
		['filter'] = '淫虫'
	},
	[2581] = {
		['id'] = 2581,
		['filter'] = '淫蟲'
	},
	[2582] = {
		['id'] = 2582,
		['filter'] = '淫荡'
	},
	[2583] = {
		['id'] = 2583,
		['filter'] = '淫荡少妇之白洁'
	},
	[2584] = {
		['id'] = 2584,
		['filter'] = '淫蕩'
	},
	[2585] = {
		['id'] = 2585,
		['filter'] = '淫秽电影'
	},
	[2586] = {
		['id'] = 2586,
		['filter'] = '淫奸'
	},
	[2587] = {
		['id'] = 2587,
		['filter'] = '淫奸女电影'
	},
	[2588] = {
		['id'] = 2588,
		['filter'] = '淫间道'
	},
	[2589] = {
		['id'] = 2589,
		['filter'] = '淫浪'
	},
	[2590] = {
		['id'] = 2590,
		['filter'] = '淫乱'
	},
	[2591] = {
		['id'] = 2591,
		['filter'] = '淫乱的女子'
	},
	[2592] = {
		['id'] = 2592,
		['filter'] = '淫乱电影'
	},
	[2593] = {
		['id'] = 2593,
		['filter'] = '淫亂'
	},
	[2594] = {
		['id'] = 2594,
		['filter'] = '淫亂電影'
	},
	[2595] = {
		['id'] = 2595,
		['filter'] = '淫妹'
	},
	[2596] = {
		['id'] = 2596,
		['filter'] = '淫靡'
	},
	[2597] = {
		['id'] = 2597,
		['filter'] = '淫魔'
	},
	[2598] = {
		['id'] = 2598,
		['filter'] = '淫魔舞会'
	},
	[2599] = {
		['id'] = 2599,
		['filter'] = '淫母'
	},
	[2600] = {
		['id'] = 2600,
		['filter'] = '淫女'
	},
	[2601] = {
		['id'] = 2601,
		['filter'] = '淫女老师'
	},
	[2602] = {
		['id'] = 2602,
		['filter'] = '淫情女老师'
	},
	[2603] = {
		['id'] = 2603,
		['filter'] = '淫色少妇'
	},
	[2604] = {
		['id'] = 2604,
		['filter'] = '淫兽学园'
	},
	[2605] = {
		['id'] = 2605,
		['filter'] = '淫兽学院'
	},
	[2606] = {
		['id'] = 2606,
		['filter'] = '淫书'
	},
	[2607] = {
		['id'] = 2607,
		['filter'] = '淫書'
	},
	[2608] = {
		['id'] = 2608,
		['filter'] = '淫术炼金士'
	},
	[2609] = {
		['id'] = 2609,
		['filter'] = '淫水'
	},
	[2610] = {
		['id'] = 2610,
		['filter'] = '淫图'
	},
	[2611] = {
		['id'] = 2611,
		['filter'] = '淫穴'
	},
	[2612] = {
		['id'] = 2612,
		['filter'] = '尹庆民'
	},
	[2613] = {
		['id'] = 2613,
		['filter'] = '隱私1圖片'
	},
	[2614] = {
		['id'] = 2614,
		['filter'] = '隱形鏡'
	},
	[2615] = {
		['id'] = 2615,
		['filter'] = '隱形噴劑'
	},
	[2616] = {
		['id'] = 2616,
		['filter'] = '印尼伊斯兰祈祷团'
	},
	[2617] = {
		['id'] = 2617,
		['filter'] = '英语枪手'
	},
	[2618] = {
		['id'] = 2618,
		['filter'] = '英语四六级答案'
	},
	[2619] = {
		['id'] = 2619,
		['filter'] = '英語槍手'
	},
	[2620] = {
		['id'] = 2620,
		['filter'] = '婴儿汤'
	},
	[2621] = {
		['id'] = 2621,
		['filter'] = '櫻井'
	},
	[2622] = {
		['id'] = 2622,
		['filter'] = '莹莹成人论坛'
	},
	[2623] = {
		['id'] = 2623,
		['filter'] = '营销利剑'
	},
	[2624] = {
		['id'] = 2624,
		['filter'] = '永磁吸盘'
	},
	[2625] = {
		['id'] = 2625,
		['filter'] = '优化官员'
	},
	[2626] = {
		['id'] = 2626,
		['filter'] = '优昙婆罗花'
	},
	[2627] = {
		['id'] = 2627,
		['filter'] = '由喜贵'
	},
	[2628] = {
		['id'] = 2628,
		['filter'] = '油田总部'
	},
	[2629] = {
		['id'] = 2629,
		['filter'] = '游行'
	},
	[2630] = {
		['id'] = 2630,
		['filter'] = '游行示威'
	},
	[2631] = {
		['id'] = 2631,
		['filter'] = '友通科技'
	},
	[2632] = {
		['id'] = 2632,
		['filter'] = '右派'
	},
	[2633] = {
		['id'] = 2633,
		['filter'] = '幼齿'
	},
	[2634] = {
		['id'] = 2634,
		['filter'] = '幼交'
	},
	[2635] = {
		['id'] = 2635,
		['filter'] = '幼女'
	},
	[2636] = {
		['id'] = 2636,
		['filter'] = '诱发恶性'
	},
	[2637] = {
		['id'] = 2637,
		['filter'] = '诱惑'
	},
	[2638] = {
		['id'] = 2638,
		['filter'] = '于大海'
	},
	[2639] = {
		['id'] = 2639,
		['filter'] = '于浩成'
	},
	[2640] = {
		['id'] = 2640,
		['filter'] = '于幼军'
	},
	[2641] = {
		['id'] = 2641,
		['filter'] = '余英时'
	},
	[2642] = {
		['id'] = 2642,
		['filter'] = '於淼林'
	},
	[2643] = {
		['id'] = 2643,
		['filter'] = '於幼軍'
	},
	[2644] = {
		['id'] = 2644,
		['filter'] = '舆论'
	},
	[2645] = {
		['id'] = 2645,
		['filter'] = '舆论反制'
	},
	[2646] = {
		['id'] = 2646,
		['filter'] = '与表妹通奸'
	},
	[2647] = {
		['id'] = 2647,
		['filter'] = '宇明网'
	},
	[2648] = {
		['id'] = 2648,
		['filter'] = '宇宙真理'
	},
	[2649] = {
		['id'] = 2649,
		['filter'] = '宇宙主佛'
	},
	[2650] = {
		['id'] = 2650,
		['filter'] = '宇宙最高法理'
	},
	[2651] = {
		['id'] = 2651,
		['filter'] = '语音广告群发'
	},
	[2652] = {
		['id'] = 2652,
		['filter'] = '玉龟'
	},
	[2653] = {
		['id'] = 2653,
		['filter'] = '玉女淫情'
	},
	[2654] = {
		['id'] = 2654,
		['filter'] = '玉蒲团'
	},
	[2655] = {
		['id'] = 2655,
		['filter'] = '玉蒲團'
	},
	[2656] = {
		['id'] = 2656,
		['filter'] = '玉森集团'
	},
	[2657] = {
		['id'] = 2657,
		['filter'] = '预测领导人'
	},
	[2658] = {
		['id'] = 2658,
		['filter'] = '域名备案'
	},
	[2659] = {
		['id'] = 2659,
		['filter'] = '原子弹'
	},
	[2660] = {
		['id'] = 2660,
		['filter'] = '原子弹的DIY制作'
	},
	[2661] = {
		['id'] = 2661,
		['filter'] = '原子弹的简易制法'
	},
	[2662] = {
		['id'] = 2662,
		['filter'] = '原子弹的理论'
	},
	[2663] = {
		['id'] = 2663,
		['filter'] = '原子弹的制作方法'
	},
	[2664] = {
		['id'] = 2664,
		['filter'] = '原子弹制作方法'
	},
	[2665] = {
		['id'] = 2665,
		['filter'] = '原子弹专家'
	},
	[2666] = {
		['id'] = 2666,
		['filter'] = '圆满'
	},
	[2667] = {
		['id'] = 2667,
		['filter'] = '袁纯清'
	},
	[2668] = {
		['id'] = 2668,
		['filter'] = '袁伟民'
	},
	[2669] = {
		['id'] = 2669,
		['filter'] = '援交'
	},
	[2670] = {
		['id'] = 2670,
		['filter'] = '远程偷拍'
	},
	[2671] = {
		['id'] = 2671,
		['filter'] = '远志明'
	},
	[2672] = {
		['id'] = 2672,
		['filter'] = '遠程偷拍'
	},
	[2673] = {
		['id'] = 2673,
		['filter'] = '约会强暴药'
	},
	[2674] = {
		['id'] = 2674,
		['filter'] = '岳武'
	},
	[2675] = {
		['id'] = 2675,
		['filter'] = '杂种'
	},
	[2676] = {
		['id'] = 2676,
		['filter'] = '在火车上被人强奸'
	},
	[2677] = {
		['id'] = 2677,
		['filter'] = '在家里做原子弹的方法'
	},
	[2678] = {
		['id'] = 2678,
		['filter'] = '在十月'
	},
	[2679] = {
		['id'] = 2679,
		['filter'] = '在线博彩网站'
	},
	[2680] = {
		['id'] = 2680,
		['filter'] = '昝爱宗'
	},
	[2681] = {
		['id'] = 2681,
		['filter'] = '脏独'
	},
	[2682] = {
		['id'] = 2682,
		['filter'] = '遭警察殴打'
	},
	[2683] = {
		['id'] = 2683,
		['filter'] = '诈骗'
	},
	[2684] = {
		['id'] = 2684,
		['filter'] = '炸弹怎么做'
	},
	[2685] = {
		['id'] = 2685,
		['filter'] = '炸弹制作'
	},
	[2686] = {
		['id'] = 2686,
		['filter'] = '炸药'
	},
	[2687] = {
		['id'] = 2687,
		['filter'] = '炸药配方'
	},
	[2688] = {
		['id'] = 2688,
		['filter'] = '炸药制作方法'
	},
	[2689] = {
		['id'] = 2689,
		['filter'] = '找政府评理'
	},
	[2690] = {
		['id'] = 2690,
		['filter'] = '赵海青'
	},
	[2691] = {
		['id'] = 2691,
		['filter'] = '赵南'
	},
	[2692] = {
		['id'] = 2692,
		['filter'] = '赵品潞'
	},
	[2693] = {
		['id'] = 2693,
		['filter'] = '赵铁锤'
	},
	[2694] = {
		['id'] = 2694,
		['filter'] = '赵晓微'
	},
	[2695] = {
		['id'] = 2695,
		['filter'] = '赵紫阳'
	},
	[2696] = {
		['id'] = 2696,
		['filter'] = '赵紫阳晚年谈话出笼'
	},
	[2697] = {
		['id'] = 2697,
		['filter'] = '赵紫阳最后的机会'
	},
	[2698] = {
		['id'] = 2698,
		['filter'] = '趙紫陽'
	},
	[2699] = {
		['id'] = 2699,
		['filter'] = '哲民'
	},
	[2700] = {
		['id'] = 2700,
		['filter'] = '专政'
	},
	[2701] = {
		['id'] = 2701,
		['filter'] = '专政机器'
	},
	[2702] = {
		['id'] = 2702,
		['filter'] = '专制'
	},
	[2703] = {
		['id'] = 2703,
		['filter'] = '專政'
	},
	[2704] = {
		['id'] = 2704,
		['filter'] = '專制'
	},
	[2705] = {
		['id'] = 2705,
		['filter'] = '转{10}法{10}轮'
	},
	[2706] = {
		['id'] = 2706,
		['filter'] = '转法轮'
	},
	[2707] = {
		['id'] = 2707,
		['filter'] = '转让冰毒配方'
	},
	[2708] = {
		['id'] = 2708,
		['filter'] = '轉法輪'
	},
	[2709] = {
		['id'] = 2709,
		['filter'] = '壮阳药'
	},
	[2710] = {
		['id'] = 2710,
		['filter'] = '追踪器'
	},
	[2711] = {
		['id'] = 2711,
		['filter'] = '啄木鸟公司'
	},
	[2712] = {
		['id'] = 2712,
		['filter'] = '啄木鳥公司'
	},
	[2713] = {
		['id'] = 2713,
		['filter'] = '子弹'
	},
	[2714] = {
		['id'] = 2714,
		['filter'] = '子女任职名单'
	},
	[2715] = {
		['id'] = 2715,
		['filter'] = '自殘'
	},
	[2716] = {
		['id'] = 2716,
		['filter'] = '自焚'
	},
	[2717] = {
		['id'] = 2717,
		['filter'] = '自摸'
	},
	[2718] = {
		['id'] = 2718,
		['filter'] = '自拍'
	},
	[2719] = {
		['id'] = 2719,
		['filter'] = '自杀'
	},
	[2720] = {
		['id'] = 2720,
		['filter'] = '自杀手册'
	},
	[2721] = {
		['id'] = 2721,
		['filter'] = '自杀指南'
	},
	[2722] = {
		['id'] = 2722,
		['filter'] = '自殺手冊'
	},
	[2723] = {
		['id'] = 2723,
		['filter'] = '自殺指南'
	},
	[2724] = {
		['id'] = 2724,
		['filter'] = '自慰'
	},
	[2725] = {
		['id'] = 2725,
		['filter'] = '自由门'
	},
	[2726] = {
		['id'] = 2726,
		['filter'] = '自由门6.33'
	},
	[2727] = {
		['id'] = 2727,
		['filter'] = '自由蒙古在线'
	},
	[2728] = {
		['id'] = 2728,
		['filter'] = '自由西藏'
	},
	[2729] = {
		['id'] = 2729,
		['filter'] = '自由西藏学生运动'
	},
	[2730] = {
		['id'] = 2730,
		['filter'] = '自由写作奖'
	},
	[2731] = {
		['id'] = 2731,
		['filter'] = '自制原子弹'
	},
	[2732] = {
		['id'] = 2732,
		['filter'] = '自主择业军官'
	},
	[2733] = {
		['id'] = 2733,
		['filter'] = '宗教压迫'
	},
	[2734] = {
		['id'] = 2734,
		['filter'] = '最高绝密新闻'
	},
	[2735] = {
		['id'] = 2735,
		['filter'] = '最快报码室'
	},
	[2736] = {
		['id'] = 2736,
		['filter'] = '最牛钉子户'
	},
	[2737] = {
		['id'] = 2737,
		['filter'] = '作弊器'
	},
	[2738] = {
		['id'] = 2738,
		['filter'] = '作爱'
	},
	[2739] = {
		['id'] = 2739,
		['filter'] = '坐交'
	},
	[2740] = {
		['id'] = 2740,
		['filter'] = '坐台'
	},
	[2741] = {
		['id'] = 2741,
		['filter'] = '做爱'
	},
	[2742] = {
		['id'] = 2742,
		['filter'] = '做爱挑逗'
	},
	[2743] = {
		['id'] = 2743,
		['filter'] = '做鸡'
	},
	[2744] = {
		['id'] = 2744,
		['filter'] = '做雞'
	},
	[2745] = {
		['id'] = 2745,
		['filter'] = '做鸭'
	},
	[2746] = {
		['id'] = 2746,
		['filter'] = '做原子弹'
	},
	[2747] = {
		['id'] = 2747,
		['filter'] = '习近平'
	},
	[2748] = {
		['id'] = 2748,
		['filter'] = '习仲勋'
	},
	[2749] = {
		['id'] = 2749,
		['filter'] = '贺国强'
	},
	[2750] = {
		['id'] = 2750,
		['filter'] = '贺子珍'
	},
	[2751] = {
		['id'] = 2751,
		['filter'] = '周永康'
	},
	[2752] = {
		['id'] = 2752,
		['filter'] = '李长春'
	},
	[2753] = {
		['id'] = 2753,
		['filter'] = '李德生'
	},
	[2754] = {
		['id'] = 2754,
		['filter'] = '王岐山'
	},
	[2755] = {
		['id'] = 2755,
		['filter'] = '姚依林'
	},
	[2756] = {
		['id'] = 2756,
		['filter'] = '李源潮'
	},
	[2757] = {
		['id'] = 2757,
		['filter'] = '李干成'
	},
	[2758] = {
		['id'] = 2758,
		['filter'] = '戴秉国'
	},
	[2759] = {
		['id'] = 2759,
		['filter'] = '黄镇'
	},
	[2760] = {
		['id'] = 2760,
		['filter'] = '刘延东'
	},
	[2761] = {
		['id'] = 2761,
		['filter'] = '刘瑞龙'
	},
	[2762] = {
		['id'] = 2762,
		['filter'] = '俞正声'
	},
	[2763] = {
		['id'] = 2763,
		['filter'] = '黄敬'
	},
	[2764] = {
		['id'] = 2764,
		['filter'] = '薄熙'
	},
	[2765] = {
		['id'] = 2765,
		['filter'] = '薄一波'
	},
	[2766] = {
		['id'] = 2766,
		['filter'] = '周小川'
	},
	[2767] = {
		['id'] = 2767,
		['filter'] = '周建南'
	},
	[2768] = {
		['id'] = 2768,
		['filter'] = '温云松'
	},
	[2769] = {
		['id'] = 2769,
		['filter'] = '徐明'
	},
	[2770] = {
		['id'] = 2770,
		['filter'] = '江绵康'
	},
	[2771] = {
		['id'] = 2771,
		['filter'] = '李小鹏'
	},
	[2772] = {
		['id'] = 2772,
		['filter'] = '李鹏'
	},
	[2773] = {
		['id'] = 2773,
		['filter'] = '李小琳'
	},
	[2774] = {
		['id'] = 2774,
		['filter'] = '朱云来'
	},
	[2775] = {
		['id'] = 2775,
		['filter'] = '朱容基'
	},
	[2776] = {
		['id'] = 2776,
		['filter'] = '让国人愤怒的第二代身份证'
	},
	[2777] = {
		['id'] = 2777,
		['filter'] = '胡海峰'
	},
	[2778] = {
		['id'] = 2778,
		['filter'] = '六四'
	},
	[2779] = {
		['id'] = 2779,
		['filter'] = '老丁'
	},
	[2780] = {
		['id'] = 2780,
		['filter'] = '莱仕德事件'
	},
	[2781] = {
		['id'] = 2781,
		['filter'] = '地下的先烈们纷纷打来电话询问'
	},
	[2782] = {
		['id'] = 2782,
		['filter'] = '真善忍'
	},
	[2783] = {
		['id'] = 2783,
		['filter'] = '新唐人'
	},
	[2784] = {
		['id'] = 2784,
		['filter'] = '六四事件'
	},
	[2785] = {
		['id'] = 2785,
		['filter'] = '蒙汗药粉'
	},
	[2786] = {
		['id'] = 2786,
		['filter'] = '透视眼镜'
	},
	[2787] = {
		['id'] = 2787,
		['filter'] = '自制手枪'
	},
	[2788] = {
		['id'] = 2788,
		['filter'] = '枪支弹药'
	},
	[2789] = {
		['id'] = 2789,
		['filter'] = '无界浏览器'
	},
	[2790] = {
		['id'] = 2790,
		['filter'] = '共匪共框非'
	},
	[2791] = {
		['id'] = 2791,
		['filter'] = '台独台反文旁虫'
	},
	[2792] = {
		['id'] = 2792,
		['filter'] = '三点水去论工力'
	},
	[2793] = {
		['id'] = 2793,
		['filter'] = '暴力拆迁'
	},
	[2794] = {
		['id'] = 2794,
		['filter'] = '轮暴致死'
	},
	[2795] = {
		['id'] = 2795,
		['filter'] = '暴力镇压'
	},
	[2796] = {
		['id'] = 2796,
		['filter'] = '陈水扁'
	},
	[2797] = {
		['id'] = 2797,
		['filter'] = '全裸'
	},
	[2798] = {
		['id'] = 2798,
		['filter'] = '偷 拍'
	},
	[2799] = {
		['id'] = 2799,
		['filter'] = '中共十七大'
	},
	[2800] = {
		['id'] = 2800,
		['filter'] = 'gm'
	},
	[2801] = {
		['id'] = 2801,
		['filter'] = '系统'
	},
	[2802] = {
		['id'] = 2802,
		['filter'] = '系统管理员'
	},
	[2803] = {
		['id'] = 2803,
		['filter'] = '尖阁列岛'
	},
	[2804] = {
		['id'] = 2804,
		['filter'] = '管理员'
	},
	[2805] = {
		['id'] = 2805,
		['filter'] = '李克强'
	},
	[2806] = {
		['id'] = 2806,
		['filter'] = '刀塔英雄'
	},
	[2807] = {
		['id'] = 2807,
		['filter'] = '葫芦兄弟'
	},
	[2808] = {
		['id'] = 2808,
		['filter'] = '石器时代'
	},
	[2809] = {
		['id'] = 2809,
		['filter'] = '点击输入昵称'
	},
	[2809] = {
		['id'] = 2809,
		['filter'] = '^'
	},
	[2810] = {
		['id'] = 2810,
		['filter'] = '点击输入'
	},
	[2811] = {
		['id'] = 2811,
		['filter'] = '守护者'
	}
}
