dataConfig.configs.giftConfig ={
	[1] = {
		['id'] = 1,
		['name'] = '测试1',
	},
	[2] = {
		['id'] = 2,
		['name'] = '测试2',
	},
	[3] = {
		['id'] = 3,
		['name'] = '测试3',
	},
	[4] = {
		['id'] = 4,
		['name'] = '测试4',
	},
	[5] = {
		['id'] = 5,
		['name'] = '新手礼包',
	},
	[6] = {
		['id'] = 6,
		['name'] = '渠道独家礼包特殊',
	},
	[7] = {
		['id'] = 7,
		['name'] = '渠道独家礼包通用',
	},
	[8] = {
		['id'] = 8,
		['name'] = '节日礼包-端午',
	},
	[9] = {
		['id'] = 9,
		['name'] = '论坛活动礼包1',
	},
	[10] = {
		['id'] = 10,
		['name'] = '论坛活动礼包2',
	},
	[11] = {
		['id'] = 11,
		['name'] = '论坛活动礼包3',
	},
	[12] = {
		['id'] = 12,
		['name'] = '论坛活动礼包4',
	},
	[13] = {
		['id'] = 13,
		['name'] = '调查问卷礼包',
	},
	[14] = {
		['id'] = 14,
		['name'] = '微信礼包',
	},
	[15] = {
		['id'] = 15,
		['name'] = '微博礼包',
	},
	[16] = {
		['id'] = 16,
		['name'] = '安卓首测-新手礼包',
	},
	[17] = {
		['id'] = 17,
		['name'] = '安卓首测-渠道独家礼包',
	},
	[18] = {
		['id'] = 18,
		['name'] = '安卓首测-节日礼包',
	},
	[19] = {
		['id'] = 19,
		['name'] = '【废弃】安卓首测-媒体礼包高级',
	},
	[20] = {
		['id'] = 20,
		['name'] = '【废弃】安卓首测-媒体礼包通用',
	},
	[21] = {
		['id'] = 21,
		['name'] = '安卓首测-一号游戏礼包',
	},
	[22] = {
		['id'] = 22,
		['name'] = '安卓首测-二号游戏礼包',
	},
	[23] = {
		['id'] = 23,
		['name'] = '安卓首测-三号游戏礼包',
	},
	[24] = {
		['id'] = 24,
		['name'] = '安卓首测-四号游戏礼包',
	},
	[25] = {
		['id'] = 25,
		['name'] = '安卓首测-高级-17173至尊礼包',
	},
	[26] = {
		['id'] = 26,
		['name'] = '安卓首测-高级-多玩至尊礼包',
	},
	[27] = {
		['id'] = 27,
		['name'] = '安卓首测-高级-新浪至尊礼包',
	},
	[28] = {
		['id'] = 28,
		['name'] = '安卓首测-高级-腾讯至尊礼包',
	},
	[29] = {
		['id'] = 29,
		['name'] = '安卓首测-高级-口袋巴士至尊礼包',
	},
	[30] = {
		['id'] = 30,
		['name'] = '安卓首测-高级-178至尊礼包',
	},
	[31] = {
		['id'] = 31,
		['name'] = '安卓首测-高级-183至尊礼包',
	},
	[32] = {
		['id'] = 32,
		['name'] = '安卓首测-普通-任玩堂至尊礼包',
	},
	[33] = {
		['id'] = 33,
		['name'] = '安卓首测-普通-766至尊礼包',
	},
	[34] = {
		['id'] = 34,
		['name'] = '安卓首测-普通-媒体通发礼包',
	},
	[35] = {
		['id'] = 35,
		['name'] = '豪华新手礼包',
	},
	[36] = {
		['id'] = 36,
		['name'] = '精选活动大礼包',
	},
	[37] = {
		['id'] = 37,
		['name'] = '独家优享大礼包',
	},
	[38] = {
		['id'] = 38,
		['name'] = '高级特供大礼包',
	}
}
