dataConfig.configs.itemPrimalInfoConfig ={
	[1] = {
		['id'] = 1,
		['name'] = '源生生命',
		['text'] = '生命能量在你眼前跳动，听说它来自翡翠梦境的最深处，用于提升领地神像的能力。',
		['icon'] = 'i1050.jpg',
		['star'] = 3
	},
	[2] = {
		['id'] = 2,
		['name'] = '源生法力',
		['text'] = '这种不稳定的奥术能量来自麦迪文之塔，用于提升领地神像能力。',
		['icon'] = 'i1051.jpg',
		['star'] = 3
	},
	[3] = {
		['id'] = 3,
		['name'] = '源生火焰',
		['text'] = '炎魔之王拉格纳罗斯的身体残片散落在世界各处，用于提升领地神像能力。',
		['icon'] = 'i1052.jpg',
		['star'] = 3
	},
	[4] = {
		['id'] = 4,
		['name'] = '源生虚空',
		['text'] = '来自于扭曲虚空的能量结晶，用于提升领地神像能力。',
		['icon'] = 'i1049.jpg',
		['star'] = 3
	}
}
