dataConfig.configs.nameConfig ={
	[1] = {
		['id'] = 1,
		['name1'] = '奔跑',
		['name2'] = '乖',
		['name3'] = '火枪'
	},
	[2] = {
		['id'] = 2,
		['name1'] = '极速',
		['name2'] = '萌',
		['name3'] = '白牛'
	},
	[3] = {
		['id'] = 3,
		['name1'] = '正义',
		['name2'] = '纯',
		['name3'] = '牧师'
	},
	[4] = {
		['id'] = 4,
		['name1'] = '圣光',
		['name2'] = '之',
		['name3'] = '测蛋器'
	},
	[5] = {
		['id'] = 5,
		['name1'] = '暗影',
		['name2'] = '大',
		['name3'] = '行者'
	},
	[6] = {
		['id'] = 6,
		['name1'] = '烈焰',
		['name2'] = '小',
		['name3'] = '科多兽'
	},
	[7] = {
		['id'] = 7,
		['name1'] = '燃烧',
		['name2'] = '猛',
		['name3'] = '祭司'
	},
	[8] = {
		['id'] = 8,
		['name1'] = '虚空',
		['name2'] = '帅',
		['name3'] = '小鸡'
	},
	[9] = {
		['id'] = 9,
		['name1'] = '法力',
		['name2'] = '酷',
		['name3'] = '龙鹰'
	},
	[10] = {
		['id'] = 10,
		['name1'] = '疾风',
		['name2'] = '疯',
		['name3'] = '狼人'
	},
	[11] = {
		['id'] = 11,
		['name1'] = '机械',
		['name2'] = '疯',
		['name3'] = '弓箭手'
	},
	[12] = {
		['id'] = 12,
		['name1'] = '日暮',
		['name2'] = '拽',
		['name3'] = '海盗'
	},
	[13] = {
		['id'] = 13,
		['name1'] = '铁堡',
		['name2'] = '野',
		['name3'] = '先知'
	},
	[14] = {
		['id'] = 14,
		['name1'] = '暮光',
		['name2'] = '魔',
		['name3'] = '侏儒'
	},
	[15] = {
		['id'] = 15,
		['name1'] = '神圣',
		['name2'] = '霸',
		['name3'] = '地精'
	},
	[16] = {
		['id'] = 16,
		['name1'] = '暴风',
		['name2'] = '壮',
		['name3'] = '鱼人'
	},
	[17] = {
		['id'] = 17,
		['name1'] = '麦田',
		['name2'] = '残阳',
		['name3'] = '守卫者'
	},
	[18] = {
		['id'] = 18,
		['name1'] = '月光',
		['name2'] = '神',
		['name3'] = '酒仙'
	},
	[19] = {
		['id'] = 19,
		['name1'] = '日光',
		['name2'] = '苦',
		['name3'] = '炼金师'
	},
	[20] = {
		['id'] = 20,
		['name1'] = '血色',
		['name2'] = '正',
		['name3'] = '地卜师'
	},
	[21] = {
		['id'] = 21,
		['name1'] = '人型',
		['name2'] = '灵',
		['name3'] = '土狼'
	},
	[22] = {
		['id'] = 22,
		['name1'] = '刀刃',
		['name2'] = '影',
		['name3'] = '工蝎'
	},
	[23] = {
		['id'] = 23,
		['name1'] = '刀阵',
		['name2'] = '萌',
		['name3'] = '小鬼'
	},
	[24] = {
		['id'] = 24,
		['name1'] = '刀塔',
		['name2'] = '红',
		['name3'] = '山狗'
	},
	[25] = {
		['id'] = 25,
		['name1'] = '土灵',
		['name2'] = '暴',
		['name3'] = '山姆'
	},
	[26] = {
		['id'] = 26,
		['name1'] = '工程',
		['name2'] = '圣',
		['name3'] = '山鹫'
	},
	[27] = {
		['id'] = 27,
		['name1'] = '万灵',
		['name2'] = '黄',
		['name3'] = '卫队'
	},
	[28] = {
		['id'] = 28,
		['name1'] = '千刃',
		['name2'] = '绿',
		['name3'] = '女妖'
	},
	[29] = {
		['id'] = 29,
		['name1'] = '千针',
		['name2'] = '白',
		['name3'] = '王冠'
	},
	[30] = {
		['id'] = 30,
		['name1'] = '亡灵',
		['name2'] = '黑',
		['name3'] = '王座'
	},
	[31] = {
		['id'] = 31,
		['name1'] = '亡者',
		['name2'] = '青',
		['name3'] = '元帅'
	},
	[32] = {
		['id'] = 32,
		['name1'] = '亡骨',
		['name2'] = '炫',
		['name3'] = '木爪'
	},
	[33] = {
		['id'] = 33,
		['name1'] = '子弹',
		['name2'] = '蓝',
		['name3'] = '巨人'
	},
	[34] = {
		['id'] = 34,
		['name1'] = '刃叶',
		['name2'] = '金',
		['name3'] = '巨斧'
	},
	[35] = {
		['id'] = 35,
		['name1'] = '刃纹',
		['name2'] = '熊',
		['name3'] = '巨神'
	},
	[36] = {
		['id'] = 36,
		['name1'] = '刃齿',
		['name2'] = '夜',
		['name3'] = '巨铲'
	},
	[37] = {
		['id'] = 37,
		['name1'] = '刃喉',
		['name2'] = '神力',
		['name3'] = '巨猿'
	},
	[38] = {
		['id'] = 38,
		['name1'] = '刃歌',
		['name2'] = '重',
		['name3'] = '巨鲸'
	},
	[39] = {
		['id'] = 39,
		['name1'] = '刃舞',
		['name2'] = '烈',
		['name3'] = '瓦卡'
	},
	[40] = {
		['id'] = 40,
		['name1'] = '刃影',
		['name2'] = '暗',
		['name3'] = '瓦伦'
	},
	[41] = {
		['id'] = 41,
		['name1'] = '刃鳞',
		['name2'] = '秘',
		['name3'] = '瓦克'
	},
	[42] = {
		['id'] = 42,
		['name1'] = '飞矢',
		['name2'] = '高',
		['name3'] = '长者'
	},
	[43] = {
		['id'] = 43,
		['name1'] = '飞羽',
		['name2'] = '高地',
		['name3'] = '分矿'
	},
	[44] = {
		['id'] = 44,
		['name1'] = '天罚',
		['name2'] = '通灵',
		['name3'] = '公主'
	},
	[45] = {
		['id'] = 45,
		['name1'] = '天职',
		['name2'] = '基',
		['name3'] = '月光'
	},
	[46] = {
		['id'] = 46,
		['name1'] = '天痕',
		['name2'] = '雪',
		['name3'] = '月神'
	},
	[47] = {
		['id'] = 47,
		['name1'] = '天赋',
		['name2'] = '晨',
		['name3'] = '风蛇'
	},
	[48] = {
		['id'] = 48,
		['name1'] = '天歌',
		['name2'] = '银翼',
		['name3'] = '风墙'
	},
	[49] = {
		['id'] = 49,
		['name1'] = '天影',
		['name2'] = '银',
		['name3'] = '风鹰'
	},
	[50] = {
		['id'] = 50,
		['name1'] = '元素',
		['name2'] = '敏',
		['name3'] = '火免'
	},
	[51] = {
		['id'] = 51,
		['name1'] = '无甲',
		['name2'] = '锐',
		['name3'] = '火炮'
	},
	[52] = {
		['id'] = 52,
		['name1'] = '无畏',
		['name2'] = '雄鹰',
		['name3'] = '书柜'
	},
	[53] = {
		['id'] = 53,
		['name1'] = '无敌',
		['name2'] = '深',
		['name3'] = '甘特'
	},
	[54] = {
		['id'] = 54,
		['name1'] = '无望',
		['name2'] = '锐',
		['name3'] = '艾瓦'
	},
	[55] = {
		['id'] = 55,
		['name1'] = '无情',
		['name2'] = '智',
		['name3'] = '艾文'
	},
	[56] = {
		['id'] = 56,
		['name1'] = '专业',
		['name2'] = '奥',
		['name3'] = '艾伦'
	},
	[57] = {
		['id'] = 57,
		['name1'] = '专注',
		['name2'] = '斗',
		['name3'] = '艾米'
	},
	[58] = {
		['id'] = 58,
		['name1'] = '云石',
		['name2'] = '的',
		['name3'] = '艾玛'
	},
	[59] = {
		['id'] = 59,
		['name1'] = '云鬃',
		['name2'] = '滴',
		['name3'] = '艾丽'
	},
	[60] = {
		['id'] = 60,
		['name1'] = '木盾',
		['name2'] = '受',
		['name3'] = '古丹'
	},
	[61] = {
		['id'] = 61,
		['name1'] = '木巢',
		['name2'] = '炎',
		['name3'] = '古奇'
	},
	[62] = {
		['id'] = 62,
		['name1'] = '木喉',
		['name2'] = '乖',
		['name3'] = '古树'
	},
	[63] = {
		['id'] = 63,
		['name1'] = '木槌',
		['name2'] = '萌',
		['name3'] = '节杖'
	},
	[64] = {
		['id'] = 64,
		['name1'] = '五雷',
		['name2'] = '萌',
		['name3'] = '术士'
	},
	[65] = {
		['id'] = 65,
		['name1'] = '不死',
		['name2'] = '萌',
		['name3'] = '左爪'
	},
	[66] = {
		['id'] = 66,
		['name1'] = '尤卡',
		['name2'] = '之',
		['name3'] = '右爪'
	},
	[67] = {
		['id'] = 67,
		['name1'] = '尤里',
		['name2'] = '之',
		['name3'] = '石母'
	},
	[68] = {
		['id'] = 68,
		['name1'] = '厄运',
		['name2'] = '之',
		['name3'] = '石鹿'
	},
	[69] = {
		['id'] = 69,
		['name1'] = '巨石',
		['name2'] = '水',
		['name3'] = '石棍'
	},
	[70] = {
		['id'] = 70,
		['name1'] = '巨蹄',
		['name2'] = '的',
		['name3'] = '石堡'
	},
	[71] = {
		['id'] = 71,
		['name1'] = '巨翼',
		['name2'] = '的',
		['name3'] = '石槌'
	},
	[72] = {
		['id'] = 72,
		['name1'] = '巨魔',
		['name2'] = '的',
		['name3'] = '龙人'
	},
	[73] = {
		['id'] = 73,
		['name1'] = '比斯',
		['name2'] = '的',
		['name3'] = '龙王'
	},
	[74] = {
		['id'] = 74,
		['name1'] = '切割',
		['name2'] = '的',
		['name3'] = '龙珠'
	},
	[75] = {
		['id'] = 75,
		['name1'] = '日泉',
		['name2'] = '的',
		['name3'] = '龙崽'
	},
	[76] = {
		['id'] = 76,
		['name1'] = '日蚀',
		['name2'] = '的',
		['name3'] = '龙鹰'
	},
	[77] = {
		['id'] = 77,
		['name1'] = '日怒',
		['name2'] = '的',
		['name3'] = '卢瑟'
	},
	[78] = {
		['id'] = 78,
		['name1'] = '日冕',
		['name2'] = '的',
		['name3'] = '甲胄'
	},
	[79] = {
		['id'] = 79,
		['name1'] = '日影',
		['name2'] = '的',
		['name3'] = '生肉'
	},
	[80] = {
		['id'] = 80,
		['name1'] = '中甲',
		['name2'] = '的',
		['name3'] = '生物'
	},
	[81] = {
		['id'] = 81,
		['name1'] = '水下',
		['name2'] = '的',
		['name3'] = '生鱼'
	},
	[82] = {
		['id'] = 82,
		['name1'] = '水果',
		['name2'] = '的',
		['name3'] = '仪祭'
	},
	[83] = {
		['id'] = 83,
		['name1'] = '水炉',
		['name2'] = '的',
		['name3'] = '斥候'
	},
	[84] = {
		['id'] = 84,
		['name1'] = '水泡',
		['name2'] = '之',
		['name3'] = '外衣'
	},
	[85] = {
		['id'] = 85,
		['name1'] = '水样',
		['name2'] = '之',
		['name3'] = '狼'
	},
	[86] = {
		['id'] = 86,
		['name1'] = '水魂',
		['name2'] = '之',
		['name3'] = '龙'
	},
	[87] = {
		['id'] = 87,
		['name1'] = '水藤',
		['name2'] = '之',
		['name3'] = '兰卡'
	},
	[88] = {
		['id'] = 88,
		['name1'] = '牛头',
		['name2'] = '之',
		['name3'] = '汉斯'
	},
	[89] = {
		['id'] = 89,
		['name1'] = '气泡',
		['name2'] = '之',
		['name3'] = '汉默'
	},
	[90] = {
		['id'] = 90,
		['name1'] = '长牙',
		['name2'] = '之',
		['name3'] = '尼玛'
	},
	[91] = {
		['id'] = 91,
		['name1'] = '长爪',
		['name2'] = '之',
		['name3'] = '尼莎'
	},
	[92] = {
		['id'] = 92,
		['name1'] = '长矛',
		['name2'] = '之',
		['name3'] = '圣徒'
	},
	[93] = {
		['id'] = 93,
		['name1'] = '长耳',
		['name2'] = '之',
		['name3'] = '圣骑'
	},
	[94] = {
		['id'] = 94,
		['name1'] = '长角',
		['name2'] = '滴',
		['name3'] = '幼龙'
	},
	[95] = {
		['id'] = 95,
		['name1'] = '长齿',
		['name2'] = '滴',
		['name3'] = '幼狼'
	},
	[96] = {
		['id'] = 96,
		['name1'] = '长须',
		['name2'] = '滴',
		['name3'] = '吉米'
	},
	[97] = {
		['id'] = 97,
		['name1'] = '长滩',
		['name2'] = '滴',
		['name3'] = '吉娜'
	},
	[98] = {
		['id'] = 98,
		['name1'] = '仇恨',
		['name2'] = '滴',
		['name3'] = '吉恩'
	},
	[99] = {
		['id'] = 99,
		['name1'] = '爪击',
		['name2'] = '滴',
		['name3'] = '地精'
	},
	[100] = {
		['id'] = 100,
		['name1'] = '爪蹄',
		['name2'] = '滴',
		['name3'] = '耳语'
	},
	[101] = {
		['id'] = 101,
		['name1'] = '反击',
		['name2'] = '滴',
		['name3'] = '亚瑟'
	},
	[102] = {
		['id'] = 102,
		['name1'] = '反冲',
		['name2'] = '滴',
		['name3'] = '西蒙'
	},
	[103] = {
		['id'] = 103,
		['name1'] = '反射',
		['name2'] = '滴',
		['name3'] = '灰狼'
	},
	[104] = {
		['id'] = 104,
		['name1'] = '凶星',
		['name2'] = '滴',
		['name3'] = '灰猫'
	},
	[105] = {
		['id'] = 105,
		['name1'] = '凶暴',
		['name2'] = '滴',
		['name3'] = '灰熊'
	},
	[106] = {
		['id'] = 106,
		['name1'] = '古风',
		['name2'] = '滴',
		['name3'] = '迈克'
	},
	[107] = {
		['id'] = 107,
		['name1'] = '叮叮',
		['name2'] = '滴',
		['name3'] = '尖塔'
	},
	[108] = {
		['id'] = 108,
		['name1'] = '土豪',
		['name2'] = '·',
		['name3'] = '劣魔'
	},
	[109] = {
		['id'] = 109,
		['name1'] = '飞火',
		['name2'] = '·',
		['name3'] = '虫子'
	},
	[110] = {
		['id'] = 110,
		['name1'] = '月弓',
		['name2'] = '·',
		['name3'] = '虫母'
	},
	[111] = {
		['id'] = 111,
		['name1'] = '月刃',
		['name2'] = '·',
		['name3'] = '虫群'
	},
	[112] = {
		['id'] = 112,
		['name1'] = '月风',
		['name2'] = '·',
		['name3'] = '曲奇'
	},
	[113] = {
		['id'] = 113,
		['name1'] = '月火',
		['name2'] = '·',
		['name3'] = '年兽'
	},
	[114] = {
		['id'] = 114,
		['name1'] = '月击',
		['name2'] = '·',
		['name3'] = '朱比'
	},
	[115] = {
		['id'] = 115,
		['name1'] = '月布',
		['name2'] = '·',
		['name3'] = '朱莉'
	},
	[116] = {
		['id'] = 116,
		['name1'] = '月矛',
		['name2'] = '·',
		['name3'] = '先知'
	},
	[117] = {
		['id'] = 117,
		['name1'] = '月羽',
		['name2'] = '·',
		['name3'] = '休玛'
	},
	[118] = {
		['id'] = 118,
		['name1'] = '月角',
		['name2'] = '·',
		['name3'] = '伍德'
	},
	[119] = {
		['id'] = 119,
		['name1'] = '月纹',
		['name2'] = nil,
		['name3'] = '血肠'
	},
	[120] = {
		['id'] = 120,
		['name1'] = '月林',
		['name2'] = nil,
		['name3'] = '十字弓'
	},
	[121] = {
		['id'] = 121,
		['name1'] = '月河',
		['name2'] = nil,
		['name3'] = '十字军'
	},
	[122] = {
		['id'] = 122,
		['name1'] = '月树',
		['name2'] = nil,
		['name3'] = '了望塔'
	},
	[123] = {
		['id'] = 123,
		['name1'] = '月语',
		['name2'] = nil,
		['name3'] = '三英雄'
	},
	[124] = {
		['id'] = 124,
		['name1'] = '月怒',
		['name2'] = nil,
		['name3'] = '土元素'
	},
	[125] = {
		['id'] = 125,
		['name1'] = '月痕',
		['name2'] = nil,
		['name3'] = '元帅'
	},
	[126] = {
		['id'] = 126,
		['name1'] = '月棘',
		['name2'] = nil,
		['name3'] = '大法师'
	},
	[127] = {
		['id'] = 127,
		['name1'] = '月焰',
		['name2'] = nil,
		['name3'] = '大酋长'
	},
	[128] = {
		['id'] = 128,
		['name1'] = '月溪',
		['name2'] = nil,
		['name3'] = '炸弹'
	},
	[129] = {
		['id'] = 129,
		['name1'] = '月歌',
		['name2'] = nil,
		['name3'] = '大教堂'
	},
	[130] = {
		['id'] = 130,
		['name1'] = '月影',
		['name2'] = nil,
		['name3'] = '大熔炉'
	},
	[131] = {
		['id'] = 131,
		['name1'] = '月翼',
		['name2'] = nil,
		['name3'] = '大漩涡'
	},
	[132] = {
		['id'] = 132,
		['name1'] = '风刃',
		['name2'] = nil,
		['name3'] = '小动物'
	},
	[133] = {
		['id'] = 133,
		['name1'] = '风矛',
		['name2'] = nil,
		['name3'] = '鱼人'
	},
	[134] = {
		['id'] = 134,
		['name1'] = '风行',
		['name2'] = nil,
		['name3'] = '姜饼'
	},
	[135] = {
		['id'] = 135,
		['name1'] = '风羽',
		['name2'] = nil,
		['name3'] = '圆盾'
	},
	[136] = {
		['id'] = 136,
		['name1'] = '风茅',
		['name2'] = nil,
		['name3'] = '小精灵'
	},
	[137] = {
		['id'] = 137,
		['name1'] = '风语',
		['name2'] = nil,
		['name3'] = '山地狮'
	},
	[138] = {
		['id'] = 138,
		['name1'] = '风怒',
		['name2'] = nil,
		['name3'] = '山鼠草'
	},
	[139] = {
		['id'] = 139,
		['name1'] = '风烈',
		['name2'] = nil,
		['name3'] = '女猎手'
	},
	[140] = {
		['id'] = 140,
		['name1'] = '风巢',
		['name2'] = nil,
		['name3'] = '马戏团'
	},
	[141] = {
		['id'] = 141,
		['name1'] = '风裂',
		['name2'] = nil,
		['name3'] = '王座犬'
	},
	[142] = {
		['id'] = 142,
		['name1'] = '风程',
		['name2'] = nil,
		['name3'] = '天地鬼'
	},
	[143] = {
		['id'] = 143,
		['name1'] = '风路',
		['name2'] = nil,
		['name3'] = '天选者'
	},
	[144] = {
		['id'] = 144,
		['name1'] = '风歌',
		['name2'] = nil,
		['name3'] = '天舞者'
	},
	[145] = {
		['id'] = 145,
		['name1'] = '风暴',
		['name2'] = nil,
		['name3'] = '无疤者'
	},
	[146] = {
		['id'] = 146,
		['name1'] = '丹尼',
		['name2'] = nil,
		['name3'] = '无眠者'
	},
	[147] = {
		['id'] = 147,
		['name1'] = '方盾',
		['name2'] = nil,
		['name3'] = '太阳果'
	},
	[148] = {
		['id'] = 148,
		['name1'] = '火山',
		['name2'] = nil,
		['name3'] = '太阳草'
	},
	[149] = {
		['id'] = 149,
		['name1'] = '火刃',
		['name2'] = nil,
		['name3'] = '巨角鹿'
	},
	[150] = {
		['id'] = 150,
		['name1'] = '火反',
		['name2'] = nil,
		['name3'] = '巨齿鲨'
	},
	[151] = {
		['id'] = 151,
		['name1'] = '火石',
		['name2'] = nil,
		['name3'] = '巨钳蝎'
	},
	[152] = {
		['id'] = 152,
		['name1'] = '火芒',
		['name2'] = nil,
		['name3'] = '巨钳蟹'
	},
	[153] = {
		['id'] = 153,
		['name1'] = '火光',
		['name2'] = nil,
		['name3'] = '瓦丝琪'
	},
	[154] = {
		['id'] = 154,
		['name1'] = '火舌',
		['name2'] = nil,
		['name3'] = '止血草'
	},
	[155] = {
		['id'] = 155,
		['name1'] = '火伤',
		['name2'] = nil,
		['name3'] = '水占师'
	},
	[156] = {
		['id'] = 156,
		['name1'] = '火红',
		['name2'] = nil,
		['name3'] = '牛头人'
	},
	[157] = {
		['id'] = 157,
		['name1'] = '火壳',
		['name2'] = nil,
		['name3'] = '牛皮糖'
	},
	[158] = {
		['id'] = 158,
		['name1'] = '火花',
		['name2'] = nil,
		['name3'] = '毛布卷'
	},
	[159] = {
		['id'] = 159,
		['name1'] = '火枝',
		['name2'] = nil,
		['name3'] = '毛纺包'
	},
	[160] = {
		['id'] = 160,
		['name1'] = '火油',
		['name2'] = nil,
		['name3'] = '毛纺靴'
	},
	[161] = {
		['id'] = 161,
		['name1'] = '火须',
		['name2'] = nil,
		['name3'] = '长尾鬃'
	},
	[162] = {
		['id'] = 162,
		['name1'] = '火冠',
		['name2'] = nil,
		['name3'] = '反对者'
	},
	[163] = {
		['id'] = 163,
		['name1'] = '火结',
		['name2'] = nil,
		['name3'] = '反抗军'
	},
	[164] = {
		['id'] = 164,
		['name1'] = '火拳',
		['name2'] = nil,
		['name3'] = '月牙斧'
	},
	[165] = {
		['id'] = 165,
		['name1'] = '火烟',
		['name2'] = nil,
		['name3'] = '月布包'
	},
	[166] = {
		['id'] = 166,
		['name1'] = '火酒',
		['name2'] = nil,
		['name3'] = '月亮井'
	},
	[167] = {
		['id'] = 167,
		['name1'] = '火浪',
		['name2'] = nil,
		['name3'] = '月神殿'
	},
	[168] = {
		['id'] = 168,
		['name1'] = '火崖',
		['name2'] = nil,
		['name3'] = '风行者'
	},
	[169] = {
		['id'] = 169,
		['name1'] = '火痕',
		['name2'] = nil,
		['name3'] = '风嚎者'
	},
	[170] = {
		['id'] = 170,
		['name1'] = '火弹',
		['name2'] = nil,
		['name3'] = '乌尔丹'
	},
	[171] = {
		['id'] = 171,
		['name1'] = '火焰',
		['name2'] = nil,
		['name3'] = '六魔包'
	},
	[172] = {
		['id'] = 172,
		['name1'] = '火锤',
		['name2'] = nil,
		['name3'] = '文森特'
	},
	[173] = {
		['id'] = 173,
		['name1'] = '火腹',
		['name2'] = nil,
		['name3'] = '火甲虫'
	},
	[174] = {
		['id'] = 174,
		['name1'] = '火鹏',
		['name2'] = nil,
		['name3'] = '火羽山'
	},
	[175] = {
		['id'] = 175,
		['name1'] = '火歌',
		['name2'] = nil,
		['name3'] = '火枪手'
	},
	[176] = {
		['id'] = 176,
		['name1'] = '火踵',
		['name2'] = nil,
		['name3'] = '火焰石'
	},
	[177] = {
		['id'] = 177,
		['name1'] = '火翼',
		['name2'] = nil,
		['name3'] = '巴瑞特'
	},
	[178] = {
		['id'] = 178,
		['name1'] = '火鬃',
		['name2'] = nil,
		['name3'] = '双子星'
	},
	[179] = {
		['id'] = 179,
		['name1'] = '火囊',
		['name2'] = nil,
		['name3'] = '幻术师'
	},
	[180] = {
		['id'] = 180,
		['name1'] = '心碎',
		['name2'] = nil,
		['name3'] = '末日犬'
	},
	[181] = {
		['id'] = 181,
		['name1'] = '双刃',
		['name2'] = nil,
		['name3'] = '击心者'
	},
	[182] = {
		['id'] = 182,
		['name1'] = '双手',
		['name2'] = nil,
		['name3'] = '击碎者'
	},
	[183] = {
		['id'] = 183,
		['name1'] = '双月',
		['name2'] = nil,
		['name3'] = '艾尔文'
	},
	[184] = {
		['id'] = 184,
		['name1'] = '双环',
		['name2'] = nil,
		['name3'] = '艾露恩'
	},
	[185] = {
		['id'] = 185,
		['name1'] = '双塔',
		['name2'] = nil,
		['name3'] = '古龙水'
	},
	[186] = {
		['id'] = 186,
		['name1'] = '双链',
		['name2'] = nil,
		['name3'] = '古代语'
	},
	[187] = {
		['id'] = 187,
		['name1'] = '幻法',
		['name2'] = nil,
		['name3'] = '古尔丹'
	},
	[188] = {
		['id'] = 188,
		['name1'] = '幻像',
		['name2'] = nil,
		['name3'] = '古物箱'
	},
	[189] = {
		['id'] = 189,
		['name1'] = '玉桥',
		['name2'] = nil,
		['name3'] = '古德曼'
	},
	[190] = {
		['id'] = 190,
		['name1'] = '玉髓',
		['name2'] = nil,
		['name3'] = '石元素'
	},
	[191] = {
		['id'] = 191,
		['name1'] = '正义',
		['name2'] = nil,
		['name3'] = '石巨兽'
	},
	[192] = {
		['id'] = 192,
		['name1'] = '正常',
		['name2'] = nil,
		['name3'] = '石行者'
	},
	[193] = {
		['id'] = 193,
		['name1'] = '艾鲁',
		['name2'] = nil,
		['name3'] = '石狮子'
	},
	[194] = {
		['id'] = 194,
		['name1'] = '艾雷',
		['name2'] = nil,
		['name3'] = '石像鬼'
	},
	[195] = {
		['id'] = 195,
		['name1'] = '古博',
		['name2'] = nil,
		['name3'] = '石腭怪'
	},
	[196] = {
		['id'] = 196,
		['name1'] = '古斯',
		['name2'] = nil,
		['name3'] = '石鳞鳗'
	},
	[197] = {
		['id'] = 197,
		['name1'] = '可靠',
		['name2'] = nil,
		['name3'] = '布莱克'
	},
	[198] = {
		['id'] = 198,
		['name1'] = '石刃',
		['name2'] = nil,
		['name3'] = '布莱德'
	},
	[199] = {
		['id'] = 199,
		['name1'] = '石手',
		['name2'] = nil,
		['name3'] = '龙卷风'
	},
	[200] = {
		['id'] = 200,
		['name1'] = '石化',
		['name2'] = nil,
		['name3'] = '龙虾人'
	},
	[201] = {
		['id'] = 201,
		['name1'] = '石火',
		['name2'] = nil,
		['name3'] = '平衡锤'
	},
	[202] = {
		['id'] = 202,
		['name1'] = '石布',
		['name2'] = nil,
		['name3'] = '卡加斯'
	},
	[203] = {
		['id'] = 203,
		['name1'] = '石皮',
		['name2'] = nil,
		['name3'] = '占卜师'
	},
	[204] = {
		['id'] = 204,
		['name1'] = '石衣',
		['name2'] = nil,
		['name3'] = '占星者'
	},
	[205] = {
		['id'] = 205,
		['name1'] = '石角',
		['name2'] = nil,
		['name3'] = '甲壳虫'
	},
	[206] = {
		['id'] = 206,
		['name1'] = '石纹',
		['name2'] = nil,
		['name3'] = '失落者'
	},
	[207] = {
		['id'] = 207,
		['name1'] = '石轮',
		['name2'] = nil,
		['name3'] = '刺客'
	},
	[208] = {
		['id'] = 208,
		['name1'] = '石河',
		['name2'] = nil,
		['name3'] = '冬刃豹'
	},
	[209] = {
		['id'] = 209,
		['name1'] = '石鸦',
		['name2'] = nil,
		['name3'] = '冬青树'
	},
	[210] = {
		['id'] = 210,
		['name1'] = '石眉',
		['name2'] = nil,
		['name3'] = '冬刺草'
	},
	[211] = {
		['id'] = 211,
		['name1'] = '石钳',
		['name2'] = nil,
		['name3'] = '冬鱿鱼'
	},
	[212] = {
		['id'] = 212,
		['name1'] = '石脊',
		['name2'] = nil,
		['name3'] = '闪电波'
	},
	[213] = {
		['id'] = 213,
		['name1'] = '石拳',
		['name2'] = nil,
		['name3'] = '闪电球'
	},
	[214] = {
		['id'] = 214,
		['name1'] = '石锤',
		['name2'] = nil,
		['name3'] = '闪电箭'
	},
	[215] = {
		['id'] = 215,
		['name1'] = '石腭',
		['name2'] = nil,
		['name3'] = '闪光球'
	},
	[216] = {
		['id'] = 216,
		['name1'] = '石蹄',
		['name2'] = nil,
		['name3'] = '闪光雷'
	},
	[217] = {
		['id'] = 217,
		['name1'] = '布克',
		['name2'] = nil,
		['name3'] = '半人马'
	},
	[218] = {
		['id'] = 218,
		['name1'] = '布质',
		['name2'] = nil,
		['name3'] = '穴居龟'
	},
	[219] = {
		['id'] = 219,
		['name1'] = '布朗',
		['name2'] = nil,
		['name3'] = '穴居者'
	},
	[220] = {
		['id'] = 220,
		['name1'] = '布鲁',
		['name2'] = nil,
		['name3'] = '永生者'
	},
	[221] = {
		['id'] = 221,
		['name1'] = '龙牙',
		['name2'] = nil,
		['name3'] = '永夜港'
	},
	[222] = {
		['id'] = 222,
		['name1'] = '龙爪',
		['name2'] = nil,
		['name3'] = '永望镇'
	},
	[223] = {
		['id'] = 223,
		['name1'] = '龙血',
		['name2'] = nil,
		['name3'] = '奴役者'
	},
	[224] = {
		['id'] = 224,
		['name1'] = '龙型',
		['name2'] = nil,
		['name3'] = '奴隶工'
	},
	[225] = {
		['id'] = 225,
		['name1'] = '龙语',
		['name2'] = nil,
		['name3'] = '召血者'
	},
	[226] = {
		['id'] = 226,
		['name1'] = '龙脊',
		['name2'] = nil,
		['name3'] = '发掘者'
	},
	[227] = {
		['id'] = 227,
		['name1'] = '龙颅',
		['name2'] = nil,
		['name3'] = '圣甲虫'
	},
	[228] = {
		['id'] = 228,
		['name1'] = '龙痕',
		['name2'] = nil,
		['name3'] = '圣骑士'
	},
	[229] = {
		['id'] = 229,
		['name1'] = '龙喉',
		['name2'] = nil,
		['name3'] = '矛骑兵'
	},
	[230] = {
		['id'] = 230,
		['name1'] = '龙翼',
		['name2'] = nil,
		['name3'] = '驭风者'
	},
	[231] = {
		['id'] = 231,
		['name1'] = '龙鳞',
		['name2'] = nil,
		['name3'] = '驭龙者'
	},
	[232] = {
		['id'] = 232,
		['name1'] = '平静',
		['name2'] = nil,
		['name3'] = '驭兽者'
	},
	[233] = {
		['id'] = 233,
		['name1'] = '平衡',
		['name2'] = nil,
		['name3'] = '丝绸卷'
	},
	[234] = {
		['id'] = 234,
		['name1'] = '灭龙',
		['name2'] = nil,
		['name3'] = '老瞎眼'
	},
	[235] = {
		['id'] = 235,
		['name1'] = '东月',
		['name2'] = nil,
		['name3'] = '扫荡者'
	},
	[236] = {
		['id'] = 236,
		['name1'] = '东尼',
		['name2'] = nil,
		['name3'] = '地卜师'
	},
	[237] = {
		['id'] = 237,
		['name1'] = '东谷',
		['name2'] = nil,
		['name3'] = '地占师'
	},
	[238] = {
		['id'] = 238,
		['name1'] = '卡瓦',
		['name2'] = nil,
		['name3'] = '地穴兽'
	},
	[239] = {
		['id'] = 239,
		['name1'] = '卡文',
		['name2'] = nil,
		['name3'] = '地狱犬'
	},
	[240] = {
		['id'] = 240,
		['name1'] = '卡尔',
		['name2'] = nil,
		['name3'] = '地狱火'
	},
	[241] = {
		['id'] = 241,
		['name1'] = '北山',
		['name2'] = nil,
		['name3'] = '地狱石'
	},
	[242] = {
		['id'] = 242,
		['name1'] = '北门',
		['name2'] = nil,
		['name3'] = '地狱兽'
	},
	[243] = {
		['id'] = 243,
		['name1'] = '北风',
		['name2'] = nil,
		['name3'] = '地根草'
	},
	[244] = {
		['id'] = 244,
		['name1'] = '北地',
		['name2'] = nil,
		['name3'] = '亚麻包'
	},
	[245] = {
		['id'] = 245,
		['name1'] = '北谷',
		['name2'] = nil,
		['name3'] = '机关枪'
	},
	[246] = {
		['id'] = 246,
		['name1'] = '北点',
		['name2'] = nil,
		['name3'] = '邪兽人'
	},
	[247] = {
		['id'] = 247,
		['name1'] = '北泉',
		['name2'] = nil,
		['name3'] = '尖啸龙'
	},
	[248] = {
		['id'] = 248,
		['name1'] = '北郡',
		['name2'] = nil,
		['name3'] = '尖啸者'
	},
	[249] = {
		['id'] = 249,
		['name1'] = '北海',
		['name2'] = nil,
		['name3'] = '回旋镖'
	},
	[250] = {
		['id'] = 250,
		['name1'] = '北流',
		['name2'] = nil,
		['name3'] = '包子'
	},
	[251] = {
		['id'] = 251,
		['name1'] = '北槌',
		['name2'] = nil,
		['name3'] = '伐木工'
	},
	[252] = {
		['id'] = 252,
		['name1'] = '卢卡',
		['name2'] = nil,
		['name3'] = '伐木机'
	},
	[253] = {
		['id'] = 253,
		['name1'] = '卢尔',
		['name2'] = nil,
		['name3'] = '伊利丹'
	},
	[254] = {
		['id'] = 254,
		['name1'] = '卢安',
		['name2'] = nil,
		['name3'] = '伊瑟拉'
	},
	[255] = {
		['id'] = 255,
		['name1'] = '卢森',
		['name2'] = nil,
		['name3'] = '血法师'
	},
	[256] = {
		['id'] = 256,
		['name1'] = '电击',
		['name2'] = nil,
		['name3'] = '血宝石'
	},
	[257] = {
		['id'] = 257,
		['name1'] = '电环',
		['name2'] = nil,
		['name3'] = '血啸者'
	},
	[258] = {
		['id'] = 258,
		['name1'] = '史诗',
		['name2'] = nil,
		['name3'] = '血领主'
	},
	[259] = {
		['id'] = 259,
		['name1'] = '生命',
		['name2'] = nil,
		['name3'] = '血琥珀'
	},
	[260] = {
		['id'] = 260,
		['name1'] = '白马',
		['name2'] = nil,
		['name3'] = '血榴石'
	},
	[261] = {
		['id'] = 261,
		['name1'] = '白爪',
		['name2'] = nil,
		['name3'] = '血精灵'
	},
	[262] = {
		['id'] = 262,
		['name1'] = '白沙',
		['name2'] = nil,
		['name3'] = '血镰刀'
	},
	[263] = {
		['id'] = 263,
		['name1'] = '白须',
		['name2'] = nil,
		['name3'] = '杀戮者'
	},
	[264] = {
		['id'] = 264,
		['name1'] = '白蹄',
		['name2'] = nil,
		['name3'] = '冰巨魔'
	},
	[265] = {
		['id'] = 265,
		['name1'] = '白鳄',
		['name2'] = nil,
		['name3'] = '冰爪熊'
	},
	[266] = {
		['id'] = 266,
		['name1'] = '处斩',
		['name2'] = nil,
		['name3'] = '冰图腾'
	},
	[267] = {
		['id'] = 267,
		['name1'] = '外交',
		['name2'] = nil,
		['name3'] = '冰盖草'
	},
	[268] = {
		['id'] = 268,
		['name1'] = '外域',
		['name2'] = nil,
		['name3'] = '冰霜箭'
	},
	[269] = {
		['id'] = 269,
		['name1'] = '冬妮',
		['name2'] = nil,
		['name3'] = '冰鳞甲'
	},
	[270] = {
		['id'] = 270,
		['name1'] = '冬泉',
		['name2'] = nil,
		['name3'] = '刘易斯'
	},
	[271] = {
		['id'] = 271,
		['name1'] = '冬娜',
		['name2'] = nil,
		['name3'] = '污染者'
	},
	[272] = {
		['id'] = 272,
		['name1'] = '冬歌',
		['name2'] = nil,
		['name3'] = '忏悔者'
	},
	[273] = {
		['id'] = 273,
		['name1'] = '鸟爪',
		['name2'] = nil,
		['name3'] = '守护者'
	},
	[274] = {
		['id'] = 274,
		['name1'] = '主基',
		['name2'] = nil,
		['name3'] = '守备官'
	},
	[275] = {
		['id'] = 275,
		['name1'] = '闪电',
		['name2'] = nil,
		['name3'] = '守夜人'
	},
	[276] = {
		['id'] = 276,
		['name1'] = '闪光',
		['name2'] = nil,
		['name3'] = '守望者'
	},
	[277] = {
		['id'] = 277,
		['name1'] = '闪星',
		['name2'] = nil,
		['name3'] = '安多尔'
	},
	[278] = {
		['id'] = 278,
		['name1'] = '闪避',
		['name2'] = nil,
		['name3'] = '安度因'
	},
	[279] = {
		['id'] = 279,
		['name1'] = '闪耀',
		['name2'] = nil,
		['name3'] = '寻心者'
	},
	[280] = {
		['id'] = 280,
		['name1'] = '兰德',
		['name2'] = nil,
		['name3'] = '寻石者'
	},
	[281] = {
		['id'] = 281,
		['name1'] = '宁静',
		['name2'] = nil,
		['name3'] = '迅猛龙'
	},
	[282] = {
		['id'] = 282,
		['name1'] = '必杀',
		['name2'] = nil,
		['name3'] = '导电器'
	},
	[283] = {
		['id'] = 283,
		['name1'] = '永久',
		['name2'] = nil,
		['name3'] = '导魔师'
	},
	[284] = {
		['id'] = 284,
		['name1'] = '永夜',
		['name2'] = nil,
		['name3'] = '异种蝎'
	},
	[285] = {
		['id'] = 285,
		['name1'] = '永望',
		['name2'] = nil,
		['name3'] = '异教徒'
	},
	[286] = {
		['id'] = 286,
		['name1'] = '永歌',
		['name2'] = nil,
		['name3'] = '收割者'
	},
	[287] = {
		['id'] = 287,
		['name1'] = '召火',
		['name2'] = nil,
		['name3'] = '防御者'
	},
	[288] = {
		['id'] = 288,
		['name1'] = '圣水',
		['name2'] = nil,
		['name3'] = '好运符'
	},
	[289] = {
		['id'] = 289,
		['name1'] = '圣石',
		['name2'] = nil,
		['name3'] = '好战者'
	},
	[290] = {
		['id'] = 290,
		['name1'] = '圣地',
		['name2'] = nil,
		['name3'] = '演员'
	},
	[291] = {
		['id'] = 291,
		['name1'] = '圣谷',
		['name2'] = nil,
		['name3'] = '观海者'
	},
	[292] = {
		['id'] = 292,
		['name1'] = '圣典',
		['name2'] = nil,
		['name3'] = '观察者'
	},
	[293] = {
		['id'] = 293,
		['name1'] = '圣物',
		['name2'] = nil,
		['name3'] = '红腮鱼'
	},
	[294] = {
		['id'] = 294,
		['name1'] = '圣契',
		['name2'] = nil,
		['name3'] = '驯犬者'
	},
	[295] = {
		['id'] = 295,
		['name1'] = '圣盾',
		['name2'] = nil,
		['name3'] = '巡林者'
	},
	[296] = {
		['id'] = 296,
		['name1'] = '圣装',
		['name2'] = nil,
		['name3'] = '麦芽酒'
	},
	[297] = {
		['id'] = 297,
		['name1'] = '台风',
		['name2'] = nil,
		['name3'] = '吞咽者'
	},
	[298] = {
		['id'] = 298,
		['name1'] = '纠缠',
		['name2'] = nil,
		['name3'] = '远古豹'
	},
	[299] = {
		['id'] = 299,
		['name1'] = '驭龙',
		['name2'] = nil,
		['name3'] = '远行者'
	},
	[300] = {
		['id'] = 300,
		['name1'] = '驭狼',
		['name2'] = nil,
		['name3'] = '演员'
	},
	[301] = {
		['id'] = 301,
		['name1'] = '驭兽',
		['name2'] = nil,
		['name3'] = '攻击者'
	},
	[302] = {
		['id'] = 302,
		['name1'] = '驭熊',
		['name2'] = nil,
		['name3'] = '折骨者'
	},
	[303] = {
		['id'] = 303,
		['name1'] = '幼蹄',
		['name2'] = nil,
		['name3'] = '抢劫者'
	},
	[304] = {
		['id'] = 304,
		['name1'] = '丝质',
		['name2'] = nil,
		['name3'] = '坑道鼠'
	},
	[305] = {
		['id'] = 305,
		['name1'] = '执著',
		['name2'] = nil,
		['name3'] = '护林者'
	},
	[306] = {
		['id'] = 306,
		['name1'] = '扩散',
		['name2'] = nil,
		['name3'] = '扭木茧'
	},
	[307] = {
		['id'] = 307,
		['name1'] = '地鸣',
		['name2'] = nil,
		['name3'] = '劫掠者'
	},
	[308] = {
		['id'] = 308,
		['name1'] = '地震',
		['name2'] = nil,
		['name3'] = '花丛蛇'
	},
	[309] = {
		['id'] = 309,
		['name1'] = '机械',
		['name2'] = nil,
		['name3'] = '克劳德'
	},
	[310] = {
		['id'] = 310,
		['name1'] = '过载',
		['name2'] = nil,
		['name3'] = '克苏恩'
	},
	[311] = {
		['id'] = 311,
		['name1'] = '再生',
		['name2'] = nil,
		['name3'] = '克拉克'
	},
	[312] = {
		['id'] = 312,
		['name1'] = '百合',
		['name2'] = nil,
		['name3'] = '克罗姆'
	},
	[313] = {
		['id'] = 313,
		['name1'] = '灰云',
		['name2'] = nil,
		['name3'] = '歼灭者'
	},
	[314] = {
		['id'] = 314,
		['name1'] = '灰石',
		['name2'] = nil,
		['name3'] = '乱风岗'
	},
	[315] = {
		['id'] = 315,
		['name1'] = '灰发',
		['name2'] = nil,
		['name3'] = '私掠者'
	},
	[316] = {
		['id'] = 316,
		['name1'] = '灰谷',
		['name2'] = nil,
		['name3'] = '狂妄者'
	},
	[317] = {
		['id'] = 317,
		['name1'] = '灰金',
		['name2'] = nil,
		['name3'] = '狂暴者'
	},
	[318] = {
		['id'] = 318,
		['name1'] = '灰须',
		['name2'] = nil,
		['name3'] = '角斗士'
	},
	[319] = {
		['id'] = 319,
		['name1'] = '灰烬',
		['name2'] = nil,
		['name3'] = '角鹰兽'
	},
	[320] = {
		['id'] = 320,
		['name1'] = '灰雾',
		['name2'] = nil,
		['name3'] = '饮血者'
	},
	[321] = {
		['id'] = 321,
		['name1'] = '灰影',
		['name2'] = nil,
		['name3'] = '庇护者'
	},
	[322] = {
		['id'] = 322,
		['name1'] = '灰蹄',
		['name2'] = nil,
		['name3'] = '辛德拉'
	},
	[323] = {
		['id'] = 323,
		['name1'] = '死木',
		['name2'] = nil,
		['name3'] = '灼热弓'
	},
	[324] = {
		['id'] = 324,
		['name1'] = '死爪',
		['name2'] = nil,
		['name3'] = '灼热箭'
	},
	[325] = {
		['id'] = 325,
		['name1'] = '死寒',
		['name2'] = nil,
		['name3'] = '沙行者'
	},
	[326] = {
		['id'] = 326,
		['name1'] = '死雾',
		['name2'] = nil,
		['name3'] = '沙行蟹'
	},
	[327] = {
		['id'] = 327,
		['name1'] = '邪爪',
		['name2'] = nil,
		['name3'] = '沙掠者'
	},
	[328] = {
		['id'] = 328,
		['name1'] = '邪枝',
		['name2'] = nil,
		['name3'] = '沉默者'
	},
	[329] = {
		['id'] = 329,
		['name1'] = '邪咒',
		['name2'] = nil,
		['name3'] = '初号机'
	},
	[330] = {
		['id'] = 330,
		['name1'] = '邪泉',
		['name2'] = nil,
		['name3'] = '灵根草'
	},
	[331] = {
		['id'] = 331,
		['name1'] = '邪眼',
		['name2'] = nil,
		['name3'] = '灵魂石'
	},
	[332] = {
		['id'] = 332,
		['name1'] = '邪蝠',
		['name2'] = nil,
		['name3'] = '陆行鸟'
	},
	[333] = {
		['id'] = 333,
		['name1'] = '邪蹄',
		['name2'] = nil,
		['name3'] = '阿古斯'
	},
	[334] = {
		['id'] = 334,
		['name1'] = '邪鳍',
		['name2'] = nil,
		['name3'] = '阿拉希'
	},
	[335] = {
		['id'] = 335,
		['name1'] = '尘风',
		['name2'] = nil,
		['name3'] = '阿拉索'
	},
	[336] = {
		['id'] = 336,
		['name1'] = '尘火',
		['name2'] = nil,
		['name3'] = '妖术师'
	},
	[337] = {
		['id'] = 337,
		['name1'] = '尘羽',
		['name2'] = nil,
		['name3'] = '纺丝者'
	},
	[338] = {
		['id'] = 338,
		['name1'] = '尘泥',
		['name2'] = nil,
		['name3'] = '玩具石'
	},
	[339] = {
		['id'] = 339,
		['name1'] = '尘链',
		['name2'] = nil,
		['name3'] = '环形山'
	},
	[340] = {
		['id'] = 340,
		['name1'] = '尘魔',
		['name2'] = nil,
		['name3'] = '山羊'
	},
	[341] = {
		['id'] = 341,
		['name1'] = '尖啸',
		['name2'] = nil,
		['name3'] = '青铜龙'
	},
	[342] = {
		['id'] = 342,
		['name1'] = '光辉',
		['name2'] = nil,
		['name3'] = '青绿石'
	},
	[343] = {
		['id'] = 343,
		['name1'] = '光铸',
		['name2'] = nil,
		['name3'] = '招潮者'
	},
	[344] = {
		['id'] = 344,
		['name1'] = '吐息',
		['name2'] = nil,
		['name3'] = '板鳞鱼'
	},
	[345] = {
		['id'] = 345,
		['name1'] = '吸血',
		['name2'] = nil,
		['name3'] = '刺杀者'
	},
	[346] = {
		['id'] = 346,
		['name1'] = '回响',
		['name2'] = nil,
		['name3'] = '雨燕草'
	},
	[347] = {
		['id'] = 347,
		['name1'] = '刚翼',
		['name2'] = nil,
		['name3'] = '奇美拉'
	},
	[348] = {
		['id'] = 348,
		['name1'] = '迁跃',
		['name2'] = nil,
		['name3'] = '斩石者'
	},
	[349] = {
		['id'] = 349,
		['name1'] = '乔汉',
		['name2'] = nil,
		['name3'] = '斩梦者'
	},
	[350] = {
		['id'] = 350,
		['name1'] = '乔尼',
		['name2'] = nil,
		['name3'] = '飞鸟'
	},
	[351] = {
		['id'] = 351,
		['name1'] = '乔贞',
		['name2'] = nil,
		['name3'] = '肯瑞托'
	},
	[352] = {
		['id'] = 352,
		['name1'] = '乔多',
		['name2'] = nil,
		['name3'] = '虎猫'
	},
	[353] = {
		['id'] = 353,
		['name1'] = '乔治',
		['name2'] = nil,
		['name3'] = '血虎'
	},
	[354] = {
		['id'] = 354,
		['name1'] = '传导',
		['name2'] = nil,
		['name3'] = '血神'
	},
	[355] = {
		['id'] = 355,
		['name1'] = '传说',
		['name2'] = nil,
		['name3'] = '血拳'
	},
	[356] = {
		['id'] = 356,
		['name1'] = '休眠',
		['name2'] = nil,
		['name3'] = '血影'
	},
	[357] = {
		['id'] = 357,
		['name1'] = '优良',
		['name2'] = nil,
		['name3'] = '血蹄'
	},
	[358] = {
		['id'] = 358,
		['name1'] = '优越',
		['name2'] = nil,
		['name3'] = '冰龙'
	},
	[359] = {
		['id'] = 359,
		['name1'] = '仲马',
		['name2'] = nil,
		['name3'] = '羊排'
	},
	[360] = {
		['id'] = 360,
		['name1'] = '仲夏',
		['name2'] = nil,
		['name3'] = '灯塔'
	},
	[361] = {
		['id'] = 361,
		['name1'] = '伪装',
		['name2'] = nil,
		['name3'] = '军马'
	},
	[362] = {
		['id'] = 362,
		['name1'] = '自律',
		['name2'] = nil,
		['name3'] = '军旗'
	},
	[363] = {
		['id'] = 363,
		['name1'] = '自然',
		['name2'] = nil,
		['name3'] = '赤狼'
	},
	[364] = {
		['id'] = 364,
		['name1'] = '自毁',
		['name2'] = nil,
		['name3'] = '护卫'
	},
	[365] = {
		['id'] = 365,
		['name1'] = '自爆',
		['name2'] = nil,
		['name3'] = '哦'
	},
	[366] = {
		['id'] = 366,
		['name1'] = '血刃',
		['name2'] = nil,
		['name3'] = '尼'
	},
	[367] = {
		['id'] = 367,
		['name1'] = '血犬',
		['name2'] = nil,
		['name3'] = '哈'
	},
	[368] = {
		['id'] = 368,
		['name1'] = '血牙',
		['name2'] = nil,
		['name3'] = '坦克'
	},
	[369] = {
		['id'] = 369,
		['name1'] = '血爪',
		['name2'] = nil,
		['name3'] = '治疗'
	},
	[370] = {
		['id'] = 370,
		['name1'] = '血矛',
		['name2'] = nil,
		['name3'] = '奶妈'
	},
	[371] = {
		['id'] = 371,
		['name1'] = '血帆',
		['name2'] = nil,
		['name3'] = '王者'
	},
	[372] = {
		['id'] = 372,
		['name1'] = '血色',
		['name2'] = nil,
		['name3'] = '霸者'
	},
	[373] = {
		['id'] = 373,
		['name1'] = '血顶',
		['name2'] = nil,
		['name3'] = '高达'
	},
	[374] = {
		['id'] = 374,
		['name1'] = '血沼',
		['name2'] = nil,
		['name3'] = '红莲'
	},
	[375] = {
		['id'] = 375,
		['name1'] = '血怒',
		['name2'] = nil,
		['name3'] = '战士'
	},
	[376] = {
		['id'] = 376,
		['name1'] = '血喉',
		['name2'] = nil,
		['name3'] = '萨满'
	},
	[377] = {
		['id'] = 377,
		['name1'] = '多彩',
		['name2'] = nil,
		['name3'] = '傻馒'
	},
	[378] = {
		['id'] = 378,
		['name1'] = '冲动',
		['name2'] = nil,
		['name3'] = '猎人'
	},
	[379] = {
		['id'] = 379,
		['name1'] = '冲锋',
		['name2'] = nil,
		['name3'] = '圣骑士'
	},
	[380] = {
		['id'] = 380,
		['name1'] = '冰刃',
		['name2'] = nil,
		['name3'] = '死骑'
	},
	[381] = {
		['id'] = 381,
		['name1'] = '冰风',
		['name2'] = nil,
		['name3'] = '武僧'
	},
	[382] = {
		['id'] = 382,
		['name1'] = '冰火',
		['name2'] = nil,
		['name3'] = '潘达'
	},
	[383] = {
		['id'] = 383,
		['name1'] = '冰冻',
		['name2'] = nil,
		['name3'] = '熊猫'
	},
	[384] = {
		['id'] = 384,
		['name1'] = '冰封',
		['name2'] = nil,
		['name3'] = '牧师'
	},
	[385] = {
		['id'] = 385,
		['name1'] = '冰寒',
		['name2'] = nil,
		['name3'] = '德鲁伊'
	},
	[386] = {
		['id'] = 386,
		['name1'] = '冰蹄',
		['name2'] = nil,
		['name3'] = '哈蒙'
	},
	[387] = {
		['id'] = 387,
		['name1'] = '冰霜',
		['name2'] = nil,
		['name3'] = '战士'
	},
	[388] = {
		['id'] = 388,
		['name1'] = '冰翼',
		['name2'] = nil,
		['name3'] = '萨满'
	},
	[389] = {
		['id'] = 389,
		['name1'] = '迅爪',
		['name2'] = nil,
		['name3'] = '傻馒'
	},
	[390] = {
		['id'] = 390,
		['name1'] = '迅风',
		['name2'] = nil,
		['name3'] = '猎人'
	},
	[391] = {
		['id'] = 391,
		['name1'] = '迅击',
		['name2'] = nil,
		['name3'] = '圣骑士'
	},
	[392] = {
		['id'] = 392,
		['name1'] = '迅影',
		['name2'] = nil,
		['name3'] = '死骑'
	},
	[393] = {
		['id'] = 393,
		['name1'] = '异种',
		['name2'] = nil,
		['name3'] = '武僧'
	},
	[394] = {
		['id'] = 394,
		['name1'] = '扭木',
		['name2'] = nil,
		['name3'] = '潘达'
	},
	[395] = {
		['id'] = 395,
		['name1'] = '苍白',
		['name2'] = nil,
		['name3'] = '熊猫'
	},
	[396] = {
		['id'] = 396,
		['name1'] = '自由',
		['name2'] = nil,
		['name3'] = '牧师'
	},
	[397] = {
		['id'] = 397,
		['name1'] = '里欧',
		['name2'] = nil,
		['name3'] = '哨兵'
	},
	[397] = {
		['id'] = 397,
		['name1'] = '真',
		['name2'] = nil,
		['name3'] = '魔导师'
	}
}
