dataConfig.configs.tipsConfig ={
	[1] = {
		['id'] = 1,
		['text'] = '战斗中玩家只能控制国王魔法的释放，军团的行动是按照一定规则自动进行的。',
		['minLevel'] = 1,
		['maxLevel'] = 10
	},
	[2] = {
		['id'] = 2,
		['text'] = '战前准备可以拖动自己的军团，改变军团所处的位置。',
		['minLevel'] = 1,
		['maxLevel'] = 10
	},
	[3] = {
		['id'] = 3,
		['text'] = '移动力决定了军团一次最远能走几个格子，移动力低未必是缺点。',
		['minLevel'] = 1,
		['maxLevel'] = 10
	},
	[4] = {
		['id'] = 4,
		['text'] = '战斗中的自动功能帮你自动释放王国魔法。',
		['minLevel'] = 1,
		['maxLevel'] = 10
	},
	[5] = {
		['id'] = 5,
		['text'] = '国王魔法要消耗魔法值释放，只有法力之泉是例外。',
		['minLevel'] = 1,
		['maxLevel'] = 10
	},
	[6] = {
		['id'] = 6,
		['text'] = '每个军团由复数个兵构成，军团下方的数字表示当前的兵数。',
		['minLevel'] = 1,
		['maxLevel'] = 10
	},
	[7] = {
		['id'] = 7,
		['text'] = '当兵力数量减少时，整个军团的攻击力也会随之降低。',
		['minLevel'] = 1,
		['maxLevel'] = 10
	},
	[8] = {
		['id'] = 8,
		['text'] = '出售已强化的装备时，强化消耗的金币会100%返还。',
		['minLevel'] = 1,
		['maxLevel'] = 10
	},
	[9] = {
		['id'] = 9,
		['text'] = '一般情况下，近战军团应该站在远程军团的前方承担伤害。',
		['minLevel'] = 1,
		['maxLevel'] = 10
	},
	[10] = {
		['id'] = 10,
		['text'] = '处于冷却当中的魔法无法使用，部分国王魔法没有冷却可以一直使用。',
		['minLevel'] = 1,
		['maxLevel'] = 10
	},
	[11] = {
		['id'] = 11,
		['text'] = '飞行军团移动时可以穿越其他军团，不分敌我。',
		['minLevel'] = 1,
		['maxLevel'] = 10
	},
	[12] = {
		['id'] = 12,
		['text'] = '战斗中的自动和二倍加速功能在国王四级时开启。',
		['minLevel'] = 1,
		['maxLevel'] = 10
	},
	[13] = {
		['id'] = 13,
		['text'] = '当战斗觉得吃力的时候，请到兵营查看是否有装备可更新。',
		['minLevel'] = 1,
		['maxLevel'] = 10
	},
	[14] = {
		['id'] = 14,
		['text'] = '装备强化可以大幅增强实力，每个军团都需要强化。',
		['minLevel'] = 1,
		['maxLevel'] = 10
	},
	[15] = {
		['id'] = 15,
		['text'] = '扫荡可以快速将体力换为经验值。',
		['minLevel'] = 1,
		['maxLevel'] = 10
	},
	[16] = {
		['id'] = 16,
		['text'] = '日常是非常重要的国王经验值来源，务必经常查看及时完成。',
		['minLevel'] = 1,
		['maxLevel'] = 10
	},
	[17] = {
		['id'] = 17,
		['text'] = '点击空白处可以关闭绝大部分界面。',
		['minLevel'] = 1,
		['maxLevel'] = 10
	},
	[18] = {
		['id'] = 18,
		['text'] = '要获得三星评价，必须确保没有军团被消灭。',
		['minLevel'] = 1,
		['maxLevel'] = 10
	},
	[19] = {
		['id'] = 19,
		['text'] = '战场共有3行19个格子，可供己方布阵的范围是左边的9个格子。',
		['minLevel'] = 1,
		['maxLevel'] = 10
	},
	[20] = {
		['id'] = 20,
		['text'] = '兵种可以随意替换，升级、进阶效果自动对上阵兵种生效。',
		['minLevel'] = 1,
		['maxLevel'] = 10
	},
	[21] = {
		['id'] = 21,
		['text'] = '国王的智力影响魔法的效果，随国王等级提升而增长。',
		['minLevel'] = 1,
		['maxLevel'] = 10
	},
	[22] = {
		['id'] = 22,
		['text'] = '兵种可以随意替换，升级、进阶效果自动对上阵兵种生效。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[23] = {
		['id'] = 23,
		['text'] = '当战斗觉得吃力的时候，请到兵营查看是否有装备可更新。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[24] = {
		['id'] = 24,
		['text'] = '装备强化可以大幅增强实力，每个军团都需要强化。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[25] = {
		['id'] = 25,
		['text'] = '日常是非常重要的国王经验值来源，务必经常查看及时完成。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[26] = {
		['id'] = 26,
		['text'] = '战前准备可以拖动自己的军团，改变军团所处的位置。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[27] = {
		['id'] = 27,
		['text'] = '伐木场或金矿的等级越高，同样时间内产出的资源数量越多。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[28] = {
		['id'] = 28,
		['text'] = '点击空白处可以关闭绝大部分界面。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[29] = {
		['id'] = 29,
		['text'] = '法师塔的等级提升后，不仅产出魔法的品质更高而且选择范围更广。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[30] = {
		['id'] = 30,
		['text'] = '副本挑战的难度越高，奖励也越好。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[31] = {
		['id'] = 31,
		['text'] = '战斗前了解敌人的魔法和技能是个特别好的习惯。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[32] = {
		['id'] = 32,
		['text'] = '副本挑战的奖励每天只能获取三次，尽量挑战高奖励的副本吧。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[33] = {
		['id'] = 33,
		['text'] = '战斗中使用三倍加速，将不显示各种特写镜头。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[34] = {
		['id'] = 34,
		['text'] = '有些技能整场战斗只能释放一次，比如血魔的割裂和魅惑魔女的魅惑。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[35] = {
		['id'] = 35,
		['text'] = '有些技能只能对同行的目标释放，比如屠夫的肉钩和地穴领主的穿刺。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[36] = {
		['id'] = 36,
		['text'] = '仓库的存储空间有限，请定时清理。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[37] = {
		['id'] = 37,
		['text'] = '当数量足够时，碎片会自动合成为完整品。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[38] = {
		['id'] = 38,
		['text'] = '及时升级军团等级可以提高你的实力。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[39] = {
		['id'] = 39,
		['text'] = '经常浏览商店换取自己需要的物品，买到就是赚到。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[40] = {
		['id'] = 40,
		['text'] = '合理搭配国王魔法，是克敌制胜的法宝。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[41] = {
		['id'] = 41,
		['text'] = '扫荡需要扫荡券，扫荡券不足时消耗钻石。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[42] = {
		['id'] = 42,
		['text'] = '军团进阶的稀有材料由精英难度冒险关卡掉落。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[43] = {
		['id'] = 43,
		['text'] = '提升建筑等级可以获得更高收益。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[44] = {
		['id'] = 44,
		['text'] = '精英赛定时开放，不要错过喔。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[45] = {
		['id'] = 45,
		['text'] = '特定时段可以领取免费体力，不要错过喔。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[46] = {
		['id'] = 46,
		['text'] = '每46小时可以在召唤阵免费招募一次兵种。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[47] = {
		['id'] = 47,
		['text'] = '带有闪烁技能的单位移动时可以穿过其他单位，不分敌我。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[48] = {
		['id'] = 48,
		['text'] = '每天钻石购买金币和木材各一次完成日常可以获得大量的国王经验。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[49] = {
		['id'] = 49,
		['text'] = '合理搭配国王魔法，是克敌制胜的法宝。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[50] = {
		['id'] = 50,
		['text'] = '伐木场加工原木有几率暴击喔。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[51] = {
		['id'] = 51,
		['text'] = '原木数量不为0的时候不能升级伐木场。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[52] = {
		['id'] = 52,
		['text'] = '其他建筑的等级无法超越城堡的等级。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[53] = {
		['id'] = 53,
		['text'] = '每一章所有关卡都获得三星评价可以领取大宝箱。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[54] = {
		['id'] = 54,
		['text'] = '十连抽价格更优惠。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[55] = {
		['id'] = 55,
		['text'] = '战前准备时点击己方军团即可更换兵种。',
		['minLevel'] = 11,
		['maxLevel'] = 20
	},
	[56] = {
		['id'] = 56,
		['text'] = '高等级的头部装备可以从副本挑战获取。',
		['minLevel'] = 21,
		['maxLevel'] = 30
	},
	[57] = {
		['id'] = 57,
		['text'] = '高等级的靴子可以从竞技商店购买。',
		['minLevel'] = 21,
		['maxLevel'] = 30
	},
	[58] = {
		['id'] = 58,
		['text'] = '装备强化随强化等级提升消耗的金币也会提升，精打细算。',
		['minLevel'] = 21,
		['maxLevel'] = 30
	},
	[59] = {
		['id'] = 59,
		['text'] = '合理搭配军团，选择适合关卡的兵种出战。',
		['minLevel'] = 21,
		['maxLevel'] = 30
	},
	[60] = {
		['id'] = 60,
		['text'] = '没有最强的兵种，只有最强的策略。',
		['minLevel'] = 21,
		['maxLevel'] = 30
	},
	[61] = {
		['id'] = 61,
		['text'] = '批量出售可以快速卖出无用的装备。',
		['minLevel'] = 21,
		['maxLevel'] = 30
	},
	[62] = {
		['id'] = 62,
		['text'] = '屠夫和血魔是一对好基友，合理搭配可以输出大量伤害。',
		['minLevel'] = 21,
		['maxLevel'] = 30
	},
	[63] = {
		['id'] = 63,
		['text'] = '城堡等级越高可同时存在的事件越多。',
		['minLevel'] = 21,
		['maxLevel'] = 30
	},
	[64] = {
		['id'] = 64,
		['text'] = '超级魔法每场战斗只能使用一次，而且只能在极速挑战中使用。',
		['minLevel'] = 21,
		['maxLevel'] = 30
	},
	[65] = {
		['id'] = 65,
		['text'] = '拥有奇袭技能的军团会优先攻击远程军团。',
		['minLevel'] = 21,
		['maxLevel'] = 30
	},
	[66] = {
		['id'] = 66,
		['text'] = '极速挑战中所用总行动数越少奖励越好。',
		['minLevel'] = 21,
		['maxLevel'] = 30
	},
	[67] = {
		['id'] = 67,
		['text'] = '副本挑战获得的代币可以在活动商店中换取强力商品。',
		['minLevel'] = 21,
		['maxLevel'] = 30
	},
	[68] = {
		['id'] = 68,
		['text'] = 'VIP等级越高，关卡每日可重置次数越多。',
		['minLevel'] = 21,
		['maxLevel'] = 30
	},
	[69] = {
		['id'] = 69,
		['text'] = '伤害排行榜只记录每日单次进攻的最高伤害。',
		['minLevel'] = 21,
		['maxLevel'] = 30
	},
	[70] = {
		['id'] = 70,
		['text'] = '副本挑战失败不会消耗次数，战况不妙时可以及时退出。',
		['minLevel'] = 21,
		['maxLevel'] = 30
	},
	[71] = {
		['id'] = 71,
		['text'] = '极速挑战每天刷新的超级魔法都不相同，运气也是实力的一部分。',
		['minLevel'] = 21,
		['maxLevel'] = 30
	},
	[72] = {
		['id'] = 72,
		['text'] = '图鉴可以快速查看所拥有兵种的属性及技能。',
		['minLevel'] = 21,
		['maxLevel'] = 30
	},
	[73] = {
		['id'] = 73,
		['text'] = '大法师可以缓解国王魔法值不足的问题。',
		['minLevel'] = 21,
		['maxLevel'] = 30
	},
	[74] = {
		['id'] = 74,
		['text'] = '合理搭配伤害类型可以最大化输出。',
		['minLevel'] = 21,
		['maxLevel'] = 30
	},
	[75] = {
		['id'] = 75,
		['text'] = '剑圣行动时如果消灭一个军团可以增加一次行动机会。',
		['minLevel'] = 21,
		['maxLevel'] = 30
	},
	[76] = {
		['id'] = 76,
		['text'] = '队伍中人族较多时带上炽天使往往是一个好选择。',
		['minLevel'] = 21,
		['maxLevel'] = 30
	},
	[77] = {
		['id'] = 77,
		['text'] = '队伍中兽族较多时带上牛头人酋长往往是一个好选择。',
		['minLevel'] = 21,
		['maxLevel'] = 30
	},
	[78] = {
		['id'] = 78,
		['text'] = '狼骑兵在攻击后会返回移动前所在位置。',
		['minLevel'] = 21,
		['maxLevel'] = 30
	},
	[79] = {
		['id'] = 79,
		['text'] = '兵种可以随意替换，升级、进阶效果自动对上阵兵种生效。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[80] = {
		['id'] = 80,
		['text'] = '当战斗觉得吃力的时候，请到兵营查看是否有装备可更新。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[81] = {
		['id'] = 81,
		['text'] = '装备强化可以大幅增强实力，每个军团都需要强化。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[82] = {
		['id'] = 82,
		['text'] = '日常是非常重要的国王经验值来源，务必经常查看及时完成。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[83] = {
		['id'] = 83,
		['text'] = '战前准备可以拖动自己的军团，改变军团所处的位置。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[84] = {
		['id'] = 84,
		['text'] = '伐木场或金矿的等级越高，同样时间内产出的资源数量越多。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[85] = {
		['id'] = 85,
		['text'] = '点击空白处可以关闭绝大部分界面。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[86] = {
		['id'] = 86,
		['text'] = '法师塔的等级提升后，不仅产出魔法的品质更高而且选择范围更广。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[87] = {
		['id'] = 87,
		['text'] = '副本挑战的难度越高，奖励也越好。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[88] = {
		['id'] = 88,
		['text'] = '战斗前了解敌人的魔法和技能是个特别好的习惯。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[89] = {
		['id'] = 89,
		['text'] = '副本挑战的奖励每天只能获取三次，尽量挑战高奖励的副本吧。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[90] = {
		['id'] = 90,
		['text'] = '战斗中使用三倍加速，将不显示各种特写镜头。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[91] = {
		['id'] = 91,
		['text'] = '有些技能整场战斗只能释放一次，比如血魔的割裂和魅惑魔女的魅惑。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[92] = {
		['id'] = 92,
		['text'] = '有些技能只能对同行的目标释放，比如屠夫的肉钩和地穴领主的穿刺。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[93] = {
		['id'] = 93,
		['text'] = '仓库的存储空间有限，请定时清理。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[94] = {
		['id'] = 94,
		['text'] = '当数量足够时，碎片会自动合成为完整品。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[95] = {
		['id'] = 95,
		['text'] = '及时升级军团等级可以提高你的实力。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[96] = {
		['id'] = 96,
		['text'] = '经常浏览商店换取自己需要的物品，买到就是赚到。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[97] = {
		['id'] = 97,
		['text'] = '合理搭配国王魔法，是克敌制胜的法宝。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[98] = {
		['id'] = 98,
		['text'] = '扫荡需要扫荡券，扫荡券不足时消耗钻石。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[99] = {
		['id'] = 99,
		['text'] = '军团进阶的稀有材料由精英难度冒险关卡掉落。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[100] = {
		['id'] = 100,
		['text'] = '提升建筑等级可以获得更高收益。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[101] = {
		['id'] = 101,
		['text'] = '精英赛定时开放，不要错过喔。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[102] = {
		['id'] = 102,
		['text'] = '特定时段可以领取免费体力，不要错过喔。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[103] = {
		['id'] = 103,
		['text'] = '每46小时可以在召唤阵免费招募一次兵种。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[104] = {
		['id'] = 104,
		['text'] = '带有闪烁技能的单位移动时可以穿过其他单位，不分敌我。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[105] = {
		['id'] = 105,
		['text'] = '每天钻石购买金币和木材各一次完成日常可以获得大量的国王经验。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[106] = {
		['id'] = 106,
		['text'] = '强化完成度达到100%才能真正提升装备的属性。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[107] = {
		['id'] = 107,
		['text'] = '伐木场加工原木有几率暴击喔。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[108] = {
		['id'] = 108,
		['text'] = '原木数量不为0的时候不能升级伐木场。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[109] = {
		['id'] = 109,
		['text'] = '其他建筑的等级无法超越城堡的等级。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[110] = {
		['id'] = 110,
		['text'] = '每一章所有关卡都获得三星评价可以领取大宝箱。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[111] = {
		['id'] = 111,
		['text'] = '十连抽价格更优惠。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[112] = {
		['id'] = 112,
		['text'] = '战前准备时点击己方军团即可更换兵种。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[113] = {
		['id'] = 113,
		['text'] = '高等级的头部装备可以从副本挑战获取。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[114] = {
		['id'] = 114,
		['text'] = '高等级的靴子可以从竞技商店购买。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[115] = {
		['id'] = 115,
		['text'] = '装备强化随强化等级提升消耗的金币也会提升，精打细算。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[116] = {
		['id'] = 116,
		['text'] = '合理搭配军团，选择适合关卡的兵种出战。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[117] = {
		['id'] = 117,
		['text'] = '没有最强的兵种，只有最强的策略。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[118] = {
		['id'] = 118,
		['text'] = '批量出售可以快速卖出无用的装备。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[119] = {
		['id'] = 119,
		['text'] = '屠夫和血魔是一对好基友，合理搭配可以输出大量伤害。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[120] = {
		['id'] = 120,
		['text'] = '城堡等级越高可同时存在的事件越多。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[121] = {
		['id'] = 121,
		['text'] = '超级魔法每场战斗只能使用一次，而且只能在极速挑战中使用。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[122] = {
		['id'] = 122,
		['text'] = '拥有奇袭技能的军团会优先攻击远程军团。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[123] = {
		['id'] = 123,
		['text'] = '极速挑战中所用总行动数越少奖励越好。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[124] = {
		['id'] = 124,
		['text'] = '副本挑战获得的代币可以在活动商店中换取强力商品。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[125] = {
		['id'] = 125,
		['text'] = 'VIP等级越高，关卡每日可重置次数越多。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[126] = {
		['id'] = 126,
		['text'] = '伤害排行榜只记录每日单次进攻的最高伤害。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[127] = {
		['id'] = 127,
		['text'] = '副本挑战失败不会消耗次数，战况不妙时可以及时退出。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[128] = {
		['id'] = 128,
		['text'] = '极速挑战每天刷新的超级魔法都不相同，运气也是实力的一部分。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[129] = {
		['id'] = 129,
		['text'] = '图鉴可以快速查看所拥有兵种的属性及技能。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[130] = {
		['id'] = 130,
		['text'] = '大法师可以缓解国王魔法值不足的问题。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[131] = {
		['id'] = 131,
		['text'] = '合理搭配伤害类型可以最大化输出。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[132] = {
		['id'] = 132,
		['text'] = '剑圣行动时如果消灭一个军团可以增加一次行动机会。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[133] = {
		['id'] = 133,
		['text'] = '队伍中人族较多时带上炽天使往往是一个好选择。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[134] = {
		['id'] = 134,
		['text'] = '队伍中兽族较多时带上牛头人酋长往往是一个好选择。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	},
	[135] = {
		['id'] = 135,
		['text'] = '狼骑兵在攻击后会返回移动前所在位置。',
		['minLevel'] = 31,
		['maxLevel'] = 60
	}
}
