_G.lovelypetchatcfg={
	--萌宠id牛牛
	-- [1] = {
		-- --萌宠id*1000 + 1休息状态 玩家休息中
		-- [1001] = {
			-- Intervaltime = 300,--100=10s
			-- list = {
				-- [1] = "为什么大家都说我长得像隔壁王叔叔呢…",
				-- [2] = "光天化日，朗朗乾坤，居然就没有个小母牛路过，简直不能忍！",
				-- [3] = "主人，如果有一天我变成色狼，请记得我也曾纯洁过",
				-- [4] = "听说灵光封魔有好多经验，我们去打吧",
				-- [5] = "王叔叔跟我说，世界boss会出卓越武器，等我再长大一点点就能去打了",
				-- [6] = "昨晚我偷看GM洗澡时，听他自言自语说斗破苍穹可以出好装备",
				-- [7] = "经验副本可以出经验！。。。咦，我为什么要这么说？",
				-- [8] = "打宝秘境是什么鬼？好想进去看看啊",
				-- [9] = "等我战力高了，一定要去极限挑战玩玩，向小丽证明我才是最强的牛",
			-- },
		-- },
		-- --萌宠id*1000 + 2战斗状态 玩家战斗中
		-- [1002] = {
			-- Intervaltime = 300,
			-- list = {
				-- [1] = "主人，揍他，狠狠的揍他！",
				-- [2] = "好逊啊，杀怪这么慢，一定是你没搞卓越装备！",
				-- [3] = "主人，主人，其实我再长大点，就能帮你打怪了。",
				-- [4] = "好多怪物啊，要不要吃个多倍经验丹呢",
				-- [5] = "知道嘛，想当初我一只手，错了，是一只蹄子打怪都比你快",
				-- [6] = "GM非要让我告诉你，打造是可以出卓越装备的。",
				-- [7] = "昨晚我偷看GM洗澡时，听他自言自语说斗破苍穹可以出好装备",
				-- [8] = "灵路试练可以出经验！。。。咦，我为什么要这么说？",
				-- [9] = "打宝秘境是什么鬼？好想进去看看啊",
				-- [10] = "等我战力高了，一定要去极限挑战玩玩，向小丽证明我才是最强的牛",
				-- [11] = "灵兽技能好厉害啊",
				-- [12] = "敢不敢放个灵阵玩玩，别告诉我你不会",
				-- [13] = "主人，主人，看到那个头顶duang了好几个小特效的怪物没，杀他可以加属性！",
			-- },
		-- },
		-- --萌宠id*1000 + 3打坐状态 玩家打坐中
		-- [1003] = {
			-- Intervaltime = 300,
			-- list = {
				-- [1] = "祖上曾传下来一句话，结阵打坐效果更好。虽然我也不知道为什么GM让我这么说。",
				-- [2] = "这时候如果有个漂亮的小母牛来一起打坐，那该多好哇~",
				-- [3] = "我好喜欢打坐啊，坐下比较矮，可以看到很多平时看不到的东西~",
				-- [4] = "每次打坐的时候，我都会思考一下人生，就像你需要思考一下怎么提升战斗力一样",
				-- [5] = "本帅牛在这站着，居然没有靓妞儿来搭个讪？",
				-- [6] = "上次我跟小丽约会的时候，我吃了10碗饭，还是她刷的卡，然后就没有然后了",
				-- [7] = "昨晚我偷看GM洗澡时，听他自言自语说斗破苍穹可以出好装备",
				-- [8] = "灵路试练可以出经验！。。。咦，我为什么要这么说？",
				-- [9] = "打宝秘境是什么鬼？好想进去看看啊",
			-- },
		-- },
	-- },
	--萌宠-钢铁侠
		[1] = {
		--萌宠id*1000 + 1休息状态 玩家休息中
		[1001] = {
			Intervaltime = 300,--100=10s
			list = {
				[1] = "是令人恐惧，还是令人尊敬...",
				[2] = "做事必须有超前意识，比如说，抢boss之前先强化下装备。",
				[3] = "你就没有睡不着觉的时候？不如我们来聊聊打造装备的事吧。",
				[4] = "听说灵光封魔可以让你获得更多的经验。",
				[5] = "啊~世界boss，那可是好玩的地方。",
				[6] = "想要保护好你所不能失去的东西，那就努力变强吧。",
				[7] = "极限挑战才是我这种强者应该去的地方",
				[8] = "打宝秘境来了一只新怪物，或许会有好装备掉落。",
				[9] = "你又在无所事事了么，看看你的任务栏吧，还不快去！",
				[10] = "耶！我能飞了。如果你有高阶翅膀，说不定你也可以",
			},
		},
		--萌宠id*1000 + 2战斗状态 玩家战斗中
		[1002] = {
			Intervaltime = 300,
			list = {
				[1] = "想要不被欺负，棍子得比别人粗。",
				[2] = "我更喜欢那种一击致命的武器",
				[3] = "我的头撞击完全可以称霸摔跤比赛。",
				[4] = "我已经忍不住想要吃点多倍经验丹了，对，就是那玩意。",
				[5] = "知道吗，我只要抬抬手，杀怪速度就比你高一万倍",
				[6] = "想要保护好你不想失去的东西，那就努力变强吧。",
				[7] = "是令人恐惧，还是令人尊敬，想二者兼顾，那就得比别人强。",
				[8] = "我很享受战斗的过程，虽然我也不知道结局是什么",
				[9] = "听说有个人去寻宝，结果被自己挖到的世界boss打死了，真可怜。",
				[10] = "只有3卓越装备才能媲美我坚固的盔甲！",
			},
		},
		--萌宠id*1000 + 3打坐状态 玩家打坐中
		[1003] = {
			Intervaltime = 300,
			list = {
				[1] = "穿上钢铁盔甲只是让你以全新的身份去思考解决问题的办法。",
				[2] = "我曾身陷钢铁盔甲，如今已因它而得到自由。",
				[3] = "打坐？很有意思的事情。",
				[4] = "每次打坐的时候，我都会思考一下怎么改造铠甲",
				[5] = "想要保护好你所不能失去的东西，那就努力变强吧。",
				[6] = "是令人恐惧，还是令人尊敬，想二者兼顾，那就得比别人强。",
				[7] = "斗破苍穹？我新改造的盔甲可以冲出大气球算不算？",
				[8] = "经验副本里的经验简直。。噢，请允许我说脏话。。简直太TM多了。",
				[9] = "奇遇？或许可以让我变成仙人？然后我就可以不穿那该死的盔甲了？",
			},
		},
	},
};