_G.t_fashiongroup={
	[1]={
		['id'] = 1,
		['name'] = "制服套装",
		['Attr'] = "att,150#def,100#hp,600",
		['lvl'] = 1,
	},
	[2]={
		['id'] = 2,
		['name'] = "战神套装",
		['Attr'] = "att,500#def,300#hp,2000",
		['lvl'] = 3,
	},
	[3]={
		['id'] = 3,
		['name'] = "摇滚套装",
		['Attr'] = "att,600#def,400#hp,2400",
		['lvl'] = 4,
	},
	[4]={
		['id'] = 4,
		['name'] = "街头套装",
		['Attr'] = "att,750#def,500#hp,3000",
		['lvl'] = 5,
	},
	[5]={
		['id'] = 5,
		['name'] = "圣诞套装",
		['Attr'] = "att,750#def,500#hp,3000",
		['lvl'] = 5,
	},
	[6]={
		['id'] = 6,
		['name'] = "普通礼服",
		['Attr'] = "att,150#def,100#hp,600",
		['lvl'] = 5,
	},
	[7]={
		['id'] = 7,
		['name'] = "奢华礼服",
		['Attr'] = "att,500#def,300#hp,2000",
		['lvl'] = 5,
	},
};