_G.t_gemlock={
	[1]={
		['id'] = 1,
		['lvl'] = 50,
		['atb'] = "att,80#def,40#hp,320",
		['name'] = "宝石连锁-白鹭晶魄",
	},
	[2]={
		['id'] = 2,
		['lvl'] = 120,
		['atb'] = "att,280#def,140#hp,1160",
		['name'] = "宝石连锁-绿鸠晶魄",
	},
	[3]={
		['id'] = 3,
		['lvl'] = 160,
		['atb'] = "att,700#def,350#hp,2820",
		['name'] = "宝石连锁-蓝鹇晶魄",
	},
	[4]={
		['id'] = 4,
		['lvl'] = 210,
		['atb'] = "att,1320#def,660#hp,5310",
		['name'] = "宝石连锁-紫貂晶魄",
	},
	[5]={
		['id'] = 5,
		['lvl'] = 270,
		['atb'] = "att,2160#def,1080#hp,8680",
		['name'] = "宝石连锁-橙熊晶魄",
	},
	[6]={
		['id'] = 6,
		['lvl'] = 330,
		['atb'] = "att,3240#def,1620#hp,12960",
		['name'] = "宝石连锁-赤猿晶魄",
	},
};