_G.t_jjcEvent={
	[1]={
		['id'] = 1,
		['chal'] = 0,
		['win'] = 0,
		['rank_change'] = 0,
		['desc'] = "您对{1}发起了挑战，您战败了！排名不变！",
	},
	[2]={
		['id'] = 2,
		['chal'] = 0,
		['win'] = 1,
		['rank_change'] = 0,
		['desc'] = "您对{1}发起了挑战，您获胜了！排名不变！",
	},
	[3]={
		['id'] = 3,
		['chal'] = 0,
		['win'] = 1,
		['rank_change'] = 1,
		['desc'] = "您对{1}发起了挑战，您获胜了！排名升至{2}！",
	},
	[4]={
		['id'] = 4,
		['chal'] = 1,
		['win'] = 0,
		['rank_change'] = 0,
		['desc'] = "{1}对你发起了挑战，您战败了！排名不变！",
	},
	[5]={
		['id'] = 5,
		['chal'] = 1,
		['win'] = 0,
		['rank_change'] = 2,
		['desc'] = "{1}对你发起了挑战，您战败了！排名降至{2}！",
	},
	[6]={
		['id'] = 6,
		['chal'] = 1,
		['win'] = 1,
		['rank_change'] = 0,
		['desc'] = "{1}对你发起了挑战，您获胜了！排名不变！",
	},
};