
StrConfig:Add(
{
	-------------打坐面板------
	['sit001'] = "无阵法",
	['sit002'] = "两仪阵",
	['sit003'] = "三才阵",
	['sit004'] = "四象阵",
	['sit005'] = "%s：<font color='#00FF00'>加成%s%%</font>",
	['sit006'] = "主城打坐区：<font color='#00FF00'>加成%s%%</font>",

	-------------附近打坐列表面板------
	['sit101'] = '选择玩家结阵打坐',
	['sit102'] = '加入阵法',
	['sit103'] = '人数',
	['sit104'] = '当前阵法',
	['sit105'] = '结阵打坐可获得更多经验及灵力',

	-------------提示信息------------
	['sit201'] = ' 正在战斗中，无法打坐',
	['sit202'] = ' 当前地图无法打坐',
	['sit203'] = ' 当前已在主城打坐区',
	['sit204'] = ' 当前地图无法寻路',
	['sit205'] = ' 当前状态无法打坐',


}
);