
ChuanSongYuanCfg =
{
	item_id = 0,
	mapTitle = {"城市区域", "特殊区域"},
	mapdata = {
		{
			{1, 0, 1, 0, "新 手 村", "1级", 1, "mapto",},
			{2, 0, 50, 0, "比 奇 城", "50级", 1, "mapto",},
			{3, 0, 100, 0, "土    城", "100级", 1, "mapto",},
			{4, 0, 250, 0, "王    城", "250级", 1, "mapto",},
		},
		{
			{108, 0, 500, 0, "第二大陆", "500级", 1, "mapto",},
			{109, 0, 800, 0, "第三大陆", "800级", 1, "mapto",},
			{110, 0, 1100, 0, "第四大陆", "1100级", 1, "mapto",},
			{114, 0, 1500, 0, "第五大陆", "1500级", 1, "mapto",},
			{2, 80, 140, 0, "每日副本", "140级", 1, "mapto",},
			--{2, 115, 300, 0, "多人副本", "300级", 1, "mapto",},
			{0, 0, 200, 0, "切割任务", "200级", 2, "QieGeView#QieGe",},
			{0, 0, 240, 0, "战鼓任务", "240级", 2, "Prestige",},
			--{2, 85, 300, 0, "福利地图", "300级", 1, "mapto",},
			--{0, 0, 300, 0, "会员地图", "300级", 2, "ZsVip#VipChild",},
		},
	},
}
