
JiQingJiaoXiaoCfg =
{
    needlevel = 70,
    insidelevel = 76,
    sceneId = 133,
    consume =
    {
        {eMoneyType = 0, cost = 500000,},
        {eMoneyType = 2, cost = 100,},
    },
    JXdesc = "叫嚣条件: {color;ff00ff00;%d级以上}\n叫嚣消耗: {color;FFff0000;%d}绑金或{color;FFff0000;%d}元宝",
    Option =
    {
        {id = 1, btnName = "邀请全服前来激战(费用50W绑金)",},
        {id = 2, btnName = "邀请全服前来激战(费用100元宝)",},
    },
    sureBtn = "{btn;0;确定;%s;}",
    tipString =
    {
        "玩家{color;FF00FF00;%s}在黑龙神殿疯狂叫嚣:来！来！来！走过路过不能错过,我倒要看看谁能把我打得过.",
        "玩家{color;FF00FF00;%s}在黑龙神殿疯狂叫嚣:哥天生就高调,哥高调,哥最闪耀,不服就来把哥放倒.",
        "玩家{color;FF00FF00;%s}在黑龙神殿疯狂叫嚣:装B一会儿,是作死.一直装B,是本事.有无本事,练练便知.",
        "玩家{color;FF00FF00;%s}在黑龙神殿疯狂叫嚣:你来或不来,我就在这里.你今不行,明不行,什么时能行.",
        "玩家{color;FF00FF00;%s}在黑龙神殿疯狂叫嚣:我一个人的寂寞,你们所有人的错,是你们让我高手寂寞.",
        "玩家{color;FF00FF00;%s}在黑龙神殿疯狂叫嚣:战过却从来没败仗,想必这独孤求败的称号最适合我不过了.",
        "玩家{color;FF00FF00;%s}在黑龙神殿疯狂叫嚣:神挡杀神,佛挡斩佛,放眼天下,可还有人敢与我一战.",
        "玩家{color;FF00FF00;%s}在黑龙神殿疯狂叫嚣:问,谁主沉浮?且看我独领风骚.若有不服,统统全部都放倒.",
        "玩家{color;FF00FF00;%s}在黑龙神殿疯狂叫嚣:挑战我的人,全部跪了.我看不上眼的人,全都废了.",
        "玩家{color;FF00FF00;%s}在黑龙神殿疯狂叫嚣:看不惯我的人有很多,却没有一个人干得掉我.",
    },
}