Fuben.KinTrainMgr = Fuben.KinTrainMgr or {}
local tbMgr = Fuben.KinTrainMgr
tbMgr.OPEN_DEFEND_TF  = "OpenLevel99"
tbMgr.OPEN_MEMBER_NUM = 2--最小开启人数
tbMgr.PREPARE_TIME    = 60*5--准备时间
tbMgr.MAPTEMPLATEID   = 1048--地图ID
tbMgr.MAP_TID_DEFEND  = 7500--守卫襄阳地图ID
tbMgr.ENTRY_POS       = {4338, 3691}
tbMgr.ENTRY_POS_DEFEND= {20831, 8172}
tbMgr.TOTAL_TIME      = 40*60 --总时间（包括准备时间）
tbMgr.AUCTION_LEVEL   = 30
tbMgr.ACTIVITY_NAME   = "家族试炼"
tbMgr.ONE_PLAYER_VALUE= 100000
tbMgr.ONE_PLAYER_VALUE_DEFEND = 120000
tbMgr.tbItemAuctionValue = {
    [2164] = 450000 / 3,
    [2165] = 1350000 / 3,
    [7067] = 4050000,
    [4312] = 100000 / 3,
    [4313] = 200000 / 3,
    [4314] = 400000 / 3,
    [4315] = 800000 / 3,
    [3593] = 1000000 / 3,
}
tbMgr.tbAuctionItem = {
--    [39]  = {[2164] = 1},
--    [49]  = {[2164] = 1},
--    [59]  = {[2164] = 1},
--    [69]  = {[4312] = 0.525, [2164] = 0.275, [2165] = 0.1},
--    [79]  = {[4312] = 0.175, [4313] = 0.35,  [2164] = 0.275, [2165] = 0.1,  [3593] = 0.1},
--    [89]  = {[4312] = 0.175, [4313] = 0.35,  [2164] = 0.225, [2165] = 0.15, [3593] = 0.1},
--    [99]  = {[4313] = 0.175, [4314] = 0.35,  [2164] = 0.175, [2165] = 0.2,  [3593] = 0.1},
--    [109] = {[4313] = 0.175, [4314] = 0.35,  [2164] = 0.125, [2165] = 0.25, [3593] = 0.1},
--    [119] = {[4314] = 0.175, [4315] = 0.35,  [2164] = 0.075, [2165] = 0.3,  [3593] = 0.1},
    {"OpenLevel39", {[2164] = 1}},
    {"OpenLevel59", {[2164] = 0.75,[4312] = 0.25}},
    {"OpenLevel69", {[4312] = 0.525, [2164] = 0.275, [2165] = 0.1}},
    {"OpenLevel79", {[4312] = 0.525, [2164] = 0.275, [2165] = 0.1,  [3593] = 0.1}},
    {"OpenDay99",   {[4312] = 0.175, [4313] = 0.35,  [2164] = 0.275, [2165] = 0.1,  [3593] = 0.1}},

    {"OpenLevel89", {[4312] = 0.175, [4313] = 0.35,  [2164] = 0.225, [2165] = 0.15, [3593] = 0.1}},
    {"OpenLevel99", {[4312] = 0.15,  [4313] = 0.375,  [2164] = 0.175, [2165] = 0.2,  [3593] = 0.1}},
    {"OpenDay224",  {[4313] = 0.175, [4314] = 0.35,  [2164] = 0.175, [2165] = 0.2,  [3593] = 0.1}},

    {"OpenLevel109", {[4313] = 0.175, [4314] = 0.35,  [2164] = 0.125, [2165] = 0.25, [3593] = 0.1}},
    {"OpenLevel119", {[4313] = 0.15,  [4314] = 0.375,  [2164] = 0.075, [2165] = 0.3,  [3593] = 0.1}},
    {"OpenDay399",   {[4314] = 0.175, [4315] = 0.35,  [2164] = 0.075, [2165] = 0.3,  [3593] = 0.1}},
    {"OpenLevel129", {[4314] = 0.15,  [4315] = 0.25,  [7067] = 0.5, [3593] = 0.1}},
    {"OpenLevel139", {[4314] = 0.1,  [4315] = 0.2,  [7067] = 0.5, [3593] = 0.05, [2804] = 0.15}},
    {"OpenLevel159", {[4314] = 0.05,  [4315] = 0.1, [10981] = 0.15, [7067] = 0.5, [3593] = 0.05, [2804] = 0.15}},
}

tbMgr.FubenDef = {
    CAR_TEMPLATE        = 1201, --物资车
    tbMaterialInfo      = {100, 100, 100, 100, 100}, --收集物完美数量
    tbBossTemplateId    = {{16, 1194}, {6, 1193}, {1, 1192}, {0, 1191}},
    tbMaterialCarPos    = {11056, 10680},
    tbBossPos           = {11449, 11852},
    tbMaterialNpc = { --物资npc配置信息
        [1196] = {nType = 1, nDropNum = 1, nCreateNum = 200},--TemplateId, 添加的物资类型数量, 一共产生多少个
        [1197] = {nType = 2, nDropNum = 1, nCreateNum = 200},
        [1198] = {nType = 3, nDropNum = 1, nCreateNum = 200},
        [1199] = {nType = 4, nDropNum = 1, nCreateNum = 200},
        [1200] = {nType = 5, nDropNum = 1, nCreateNum = 200},
    },
    tbDropAward = { --npc掉落，给地图里所有家族成员掉落该数量,第二个参数为掉落概率，概率最大为 100,第三个参数是附加的基准经验
        [1190] = {{"Item", 1463, 1}, 30, 1.2},--金军斥候
        [1254] = {{"Item", 1463, 1}, 50, 1.2},--机关战车
        [1255] = {{"Item", 1463, 1}, 100, 1.2},--金军校尉
        [1256] = {{"Item", 1463, 1}, 100, 1.2},--金军头目
        [1257] = {{"Item", 1463, 1}, 100, 1.2},--蒙面杀手
        [1259] = {{"Item", 1463, 1}, 100, 1.2},--金军斥候·精英
        [1260] = {{"Item", 1463, 3}, 100, 1.2},--火炮

        [1191] = {{"Item", 1463, 40}, 100, 1.2},--BOSS1
        [1192] = {{"Item", 1463, 20}, 100, 1.2},--BOSS2
        [1193] = {{"Item", 1463, 10}, 100, 1.2},--BOSS3
        [1194] = {{"Item", 1463, 5}, 100, 1.2},--BOSS4

        --新家族试炼
        [2783] = {{"Item", 1463, 50}, 100, 1.2},--BOSS1
        [2784] = {{"Item", 1463, 25}, 100, 1.2},--BOSS2
        [2785] = {{"Item", 1463, 15}, 100, 1.2},--BOSS3
        [2786] = {{"Item", 1463, 10}, 100, 1.2},--BOSS4

        [1290] = {{"Item", 1463, 1}, 30, 1.2},--金军斥候---2档强度
        [1291] = {{"Item", 1463, 1}, 50, 1.2},--机关战车---2档强度
        [1292] = {{"Item", 1463, 1}, 100, 1.2},--金军校尉---2档强度
        [1293] = {{"Item", 1463, 1}, 100, 1.2},--金军头目---2档强度
        [1294] = {{"Item", 1463, 1}, 100, 1.2},--蒙面杀手---2档强度
        [1295] = {{"Item", 1463, 1}, 100, 1.2},--金军斥候·精英---2档强度
        [1296] = {{"Item", 1463, 3}, 100, 1.2},--火炮---2档强度

        [1297] = {{"Item", 1463, 1}, 30, 1.2},--金军斥候---3档强度
        [1298] = {{"Item", 1463, 1}, 50, 1.2},--机关战车---3档强度
        [1299] = {{"Item", 1463, 1}, 100, 1.2},--金军校尉---3档强度
        [1300] = {{"Item", 1463, 1}, 100, 1.2},--金军头目---3档强度
        [1301] = {{"Item", 1463, 1}, 100, 1.2},--蒙面杀手---3档强度
        [1302] = {{"Item", 1463, 1}, 100, 1.2},--金军斥候·精英---3档强度
        [1303] = {{"Item", 1463, 3}, 100, 1.2},--火炮---3档强度


        [2753] = {{"Item", 1463, 10}, 100, 1.2},--完颜大雄
        [2754] = {{"Item", 1463, 10}, 100, 1.2},--完颜二雄
        [2755] = {{"Item", 1463, 10}, 100, 1.2},--完颜三雄
        [2756] = {{"Item", 1463, 10}, 100, 1.2},--完颜大雄--弱
        [2757] = {{"Item", 1463, 10}, 100, 1.2},--完颜二雄--弱
        [2758] = {{"Item", 1463, 10}, 100, 1.2},--完颜三雄--弱
        [2759] = {{"Item", 1463, 10}, 100, 1.2},--完颜大雄--弱弱
        [2760] = {{"Item", 1463, 10}, 100, 1.2},--完颜二雄--弱弱
        [2761] = {{"Item", 1463, 10}, 100, 1.2},--完颜三雄--弱弱
    },
    tbBoxAward = { --开启宝箱的奖励掉落，每一层不一样
        [1] = {{"Item", 1463, 1}, 30, 1.2},
        [2] = {{"Item", 1463, 1}, 50, 1.2},
        [3] = {{"Item", 1463, 1}, 100, 1.2},
        [4] = {{"Item", 1463, 2}, 100, 1.2},
        [5] = {{"Item", 1463, 3}, 100, 1.2},
    },
    tbPlayerNumForNpIdx = {10, 25},
    tbPrestige = { --通关根据人数添加的家族威望
        --第一个参数为人数，第二个是添加的威望
        {5, 40},
        {10, 60},
        {20, 80},
        {30, 100},
        {40, 120},
        {50, 140},
        {60, 160},
        {999, 200},
    },
}

tbMgr.DefendFubenDef = {
    tbMaterialNpc = { --物资npc配置信息
        [2774] = {nType = 1, nDropNum = 1, nCreateNum = 200},--TemplateId, 添加的物资类型数量, 一共产生多少个
        [2775] = {nType = 2, nDropNum = 1, nCreateNum = 200},
        [2776] = {nType = 3, nDropNum = 1, nCreateNum = 200},
        [2777] = {nType = 4, nDropNum = 1, nCreateNum = 200},
    },
    tbBossPos = {15277,8271}, --最后阶段BOSS位置
    CAR_TEMPLATE = 2779, --军资官
    tbMaterialCarPos = {9255,9038, 0, 17}, --军资官位置
    nOtherCarTID = 2778, --可以被攻击的那个物资车
    tbOtherCarPos = {9090,8931, 0, 17},  --物资车位置
    tbBossTemplateId    = {{16, 2786}, {6, 2785}, {1, 2784}, {0, 2783}},
}
setmetatable(tbMgr.DefendFubenDef, {__index = tbMgr.FubenDef})