UIStrConfig:Add(
{
	['cave1'] = '本层BOSS:',
	['cave2'] = '刷新时间:',
	['cave3'] = 'BOSS掉落:',
	['cave4'] = '产出预览:',
	['cave5'] = '打宝秘境每日可产生大量商城道具，建议使用高掉宝率时间',
	['cave6'] = '退出副本',
	['cave7'] = '已刷新',
	['cave10'] = 'BOSS背景',
	['cave11'] = '所在场景：',
	['cave12'] = '有几率掉落：',
	['cave15'] = '副本追踪',
	['cave16'] = '打宝秘境',
	['cave17'] = '立即前往',
	['cave18'] = '开始打宝',
	
	['cave20'] = '</font><font color="#00ff00">%s级以上玩家</font>',
	['cave21'] = '</font><font color="#00ff00">全天</font>',
	['cave22'] = '<u>规则说明</u>',
	
	['cave25'] = '本层信息',
	['cave26'] = '获得物品',
	['cave27'] = '推荐挂机',
	['cave28'] = '拥有试炼积分:',
	
	--BOSS刷新提示
	['cave100'] = '打宝秘境BOSS',
	['cave101'] = '产出卓越装备和打造材料',
	['cave102'] = '掉落宝物',
	['cave103'] = '<u>前往</u>',
	
	
	['cave200'] = 'BOSS产出卓越装备、小怪150%经验、自由PK',
	['cave201'] = 'BOSS产出卓越装备、小怪150%经验、自由PK<br/><font color="#29cc00">困难难度产出加倍</font>',
	
	['cave501'] = '<u>前往</u>',
	['cave502'] = '安全区内杀怪经验*1倍',
	['cave503'] = '非安全区内杀怪经验*1.5倍',
	
	['cave600'] = '(自由PK区)',

	['cave700'] = '立刻前往',
	['cave701'] = '使用',
	
	--页签信息
	['cave800'] = '本层信息',
	['cave801'] = 'BOSS排行',
}
)