UIStrConfig:Add(
{
	['babel1'] = '斗破苍穹',
	['babel2'] = '上一关',
	['babel3'] = '下一关',
	['babel4'] = '层数排行榜',
	['babel5'] = '本层最佳通关:',
	['babel7'] = '我的最高层数:',
	['babel8'] = '首次过关可获得',
	['babel9'] = 'BOSS随机掉落物品: ',
	['babel10'] = '挑    战',
	['babel11'] = '<font color="#8cbbd3">规则说明</font>',
	['babel12'] = '(必定获得2卓越属性)',
	
	['babel15'] = '<u>向上四层</u>',
	['babel16'] = '<u>向下四层</u>',
	
	['babel18'] = '扫荡',
	['babel19'] = '确认',
	
	-->排行榜
	['babel20'] = '斗破苍穹排行榜',
	['babel21'] = '排名',
	['babel22'] = '玩家名称',
	['babel23'] = '等级',
	['babel24'] = '通关层数',
	['babel25'] = '我的排名',
	
	-->副本追踪
	['babel150'] = '副本追踪',
	['babel151'] = '当前层数: ',
	['babel152'] = '推荐秒伤: ',
	['babel153'] = '当前秒伤: ',
	['babel154'] = '副本结束倒计时:',
	['babel155'] = '通关几率获得奖励:',
	['babel156'] = '开始挂机',
	['babel157'] = '取消挂机',
	['babel158'] = '退出',
	
	-->结局面板
	['babel200'] = '获得物品';
	['babel201'] = '领奖退出';
	['babel202'] = '领奖继续';
	['babel203'] = '再次挑战';
	['babel204'] = '退出';
	
	
	['babel300'] = '本次挑战失败，请提升攻击力再次挑战！<br/>挑战失败的层每天可无限次挑战。';
	['babel350'] = '<u>返回可挑战最高层</u>';
}
)