UIStrConfig:Add(
{
	 ['fabao10001'] = "预览",
	 ['fabao10002'] = "所需材料",
	 ['fabao10003'] = "攻击资质",
	 ['fabao10004'] = "生命资质",
	 ['fabao10005'] = "防御资质",
	 ['fabao10006'] = "命中资质",
	 ['fabao10007'] = "闪避资质",
	 
	 ['fabao120004'] = "生命：",
	 ['fabao120003'] = "攻击：",
	 ['fabao120005'] = "防御：",
	 ['fabao120006'] = "命中：",
	 ['fabao120007'] = "闪避：",
	
	 ['fabao10010'] = "激活属性：",
	 ['fabao10011'] = "装备列表",
	 ['fabao10012'] = "宝石总属性加成：",
	 ['fabao10013'] = "战斗力加成：",
	 ['fabao10014'] = "增加战斗力",
	
	 ['fabao10015'] = "请选择宝石",
	 ['fabao10016'] = "宝石升级清单",
	 ['fabao10017'] = "消耗：",
	
	 ['fabao10021'] = "主",
	 ['fabao10022'] = "资质范围",
	 ['fabao10023'] = "技能最多情况",
	 
	 ['fabao01'] = "融合",
	 ['fabao02'] = "学习",
	 ['fabao03'] = "合成",
	 ['fabao04'] = "分解",
	 ['fabao05'] = "休息",
	 ['fabao06'] = "出战",
	 ['fabao07'] = "重生",
	 
	 ['fabao08'] = "法宝",
	 ['fabao09'] = "合成",
	 ['fabao010'] = "融合",
	 ['fabao011'] = "洗练",
	 ['fabao012'] = "取消",
	 ['fabao013'] = "Lv:",
	 
	['fabao551'] = "一阶法宝",
	['fabao552'] = "二阶法宝",
	['fabao553'] = "三阶法宝",
	['fabao554'] = "四阶法宝",
	['fabao555'] = "五阶法宝",
	['fabao556'] = "六阶法宝",
}
)