_G.Cfg.clan_active_all =
{
 [1] ={  active_name=[[门派守护神]],reward=[[]],type1=[[]],condition=[[]],value1=[[]]},
 [2] ={  active_name=[[第一门派]],reward=[[]],type1=[[]],condition=[[]],value1=[[]]},
 [3] ={  active_name=[[门派大战]],reward=[[大量铜钱，贡献]],type1=[[周四20:00-20:45]],condition=[[排名前九名的门派]],value1=[[1.门派大战分为两轮比赛（初赛和决赛）。
2.初赛在所有门派中选出排名前9的门派进行门派大战。每三个门派为一组，在三张互相连接的地图中战斗，每组胜利的门派可进入决赛。决赛的规则与初赛一样，胜利的门派获得活动冠军。
3.战斗中，玩家血量*5，玩家死完后有一定的复活次数，当复活次数为0且死亡时，该玩家将退出活动。
4.胜利条件：
（1）规定时间内，地图上只剩下一个门派的玩家，该门派胜 
（2）规定时间内，地图上不只剩下一个门派的玩家，按照门派剩余人数>门派击杀人数>剩余人员平均战力选出胜利门派
5.奖励（最多获得一次奖励）:
    决赛胜出：2000000铜钱，1500贡献
    决赛失败：1500000铜钱，1200贡献
    初赛失败：1000000铜钱，800贡献
 以上奖励统一在20：45以邮寄的形式发送
6.开服第一天，门派大战将不开启。]]},
 [4] ={  active_name=[[保卫圣兽]],reward=[[大量铜钱，贡献]],type1=[[周一20:00-20:30]],condition=[[门派等级达到2级（活动开始前）]],value1=[[1.百鬼夜行分为两张地图，每个地图拥有一个雕像，每张地图的难度不一。
2.所有成员可以进入任何一张地图战斗。
3.每张地图共有六层，清除当层的怪物后才可通往下一层。
4.传送门规则：清除完当层怪物后，会出现两个传送门，一个通往下一层，一个通往第一层。
5.某一地图中，击杀所有敌人或雕像血量为0时，该地图结束活动；所有地图都结束后，根据通关的总层数进行奖励。奖励统一在20:30以邮件形式发送]]},
 [5] ={  active_name=[[门派祈福]],reward=[[大量宝石]],type1=[[全天]],condition=[[门派等级达到1级]],value1=[[1.门派所有成员每天能进行一次祈福；
2.每次祈福会增加一点福值，福值每天凌晨清零；
3.福值达到对应的阶段祈福者可领取对应的奖励。]]},

}
