_G.Cfg.feather_des = { [1] = { id=44105,name=[[幽绿魅影]],des1=[[资质:12  战力:500
获得:商城、精彩活动
所有翅膀可累加到主角上。]],goods_id=44105,m_color=6,skin_id=44105,skill={201,101,102}},
[2] = { id=44110,name=[[焚天夜火]],des1=[[资质:13  战力:1000
获得:商城、精彩活动
所有翅膀可累加到主角上。]],goods_id=44110,m_color=6,skin_id=44110,skill={202,101,102,103}},
[3] = { id=44115,name=[[云随风啸]],des1=[[资质:14  战力:2000
获得:商城、精彩活动
所有翅膀可累加到主角上。]],goods_id=44115,m_color=6,skin_id=44115,skill={203,102,103}},
[4] = { id=44120,name=[[审判雷霆]],des1=[[资质:15  战力:3000
获得:商城、精彩活动
所有翅膀可累加到主角上。]],goods_id=44120,m_color=6,skin_id=44120,skill={204,103,104,105}},
[5] = { id=44125,name=[[青木天翔]],des1=[[资质:16  战力:4000
获得:商城、精彩活动
所有翅膀可累加到主角上。]],goods_id=44125,m_color=7,skin_id=44125,skill={205,104,105,106}},
[6] = { id=44130,name=[[琉璃冰晶]],des1=[[资质:17  战力:6000
获得:商城、精彩活动
所有翅膀可累加到主角上。]],goods_id=44130,m_color=7,skin_id=44130,skill={206,105,106,107}},
[7] = { id=44135,name=[[圣光神羽]],des1=[[资质:18  战力:8000
获得:商城、精彩活动
所有翅膀可累加到主角上。]],goods_id=44135,m_color=7,skin_id=44135,skill={207,106,107,108}},
[8] = { id=44140,name=[[破灭魔翼]],des1=[[资质:20  战力:10000
获得:至尊商城、精彩活动
所有翅膀可累加到主角上。]],goods_id=44140,m_color=7,skin_id=44140,skill={208,107,108}}}
