_G.Cfg.logs=
{
 [1001] ={ title=[[15级礼包]],open=113,describe=[[恭喜你达到15级{nn}，赶紧去打开15级礼包，看下有什么好东西吧！]],conditions=[[人物等级达到15并且背包里有“15级礼包”，注：检测背包里是否有此物品ID]],arg=Array},
 [1002] ={ title=[[20级礼包]],open=113,describe=[[恭喜你达到20级{nn}，赶紧去打开20级礼包，看下有什么好东西吧！]],conditions=[[完成20级主线任务且背包里有“20级礼包”，注：检测背包里是否有此物品ID]],arg=Array},
 [1003] ={ title=[[25级礼包]],open=113,describe=[[恭喜你达到25级{nn}，赶紧去打开25级礼包，看下有什么好东西吧！]],conditions=[[人物等级达到25并且背包里有“25级礼包”，注：检测背包里是否有此物品ID]],arg=Array},
 [1004] ={ title=[[30级礼包]],open=113,describe=[[恭喜你达到30级{nn}，赶紧去打开30级礼包，看下有什么好东西吧！]],conditions=[[人物等级达到30并且背包里有“30级礼包”，注：检测背包里是否有此物品ID]],arg=Array},
 [1005] ={ title=[[40级礼包]],open=113,describe=[[恭喜你达到40级{nn}，赶紧去打开40级礼包，看下有什么好东西吧！]],conditions=[[人物等级达到40并且背包里有“40级礼包”，注：检测背包里是否有此物品ID]],arg=Array},
 [1006] ={ title=[[50级礼包]],open=113,describe=[[恭喜你达到50级{nn}，赶紧去打开50级礼包，看下有什么好东西吧！]],conditions=[[人物等级达到50并且背包里有“50级礼包”，注：检测背包里是否有此物品ID]],arg=Array},
 [1101] ={ title=[[整点体力赠送]],open=0,describe=[[每天12点、18点赠送50额外体力{nn}，千万别落后于人，赶紧去领取吧！]],conditions=[[每日按时发送刷新]],arg=Array},
 [1106] ={ title=[[精英副本开启]],open=114,describe=[[去接受精英副本任务{nn}，迎接更为强大的刺激挑战吧！]],conditions=[[完成20级主线任务]],arg=Array},
 [1111] ={ title=[[帮派申请]],open=115,describe=[[有伙伴加入帮派，赶快去看下是何方神圣来投！]],conditions=[[有审核职能的玩家出现提示]],arg=Array},
 [7000] ={ title=[[我要变强]],open=122,describe=[[胜败乃兵家常事，失败不算什么，先去增强自己的实力，再接再厉吧！]],conditions=[[玩家自己在所有战斗场景失败后发送此消息]],arg=Array},
 [8001] ={ title=[[竞技挑战]],open=106,describe=[[{$}在竞技场挑战你失败，{nn}你的排名稳如泰山！]],conditions=[[玩家自己在竞技场打败挑战者后发送此消息]],arg=Array},
 [8002] ={ title=[[竞技挑战]],open=106,describe=[[{$}在竞技场挑战你成功，{nn}你的排名下降到第{#}名，望能东山再起！]],conditions=[[玩家自己在竞技场被挑战者打败后发送此消息]],arg=Array},
 [8005] ={ title=[[加入帮派]],open=115,describe=[[恭喜，{$}帮派已通过你的申请，现在开始你也是其中的一份子啦！]],conditions=[[玩家申请社团成功后发送此消息]],arg=Array},
 [8007] ={ title=[[帮派boss]],open=115,describe=[[帮助{$}召唤了一个强大的BOSS，将于{nn}分钟后出现，赶紧去击杀帮派BOSS吧！]],conditions=[[帮主召唤boss之后向帮派成员发送此消息]],arg=Array},
 [8010] ={ title=[[帮派拒接加入]],open=0,describe=[[{$}帮派拒绝了你的申请，赶紧加强自己的战斗力，证明自己吧！]],conditions=[[玩家申请社团失败后发送此消息]],arg=Array},

}
