_G.Cfg.moil_inter =
{
 [1] ={ type=1,active=[[肺腑之言]],des=[[你对苦工#说会永远对TA好，TA听后感动得痛哭流涕。]],des_passive=[[主人#说TA和你的感情地久天长，会永远对你好，你只好假装被感动了。]]},
 [2] ={ type=1,active=[[改善伙食]],des=[[苦工#最近干活很卖力，你决定给TA每顿的清炒番茄里加多点西红柿。]],des_passive=[[你最近干活很卖力，主人#决定在你每顿的清炒番茄里多加点西红柿。]]},
 [3] ={ type=1,active=[[去泡温泉]],des=[[你心情大好要去泡温泉，顺便带上了苦工#，TA得知后整夜失眠了。]],des_passive=[[主人#对你说：“为了奖励你的忠诚称职，我们去泡温泉吧。”]]},
 [4] ={ type=1,active=[[赠送礼物]],des=[[你给苦工#送上了礼物，好让TA更卖力干活。]],des_passive=[[在你心灰意冷的时候，主人#给你带来了贵重的礼物。]]},
 [5] ={ type=1,active=[[温暖小床]],des=[[家里还有张破旧的小床，就送给苦工#吧。]],des_passive=[[得知你家徒四壁，主人#特地给你安排了一张温暖的小床。]]},
 [6] ={ type=1,active=[[甜言蜜语]],des=[[你说了几句甜言蜜语，想让苦工#从此死心塌地跟着你干。]],des_passive=[[主人#给你说了几句貌似贴心温馨的好话，你却不以为然。]]},
 [7] ={ type=1,active=[[人体模特]],des=[[你要开艺术展，毫不犹豫地让苦工#客串帮忙，打上石膏扮演思考者。]],des_passive=[[主人#要开艺术展，让你扮演思想者，TA看着你满身石膏可耻的笑了。]]},
 [8] ={ type=1,active=[[斗牛勇士]],des=[[你看斗牛比赛时突然将苦工#推倒在地，并扒下TA的衣服跳起舞来。]],des_passive=[[主人#在看斗牛比赛时突然将你推倒在地，并扒下你的衣服跳起舞来。]]},
 [9] ={ type=1,active=[[人肉沙包]],des=[[把苦工#暴打了一顿后，你突然明白到幸福其实就是奥特曼打小怪兽。]],des_passive=[[主人#把你暴打一顿之后，高兴的告诉你幸福就是奥特曼打小怪兽。]]},
 [10] ={ type=1,active=[[清扫大街]],des=[[你无所事事，就让苦工#去讨好街道办清洁大妈，帮她打扫大街。]],des_passive=[[主人#要你打扫大街讨好街道办清洁大妈，你对TA的品味恶心不已。]]},
 [11] ={ type=1,active=[[抗击雾霾]],des=[[最近北方出现大片雾霾，你让苦工#远途北上，试下雾霾的味道。]],des_passive=[[主人#对你说：“北方没有雾霾，空气可清新了，你去见识一下吧。”]]},
 [12] ={ type=1,active=[[生日礼物]],des=[[苦工#最近掉发严重，你就送了一瓶智慧牌洗发水祝TA早日聪明绝顶。]],des_passive=[[你最近掉发严重，主人#送上一瓶智慧牌洗发水祝你早日聪明绝顶。]]},
 [13] ={ type=2,active=[[睡前故事]],des=[[你挑了一个惊悚的故事说给苦工#听，其实是想让TA做噩梦。]],des_passive=[[主人#对你说：“看你每天晚上都失眠，我讲个好玩的故事给你听吧。”]]},
 [14] ={ type=2,active=[[吟诗作对]],des=[[你突然来了灵感，慢悠悠走了七步，在苦工#面前作了两句绝妙诗句。]],des_passive=[[主人#突然作了诗给你欣赏：“人生在世不称意，不如自挂东南枝。”]]},
 [15] ={ type=2,active=[[跳天鹅湖]],des=[[你给苦工#表演了一支《天鹅湖》，结果TA三天吃不下饭。]],des_passive=[[主人#给你表演了一支《天鹅湖》，之后你三天吃不下饭。]]},
 [16] ={ type=2,active=[[学习雷锋]],des=[[你今天要学雷锋，想让人感到快乐，所以大大的称赞了苦工#一番。]],des_passive=[[主人#突然想称赞下你，说你是这个世界上最忠心、最耐劳的称职仆人。]]},
 [17] ={ type=2,active=[[一朵鲜花]],des=[[你在一堆牛粪上，摘了一朵鲜花送给苦工#，TA顿时开心死了。]],des_passive=[[主人#在牛粪上摘了一朵鲜花，说像你这样的忠诚仆人应该得到这朵鲜花。]]},
 [18] ={ type=2,active=[[失恋安慰]],des=[[苦工#失恋后痛哭流涕，你捡起地上擦过鼻涕的纸巾帮TA擦干眼泪。]],des_passive=[[主人#用纸巾为失恋伤心的你擦干眼泪，你至今还记得纸巾上的鼻涕味。]]},
 [19] ={ type=2,active=[[艳照风波]],des=[[你偷偷拍下苦工#的睡姿发到网上，第二天TA就火了。]],des_passive=[[主人#偷偷拍下你的睡姿发到网上，第二天你就火了。]]},
 [20] ={ type=2,active=[[办证电话]],des=[[你将苦工#的电话弄成办证电话贴满大街小巷，之后TA不停地被骚扰。]],des_passive=[[主人#将你的电话弄成办证电话贴满大街小巷，之后你被骚扰得几近崩溃。]]},
 [21] ={ type=2,active=[[自制神药]],des=[[你自制了一瓶神奇的凉茶，苦工#喝后说味道虽怪，口感还不错。]],des_passive=[[主人#给了你一瓶神奇的凉茶，可你吃了之后上吐下泄，感觉被TA坑惨了。]]},
 [22] ={ type=2,active=[[东莞扫黄]],des=[[你得知苦工#去东莞寻开心，就通知了那里突击检查的最强力小分队。]],des_passive=[[你好不容易去趟东莞，主人#却引来了突击检查小队，你吓得撒腿就跑了。]]},
 [23] ={ type=2,active=[[馊味炖汤]],des=[[你把一碗放了三天三夜的炖汤给苦工#送去，TA说很喜欢这味道。]],des_passive=[[主人#知道你喜欢喝汤，特地为你送上一份馊味直冒的菜叶汤。]]},
 [24] ={ type=2,active=[[厕所陷阱]],des=[[你在厕所设下了陷阱，苦工#没发现，终于掉到了茅坑里。]],des_passive=[[主人#在你方便前偷偷把马桶座拆得破破烂烂的，一坐上去就会……]]}

}
