_G.Cfg.paly_des = { [40211] = { name=[[玉清幻境]],declare = { [1]=[[周一--周四,每天00:00-22:00开启活动；]],[2]=[[将一层对手全部战胜后可获得宝箱奖励,并可挑战下一层对手；]],[3]=[[通过越级挑战功能可挑战高组别的强者；]],[4]=[[共设新手组,青铜组,白银组,黄金组,白金组,钻石组6个组别；]],[5]=[[越级挑战需按照组别依次挑战；]],[6]=[[每周四晚上22:00结算排行,结算奖励通过邮件发放；]],[7]=[[排名前500的玩家可参与上清幻境。]]}},
[40212] = { name=[[上清幻境]],declare = { [1]=[[周五00:00--22:00开启活动；]],[2]=[[战胜高排名的玩家可与该玩家互换排名；]],[3]=[[每周五晚上22:00结算排行,结算奖励通过邮件发放；]],[4]=[[排名前256的玩家可参与太清幻境。]]}},
[40213] = { name=[[门派妖兽]],declare = { [1]=[[门派等级达到1级可召唤门派妖兽；]],[2]=[[掌门和护法可以召唤妖兽；]],[3]=[[每天23:30--00:00不可召唤妖兽；]],[4]=[[每位玩家每天可挑战1次门派妖兽；]],[5]=[[击杀门派妖兽可获得大量的个人贡献。]]}},
[40214] = { name=[[保卫圣兽堂]],declare = { [1]=nil,[2]=nil,[3]=nil,[4]=nil,[5]=nil}},
[40215] = { name=[[第一门派]],declare = { [1]=[[活动时间:每天10:00--22:00；]],[2]=[[每天由一个门派进行防守（第1次活动由排名第一的门派防守）,其他门派进行进攻；]],[3]=[[防守门派的成员将获得属性加成；]],[4]=[[当天活动结束前,如果进攻方击杀了防守门派的所有成员，则防守门派防守失败；]],[5]=[[当天活动结束前,如果防守门派有成员存活，则防守门派防守成功；]],[6]=[[若防守成功,第二天依然由该门派防守,而进攻方的门派成员将获得属性加成；]],[7]=[[若防守失败,第二天由伤害排行第一的门派进行防守,进攻方的门派成员不会获得属性加成；]],[8]=[[防守门派成员的血量在当天的活动中不会恢复；]],[9]=[[防守方奖励:防守成功个人贡献*1600,防守失败个人贡献*1200。进攻方:进攻成功奖励贡献根据排名依次为:1600、1400、1200、1100、1000、900、800、700、600、500,进攻失败则奖励减半。只有参与防守或者进攻才能获得奖励。活动结束后奖励通过邮件发放。]]}},
[40216] = { name=[[斗转星移]],declare = { [1]=[[玩家可选择任意职业进行战斗，所有职业均为30级且属性相同；]],[2]=[[玩家需要不断挑战敌人,该过程血量不会恢复,直到玩家通关或死亡,挑战结束；]],[3]=[[按照玩家历史最高伤害进行排行,结算时间为每周日晚上23:00,奖励将通过邮件发送。]]}},
[40217] = { name=[[归墟之境-报名]],declare = { [1]=[[归墟之境报名时间:周二 00:00 --  19:30；]],[2]=[[周二 19:30,从在线报名玩家中选取竞技排名前64的玩家参与比赛；]],[3]=[[系统将在周二 19:30发放邮件通知玩家是否获得参赛资格；]],[4]=[[归墟之境初赛时间:周二晚上 20:00--21:00；]],[5]=[[归墟之境决赛时间:周三晚上 20:00--21:00。]]}},
[40218] = { name=[[归墟之境-说明]],declare = { [1]=[[初赛时间:周二晚上20:00--20:30；决赛时间:周三晚上20:00--20:30；]],[2]=[[初赛:系统自动将报名的竞技场前64名在线玩家分为8组进行小组赛,小组赛前两名可参加决赛；]],[3]=[[决赛:进入决赛的玩家进行淘汰赛,争夺最后胜利；]],[4]=[[决赛最后一场采用三局两胜,其余比赛一局定胜负；]],[5]=[[初赛奖励:1-8名奖励易换乾坤分别为:100、90、80、75、70、65、60、55个；]],[6]=[[决赛奖励:根据被淘汰轮次进行奖励,1-4轮被淘汰奖励分别为40、60、80、120个易换乾坤。决赛胜者奖励200个易换乾坤。]],[7]=[[归墟之境初赛结束到决赛开始前可以进行竞猜，在进入决赛的16名玩家中选择一位冠军,一位亚军,每位玩家只能投注1次,投注以后不可更改名单；同时猜中或猜中一个即可获得奖励；]],[8]=[[竞猜奖励:只猜中冠军或亚军，奖励元宝为投注金额*2；同时猜中冠军和亚军奖励元宝为投注金额*4,没有猜中返回投注的元宝；归墟之境活动结束后,欢乐竞猜奖励将通过邮件发放。]]}},
[40219] = { name=[[太清混元-欢乐竞猜]],declare = { [1]=[[竞猜时间:归墟之境初赛结束后--决赛开始前；]],[2]=[[在进入决赛的16名玩家中选择一位冠军,一位亚军,同时猜中或猜中一个即可获得奖励；]],[3]=[[每位玩家只能投注1次,投注以后不可更改名单；]],[4]=[[只猜中冠军或亚军，奖励元宝为投注金额*2；同时猜中冠军和亚军奖励元宝为投注金额*4,没有猜中返回投注的元宝；]],[5]=[[本活动只返回元宝，不返回钻石;]],[6]=[[归墟之境活动结束后,欢乐竞猜奖励将通过邮件发放。]],[7]=[[只猜中冠军或亚军，奖励元宝为投注金额*2；同时猜中冠军和亚军奖励元宝为投注金额*4,没有猜中返回投注的元宝；]],[8]=[[本活动只返回元宝，不返回钻石;]]}},
[40220] = { name=[[拍卖说明]],declare = { [1]=[[所有物品价高者得]],[2]=[[竞拍下物品之后,两分钟内无人出更高的价格,竞拍者在竞拍结束后通过邮件获得此物]],[3]=[[竞拍价格被压后,钻石或元宝将会在本物结束后通过邮件返还]],[4]=[[如果一个物品开始拍卖后,十分钟内无人拍将会流拍]]}},
[30600] = { name=[[镇守妖塔]],declare = { [1]=[[玩家可占领的位置与锁妖塔中通关数一致；]],[2]=[[每占领30分钟,玩家获得的奖励将会增加；]],[3]=[[每天有12小时的占领时间,当占领时间为0或过了0点时,自动获得占领奖励；]],[4]=[[玩家自行离开,当前收益减半；]],[5]=[[被他人抢占后,当前收益减半,抢占者可获得当前10%的奖励；]],[6]=[[奖励将通过邮件发放；]]}},
[40221] = { name=[[太清混元-说明]],declare = { [1]=[[初赛时间:周六晚上20:00--20:30；]],[2]=[[决赛时间:周日晚上20:00--20:30；]],[3]=[[系统自动将上清幻境前256名玩家分为16组进行淘汰赛,小组赛冠军可参加决赛；]],[4]=[[进入决赛的玩家进行淘汰赛,争夺三界尊主荣誉；决赛最后一场采用三局两胜；]],[5]=[[初赛奖励:根据被淘汰轮次进行奖励,1-4轮被淘汰奖励分别为400、500、600、700个神兵碎片。初赛胜者奖励800个神兵碎片。]],[6]=[[决赛奖励:根据被淘汰轮次进行奖励,1-4轮被淘汰奖励分别为800、1000、1200、1500个神兵碎片。决赛胜者奖励2000个神兵碎片。]],[7]=[[决赛冠军所在的区所有玩家将获得100神兵碎片和100元宝，亚军所在的区所有玩家将获得50神兵碎片和50元宝；]],[8]=[[太清幻境初赛结束到决赛开始前可以进行竞猜，在进入决赛的16名玩家中选择一位冠军,一位亚军,每位玩家只能投注1次,投注以后不可更改名单；同时猜中或猜中一个即可获得奖励；]],[9]=[[竞猜奖励:只猜中冠军或亚军，奖励元宝为投注金额*2；同时猜中冠军和亚军奖励元宝为投注金额*4,没有猜中返回投注的元宝；太清幻境活动结束后,欢乐竞猜奖励将通过邮件发放。]]}},
[40222] = { name=[[太清混元-欢乐竞猜]],declare = { [1]=[[竞猜时间:太清幻境初赛结束后--决赛开始前；]],[2]=[[在进入决赛的16名玩家中选择一位冠军,一位亚军,同时猜中或猜中一个即可获得奖励；]],[3]=[[每位玩家只能投注1次,投注以后不可更改名单；]],[4]=[[太清幻境活动结束后,欢乐竞猜奖励将通过邮件发放。]]}},
[40223] = { name=[[大转盘]],declare = { [1]=[[抽中的物品将不会再次被抽中；]],[2]=[[每次活动期间最多可抽奖12次；]],[3]=[[抽满12次可获的转盘中所有物品；]],[4]=[[抽奖所需道具可在累计消费中获得。]]}},
[40224] = { name=[[珍宝]],declare = { [1]=[[打造相邻的两个珍宝，可获得相应的属性加成；]],[2]=[[将本层珍宝全部打造完成，可开通下一层珍宝阁；]],[3]=[[打造珍宝所需材料可在珍宝副本中获得；]]}},
[30160] = { name=[[祈福]],declare = { [1]=[[门派所有成员每天能进行一次祈福；]],[2]=[[每次祈福花费200元宝获得1个5级宝石礼包；]],[3]=[[每次祈福会增加一点福值，福值每天凌晨清零；]],[4]=[[当天祈福的成员可以领取福值中各阶段的宝箱；]]}},
[40225] = { name=[[八卦]],declare = { [1]=[[占卦可随机获得卦象，通过高级占卦更易获得高品质的卦象。]],[2]=[[卦象可通过吞噬其他卦象获得经验值提升等级，等级越高加成的属性越高。]],[3]=[[一键吞噬时，低品质卦象将会被高品质卦象吞噬。拖动吞噬时，被拖动卦象将被吞噬。]],[4]=[[相同类型卦象只能装备一个。]],[5]=[[升级卦阵核心，可提高卦象属性加成。]]}},
[31400] = { name=[[轮回试练]],declare = { [1]=[[关卡说明:
（1）轮回试练共有10层关卡，每个关卡的敌人会有不同属性的提升；
（2）玩家每天可挑战1次，挑战时间为00:00--23:45
（3）每天00:00点重置层数；]],[2]=[[战斗说明:
（1）每挑战完一层，主角的血量将不会恢复；
（2）若战斗失败，玩家血量恢复到该关卡挑战前状态；
（3）战斗失败不影响挑战次数；
（4）宠物助战:玩家可选择已激活的宠物帮助战斗；
（5）属性点:属性点可加成相应的属性（只影响本系统），每天重置层数时属性点将清零；]],[3]=[[奖励说明:每通关一个关卡即可获得相应的奖励]]}},
[40226] = { name=[[屏蔽功能]],declare = { [1]=[[亲爱的玩家，您想要一个简洁清爽的游戏界面吗？]],[2]=[[点击左上角的角色框头像，可屏蔽游戏左边、右上方的功能图标。]],[3]=[[再次点击，原来的功能图标即可恢复显示。]],[4]=[[所以误点的时候不用害怕，再次点击头像即可！]]}},
[611] = { name=[[屏蔽功能]],declare = { [1]=[[本次删档测试进行充值的玩家均可在正式服获取两倍的钻石返还。]],[2]=[[使用封测时同一账号创建角色，并且等级达到20级即可获得钻石返还。]],[3]=[[同一账号在不同的服务器只有一次领取的机会。]]}},
[621] = { name=[[屏蔽功能]],declare = { [1]=[[在删档测试期间进行充值的玩家均可在正式服获取两倍的钻石返还。]],[2]=[[使用封测时同一账号创建角色，并且等级达到20级即可获得钻石返还。]],[3]=[[同一账号在不同的服务器只有一次领取的机会。]]}},
[631] = { name=[[屏蔽功能]],declare = { [1]=[[该账号在所有服务器上的充值总额将按照15%的比例返还钻石。]],[2]=[[使用正式服同一账号创建角色，并且等级达到20级即可获得钻石返还。]],[3]=[[同一账号在不同的服务器只有一次领取的机会。]]}},
[41370] = { name=[[屏蔽功能]],declare = { [1]=[[活动期间，vip4的玩家可花费1000钻石购买“招财貔貅”；]],[2]=[[购买招财貔貅的玩家可根据自身的等级获得相应的钻石奖励（共计8888钻石）；]],[3]=[[每种等级奖励只能领取1次；]],[4]=[[活动结束后，玩家仍可通过提升等级获得相应的奖励；]]}}}
