_G.Cfg.wing_des = { [54105] = { wing_id=54105,name=[[棉花糖]],des1=[[资质:10  战力:40
获得方式一:签到第二天]],m_lv=1000,m_card=54105,m_color=6,scale=2000,Xpianyi=0,skin_id=60101,fly=0,skill={201,101,102}},
[54110] = { wing_id=54110,name=[[金灵兽]],des1=[[资质:11  战力:800
获得方式一:第三天首充
获得方式二:等级达到60级]],m_lv=60,m_card=54110,m_color=6,scale=2300,Xpianyi=0,skin_id=60106,fly=0,skill={202,101,102,103}},
[54115] = { wing_id=54115,name=[[木灵兽]],des1=[[资质:12  战力:1600
获得方式一:精彩活动、至尊商城
获得方式二:等级达到70级]],m_lv=70,m_card=54115,m_color=6,scale=2000,Xpianyi=0,skin_id=60111,fly=0,skill={203,102,103}},
[54120] = { wing_id=54120,name=[[水灵兽]],des1=[[资质:13  战力:2400
获得方式一:精彩活动、至尊商城
获得方式二:等级达到80级]],m_lv=80,m_card=54120,m_color=6,scale=2000,Xpianyi=0,skin_id=60116,fly=0,skill={204,103,104,105}},
[54125] = { wing_id=54125,name=[[火灵兽]],des1=[[资质:14  战力:3200
获得方式一:精彩活动、至尊商城
获得方式二:等级达到90级]],m_lv=90,m_card=54125,m_color=7,scale=2000,Xpianyi=0,skin_id=60121,fly=0,skill={205,104,105,106}},
[54130] = { wing_id=54130,name=[[土灵兽]],des1=[[资质:15  战力:4800
获得方式一:精彩活动、至尊商城
获得方式二:等级达到100级]],m_lv=100,m_card=54130,m_color=7,scale=1800,Xpianyi=0,skin_id=60126,fly=0,skill={206,105,106,107}},
[54135] = { wing_id=54135,name=[[阴灵兽]],des1=[[资质:16  战力:6400
获得方式一:精彩活动、至尊商城
获得方式二:等级达到110级]],m_lv=110,m_card=54135,m_color=7,scale=1800,Xpianyi=0,skin_id=60131,fly=0,skill={207,106,107,108}},
[54140] = { wing_id=54140,name=[[阳灵兽]],des1=[[资质:18  战力:8000
获得方式一:精彩活动、至尊商城
获得方式二:等级达到120级]],m_lv=120,m_card=54140,m_color=7,scale=2000,Xpianyi=0,skin_id=60136,fly=0,skill={208,107,108}}}
