challengeRaidCfg={
    weekCard={
        money=50,  --购买周卡一次性获得金币
        time=7,  --周卡持续时间
        addExp=1,  --周卡功能增加升级精英坦克获得经验
        getItem={{props_p3326=10,userinfo_gems=50},{p={p3326=10},u={gems=50}}},  --周卡每日获得扫荡令和金币
    },
    
    vipBuyNums={0,1,2,3,4,5,6,7,8,9,10,11,12,13},  --VIP等级购买扫荡令次数限制   例：Vip0可购买0次，Vip10可购买10次
    buyMoney={10,10,10,10,10,10,10,10,10,10,10,10,10}, --次数对应花费金币  每次购买都只需10金币
    buyGet={{"p3326",5},{p={p3326=5}}},  --每次购买获得扫荡令
    
    addExp=1,  --扫荡功能增加升级精英坦克获得经验      例：关卡获得精英坦克经验 = 关卡精英坦克经验 *（1+周卡加成+扫荡加成）
    
    needLv=6,  --需要人物等级10级
    needStar=3,  --需要关卡3星
    needChapter=2,  --需要关卡第二章解锁
    
    energy=1,  --每次扫荡消耗能量1点
    useprop={{p3326=1},{p={p3326=1}}},  --每次扫荡消耗一个扫荡令
    limitNum=20,  --单次扫荡最多20次
    
    vipQueue={  --扫荡卡槽所需VIP等级开放
        [2]=3,  --卡槽2需要VIP等级3
        [3]=5,  --卡槽3需要VIP等级5
    },
    vipQueueForShow={1,1,1,2,2,3,3,3,3,3,3,3,3,3,3},     --仅用于前台显示
}


