-- G-更新公告.xls
return {
other={
{}},

other_default_table={is_reward_item=1,reward_item={item_id=22020,num=1,is_bind=1},explain="<size='35'><color='#ffe500'>亲爱的玩家</color></size>    欢迎回来仙侠世界，为了您更好的游戏体验，我们加入了更多更好玩的系统玩法以及各种优化，祝您游戏愉快！\n\n<size='26'><color='#ffe500'>酷炫的时装体验</color></size>      形象系统拥有大量酷炫时装，让玩家在游戏中可以自由搭配不同的时装。霸气的武器形象搭配帅气的衣服时装，在战力提升的同时也让你感受到不一样的自己。\n\n<size='26'><color='#ffe500'>伙伴系统</color></size>\n全新的主动技能，不同的伙伴有不同的技能，可以针对不同的副本或者战斗进行出战。\n\n<size='26'><color='#ffe500'>丰富的玩法</color></size>\n游戏按照合理的规划，增加了大量的有趣玩法。日常、活动、福利、挑战、BOSS……无论你是什么样的玩家，你都可以找到属于自己的乐趣!\n\n<size='26'><color='#ffe500'>写实风格的场景</color></size>\n1.宽广世界的风情，神州大陆的景色。\n2.优秀的画师在场景、人物、坐骑、怪物花费了大量的心思，给予玩家一个不一样的仙侠世界。\n\n<size='26'><color='#ffe500'>特殊表情</color></size>\n1.大量特殊表情，更多表情包等你来解锁。\n2.在聊天界面上增加大量特殊表情，让你的聊天更加风趣。\n3.特殊表情增加升级功能，特殊表情激活后仍能进行升级增加属性\n",foreshow="",}

}

