return {--称号激活方式
------------------------------------------------------------------------------------------------------------
	[1]  = "通过首充可获得",--//家里有矿(首充获得)
	[2]  = "通过登录奖励可获得",--//不要怂就是干(登录7天获得)
	[3]  = "通过守护竞技(活动)可获得",--//武器大师(【守护竞技30】活动,第1名)
	[4]  = "通过战宠竞技(活动)可获得",--//逍遥尊者(【战宠竞技19】活动,第1名)
	[5]  = "通过魂珠竞技(活动)可获得",--//物华天宝(【魂珠竞技21】活动,第1名)
	[6]  = "通过翅膀竞技(活动)可获得",--//无翼伦比(【翅膀竞技9】活动,第1名)
	[7]  = "通过战力竞技(活动)可获得",--//无敌是多么寂寞(【战力竞技23】活动,第1名)
	[8]  = "通过主线任务可获得",--//杀BOSS直升VIP12(主线任务赠送)
	[9]  = "通过合服消费榜(活动)可获得",--//天地神壕(【合服-消费争锋81】活动,第1名)
	[10] = "通过豪装竞技(活动)可获得",--//君临天下(【土豪装竞技】第一名)[暂时无用]
	[11] = "通过开服消费榜(活动)可获得",--//天下第一壕(【开服-消费竞技18】活动,第1名)
	[12] = "通过热血竞技(活动)可获得",--//无敌神装(【热血竞技22】活动,第1名)
	[13] = "通过宝石竞技(活动)可获得",--//珠光宝气(【宝石竞技20】活动,第1名)
	[14] = "通过等级竞技(活动)可获得",--//转世天帝(【等级竞技8】活动,第1名)
	[15] = "通过阵营战(日常活动),累计击杀100人可获得",--//万人斩(日常活动-阵营战，击杀100人)
	[16] = "通过鉴宝竞技(活动)可获得",--//鉴宝达人(【鉴宝竞技24】活动,第1名)
--	[17] = "通过星魂竞技(活动)可获得",--//星空之神(【星魂竞技】第一名)[暂时无用]

	[22] = "通过客服定制独一无二称号",--定制称号专用1
	[23] = "游戏名称：烈火王座\n游戏区服：21服\n玩家名字：心已放空",--定制称号专用2	天空之城城主(称号)   【玩家名字:s21.心已放空】
	
	
	[33] = "通过排行榜-战力榜第1名可获得",--//最强王者(排行榜-战力榜，第1名)
	[34] = "通过排行榜-战力榜第2-10名可获得",--//至尊星耀(排行榜-战力榜，第2-10名)
--	[35] = "通过可获得",--//达官显贵(根据封神等级做判断第一名可获得)[暂时无用]
--	[36] = "通过可获得",--//十大名流(官职等级做判断，官职第2-10名获得)[暂时无用]
	[37] = "通过排行榜-等级榜第1名可获得",--//枭雄之首(排行榜-等级榜-第1名)
	[38] = "通过排行榜-等级榜第2-10名可获得",--//十大枭雄(排行榜-等级榜，第2-10名)
--	[39] = "通过可获得",--//战神无双(装备战力第一名)[暂时无用]
--	[40] = "通过可获得",--//十大宗师(装备战力第2-10名)[暂时无用]
	[41] = "通过夺宝奇兵(日常活动),最终持宝人可获得",--//持宝人(日常活动-夺宝奇兵,持宝人)
	[42] = "通过攻城战(日常活动),王城行会会长可获得",--//龙城城主(日常活动-攻城战-王城城主)
	[43] = "通过攻城战(日常活动),王城行会成员可获得",--//龙城勇士(日常活动-攻城战-王城成员) 
	[44] = "通过武林争霸(日常活动),最终胜利者可获得",--//雄霸天下(日常活动-武林争霸，第一名)
--	[45] = "通过可获得",--//万世伟业(试炼推关第一名)[暂时无用]
--	[46] = "通过可获得",--//十大雄才(试炼推关第2-10名)[暂时无用]
	[47] = "通过激活特权卡-贵族特权可获得",--//贵族特权
	[48] = "通过激活特权卡-王者特权可获得",--//王者特权
	[49] = "通过激活特权卡-至尊特权可获得",--//至尊特权
--	[50] = "通过可获得",--//至尊神壕(合服5天总消费榜第1名可获得)[暂时无用]
	[51] = "通过世界BOSS(日常活动),对BOSS最后一刀可获得",--//屠龙高手(日常活动-世界BOSS，最后一击)


------------------------------------------------------------------------------------------------------------
}