
local tb    = {

    book_cg_ysjh = --云生结海
    {
		addstartskill={4510,4553,{{1,1},{10,10}}},
		userdesc_000={4553},
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_cg_ysjh_child = --云生结海_子
    {
		recover_life_v={{{1,300},{10,600}},15},		--每秒一次回复生命值，共8次。（间隔与次数与主动技能的BUFF一样）
		skill_statetime={{{1,2},{10,2}}},
    },
    book_cg_mid_ysjh = --云生结海--中级
    {
		addstartskill={4510,4559,{{1,1},{10,10},{15,15}}},
		addms_life1={4508,{{1,0},{10,0},{11,15*1},{15,15*5}}},		--增加主技能子弹存活时间
		add_state_time1={4509,{{1,0},{10,0},{11,15*1},{15,15*5}}},  --增加云生结海_自身持续时间
		addms_life2={4559,{{1,0},{10,0},{11,15*1},{15,15*5}}},		--增加秘籍子弹存活时间，用于回复生命
		userdesc_000={4559},
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_cg_mid_ysjh_child = --云生结海_子--中级
    {
		recover_life_v={{{1,300},{10,600},{15,800}},15},		--每秒一次回复生命值，共8次。（间隔与次数与主动技能的BUFF一样）
		skill_statetime={{{1,2},{10,2}}},
    },
    book_cg_high_ysjh = --云生结海--高级
    {
		addstartskill={4510,4565,{{1,1},{10,10}}},
		addms_life1={4508,{{1,0},{10,0},{11,15*1},{15,15*5},{20,15*5}}},		--增加主技能子弹存活时间
		add_state_time1={4509,{{1,0},{10,0},{11,15*1},{15,15*5},{20,15*5}}}, 	--增加云生结海_自身持续时间
		addms_life2={4559,{{1,0},{10,0},{11,15*1},{15,15*5},{20,15*5}}},		--增加秘籍子弹存活时间，用于回复生命
		addvanishskill1={4508,4566,{{1,1},{10,10},{15,15},{20,20}}},			--BUFF消失，触发伤害
		userdesc_000={4565,4566},
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_cg_high_ysjh_child1 = --云生结海_子--高级
    {
		recover_life_v={{{1,300},{10,600},{15,800},{20,1000}},15},		--每秒一次回复生命值，共8次。（间隔与次数与主动技能的BUFF一样）
		skill_statetime={{{1,2},{10,2}}},
    },
    book_cg_high_ysjh_child2 = --云生结海_伤害--高级
    {
		attack_usebasedamage_p={{{1,0},{15,0},{16,40},{20,200}}},
		attack_earthdamage_v={
			[1]={{1,0},{15,0},{16,250*0.9},{20,500*0.9}},
			[3]={{1,0},{15,0},{16,250*1.1},{20,500*1.1}}
			},
		missile_hitcount={{{1,5},{20,5}}},
    },
	
    book_cg_jzyt = --江逐月天
    {
		add_usebasedmg_p1={4519,{{1,2},{10,20}}},
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_cg_mid_jzyt = --江逐月天--中级
    {
		add_usebasedmg_p1={4519,{{1,2},{10,20},{15,25}}},		--增加攻击力%
		deccdtime={4518,{{1,0},{10,0},{11,15*1},{15,15*5}}},	--减技能CD
		skill_statetime={{{1,-1},{15,-1}}},
    },
    book_cg_high_jzyt = --江逐月天--高级
    {
		add_usebasedmg_p1={4519,{{1,2},{10,20},{15,25},{20,25}}},		--增加攻击力%
		deccdtime={4518,{{1,0},{10,0},{11,15*1},{15,15*5},{20,15*5}}},	--减技能CD
		addstartskill={4521,4570,{{1,1},{10,10},{20,20}}},
		userdesc_000={4570},
		skill_statetime={{{1,-1},{20,-1}}},
    },
	book_cg_high_jzyt_child = --江逐月天_拉回--高级
    {
		state_drag_attack={{{1,0},{15,0},{16,10},{20,50}},8,70},		--几率，时间，速度
		skill_drag_npclen={70},
    },
}

FightSkill:AddMagicData(tb)