
local tb    = {
    book_kl_xrzl = --仙人指路--初级
    { 
		addstartskill={4106,4134,{{1,1},{10,10}}},					--释放仙人指路后增加buff
		userdesc_000={4134},
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_kl_xrzl_child = --仙人指路_子--初级
    { 
		attackspeed_v={{{1,5},{10,30}}},
		deadlystrike_p={{{1,20},{10,50}}},
		skill_statetime={{{1,15*5},{10,15*5}}},
    },
    book_kl_xfslj = --啸风三连击--初级
    { 
		add_usebasedmg_p1={4110,{{1,3},{10,10}}},					--增加啸风三连击攻击力
		skill_statetime={{{1,-1},{10,-1}}},	
    },
    book_kl_hdjz = --混沌剑阵--初级
    { 
		addms_life1={4108,{{1,15*0.5},{10,15*2}}},  				--增加混沌子弹存活时间
		addstartskill={4108,4137,{{1,1},{10,10}}},					--释放混沌剑阵后增加跑速
		userdesc_000={4137},	
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_kl_hdjz_child = --混沌剑阵_子--初级
    { 
		runspeed_v={{{1,5},{10,20}}},
		skill_statetime={{{1,15*9},{4,15*9},{5,15*10},{9,15*10},{10,15*11}}},
    },
    book_kl_ldjt = --雷动九天--初级
    { 
		add_usebasedmg_p1={4112,{{1,5},{10,20}}},					--增加雷动九天1攻击力
		add_usebasedmg_p2={4113,{{1,5},{10,20}}},					--增加雷动九天2攻击力
		add_igdefense_v1={4112,{{1,20},{10,100}}},  				--增加忽闪点数
		add_igdefense_v2={4113,{{1,20},{10,100}}},  				--增加忽闪点数
		skill_statetime={{{1,-1},{10,-1}}},	
    },
    book_kl_mid_xrzl = --仙人指路--中级
    { 
		addstartskill={4106,4140,{{1,1},{10,10},{15,15}}},			--释放仙人指路后增加buff
		userdesc_000={4140},
		add_stun_t={4107,{{1,0},{10,0},{11,15*0.2},{15,15*1}}},		--增加仙人指路造成眩晕的时间
		skill_statetime={{{1,-1},{10,-1},{15,-1}}},
    },
    book_kl_mid_xrzl_child = --仙人指路_子--中级
    { 
		attackspeed_v={{{1,5},{10,30},{15,35}}},
		deadlystrike_p={{{1,20},{10,50},{15,70}}},
		skill_statetime={{{1,15*5},{10,15*5},{15,15*5}}},
    },
    book_kl_mid_xfslj = --啸风三连击--中级
    { 
		add_usebasedmg_p1={4110,{{1,3},{10,10},{11,12},{15,15}}},					--增加啸风三连击攻击力
		add_igdefense_v1={4110,{{1,0},{10,0},{11,50},{15,200}}},  	--增加忽闪点数
		add_stun_r={4110,{{1,0},{10,0},{11,5},{15,15}}},			--增加啸风三连击造成眩晕的几率
		add_stun_t={4110,{{1,0},{10,0},{11,5},{15,15}}},			--增加啸风三连击造成眩晕的时间
		skill_statetime={{{1,-1},{10,-1}}},	
    },
    book_kl_mid_hdjz = --混沌剑阵--中级
    { 
		addms_life1={4108,{{1,15*0.5},{10,15*2},{15,15*2}}},  			--增加混沌子弹存活时间
		addstartskill={4108,4143,{{1,1},{10,10},{15,15}}},				--释放混沌剑阵后增加跑速
		userdesc_000={4143},	
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_kl_mid_hdjz_child = --混沌剑阵_子--中级
    { 
		runspeed_v={{{1,5},{6,10},{10,20},{15,25}}},
		resist_allseriesstate_rate_v={{{1,0},{10,0},{11,20},{15,70}}},								--抗属性效果的几率
		resist_allspecialstate_rate_v={{{1,0},{10,0},{11,20},{15,70}}},							--抗负面效果的几率
		skill_statetime={{{1,15*9},{4,15*9},{5,15*10},{9,15*10},{10,15*11},{15,15*11}}},
    },
    book_kl_mid_ldjt = --雷动九天--中级
    { 
		add_usebasedmg_p1={4112,{{1,5},{10,20},{15,30}}},					--增加雷动九天1攻击力
		add_usebasedmg_p2={4113,{{1,5},{10,20},{15,30}}},					--增加雷动九天2攻击力
		add_igdefense_v1={4112,{{1,20},{10,100},{11,120},{15,200}}},  		--增加忽闪点数
		add_igdefense_v2={4113,{{1,20},{10,100},{11,120},{15,200}}},  		--增加忽闪点数
		deccdtime={4112,{{1,0},{10,0},{11,15*1},{15,15*5}}},				--减雷动九天的CD
		skill_statetime={{{1,-1},{10,-1}}},	
    },
    book_kl_high_xrzl = --仙人指路--高级
    { 
		addstartskill={4106,4146,{{1,1},{10,10},{15,15},{20,20}}},						--释放仙人指路后增加buff
		userdesc_000={4146},
		add_stun_t={4107,{{1,0},{10,0},{11,15*0.2},{15,15*1},{20,15*1}}},		--增加仙人指路造成眩晕的时间
		add_usebasedmg_p1={4107,{{1,0},{15,10},{16,15},{20,50}}},					--增加仙人指路攻击力
		skill_statetime={{{1,-1},{10,-1},{15,-1}}},
    },
    book_kl_high_xrzl_child = --仙人指路_子--高级
    { 
		attackspeed_v={{{1,5},{10,30},{15,35},{20,35}}},
		deadlystrike_p={{{1,20},{10,50},{15,70},{20,90}}},
		skill_statetime={{{1,15*5},{10,15*5},{15,15*5},{20,15*5}}},
    },
    book_kl_high_xfslj = --啸风三连击--高级
    { 
		add_usebasedmg_p1={4110,{{1,3},{10,10},{11,12},{15,15},{20,18}}},					--增加啸风三连击攻击力
		add_igdefense_v1={4110,{{1,0},{10,0},{11,60},{15,200},{20,300}}},  					--增加忽闪点数
		add_stun_r={4110,{{1,0},{10,0},{11,5},{15,15},{20,15}}},							--增加啸风三连击造成眩晕的几率
		add_stun_t={4110,{{1,0},{10,0},{11,5},{15,15},{20,15}}},							--增加啸风三连击造成眩晕的时间
		add_deadlystrike_v1={{{1,0},{15,20},{16,25},{20,100}}},						--增加啸风三连击会心一击
		skill_statetime={{{1,-1},{10,-1}}},	
    },
    book_kl_high_hdjz = --混沌剑阵--高级
    { 
		addms_life1={4108,{{1,15*0.5},{10,15*2},{15,15*2},{20,15*2}}},  						--增加混沌子弹存活时间
		addstartskill={4108,4150,{{1,1},{10,10},{15,15},{20,20}}},							--释放混沌剑阵后增加跑速
		userdesc_000={4150},	
		add_usebasedmg_p1={4109,{{1,0},{15,2},{16,3},{20,8}}},							--增加混沌剑阵攻击力	
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_kl_high_hdjz_child = --混沌剑阵_子--高级
    { 
		runspeed_v={{{1,5},{6,10},{10,20},{15,25},{20,30}}},
		resist_allseriesstate_rate_v={{{1,0},{10,0},{11,20},{15,70},{20,100}}},							--抗属性效果的几率
		resist_allspecialstate_rate_v={{{1,0},{10,0},{11,20},{15,70},{20,100}}},							--抗负面效果的几率
		skill_statetime={{{1,15*9},{10,15*11},{15,15*11},{20,15*11}}},	
    },
    book_kl_high_ldjt = --雷动九天--高级
    { 
		add_usebasedmg_p1={4112,{{1,5},{10,20},{15,35},{20,35}}},					--增加雷动九天1攻击力
		add_usebasedmg_p2={4113,{{1,5},{10,20},{15,35},{20,35}}},					--增加雷动九天2攻击力
		add_igdefense_v1={4112,{{1,20},{10,100},{11,120},{15,200},{20,240}}},  		--增加忽闪点数
		add_igdefense_v2={4113,{{1,20},{10,100},{11,120},{15,200},{20,240}}},  		--增加忽闪点数
		deccdtime={4112,{{1,0},{10,0},{11,15*1},{15,15*5},{20,15*5}}},				--减雷动九天的CD
		add_stun_t={4112,{{1,0},{15,0},{16,15*0.2},{20,15*1}}},						--增加雷动九天1的造成眩晕的时间
		skill_statetime={{{1,-1},{10,-1}}},	
    },

}

FightSkill:AddMagicData(tb)