
local tb    = {
    book_tm_csc = --缠身刺--初级
    { 
		add_usebasedmg_p1={4007,{{1,5},{10,20}}},					--增加缠身刺攻击力
		add_zhican_t={4007,{{1,5},{10,15}}},						--增加缠身刺造成致残时间
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_tm_bylh = --暴雨梨花--初级
    { 
		add_usebasedmg_p1={4008,{{1,5},{10,20}}},					--增加暴雨梨花主飞镖攻击力
		add_usebasedmg_p2={4009,{{1,5},{10,20}}},					--增加暴雨梨花1轮散飞镖攻击力
		add_usebasedmg_p3={4022,{{1,5},{10,20}}},					--增加暴雨梨花2轮散飞镖攻击力
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_tm_myz = --迷影纵--初级
    { 
		addstartskill={4010,4040,{{1,1},{10,10}}},					--释放迷影纵后增加buff
		userdesc_000={4040},	
		skill_statetime={{{1,-1},{10,-1}}},		
    },
    book_tm_myz_child = --迷影纵_攻击力--初级
    { 
		physics_potentialdamage_p={{{1,5},{10,15}}},			--每1层攻击力
		superposemagic={{{1,3},{10,5}}},						--叠加层数
		skill_statetime={{{1,15*12},{10,15*12}}},
    },
    book_tm_jgfx = --九宫飞星--初级
    {						
		add_igdefense_v1={4013,{{1,50},{10,200}}},  				--增加忽闪点数
		add_deadlystrike_v1={4013,{{1,10},{10,40}}},  				--增加会心一击点数
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_tm_mid_csc = --缠身刺--中级
    { 
		add_usebasedmg_p1={4007,{{1,5},{10,20},{15,25}}},				--增加缠身刺攻击力
		add_zhican_t={4007,{{1,5},{10,15},{11,15},{15,20}}},			--增加缠身刺造成致残时间
		add_skill_max_ms1={4006,{{1,1},{6,1},{10,1},{11,1},{15,2}}},	--增加缠身刺最大布置数量
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_tm_mid_bylh = --暴雨梨花--中级
    { 
		add_usebasedmg_p1={4008,{{1,5},{10,20},{15,25}}},					--增加暴雨梨花主飞镖攻击力
		add_usebasedmg_p2={4009,{{1,5},{10,20},{15,25}}},					--增加暴雨梨花1轮散飞镖攻击力
		add_usebasedmg_p3={4022,{{1,5},{10,20},{15,25}}},					--增加暴雨梨花2轮散飞镖攻击力
		add_igdefense_v1={4008,{{1,0},{10,0},{11,50},{15,200}}},  			--增加主飞镖忽闪点数
		add_igdefense_v2={4009,{{1,0},{10,0},{11,50},{15,200}}},  			--增加1轮散飞镖忽闪点数
		add_igdefense_v3={4022,{{1,0},{10,0},{11,50},{15,200}}},  			--增加2轮散飞镖忽闪点数
		add_deadlystrike_v1={4008,{{1,0},{10,0},{11,20},{15,50}}},  		--增加主飞镖会心一击点数
		add_deadlystrike_v2={4009,{{1,0},{10,0},{11,20},{15,50}}},  		--增加1轮散飞镖会心一击点数
		add_deadlystrike_v3={4022,{{1,0},{10,0},{11,20},{15,50}}},  		--增加2轮散飞镖会心一击点数
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_tm_mid_myz = --迷影纵--中级
    { 
		addstartskill={4010,4045,{{1,1},{10,10},{15,15}}},					--释放迷影纵后增加buff
		userdesc_000={4045},		
		skill_statetime={{{1,-1},{10,-1}}},		
    },
    book_tm_mid_myz_child1 = --迷影纵_攻击力--中级
    { 
		physics_potentialdamage_p={{{1,5},{10,15},{11,16},{15,18}}},			--每1层攻击力
		superposemagic={{{1,3},{10,5},{15,6}}},									--叠加层数
		autoskill={56,{{1,1},{10,10},{15,15}}},		
		userdesc_101={{{1,0},{10,0},{11,20},{15,80}}},					--触发概率的描述，实际触发概率于aotuskill.tab中设置		
		userdesc_102={{{1,0},{10,0},{11,15*1},{15,15*2}}},				--免疫属性效果的描述，实际时间要与book_tm_mid_myz_child2中的一致
		skill_statetime={{{1,15*12},{10,15*12},{15,15*12}}},
    },
    book_tm_mid_myz_child2 = --迷影纵_清属性--中级
    { 
		ignore_series_state={},	
		skill_statetime={{{1,0},{10,0},{11,15*1},{15,15*2}}},
    },
    book_tm_mid_jgfx = --九宫飞星--中级
    {						
		add_igdefense_v1={4013,{{1,50},{10,200},{11,200},{15,300}}},  				--增加忽闪点数
		add_deadlystrike_v1={4013,{{1,10},{10,40},{11,45},{15,60}}},  				--增加会心一击点数
		deccdtime={4012,{{1,0},{10,0},{11,15*1},{15,15*5}}},
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_tm_high_csc = --缠身刺--高级
    { 
		add_usebasedmg_p1={4007,{{1,5},{10,20},{15,25},{20,30}}},				--增加缠身刺攻击力
		add_zhican_t={4007,{{1,5},{10,15},{11,15},{15,20},{20,20}}},			--增加缠身刺造成致残时间
		add_skill_max_ms1={4006,{{1,1},{6,1},{10,1},{11,1},{15,2},{20,3}}},		--增加缠身刺最大布置数量
		add_deadlystrike_v1={4007,{{1,0},{15,0},{16,20},{20,100}}},				--增加会心点数	
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_tm_high_bylh = --暴雨梨花--高级
    { 
		add_usebasedmg_p1={4008,{{1,5},{10,20},{15,25},{20,30}}},					--增加暴雨梨花主飞镖攻击力
		add_usebasedmg_p2={4009,{{1,5},{10,20},{15,25},{20,30}}},					--增加暴雨梨花1轮散飞镖攻击力
		add_usebasedmg_p3={4022,{{1,5},{10,20},{15,25},{20,30}}},					--增加暴雨梨花2轮散飞镖攻击力
		add_igdefense_v1={4008,{{1,0},{10,0},{11,50},{15,200},{20,300}}},  			--增加主飞镖忽闪点数
		add_igdefense_v2={4009,{{1,0},{10,0},{11,50},{15,200},{20,300}}},  			--增加1轮散飞镖忽闪点数
		add_igdefense_v3={4022,{{1,0},{10,0},{11,50},{15,200},{20,300}}},  			--增加2轮散飞镖忽闪点数
		add_deadlystrike_v1={4008,{{1,0},{10,0},{11,20},{15,50},{20,70}}},  		--增加主飞镖会心一击点数
		add_deadlystrike_v2={4009,{{1,0},{10,0},{11,20},{15,50},{20,70}}},  		--增加1轮散飞镖会心一击点数
		add_deadlystrike_v3={4022,{{1,0},{10,0},{11,20},{15,50},{20,70}}},  		--增加2轮散飞镖会心一击点数
		add_skill_point1={4008,{{1,0},{15,0},{16,100},{19,100},{20,200}}},			--增加累计次数，100=1次
		userdesc_101={4008,{{1,0},{15,0},{16,100},{19,100},{20,200}}},				--描述用，增加累计次数，100=1次		
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_tm_high_myz = --迷影纵--高级
    { 
		addstartskill={4010,4057,{{1,1},{10,10},{15,15},{20,20}}},					--释放迷影纵后增加buff
		userdesc_000={4057},		
		skill_statetime={{{1,-1},{10,-1}}},		
    },
    book_tm_high_myz_child1 = --迷影纵_攻击力--高级
    { 
		physics_potentialdamage_p={{{1,5},{10,15},{11,16},{15,18},{20,20}}},			--每1层攻击力
		superposemagic={{{1,3},{10,5},{15,6},{20,6}}},									--叠加层数
		autoskill={57,{{1,1},{10,10},{15,15},{20,20}}},		
		userdesc_101={{{1,0},{10,0},{11,20},{15,80},{20,100},{21,100}}},				--触发概率的描述，实际触发概率于aotuskill.tab中设置		
		userdesc_102={{{1,0},{10,0},{11,15*1},{15,15*2},{20,15*3}}},					--免疫属性效果的描述，实际时间要与book_tm_mid_myz_child2中的一致
		defense_v={{{1,0},{15,0},{16,50},{20,200}}},									--每1层闪避
		skill_statetime={{{1,15*12},{10,15*12},{15,15*12},{20,15*12}}},
    },
    book_tm_high_myz_child2 = --迷影纵_清属性--高级
    { 
		ignore_series_state={},	
		skill_statetime={{{1,0},{10,0},{11,15*1},{15,15*2},{20,15*3}}},
    },
    book_tm_high_jgfx = --九宫飞星--高级
    {						
		add_igdefense_v1={4013,{{1,50},{10,200},{11,200},{15,300},{20,350}}},  			--增加忽闪点数
		add_deadlystrike_v1={4013,{{1,10},{10,40},{11,45},{15,60},{20,60}}},  			--增加会心一击点数
		deccdtime={4012,{{1,0},{10,0},{11,15*1},{15,15*5},{20,15*5}}},
		add_usebasedmg_p1={4013,{{1,0},{15,2},{16,3},{20,10}}},							--每1枚子弹的攻击力
		skill_statetime={{{1,-1},{10,-1}}},
    },

}

FightSkill:AddMagicData(tb)