
local tb    = {
    book_tw_tgzq = --野蛮冲撞
    {
		add_hitskill1={207,217,{{1,1},{10,10}}},
		userdesc_000={217},
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_tw_tgzq_child  = --野蛮冲撞_子
    {
		attackspeed_v={{{1,20},{10,50}}},
		deadlystrike_p={{{1,20},{10,70}}},
		deadlystrike_v={{{1,50},{10,150}}},
		skill_statetime={{{1,15*3},{10,15*5}}},
    },
    book_tw_qgbh = --血战八方
    {
		add_usebasedmg_p1={211,{{1,3},{10,30}}},						--增加血战八方攻击力%
		add_metaldamage_v1={211,{{1,20},{10,200}}},						--增加血战八方攻击力
		--add_hitskill1={211,223,{{1,1},{10,10}}},
		--userdesc_000={223},
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_tw_bdrs = --霸王怒吼
    {
		add_hitskill1={208,221,{{1,1},{10,10}}},
		userdesc_000={221},
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_tw_bdrs_child = --霸王怒吼_子
    {
		defuse_damage={{{1,10},{10,60}},30},
		superposemagic={{{1,5},{10,5}}},
		skill_statetime={{{1,15*4},{10,15*8}}},
    },
    book_tw_new = --金钟罩
    {
		addstartskill={213,254,{{1,1},{10,10}}},
		userdesc_000={254},
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_tw_new_child  = --天王新秘籍_子
    {
		all_series_resist_p={{{1,20},{10,100}}},
		all_series_resist_v={{{1,20},{10,100}}},
		skill_statetime={{{1,15*15},{10,15*15}}},
    },
    book_tw_mid_new = --中级金钟罩
    {
		addstartskill={213,256,{{1,1},{10,10},{15,15}}},
		add_state_time1={213,{{1,0},{10,0},{11,15*1},{15,15*5}}},  			--增加金钟罩持续时间
		--userdesc_101={213,{{1,0},{10,0},{11,15*1},{15,15*5}}},  				--描述用：增加金钟罩持续时间
		userdesc_000={256},
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_tw_mid_new_child  = --中级金钟罩_子
    {
		all_series_resist_p={{{1,20},{10,100},{11,100},{15,120}}},
		all_series_resist_v={{{1,20},{10,100},{11,100},{15,200}}},
		skill_statetime={{{1,15*15},{10,15*15},{11,15*15.5},{15,15*20}}},
    },
    book_tw_mid_tgzq = --中级野蛮冲撞
    {
		add_hitskill1={207,258,{{1,1},{10,10},{15,15}}},
		userdesc_000={258},
		add_usebasedmg_p1={207,{{1,0},{10,0},{11,5},{15,30}}},					--增加野蛮冲撞攻击力
		--userdesc_101={207,{{1,0},{10,0},{11,5},{15,30}}},						--描述用：增加野蛮冲撞攻击力
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_tw_mid_tgzq_child  = --中级野蛮冲撞_子
    {
		attackspeed_v={{{1,20},{10,50},{15,60}}},
		deadlystrike_p={{{1,20},{10,70},{15,80}}},
		deadlystrike_v={{{1,50},{10,150},{15,200}}},
		skill_statetime={{{1,15*3},{10,15*5},{15,15*7}}},
    },
    book_tw_mid_qgbh = --中级血战八方
    {
		add_usebasedmg_p1={211,{{1,3},{10,30},{15,30}}},						--增加血战八方攻击力%
		add_metaldamage_v1={211,{{1,20},{10,200},{15,200}}},					--增加血战八方攻击力
		add_igdefense_p1={211,{{1,0},{10,0},{11,50},{15,200}}},  				--增加忽闪
		add_deadlystrike_v1={211,{{1,0},{10,0},{11,50},{15,200}}},  			--增加会心一击
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_tw_mid_bdrs = --中级霸王怒吼
    {
		add_hitskill1={208,245,{{1,1},{10,10},{20,20}}},
		userdesc_000={245},
		add_usebasedmg_p1={208,{{1,0},{10,0},{11,5},{15,30}}},					--增加霸王怒吼攻击力
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_tw_mid_bdrs_child = --中级霸王怒吼_子
    {
		defuse_damage={{{1,10},{10,60},{15,80}},30},
		superposemagic={{{1,5},{10,5},{15,5}}},
		skill_statetime={{{1,15*4},{10,15*8},{15,15*10}}},
    },
    book_tw_high_jzz = --高级金钟罩
    {
		addstartskill={213,3450,{{1,1},{10,10},{15,15},{20,20}}},
		add_state_time1={213,{{1,0},{10,0},{11,15*1},{15,15*5},{20,15*6}}},  			--增加金钟罩持续时间
		userdesc_000={3450},
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_tw_high_jzz_child  = --高级金钟罩_子
    {
		all_series_resist_p={{{1,20},{10,100},{11,100},{15,120},{20,150}}},
		all_series_resist_v={{{1,20},{10,100},{11,100},{15,200},{20,250}}},
		lifereplenish_p={{{1,0},{15,0},{16,5},{20,15}}},
		skill_statetime={{{1,15*15},{10,15*15},{11,15*15.5},{15,15*20},{20,15*21}}},
    },
    book_tw_high_tgzq = --高级野蛮冲撞
    {
		add_hitskill1={207,3452,{{1,1},{10,10},{15,15},{20,20}}},
		userdesc_000={3452},
		add_usebasedmg_p1={207,{{1,0},{10,0},{11,5},{15,30},{20,40}}},					--增加野蛮冲撞攻击力
		add_igdefense_p1={207,{{1,0},{15,0},{16,20},{20,100}}},  						--增加忽闪%
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_tw_high_tgzq_child  = --高级野蛮冲撞_子
    {
		attackspeed_v={{{1,20},{10,50},{15,60},{20,80}}},
		deadlystrike_p={{{1,20},{10,70},{15,80},{20,80}}},
		deadlystrike_v={{{1,50},{10,150},{15,200},{20,200}}},
		skill_statetime={{{1,15*3},{10,15*5},{15,15*7},{20,15*7}}},
    },
    book_tw_high_qgbh = --高级血战八方
    {
		add_usebasedmg_p1={211,{{1,3},{10,20},{15,30},{20,40}}},						--增加血战八方攻击力%
		add_metaldamage_v1={211,{{1,20},{10,200},{15,200},{20,300}}},					--增加血战八方攻击力
		--userdesc_101={211,{{1,20},{10,200},{15,200},{20,250}}},							--增加血战八方攻击力
		add_igdefense_p1={211,{{1,0},{10,0},{11,50},{15,200},{20,250}}},  				--增加忽闪
		add_deadlystrike_v1={211,{{1,0},{10,0},{11,50},{15,200},{20,300}}},  			--增加会心一击
		addstartskill={212,3446,{{1,1},{10,10},{20,20}}},
		userdesc_000={3446},
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_tw_high_qgbh_child = --高级血战八方_子
    {
		runspeed_v={{{1,0},{15,0},{16,5},{20,25}}},									--增加移动速度
		skill_statetime={{{1,15*7},{10,15*7},{15,15*7},{20,15*7}}},
    },
    book_tw_high_bdrs = --高级霸王怒吼
    {
		add_hitskill1={208,3448,{{1,1},{10,10},{20,20}}},
		userdesc_000={3448},
		add_usebasedmg_p1={208,{{1,0},{10,0},{11,5},{15,30},{20,60}}},					--增加霸王怒吼攻击力
		add_hurt_r={208,{{1,0},{15,0},{16,5},{20,20}}},  								--增加受伤几率
		add_hurt_t={208,{{1,0},{15,0},{16,15*0.5},{20,15*1.5}}},  						--增加受伤时间
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_tw_high_bdrs_child = --高级霸王怒吼_子
    {
		defuse_damage={{{1,10},{10,60},{15,80},{20,200}},40},
		superposemagic={{{1,5},{10,5},{15,5},{20,5}}},
		skill_statetime={{{1,15*4},{10,15*8},{15,15*10},{20,15*12}}},
    },
}

FightSkill:AddMagicData(tb)