
local tb    = {
    book_tr_hlfh = --魔焰在天
    { 
		add_usebasedmg_p1={707,{{1,4},{10,40}}},			--增加魔焰在天攻击力%
		userdesc_101={{{1,4},{10,40}}},						--描述用，增加魔焰在天攻击力%
		add_firedamage_v1={707,{{1,5},{10,50}}},			--增加魔焰在天攻击力
		userdesc_102={{{1,5},{10,50}}},						--描述用，增加魔焰在天攻击力	
		add_hitskill1={707,731,{{1,1},{10,10}}},
		skill_statetime={{{1,-1},{10,-1}}},
		userdesc_000={731},		
    },
    book_tr_hlfh_child = --魔焰在天_子
    { 
		defense_v={{{1,-20},{10,-200}}},
		skill_statetime={{{1,15*10},{10,15*10}}},
    },
    book_tr_fhwj = --血月之影
    { 
		addstartskill={711,733,{{1,1},{10,10}}},
		addstartskill2={713,755,{{1,1},{10,10}}},
		skill_statetime={{{1,-1},{10,-1}}},
		userdesc_000={733},	
		userdesc_101={{{1,15*2},{15,15*5}}},			--假描述，真实效果查看book_tr_fhwj_child2中的时间
    },
    book_tr_fhwj_child1 = --血月之影_子1
    { 
		defense_p={{{1,100},{10,500}}},
		ignore_series_state={},		
		skill_statetime={{{1,15*15},{15,15*20}}},
    },
    book_tr_fhwj_child2 = --血月之影_子2
    { 
		ignore_series_state={},		
		skill_statetime={{{1,15*2},{15,15*5}}},
    },
    book_tr_lmdh = --摄魂乱心
    { 
		add_hitskill1={723,735,{{1,1},{10,10}}},
		skill_statetime={{{1,-1},{10,-1}}},
		userdesc_000={735},	
    },
    book_tr_lmdh_child = --摄魂乱心_子
    { 
		defense_v={{{1,-100},{10,-500}}},
		all_series_resist_v={{{1,-50},{10,-200}}},	
		skill_statetime={{{1,15*5},{10,15*5}}},
    },
    book_tr_new = --死亡回旋
    {
		add_igdefense_p1={709,{{1,50},{10,200}}},  				--增加忽闪%
		userdesc_101={709,{{1,5},{10,200}}},  					--描述用：增加忽闪
		add_deadlydmg_p1={709,{{1,5},{10,15}}},  				--增加会心伤害
		userdesc_102={709,{{1,5},{10,15}}},  					--描述用：增加会心伤害
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_tr_mid_new = --中级死亡回旋
    {
		add_usebasedmg_p1={709,{{1,0},{10,0},{11,5},{15,30}}},			--增加死亡回旋攻击力
		userdesc_103={709,{{1,0},{10,0},{11,5},{15,30}}},				--描述用：增加死亡回旋攻击力
		add_igdefense_p1={709,{{1,50},{10,200},{15,260}}},  			--增加忽闪%
		userdesc_101={709,{{1,50},{10,000},{20,260}}}, 					--描述用：增加忽闪
		add_deadlydmg_p1={709,{{1,5},{10,15},{15,20}}},  				--增加会心伤害
		userdesc_102={709,{{1,5},{10,15},{15,20}}},  					--描述用：增加会心伤害
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_tr_mid_hlfh = --中级魔焰在天
    { 
		add_palsy_r={707,{{1,0},{10,0},{11,10},{15,30}}},			--增加麻痹几率
		userdesc_103={707,{{1,0},{10,0},{11,10},{15,30}}},			--增加麻痹几率
		add_usebasedmg_p1={707,{{1,4},{10,40},{15,50}}},			--增加魔焰在天攻击力%
		userdesc_101={{{1,4},{10,40},{15,50}}},						--描述用，增加魔焰在天攻击力%
		add_firedamage_v1={707,{{1,5},{10,50},{15,80}}},			--增加魔焰在天攻击力
		userdesc_102={{{1,5},{10,50},{15,80}}},						--描述用，增加魔焰在天攻击力	
		add_hitskill1={707,752,{{1,1},{10,10},{15,15}}},
		skill_statetime={{{1,-1},{10,-1}}},
		userdesc_000={752},	
		userdesc_104={{{1,0},{10,0},{11,15*1},{15,15*1}}},		--假描述，实际情况查看tianren.lua中tr_myzt_child2的state_palsy_attack 26级-35级效果	
    },
    book_tr_mid_hlfh_child = --中级魔焰在天_子
    { 
		defense_v={{{1,-20},{10,-200},{15,-200}}},
		skill_statetime={{{1,15*10},{10,15*10},{15,15*10}}},
    },
    book_tr_mid_fhwj = --中级血月之影
    { 
		addskillhidetime={711,{{1,0},{10,0},{11,15*1},{15,15*5}}},				--增加隐身状态时间
		add_state_time1={711,{{1,0},{10,0},{11,15*1},{15,15*5}}},  				--增加BUFF持续时间
		addstartskill={711,757,{{1,1},{10,10},{20,20}}},
		addstartskill2={713,758,{{1,1},{10,10},{20,20}}},
		skill_statetime={{{1,-1},{10,-1}}},
		userdesc_000={757},	
		userdesc_101={{{1,15*2},{15,15*6}}},			--假描述，真实效果查看book_tr_fhwj_child2中的时间
    },
    book_tr_mid_fhwj_child1 = --中级血月之影_子1
    { 
		defense_p={{{1,100},{10,500},{15,600}}},
		ignore_series_state={},		
		skill_statetime={{{1,15*15},{15,15*20},{15,15*20}}},
    },
    book_tr_mid_fhwj_child2 = --中级血月之影_子2
    { 
		ignore_series_state={},		
		skill_statetime={{{1,15*2},{15,15*6},{15,15*6}}},
    },
    book_tr_mid_lmdh = --中级摄魂乱心
    { 
		deccdtime={722,{{1,0},{10,0},{11,15*1},{15,15*5}}},
		add_hitskill1={723,760,{{1,1},{10,10},{20,20}}},
		skill_statetime={{{1,-1},{10,-1}}},
		userdesc_000={760},	
    },
    book_tr_mid_lmdh_child = --摄魂乱心_子
    { 
		defense_v={{{1,-100},{10,-500},{15,-600}}},
		all_series_resist_v={{{1,-50},{10,-200},{15,-300}}},	
		skill_statetime={{{1,15*5},{10,15*5}}},
    },
    book_tr_high_swhx = --高级死亡回旋
    {
		add_usebasedmg_p1={709,{{1,0},{10,0},{11,5},{15,30},{20,50}}},			--增加死亡回旋攻击力
		add_igdefense_p1={709,{{1,50},{10,200},{15,260},{20,300}}},  			--增加忽闪%
		add_deadlydmg_p1={709,{{1,5},{10,15},{15,20},{20,25}}},  				--增加会心伤害
		add_palsy_r={709,{{1,0},{15,0},{16,10},{20,40}}},						--增加麻痹几率
		add_palsy_t={709,{{1,0},{15,0},{16,15*0.2},{20,15*1.5}}},					--增加麻痹时间
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_tr_high_hlfh = --高级魔焰在天
    { 
		add_palsy_r={707,{{1,0},{10,0},{11,10},{15,30},{20,40}}},			--增加麻痹几率
		add_usebasedmg_p1={707,{{1,4},{10,40},{15,50},{20,90}}},			--增加魔焰在天攻击力%
		add_firedamage_v1={707,{{1,5},{10,50},{15,80},{20,200}}},			--增加魔焰在天攻击力
		userdesc_101={707,{{1,5},{10,50},{15,50},{20,60}}},
		add_hitskill1={707,764,{{1,1},{10,10},{15,15},{20,20}}},
		skill_statetime={{{1,-1},{10,-1}}},
		userdesc_000={764},	
		userdesc_104={{{1,0},{10,0},{11,15*1},{15,15*1},{20,15*1}}},		--假描述，实际情况查看tianren.lua中tr_myzt_child2的state_palsy_attack 26级-35级效果	
    },
    book_tr_high_hlfh_child = --高级魔焰在天_子
    { 
		defense_v={{{1,-20},{10,-200},{15,-200},{20,-500}}},
		all_series_resist_p={{{1,0},{15,0},{16,-50},{20,-200}}},		
		skill_statetime={{{1,15*10},{10,15*10},{15,15*10},{20,15*10}}},
    },
    book_tr_high_fhwj = --高级血月之影
    {
		addskillhidetime={711,{{1,0},{10,0},{11,15*1},{15,15*5},{20,15*6}}},				--增加隐身状态时间
		add_state_time1={711,{{1,0},{10,0},{11,15*1},{15,15*5},{20,15*6}}},  				--增加BUFF持续时间
		addstartskill={711,766,{{1,1},{10,10},{20,20}}},
		addstartskill2={713,767,{{1,1},{10,10},{20,20}}},
		skill_statetime={{{1,-1},{10,-1}}},
		userdesc_000={766},	
		userdesc_101={{{1,15*2},{15,15*6},{20,15*6}}},			--假描述，真实效果查看book_tr_fhwj_child2中的时间
    },
    book_tr_high_fhwj_child1 = --高级血月之影_子1
    { 
		defense_p={{{1,100},{10,500},{15,600},{20,800}}},		--增加闪避%
		ignore_series_state={},		
		runspeed_v={{{1,0},{15,0},{16,5},{20,20}}},			--增加移动速度
		skill_statetime={{{1,15*15},{15,15*20},{20,15*20}}},
    },
    book_tr_high_fhwj_child2 = --高级血月之影_子2
    { 
		ignore_series_state={},		
		skill_statetime={{{1,15*2},{15,15*6},{15,15*6},{20,15*6}}},
    },
    book_tr_high_lmdh = --高级摄魂乱心
    { 
		deccdtime={722,{{1,0},{10,0},{11,15*1},{15,15*5},{20,15*7}}},
		add_hitskill1={723,769,{{1,1},{10,10},{20,20}}},
		add_usebasedmg_p1={723,{{1,0},{15,0},{16,10},{20,40}}},			--增加摄魂乱心攻击力%
		skill_statetime={{{1,-1},{10,-1}}},
		userdesc_000={769},	
    },
    book_tr_high_lmdh_child = --高级摄魂乱心_子
    { 
		defense_v={{{1,-100},{10,-500},{15,-600},{20,-1000}}},
		all_series_resist_v={{{1,-50},{10,-200},{15,-300},{20,-600}}},	
		skill_statetime={{{1,15*5},{10,15*5},{15,15*5},{20,15*5}}},
    },
}

FightSkill:AddMagicData(tb)