
local tb    = {
    book_wd_lyjf = --剑飞惊天
    { 
		autoskill={62,{{1,1},{10,10}}},
		skill_statetime={{{1,-1},{10,-1}}},
		userdesc_000={623},	
    },
    book_wd_lyjf_child = --剑飞惊天_子
    { 
		attack_usebasedamage_p={{{1,100},{10,200},{11,200}}},
		attack_earthdamage_v={
			[1]={{1,200*1},{10,500*0.95},{11,500*0.95}},
			[3]={{1,200*1},{10,500*1.05},{11,500*1.05}}
			},
		state_stun_attack={{{1,100},{10,100}},{{1,15*1},{10,15*1}}},
		state_npcknock_attack={100,15,20},
		spe_knock_param={9 , 4, 26},		
		userdesc_102={{{1,50},{10,80}}},			--假的魔法属性，仅用作描述，此时间需对应autoskill表中的“触发几率”
		missile_hitcount={{{1,6},{10,6}}},
    },
    book_wd_jqzh = --坐忘无我
    { 
		autoskill={63,{{1,1},{10,10}}},
		skill_statetime={{{1,-1},{10,-1}}},
		userdesc_000={625},	
    },
    book_wd_jqzh_child = --坐忘无我_子
    { 
		attack_usebasedamage_p={{{1,100},{10,200},{11,200}}},
		attack_earthdamage_v={
			[1]={{1,100*1},{10,500*1},{11,500*1}},
			[3]={{1,100*1},{10,500*1},{11,500*1}}
			},
		state_stun_attack={{{1,20},{10,40}},{{1,15*1},{10,15*1}}},
    },
    book_wd_qxj = --天地无极
    { 
		add_hitskill1={615,627,{{1,1},{10,10}}},
		add_hitskill2={616,627,{{1,1},{10,10}}},
		--addstartskill={627,628,{{1,1},{10,10}}},
		skill_statetime={{{1,-1},{10,-1}}},
		userdesc_000={627},	
    },
    book_wd_qxj_child1 = --天地无极_减闪避、抗性
    { 
		defense_v={{{1,-100},{10,-500}}},	
		all_series_resist_v={{{1,-50},{10,-200}}},	
		skill_statetime={{{1,15*5},{10,15*20}}},
    },
	
    book_wd_new = --人剑合一
    { 
		add_adddmgbydist={612,{{1,20},{10,100}}},
		userdesc_101={612,{{1,20},{10,100}}},
		add_addstuntimedist={612,{{1,20},{10,50}}},
		userdesc_102={612,{{1,20},{10,50}}},
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_wd_mid_new = --中级人剑合一
    { 
		add_adddmgbydist={612,{{1,20},{10,100},{15,150}}},
		userdesc_101={612,{{1,20},{10,100},{15,150}}},
		add_addstuntimedist={612,{{1,20},{10,50},{15,100}}},
		userdesc_102={612,{{1,20},{10,50},{15,100}}},
		deccdtime={611,{{1,0},{10,0},{11,15*1},{15,15*5}}},
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_wd_mid_lyjf = --中级剑飞惊天
    { 
		add_usebasedmg_p1={610,{{1,0},{10,0},{11,10},{15,60}}},					--增加剑飞惊天攻击力
		userdesc_101={610,{{1,0},{10,0},{11,10},{15,60}}},								--描述用：增加剑飞惊天攻击力
		add_usebasedmg_p2={651,{{1,0},{10,0},{11,10},{15,60}}},					--增加剑飞惊天2攻击力
		userdesc_102={651,{{1,0},{10,0},{11,10},{15,60}}},								--描述用：增加剑飞惊天2攻击力
		autoskill={65,{{1,1},{10,10},{20,20}}},
		skill_statetime={{{1,-1},{10,-1}}},
		userdesc_000={651},	
    },
    book_wd_mid_lyjf_child = --中级剑飞惊天_子
    { 
		attack_usebasedamage_p={{{1,100},{10,200},{15,300}}},
		attack_earthdamage_v={
			[1]={{1,200*1},{10,500*0.95},{15,800*0.95}},
			[3]={{1,200*1},{10,500*1.05},{15,800*1.05}}
			},
		state_stun_attack={{{1,100},{10,100},{15,100}},{{1,15*1},{10,15*1},{15,15*1}}},
		state_npcknock_attack={100,15,20},
		spe_knock_param={9 , 4, 26},		
		userdesc_103={{{1,50},{10,80},{20,80}}},			--假的魔法属性，仅用作描述，此时间需对应autoskill表中的“触发几率”
		missile_hitcount={{{1,6},{15,6}}},
    },
    book_wd_mid_jqzh = --中级坐忘无我
    { 
		add_shield={613,{{1,0},{10,0},{11,2*100},{15,9*100}}},			--增加坐忘无我防御
		userdesc_101={613,{{1,0},{10,0},{11,2*100},{15,9*100}}},			--增加坐忘无我防御
		autoskill={66,{{1,1},{10,10},{20,20}}},
		skill_statetime={{{1,-1},{10,-1}}},
		userdesc_000={653},	
    },
    book_wd_mid_jqzh_child = --中级坐忘无我_子
    { 
		attack_usebasedamage_p={{{1,100},{10,200},{15,300}}},
		attack_earthdamage_v={
			[1]={{1,100*1},{10,500*1},{15,800*1}},
			[3]={{1,100*1},{10,500*1},{15,800*1}}
			},
		state_stun_attack={{{1,20},{10,40},{20,40}},{{1,15*1},{10,15*1},{20,15*1}}},
    },
    book_wd_mid_qxj = --中级天地无极
    { 
		deccdtime={615,{{1,0},{10,0},{11,15*1},{15,15*5}}},			--减少天地无极冷却时间
		add_hitskill1={615,655,{{1,1},{10,10},{20,20}}},
		add_hitskill2={616,655,{{1,1},{10,10},{20,20}}},
		skill_statetime={{{1,-1},{10,-1}}},
		userdesc_000={655},	
		userdesc_101={{{1,15*5},{10,15*20},{15,15*20}}},			--假描述，真实效果查看book_wd_mid_qxj_child中的时间
    },
    book_wd_mid_qxj_child = --中级天地无极_减闪避、抗性
    { 
		defense_v={{{1,-100},{10,-500},{15,-700}}},	
		all_series_resist_v={{{1,-50},{10,-200},{15,-300}}},	
		skill_statetime={{{1,15*5},{10,15*20},{15,15*20}}},
    },
    book_wd_high_rjhy = --高级人剑合一
    { 
		add_adddmgbydist={612,{{1,20},{10,100},{15,150},{20,180}}},
		add_addstuntimedist={612,{{1,20},{10,50},{15,100},{20,100}}},
		deccdtime={611,{{1,0},{10,0},{11,15*1},{15,15*5},{20,15*6}}},
		add_usebasedmg_p1={612,{{1,0},{15,0},{16,5},{20,25}}},							--增加人剑合一攻击力
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_wd_high_lyjf = --高级剑飞惊天
    { 
		add_usebasedmg_p1={610,{{1,0},{10,0},{11,10},{15,60},{20,70}}},					--增加剑飞惊天攻击力
		add_usebasedmg_p2={660,{{1,0},{10,0},{11,10},{15,60},{20,70}}},					--增加剑飞惊天2攻击力
		autoskill={69,{{1,1},{10,10},{20,20}}},
		add_igdefense_v1={610,{{1,0},{15,0},{16,40},{20,200}}},							--增加忽闪点数1
		add_igdefense_v2={660,{{1,0},{15,0},{16,40},{20,200}}},							--增加忽闪点数2
		add_deadlystrike_v1={610,{{1,0},{15,0},{16,20},{20,100}}},						--增加会心点数1
		add_deadlystrike_v2={660,{{1,0},{15,0},{16,20},{20,100}}},						--增加会心点数2
		skill_statetime={{{1,-1},{10,-1}}},
		userdesc_000={660},	
    },
    book_wd_high_lyjf_child = --高级剑飞惊天_子
    { 
		attack_usebasedamage_p={{{1,100},{10,200},{15,300},{20,350}}},
		attack_earthdamage_v={
			[1]={{1,200*1},{10,500*0.95},{15,800*0.95},{20,900*0.95}},
			[3]={{1,200*1},{10,500*1.05},{15,800*1.05},{20,900*0.95}}
			},
		state_stun_attack={{{1,100},{10,100},{15,100},{20,100}},{{1,15*1},{10,15*1},{15,15*1},{20,15*1}}},
		state_npcknock_attack={100,15,20},
		spe_knock_param={9 , 4, 26},		
		userdesc_103={{{1,50},{10,80},{20,80}}},			--假的魔法属性，仅用作描述，此时间需对应autoskill表中的“触发几率”
		missile_hitcount={{{1,6},{15,6}}},
    },
    book_wd_high_jqzh = --高级坐忘无我
    { 
		add_shield={613,{{1,0},{10,0},{11,2*100},{15,9*100},{20,9.5*100}}},			--增加坐忘无我防御
		autoskill={70,{{1,1},{10,10},{20,20}}},
		add_stun_t={662,{{1,0},{15,0},{16,3},{20,10}}},								--增加眩晕时间	
		skill_statetime={{{1,-1},{10,-1}}},
		userdesc_000={662},	
    },
    book_wd_high_jqzh_child = --高级坐忘无我_子
    { 
		attack_usebasedamage_p={{{1,100},{10,200},{15,300},{20,320}}},
		attack_earthdamage_v={
			[1]={{1,100*1},{10,500*1},{15,800*1},{20,850*1}},
			[3]={{1,100*1},{10,500*1},{15,800*1},{20,850*1}}
			},
		state_stun_attack={{{1,20},{10,40},{20,40}},{{1,15*1},{10,15*1},{20,15*1}}},
    },
    book_wd_high_qxj = --高级天地无极
    { 
		deccdtime={615,{{1,0},{10,0},{11,15*1},{15,15*5},{20,15*6}}},			--减少天地无极冷却时间
		add_hitskill1={615,664,{{1,1},{10,10},{20,20}}},
		add_hitskill2={616,664,{{1,1},{10,10},{20,20}}},
		add_usebasedmg_p1={615,{{1,0},{15,0},{16,5},{20,20}}},			--增加天地无极1攻击力
		add_usebasedmg_p2={616,{{1,0},{15,0},{16,5},{20,20}}},			--增加天地无极2攻击力
		skill_statetime={{{1,-1},{10,-1}}},
		userdesc_000={664},	
		userdesc_101={{{1,15*5},{10,15*20},{15,15*20},{20,15*20}}},			--假描述，真实效果查看book_wd_high_qxj_child中的时间
    },
    book_wd_high_qxj_child = --高级天地无极_减闪避、抗性
    { 
		defense_v={{{1,-100},{10,-500},{15,-700},{20,-800}}},	
		all_series_resist_v={{{1,-50},{10,-200},{15,-300},{20,-350}}},	
		skill_statetime={{{1,15*5},{10,15*20},{15,15*20},{20,15*20}}},
    },
}

FightSkill:AddMagicData(tb)