
local tb    = {
    book_wudu_yfsg = --阴风蚀骨
    { 
		add_igdefense_p1={4309,{{1,3},{10,35}}},					--增加忽闪点数
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_wudu_zhdc = --召唤毒虫
    { 
		addcall_npcdmg={4313,{{1,10},{10,36}}},						--增加(灵蛇)攻击
		addcall_npcdmg1={4315,{{1,10},{10,36}}},					--增加(碧蟾)攻击	
		addcall_npcdmg2={4317,{{1,10},{10,36}}},					--增加(赤蝎)攻击
		addcall_npcdmg3={4319,{{1,10},{10,36}}},					--增加(风蜈)攻击
		addcall_npcdmg4={4321,{{1,10},{10,36}}},					--增加(墨蛛)攻击

		--addcall_npclife={4313,{{1,10},{10,30}}},					--增加(碧蟾)血量
		--addcall_npclife1={4315,{{1,10},{10,30}}},					--增加(灵蛇)血量
		--addcall_npclife2={4317,{{1,10},{10,30}}},					--增加(赤蝎)血量
		--addcall_npclife3={4319,{{1,10},{10,30}}},					--增加(风蜈)血量
		--addcall_npclife4={4321,{{1,10},{10,30}}},					--增加(墨蛛)血量

		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_wudu_mxg = --迷心蛊
    { 
		add_recdot_type_p={2,{{1,1},{10,10}}},					--增加受到毒伤%		
		skill_statetime={{{1,-1},{10,-1}}},		
    },
    book_wudu_wgsx = --万蛊蚀心
    {						
		add_usebasedmg_p1={4339,{{1,2},{10,20}}},  								--增加正常攻击：技能ID，增加%
		--add_dotdamage_wood={4339,{{1,2},{10,20}},{{1,0},{10,0}}},  			--增加毒攻：技能ID，增加%，增加点数
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_wudu_mid_yfsg = --中级阴风蚀骨
    { 
		add_igdefense_p1={4309,{{1,3},{10,35},{15,40}}},								--增加忽闪比例
		add_dotdamage_wood={4309,{{1,0},{10,0},{11,2},{15,10}},{{1,0},{15,0}}},  		--增加毒攻：技能ID，增加%，增加点数
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_wudu_mid_zhdc = --中级召唤毒虫
    { 
		addcall_npcdmg={4313,{{1,10},{10,36},{15,36}}},						--增加(灵蛇)攻击
		addcall_npcdmg1={4315,{{1,10},{10,36},{15,36}}},					--增加(碧蟾)攻击
		addcall_npcdmg2={4317,{{1,10},{10,36},{15,36}}},					--增加(赤蝎)攻击
		addcall_npcdmg3={4319,{{1,10},{10,36},{15,36}}},					--增加(风蜈)攻击
		addcall_npcdmg4={4321,{{1,10},{10,36},{15,36}}},					--增加(墨蛛)攻击	
		deccdtime={4312,{{1,0},{10,0},{11,15*1},{15,15*5}}},

		--addcall_npclife={4313,{{1,10},{10,30},{15,30}}},					--增加(灵蛇)血量			
		--addcall_npclife1={4315,{{1,10},{10,30},{15,30}}},					--增加(碧蟾)血量
		--addcall_npclife2={4317,{{1,10},{10,30},{15,30}}},					--增加(赤蝎)血量
		--addcall_npclife3={4319,{{1,10},{10,30},{15,30}}},					--增加(风蜈)血量
		--addcall_npclife4={4321,{{1,10},{10,30},{15,30}}},					--增加(墨蛛)血量

		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_wudu_mid_mxg = --中级迷心蛊
    { 
		add_recdot_type_p={2,{{1,1},{10,10},{15,15}}},								--增加受到毒伤%		
		add_state_time1={4336,{{1,0},{10,0},{11,15*0.5},{15,15*2}}},  				--增加迷心蛊持续时间
		add_state_time2={4335,{{1,0},{10,0},{11,15*0.5},{15,15*2}}}, 	 			--增加迷心蛊毒攻持续时间，此延长时间若改动则下面描述次数也需要改动
		userdesc_109={{{1,0},{10,0},{11,1},{15,5},{20,5}}},							--描述用，增加迷心蛊的毒攻次数
		addms_life1={4335,{{1,0},{10,0},{11,15*0.5},{15,15*2}}},					--增加迷心蛊子弹持续时间（每0.5秒造成致残所用到的子弹）
		skill_statetime={{{1,-1},{10,-1}}},		
    },
    book_wudu_mid_wgsx = --中级万蛊蚀心
    {						
		add_usebasedmg_p1={4339,{{1,2},{10,20},{15,20}}},  								--增加正常攻击：技能ID，增加%
		--add_dotdamage_wood={4339,{{1,2},{10,20},{15,20}},{{1,0},{10,0}}},  				--增加毒攻：技能ID，增加%，增加点数
		add_recdot_alldmg1={4340,{{1,0},{10,0},{11,2},{15,10}}}, 						--增加引爆%
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_wudu_high_yfsg = --高级阴风蚀骨
    { 
		add_igdefense_p1={4309,{{1,3},{10,35},{15,40},{20,40}}},								--增加忽闪比例
		add_dotdamage_wood={4309,{{1,0},{10,0},{11,2},{15,10},{20,10}},{{1,0},{15,0},{20,0}}},  --增加毒攻：技能ID，增加%，增加点数
		autoskill={123,{{1,1},{10,10},{20,20}}},												--触发攻速
		userdesc_101={{{1,0},{15,0},{16,100},{20,100}}},											--假描述，实际触发概率于aotuskill.tab中设置	
		userdesc_000={4371},
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_wudu_high_yfsg_child  = --高级阴风蚀骨_子
    {
		attackspeed_v={{{1,0},{10,0},{15,0},{16,10},{20,50}}},
		skill_statetime={{{1,0},{15,0},{16,15*8},{20,15*8}}},
    },
    book_wudu_high_zhdc = --高级召唤毒虫
    { 

		addcall_npcdmg={4313,{{1,10},{10,36},{15,36},{20,36}}},						--增加(灵蛇)攻击
		addcall_npcdmg1={4315,{{1,10},{10,36},{15,36},{20,36}}},					--增加(碧蟾)攻击
		addcall_npcdmg2={4317,{{1,10},{10,36},{15,36},{20,36}}},					--增加(赤蝎)攻击
		addcall_npcdmg3={4319,{{1,10},{10,36},{15,36},{20,36}}},					--增加(风蜈)攻击
		addcall_npcdmg4={4321,{{1,10},{10,36},{15,36},{20,36}}},					--增加(墨蛛)攻击
		deccdtime={4312,{{1,0},{10,0},{11,15*1},{15,15*5},{20,15*5}}},
		add_callnpc_skill={4312,4373,{{1,1},{15,15},{20,20}}},				--召唤灵蛇的buffid,给灵蛇的buffid,等级
		add_callnpc_skill1={4314,4374,{{1,1},{15,15},{20,20}}},				--召唤碧蟾的buffid,给碧蟾的buffid,等级
		--add_callnpc_skill2={4316,4376,{{1,1},{15,15},{20,20}}},			--召唤赤蝎的buffid,给赤蝎的buffid,等级
		add_callnpc_skill3={4318,4377,{{1,1},{15,15},{20,20}}},				--召唤风蜈的buffid,给风蜈的buffid,等级
		add_callnpc_skill4={4320,4379,{{1,1},{15,15},{20,20}}},				--召唤墨蛛的buffid,给墨蛛的buffid,等级
		userdesc_000={4373,4375},											--索引灵蛇、碧蟾的技能描述
		userdesc_101={{{1,0},{15,0},{16,-20},{20,-100}}},					--假描述，风蜈技能，需要与book_wudu_high_zhdc_fw_zi减闪避的一致
		userdesc_102={4333,{{1,0},{15,0},{16,2},{20,10}},{{1,0},{20,0}}},	--假描述，风蜈技能，需要与book_wudu_high_zhdc_mz中毒攻一致

		buff_addition={4316,7,{{1,1},{15,15},{16,16},{20,20}}},				--增加赤蝎为主角提供的会心伤害			
		userdesc_103={{{1,0},{15,0},{16,5},{20,25}}},						--假描述，增加赤蝎为主角提供的会心伤害

		--addcall_npclife={4313,{{1,10},{10,30},{15,30},{20,30}}},					--增加(灵蛇)血量		
		--addcall_npclife1={4315,{{1,10},{10,30},{15,30},{20,30}}},					--增加(碧蟾)血量
		--addcall_npclife2={4317,{{1,10},{10,30},{15,30},{20,30}}},					--增加(赤蝎)血量
		--addcall_npclife3={4319,{{1,10},{10,30},{15,30},{20,30}}},					--增加(风蜈)血量
		--addcall_npclife4={4321,{{1,10},{10,30},{15,30},{20,30}}},					--增加(墨蛛)血量

		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_wudu_high_zhdc_ls = --高级召唤毒虫-灵蛇
    { 
		add_zhican_r={4323,{{1,0},{15,0},{16,5},{20,25}}},					--增加灵蛇技能造成致残几率
		add_zhican_t={4323,{{1,0},{15,0},{16,15*0.2},{20,15*1}}},			--增加灵蛇技能造成致残时间
		--add_usebasedmg_p1={4323,{{1,0},{15,0},{16,2},{20,10}}}, 			--增加灵蛇技能伤害
		--add_usebasedmg_p2={4322,{{1,0},{15,0},{16,2},{20,10}}}, 			--增加灵蛇普攻伤害
		skill_statetime={{{1,-1},{10,-1}}},	
    },
    book_wudu_high_zhdc_bc = --高级召唤毒虫-碧蟾
    { 
    	addstartskill={4326,4375,{{1,1},{10,10},{15,15},{20,20}}},
		--add_usebasedmg_p1={4325,{{1,0},{15,0},{16,2},{20,10}}}, 			--增加碧蟾技能伤害
		--add_usebasedmg_p2={4324,{{1,0},{15,0},{16,2},{20,10}}}, 			--增加碧蟾普攻伤害
		skill_statetime={{{1,-1},{10,-1}}},	
    },
    book_wudu_high_zhdc_bc_zi = --高级召唤毒虫-碧蟾_子
    { 
		wood_resist_v={{{1,0},{15,0},{16,-20},{20,-100}}},					--减少木系抗性
		skill_statetime={15*8},
    },
    book_wudu_high_zhdc_fw = --高级召唤毒虫-风蜈
    { 
    	add_hitskill1={4330,4378,{{1,1},{10,10},{15,15},{20,20}}},
		--add_usebasedmg_p1={4330,{{1,0},{15,0},{16,2},{20,10}}}, 			--增加风蜈技能伤害
		--add_usebasedmg_p2={4329,{{1,0},{15,0},{16,2},{20,10}}}, 			--增加风蜈普攻伤害
		skill_statetime={{{1,-1},{10,-1}}},	
    },
    book_wudu_high_zhdc_fw_zi = --高级召唤毒虫-风蜈_子
    { 
		defense_v={{{1,0},{15,0},{16,-20},{20,-100}}},						--减少闪避
		skill_statetime={15*8},
    },
    book_wudu_high_zhdc_mz = --高级召唤毒虫-墨蛛
    {						
		--add_usebasedmg_p1={4332,{{1,0},{15,0},{16,2},{20,10}}},  					--增加墨蛛普攻伤害
		add_dotdamage_wood={4333,{{1,0},{15,0},{16,2},{20,10}},{{1,0},{20,0}}},  	--增加墨蛛毒攻：技能ID，增加%，增加点数
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_wudu_high_mxg = --高级迷心蛊
    { 
		add_recdot_type_p={2,{{1,1},{10,10},{15,15},{20,15}}},						--增加受到毒伤%	
		add_state_time1={4336,{{1,0},{10,0},{11,15*0.5},{15,15*2},{20,15*2}}},  --增加迷心蛊debuff持续时间
		add_state_time2={4335,{{1,0},{10,0},{11,15*0.5},{15,15*2},{20,15*2}}},  	--增加迷心蛊毒攻持续时间，此延长时间若改动则下面描述次数也需要改动
		userdesc_109={{{1,0},{10,0},{11,1},{15,5},{20,5}}},							--描述用，增加迷心蛊的毒攻次数
		addms_life1={4335,{{1,0},{10,0},{11,15*0.5},{15,15*2},{20,15*2}}},		--增加迷心蛊子弹持续时间（每0.5秒造成致残所用到的子弹）
		addstartskill={4336,4381,{{1,1},{10,10},{15,15},{20,20}}},					--触发增加CD技能
 		userdesc_000={4381},   	
		skill_statetime={{{1,-1},{10,-1}}},		
    },
	book_wudu_high_mxg_child = --高级迷心蛊_子
    { 
		allfactionskill_cd_point={{{1,0},{15,0},{16,15*0.5},{20,15*3}},1},				--增加敌人主动技能CD时间
		skill_statetime={{{1,15*8},{15,15*8},{16,15*8.5},{20,15*10.5}}},				--debuff的持续时间
    },
    book_wudu_high_wgsx = --高级万蛊蚀心
    {						
		add_usebasedmg_p1={4339,{{1,2},{10,20},{15,20},{20,20}}},  								--增加正常攻击：技能ID，增加%
		--add_dotdamage_wood={4339,{{1,2},{10,20},{15,20},{20,20}},{{1,0},{10,0}}},  			--增加毒攻：技能ID，增加%，增加点数
		add_recdot_alldmg1={4340,{{1,0},{10,0},{11,2},{15,10},{20,15}}}, 					--增加引爆%
		add_steallife_p={4339,{{1,0},{15,0},{16,1000},{20,4000}}},							--技能ID，吸血万分比
		skill_statetime={{{1,-1},{10,-1}}},
    },
}

FightSkill:AddMagicData(tb)