
local tb    = {
    book_xy_wlzf = --七探蛇盘
    { 
		add_hitskill1={508,518,{{1,1},{10,10}}},
		add_melee_float={507}, 							--动作技能能选中空中目标
		add_hit_float1={508},							--标记子弹能打空中目标
		add_hit_float2={518},							--标记子弹能打空中目标
		userdesc_000={518},
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_xy_wlzf_child = --七探蛇盘_子
    { 
		attack_usebasedamage_p={{{1,30},{10,50}}},
		attack_wooddamage_v={
			[1]={{1,100*1},{10,300*1}},
			[3]={{1,100*1},{10,300*1}}
			},
		state_dragfloat_attack={{{1,100},{10,100},{31,100}},{{1,15*0.5},{10,15*0.5}},50},		--击落空中目标：概率，时间，速度
    },
    book_xy_bmsg = --斗转星移
    { 
		add_steallife_p={506,{{1,500},{10,2000}}},		--技能ID，吸血万分比
		deccdtime={506,{{1,15*1},{4,15*1},{5,15*2},{9,15*2},{10,15*3}}},
		skill_statetime={{{1,-1},{10,-1}}},		
    },
    book_xy_bsqf = --风卷残云
    { 
		add_hitskill1={513,520,{{1,1},{10,10}}},
		add_hitskill2={520,521,{{1,1},{10,10}}},
		add_hit_float1={520},						--标记子弹能打空中目标
		userdesc_000={520,521},
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_xy_bsqf_child1 = --风卷残云_子1
    { 
		state_zhican_attack={{{1,30},{10,60}},{{1,15*2},{10,15*4},{31,15*4}}},
    },
    book_xy_bsqf_child2 = --风卷残云_子2
    { 
		all_series_resist_v={{{1,-100},{10,-300}}},
		skill_statetime={{{1,15*5},{10,15*10}}},
    },
    book_xy_new = --白虹贯日
    {  
		add_usebasedmg_p1={511,{{1,5},{10,30}}},			--增加白虹贯日攻击力
		userdesc_101={511,{{1,5},{10,30}}},					--描述用：增加白虹贯日攻击力			
		add_igdefense_p1={511,{{1,50},{10,200}}},  			--增加忽闪
		userdesc_102={511,{{1,50},{10,200}}},  				--描述用：增加忽闪
		skill_statetime={{{1,-1},{10,-1}}},		
    },
    book_xy_mid_new = --中级白虹贯日
    {  
		add_usebasedmg_p1={511,{{1,5},{10,20},{15,35}}},			--增加白虹贯日攻击力
		userdesc_101={511,{{1,5},{10,20},{15,35}}},					--描述用：增加白虹贯日攻击力			
		add_igdefense_p1={511,{{1,50},{10,200},{15,260}}},  		--增加忽闪
		userdesc_102={511,{{1,50},{10,200},{15,260}}},  			--描述用：增加忽闪
		add_zhican_r={511,{{1,0},{10,0},{11,5},{15,15}}},			--增加白虹贯日造成致残的几率
		userdesc_103={511,{{1,0},{10,0},{11,5},{15,15}}},			--描述用：增加白虹贯日造成致残的几率			
		skill_statetime={{{1,-1},{10,-1}}},		
    },
    book_xy_mid_wlzf = --中级七探蛇盘
    { 
		add_usebasedmg_p1={508,{{1,0},{10,0},{11,10},{15,50}}},			--增加七探蛇盘攻击力
		userdesc_101={508,{{1,0},{10,0},{11,10},{15,50}}},				--描述用：增加七探蛇盘攻击力	
		add_hitskill1={508,547,{{1,1},{10,10},{20,20}}},
		add_melee_float={507}, 											--动作技能能选中空中目标
		add_hit_float1={508},											--标记子弹能打空中目标
		add_hit_float2={547},											--标记子弹能打空中目标
		userdesc_000={547},
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_xy_mid_wlzf_child = --中级七探蛇盘_子
    { 
		attack_usebasedamage_p={{{1,30},{10,60},{15,80}}},
		attack_wooddamage_v={
			[1]={{1,200*1},{10,600*1},{15,1000*1}},
			[3]={{1,200*1},{10,600*1},{15,1000*1}}
			},
		state_dragfloat_attack={{{1,100},{10,100},{20,100}},{{1,15*0.5},{10,15*0.5},{20,15*0.5}},50},		--击落空中目标：概率，时间，速度
    },
	
    book_xy_mid_bmsg = --中级斗转星移
    { 
		add_usebasedmg_p1={506,{{1,0},{10,0},{11,20},{15,70}}},			--增加斗转星移攻击力
		userdesc_101={506,{{1,0},{10,0},{11,10},{15,50}}},				--描述用：增加斗转星移攻击力
		add_steallife_p={506,{{1,500},{10,2000},{15,3000}}},				--技能ID，吸血万分比
		deccdtime={506,{{1,15*1},{4,15*1},{5,15*2},{9,15*2},{10,15*3},{15,15*4}}},
		skill_statetime={{{1,-1},{10,-1}}},		
    },
    book_xy_mid_bsqf = --中级风卷残云
    { 
		deccdtime={513,{{1,0},{10,0},{11,15*1},{15,15*5}}},
		add_hitskill1={513,550,{{1,1},{10,10},{20,20}}},
		add_hitskill2={550,551,{{1,1},{10,10},{20,20}}},
		add_hit_float1={550},						--标记子弹能打空中目标
		userdesc_000={550,551},
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_xy_mid_bsqf_child1 = --中级风卷残云_子1
    { 
		state_zhican_attack={{{1,30},{10,60},{15,60}},{{1,15*2},{10,15*4},{15,15*5}}},
    },
    book_xy_mid_bsqf_child2 = --中级风卷残云_子2
    { 
		all_series_resist_v={{{1,-100},{10,-300},{15,-400}}},
		skill_statetime={{{1,15*5},{10,15*10},{15,15*10}}},
    },
    book_xy_high_bhgr = --高级白虹贯日
    {  
		add_usebasedmg_p1={511,{{1,5},{10,20},{15,35},{20,45}}},			--增加白虹贯日攻击力			
		add_igdefense_p1={511,{{1,50},{10,200},{15,260},{20,300}}},  		--增加忽闪
		add_zhican_r={511,{{1,0},{10,0},{11,5},{15,15},{20,20}}},			--增加白虹贯日造成致残的几率
		add_deadlystrike_v1={511,{{1,0},{15,0},{16,40},{20,200}}},			--增加会心点数					
		skill_statetime={{{1,-1},{10,-1}}},		
    },
    book_xy_high_wlzf = --高级七探蛇盘
    { 
		add_usebasedmg_p1={508,{{1,0},{10,0},{11,10},{15,50},{20,60}}},			--增加七探蛇盘攻击力	
		add_hitskill1={508,555,{{1,1},{10,10},{15,50},{20,60}}},
		add_melee_float={507}, 											--动作技能能选中空中目标
		add_hit_float1={508},											--标记子弹能打空中目标
		add_hit_float2={555},											--标记子弹能打空中目标
		userdesc_000={555},
		add_igdefense_v1={508,{{1,0},{15,0},{16,50},{20,300}}},							--增加忽闪点数
		add_deadlystrike_v1={508,{{1,0},{15,0},{16,40},{20,200}}},						--增加会心点数
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_xy_high_wlzf_child = --高级七探蛇盘_子
    { 
		attack_usebasedamage_p={{{1,30},{10,60},{15,80},{15,90}}},
		attack_wooddamage_v={
			[1]={{1,200*1},{10,600*1},{15,1000*1},{20,1200*1}},
			[3]={{1,200*1},{10,600*1},{15,1000*1},{20,1200*1}}
			},
		state_dragfloat_attack={{{1,100},{10,100},{20,100}},{{1,15*0.5},{10,15*0.5},{20,15*0.5}},50},		--击落空中目标：概率，时间，速度
    },
    book_xy_high_bmsg = --高级斗转星移
    { 
		add_usebasedmg_p1={506,{{1,0},{10,0},{11,20},{15,70},{20,85}}},			--增加斗转星移攻击力
		add_steallife_p={506,{{1,500},{10,2000},{15,3000},{20,4000}}},				--技能ID，吸血万分比
		deccdtime={506,{{1,15*1},{4,15*1},{5,15*2},{9,15*2},{10,15*3},{15,15*4},{20,15*5}}},
		add_zhican_t={506,{{1,0},{15,0},{16,15*0.2},{20,15*1.5}}},				--增加斗转星移造成致残的时间
		skill_statetime={{{1,-1},{10,-1}}},		
    },
    book_xy_high_bsqf = --高级风卷残云
    { 
		deccdtime={513,{{1,0},{10,0},{11,15*1},{15,15*5},{20,15*6}}},
		add_hitskill1={513,559,{{1,1},{10,10},{20,20}}},
		add_hitskill2={559,560,{{1,1},{10,10},{20,20}}},
		add_hit_float1={559},											--标记子弹能打空中目标
		userdesc_000={559,560},
		add_usebasedmg_p1={513,{{1,0},{15,0},{16,5},{20,15}}},			--增加风卷残云的攻击力
		skill_statetime={{{1,-1},{10,-1}}},
    },
    book_xy_high_bsqf_child1 = --高级风卷残云_子1
    { 
		state_zhican_attack={{{1,30},{10,60},{15,60}},{{1,15*2},{10,15*4},{15,15*5},{20,15*5.5}}},
    },
    book_xy_high_bsqf_child2 = --高级风卷残云_子2
    { 
		all_series_resist_v={{{1,-100},{10,-300},{15,-400},{20,-500}}},
		skill_statetime={{{1,15*5},{10,15*10},{15,15*10},{20,15*10}}},
    },
}

FightSkill:AddMagicData(tb)