-- -------------------------------
-- 全局用的枚举类
-- hosr
-- -------------------------------
GlobalEumn = GlobalEumn or {}

-- android自定义输入框回调类型
GlobalEumn.InputCallbackType = {
    ClickBlank = 1, -- 点击空白回调
    ClickReturn = 2, -- 点击回车回调
}

-- android自定义输入框输入操作类型
GlobalEumn.ShowType = {
    Normal = 0, -- 普通显示
    Send = 1, -- 显示发送
}

-- android自定义输入框调用标志Id
GlobalEumn.InputFormId = {
    Chat = 1, -- 聊天
    FriendChat = 2, -- 好友私聊
    CreateRole = 3, --创建角色
    Group = 4, --群聊
}

-- android自定义输入框对齐方式
GlobalEumn.GravityType = {
    Left = 1, -- 左对齐
    Center = 2, -- 居中
    Right = 3, -- 右对齐
}

-- 道具属性类型
GlobalEumn.ItemAttrType = {
    base = 0
    ,enchant = 1 --强化属性
    ,extra = 2 --附加属性
    ,gem = 3 --宝石属性
    ,effect = 4 --特效属性
    ,shenqi = 5 --神器属性
    ,shenqiCache = 6 --神器未保存属性
    ,wing_skill = 10 -- 翅膀特技
    ,zero_speed = 11 -- 万年玄冰
    ,ingot_crash = 12 -- 元宝争霸
}

-- 活动提示状态枚举
GlobalEumn.ActivityEumn = {
    fairy = 101 --幻境冒险
    ,para = 102 --吃货巡游
    ,qualify = 103 --时空段位
    ,warrior = 104 --勇士战场
    ,classes =105 --职业挑战
    ,exam = 106 --智慧闯关
    ,top_compete = 109 --巅峰对决
    ,pet_love = 110 --宠物情缘
    ,guild_siege = 111-- 攻城战
    ,ingot_crash = 122 -- 元宝争霸
    ,guild_dragon = 123,-- 巨龙挑战
}


-- 市场消耗银币，金币，砖石类型对应的Base_里面图标的名字
GlobalEumn.CostTypeIconName = {
    [90000] = "Assets90000"
    ,[90002] = "Assets90002"
    ,[90003] = "Assets90003"
    ,[90004] = "Assets90004"
    ,[90005] = "Assets90005"
    ,[90006] = "Assets90006"
    ,[90007] = "Assets90007"
    ,[90008] = "Assets90008"
    ,[90010] = "Assets90010"
    ,[90011] = "Assets90011"
    ,[90012] = "Assets90012"
    ,[90013] = "Assets90013"
    ,[90014] = "Assets90014"
    ,[90015] = "Assets90015"
    ,[90017] = "Assets90017"
    ,[90018] = "Assets90018"
    ,[90019] = "Assets90019"
    ,[90020] = "Assets90020"
    ,[90021] = "Assets90021"
    ,[90022] = "Assets90022"
    ,[90023] = "Assets90023"
    ,[90024] = "Assets90024"
    ,[90025] = "Assets90025"
    ,[90026] = "Assets90026"
    ,[90032] = "Assets90032"
}

-- 资产名,不取道具
GlobalEumn.AssetName = {
    [90000] = TI18N("银币"),
    [90002] = TI18N("钻石"),
    [90003] = TI18N("金币"),
    [90004] = TI18N("灵气"),
    [90005] = TI18N("宠物经验"),
    [90006] = TI18N("活力"),
    [90007] = TI18N("人品"),
    [90010] = TI18N("经验"),
    [90011] = TI18N("公会贡献"),
    [90012] = TI18N("星辰积分"),
    [90013] = TI18N("冒险经验"),
    [90014] = TI18N("饱食度"),
    [90015] = TI18N("公会资产"),
    [90017] = TI18N("能量"),
    [90018] = TI18N("恩爱值"),
    [90019] = TI18N("师道值"),
    [90020] = TI18N("王者积分"),
}

GlobalEumn.AttrSort = {
    [1  ] = 1--"生命"
    ,[2  ] = 10--"魔法"
    ,[3  ] = 6--"攻速"
    ,[4  ] = 4--"物攻"
    ,[5  ] = 5--"魔攻"
    ,[6  ] = 2--"物防"
    ,[7  ] = 3--"魔防"
    ,[8  ] = 11--"暴击"
    ,[9  ] = 12--"坚韧"
    ,[10 ] = 13--"命中"
    ,[11 ] = 14--"闪避"
    ,[12 ] = 15--"移速"
    ,[21 ] = 21--"神伤"
    ,[22 ] = 22--"暴击伤害"
    ,[23 ] = 23--"伤害加成"
    ,[24 ] = 24--"伤害减免"
    ,[25 ] = 8--"控制加强"
    ,[26 ] = 9--"控制抵抗"
    ,[27 ] = 27--"逃跑率"
    ,[28 ] = 28--"抗逃跑"
    ,[29 ] = 29--"抓捕率"
    ,[30 ] = 30--"物理减免"
    ,[31 ] = 31--"魔法减免"
    ,[32 ] = 32--"受到伤害"
    ,[33 ] = 33--"治疗效果"
    ,[34] = 34--"受到治疗效果"
    ,[35] = 35--"物理暴击"
    ,[36] = 36--"魔法暴击"
    ,[37] = 37--"物理坚韧"
    ,[38] = 38--"魔法坚韧"
    ,[39] = 39--"物理命中"
    ,[40] = 40--"魔法命中"
    ,[41] = 41--"物理闪避"
    ,[42] = 42 --"魔法闪避"
    ,[43] = 7 --"治疗加强"
    ,[51 ] = 51 --"生命" --生命比
    ,[52 ] = 52--"魔法" --魔法比
    ,[53 ] = 53 --"攻速" --攻速比
    ,[54 ] = 54 --"物攻" --物攻比
    ,[55 ] = 55 --"魔攻" --魔攻比
    ,[56 ] = 56 --"物防" --物防bi
    ,[57 ] = 57 --"魔防" --魔防比
    ,[58 ] = 58 --"暴击" --暴击比
    ,[59 ] = 59 --"坚韧" --坚韧比
    ,[60 ] = 60 --"命中" --命中比
    ,[61 ] = 61 --"闪避" --闪避比
    ,[62 ] = 62 --"移速" --移速比

    ,[100] = 100 --"技能"
    ,[101] = 101 --"力量"
    ,[102] = 102 --"体质"
    ,[103] = 103 --"智力"
    ,[104] = 104 --"敏捷"
    ,[105] = 105 --"耐力"

    --装备上镶嵌的宝石信息
    ,[110] = 110 --"宝石孔1"
    ,[111] = 111 --"宝石孔2"
    ,[112] = 112 --"宝石孔2"

    ,[150] = 150 --"易强化"
    ,[151] = 151 --"易成长"
}

MatchStatus = {
    Normal = 0,
    Matching = 1,
    Matchend = 2
}