local mapArray = MEMapArray:new()
mapArray:push({ quality = 1, title = "破损", attribute = "100_4000|200_3000|300_2000|400_800|500_200", rate = 8000, effects = "white"})
mapArray:push({ quality = 2, title = "瑕疵", attribute = "600_4000|700_3000|800_2000|900_800|1000_200", rate = 1500, effects = "green"})
mapArray:push({ quality = 3, title = "完美", attribute = "1100_4000|1200_0|1300_3000|1400_0|1500_2000|1600_0|1700_0|1800_800|1900_0|2000_0|2100_200|2200_0", rate = 400, effects = "blue"})
mapArray:push({ quality = 4, title = "神铸", attribute = "2300_4000|2400_0|2500_0|2600_3000|2700_0|2800_0|2900_2000|3000_0|3100_0|3200_500|3300_0|3400_0|3500_0|3600_300|3700_0|3800_0|3900_0|4000_200|4100_0|4200_0|4300_0|4400_0|4500_0|4600_0|4700_0|4800_0|4900_0|5000_0|5100_0|5200_0|5300_0|5400_0|5500_0|5600_0|5700_0|5800_0|5900_0|6000_0", rate = 100, effects = "purple"})
return mapArray
