--EventListener.lua
--/*-----------------------------------------------------------------
 --* Module:   EventListener.lua
 --* Author:   Yang ChangGao
 --* Modified: 2012年10月18日 16:07:08
 --* Purpose:  特定事件监听器接口
 -------------------------------------------------------------------*/

--------------------------------------------------------
--Action监听器
--------------------------------------------------------
ActionListener = interface(nil, "action")

--------------------------------------------------------
--事件监听器
--------------------------------------------------------
EventListener = interface(ActionListener, "getEventID")

--------------------------------------------------------
--事件集监听器
--------------------------------------------------------
EventSetListener = interface(ActionListener, "getEvents", "getEventsCount")