UIStrConfig:Add(
{
	['uarena101'] = "竞技场",
	['uarena102'] = "昵称：",
	['uarena103'] = "荣誉：",
	['uarena104'] = "今日已挑战次数:",
	['uarena105'] = "冷却时间：",
	['uarena106'] = "当前连胜场数：",
	['uarena107'] = "我的战力：",
	['uarena108'] = "排行奖励",
	['uarena109'] = "荣誉商店",
	['uarena110'] = "每日0点结算排名奖励，竞技场排名越前，奖励越高",
	['uarena111'] = "银两：",
	['uarena112'] = "竞技场战报",
	['uarena113'] = "战斗力：",
	['uarena114'] = "等级：",

	['uarena115'] = "胜利",
	['uarena116'] = "您的排名已升至",
	['uarena117'] = "获得奖励",
	['uarena118'] = "经验",
	['uarena119'] = "失败",
	['uarena120'] = "您的排名保持不变",
	['uarena122'] = "前三名",
	['uarena123'] = "我的排名：",

	-- 2级界面
	['ua201'] = "排行奖励",
	['ua202'] = "排行奖励预览",
	['ua203'] = "我的排名奖励：",
	['ua204'] = "奖励排名：",
	['ua205'] = "奖励排名是指在0点刷新领取奖励时您的排名，可能与您当前的排名不同",
	['ua206'] = "整点在线获得奖励累计",
	['ua207'] = "领取奖励",
	['ua208'] = "下次奖励时间:",
	['ua209'] = "今日整点在线获得奖励累计：",
	['ua210'] = "",

	-- skinfo
	['ua301'] = "新战报",
	
	---战斗结束
	['zdjx001'] = "退出",
	['zdjx002'] = "获得奖励：",
	['zdjx003'] = "经验：",
	['zdjx004'] = "荣誉：",

}
)