UIStrConfig:Add(
{
	['equip1'] = '炼化炉',
	['equip2'] = '强化',
	['equip3'] = '升品',
	['equip4'] = '觉醒',
	['equip5'] = '传承',
	['equip6'] = '剥离',
	['equip7'] = '铭刻',
	['equip8'] = '升星',
	
	['equip10'] = '满级效果',
	['equip11'] = '进度值满时可升星',
	['equip13'] = '本次升星不掉级',
	['equip14'] = '材料不足时，自动花元宝购买',
	['equip15'] = '消耗道具：',
	['equip16'] = '银两：',
	
	['equip50'] = '<u>规则说明</u>',
	['equip51'] = '原装备',
	['equip52'] = '目标装备',
	['equip54'] = '背包装备',
	['equip55'] = '消耗道具:',
	['equip56'] = '银两:',
	['equip58'] = '传承',
	['equip59'] = '强化传承',
	['equip60'] = '追加传承',
	['equip61'] = '重铸',

	-- product Smart
	['equip217'] = '吞   噬',
	['equip218'] = '一键吞噬',
	['equip219'] = '确认',
	['equip220'] = '取消',
	['equip221'] = '提示',
	['equip222'] = '下次不再提示',
	['equip223'] = '将要吞噬掉高阶装备，确定要执行此操作？',
	['equip224'] = '该装备正在升品中，确定要被其他装备吞噬？',
	['equip225'] = '当前宝石',
	['equip226'] = '当前属性',
	['equip227'] = '<u>规则说明</u>',
	['equip228'] = "吞噬背包内装备可为身上装备升品",
	['equip229'] = "将要吞噬掉“高阶”、“正在升品”中的装备，确定要执行吞噬操作吗？",
	['equip230'] = "我知道了",
	['equip231'] = "确认装备",
	
	--卓越
	['equip300'] = "消耗道具:",
	['equip301'] = "银两:",
	['equip302'] = "材料不足时，自动花元宝购买",
	['equip303'] = "升级",
	['equip304'] = "人物装备",
	['equip305'] = "背包装备",
	['equip306'] = "卓越剥离",
	['equip307'] = "卓越铭刻",
	['equip308'] = "卓越属性列表",
	['equip309'] = "删除",
	['equip310'] = "当前觉醒",
	['equip311'] = "生成",
	['equip312'] = '确定',
	['equip313'] = '获得附加属性:',
	['equip314'] = '点击查看该属性',
	['equip315'] = '卓越属性:',
	['equip316'] = '已合成:',
	['equip317'] = '（可在背包内查看该卷轴）',
	
	--更改套装
	['equip401'] = "人物装备",
	['equip402'] = "背包装备",
	['equip403'] = "放入更改道具",
	['equip404'] = "放入装备",
	['equip405'] = "更改套装名称:",
	['equip406'] = "套装属性:",
	['equip407'] = "确认更改",

	["euipgem101"] = "宝石",
	["euipgem102"] = "消耗道具：",
	["euipgem103"] = "银两：",
	["euipgem104"] = "材料不足时，自动花元宝购买",
	["euipgem105"] = "升级",
	["euipgem106"] = "<u>规则说明</u>",
	["euipgem107"] = "宝石",
	["euipgem108"] = "暂时已达到最高等级",

	-----------------炼化
	['equiprefin001'] = "强化等级：",
	['equiprefin002'] = "附加属性：",
	['equiprefin003'] = "单件强化消耗：",
	['equiprefin004'] = "成功率：",
	['equiprefin005'] = "强化",
	['equiprefin006'] = "一键强化",
	['equiprefin007'] = "",
	['equiprefin008'] = "",
	['equiprefin009'] = "",
	['equiprefin0000001'] = "一键强化消耗：",
	['equiprefin0000002'] = "一键强化对全身可强化装备为进行强化一次",
	-----------------熔炼
	['equipsmelt001'] = '熔    炼',
	['equipsmelt002'] = '一键放入',
	['equipsmelt005'] = '挂机时自动熔炼所选品质装备',

	--洗练
	['equipWash001'] = "重 铸",
	['equipWash002'] = "保 存",
	['equipWash003'] = "取 消",
	['equipWash004'] = "继续重铸",




	['equip62'] = '精炼',
	['equipWash005'] = '普通精炼',
	['equipWash006'] = '高级精炼',
	['equipWash007'] = '继续精炼',


	['buildAttrScroll001'] = '生成卷轴',

	['equip501'] = "批量删除",
	['equip502'] = "确认",
	['equip503'] = "取消",
	['equip504'] = "神武",

	['equip600'] = "启灵",

	['equip700'] = "激活",
	['equip801'] = "未解锁",
	['equip802'] = "未激活",
	['equip803'] = "所需材料：",
	['equip804'] = "下级预览",
}
)