UIStrConfig:Add(
{
	['se1'] = '噬魂',
	['se2'] = '击败各大陆的神秘怪，可获得属性提升',
	['se3'] = '本地图属性加成',
	['se4'] = '攻击',
	['se5'] = '防御',
	['se6'] = '暴击',
	['se7'] = '击败量级怪获得属性加成',
	['se8'] = '噬魂进度：',
	['se9'] = '魂值',
	['se10'] = '所需魂值',
	['se11'] = '召唤',
	['se12'] = '前往噬魂',
	['se13'] = '魂值',
	['se14'] = '1/30',
	['se15'] = '成功击败获得属性加成',
	['se16'] = '<u>总属性加成</u>',
	['se17'] = '当前魂值：',
	['se18'] = '所需魂值:',
	['se19'] = '生命',
	['se20'] = '命中',
	['se21'] = '闪避',
	['se22'] = '韧性',
	['se23'] = '破防',
	['se24'] = '韧性',

}
)