ChargeFirstModel = {
    desc = {
        num = "首冲金额",
        name = "名称",
        rewardResouceList = "奖励资源",
        getReward = "可等价获得多少元宝（前端显示）"
    },
    key = nil,
    items_count = 5,
    items = {
        {
            num = 120,
            name = "精打细算",
            rewardResouceList = "1606,16060015,1||1602,16020021,1||1603,16030006,3||1603,16030008,5||1112,0,100000",
            getReward = 5575
        },
        {
            num = 600,
            name = "不计小钱",
            rewardResouceList = "1606,16060400,1||1606,16060018,1||1605,16050001,1000||1603,16030006,8||1603,16030008,10",
            getReward = 10900
        },
        {
            num = 1960,
            name = "出手阔绰",
            rewardResouceList = "1606,16060400,2||1606,16060014,1||1401,14010801,5||1605,16050001,2000||1112,0,300000",
            getReward = 24200
        },
        {
            num = 6560,
            name = "一掷千金",
            rewardResouceList = "1606,16060303,1||1604,16040019,100||1605,16050239,100||1603,16030003,15||1112,0,600000",
            getReward = 35300
        },
        {
            num = 12960,
            name = "豪情万丈",
            rewardResouceList = "1606,16060302,1||1606,16060017,1||1605,16050240,100||1401,14011301,5||1112,0,1000000",
            getReward = 59000
        }
    }
}