FashionPrRelation = {
    desc = {
        ID = "#搭配ID",
        name = "搭配名字",
        intro = "简介",
        memberS = "搭配时装",
        allAttr = "属性加成%"
    },
    key = {"ID"},
    items_count = 14,
    items = {
        [1] = {
            ID = 1,
            name = "终南为邻",
            intro = "前排血量+2000,后排攻击+200",
            memberS = "19010001,19010002",
            allAttr = "6||432|2000,7||431|200"
        },
        [2] = {
            ID = 2,
            name = "剑掌合鸣",
            intro = "前排攻击+300,后排血量+3000",
            memberS = "19010005,19010006",
            allAttr = "6||431|300,7||432|3000"
        },
        [3] = {
            ID = 3,
            name = "师出一门",
            intro = "前排血量+2000,后排攻击+200",
            memberS = "19010007,19010008",
            allAttr = "6||432|2000,7||431|200"
        },
        [4] = {
            ID = 4,
            name = "琴棋书画",
            intro = "全体攻击+300",
            memberS = "19010009,19010010",
            allAttr = "6||431|300,7||431|300"
        },
        [5] = {
            ID = 5,
            name = "红缨翠竹",
            intro = "全体血量+2000",
            memberS = "19010012,19010013",
            allAttr = "6||432|2000,7||432|2000"
        },
        [6] = {
            ID = 6,
            name = "暖暖红衣",
            intro = "全体攻击+800",
            memberS = "19010015,19010016",
            allAttr = "6||431|800,7||431|800"
        },
        [7] = {
            ID = 7,
            name = "南华逍遥",
            intro = "全体攻击+400",
            memberS = "19010018,19010019",
            allAttr = "6||431|400,7||431|400"
        },
        [8] = {
            ID = 8,
            name = "东邪双绝",
            intro = "全体攻击+600,全体血量+6000",
            memberS = "19010021,19010022",
            allAttr = "6||431|600,6||432|6000,7||431|600,7||432|6000"
        },
        [9] = {
            ID = 9,
            name = "笑傲武林",
            intro = "全体攻击+200",
            memberS = "19010023,19010024",
            allAttr = "6||431|200,7||431|200"
        },
        [10] = {
            ID = 10,
            name = "弹指生花",
            intro = "前排血量+3000,后排攻击+300",
            memberS = "19010026,19010027",
            allAttr = "6||432|3000,7||431|300"
        },
        [11] = {
            ID = 11,
            name = "雄霸天下",
            intro = "前排血量+4000,后排攻击+400",
            memberS = "19010029,19010030",
            allAttr = "6||432|4000,7||431|400"
        },
        [12] = {
            ID = 12,
            name = "异族风情",
            intro = "全体攻击+1000",
            memberS = "19010032,19010033",
            allAttr = "6||431|1000,7||431|1000"
        },
        [13] = {
            ID = 13,
            name = "锦鲤成双",
            intro = "全体攻击+600,全体防御+300",
            memberS = "19010035,19010036",
            allAttr = "6||431|600,7||431|600,6||433|300,7||433|300"
        },
        [14] = {
            ID = 14,
            name = "神机妙算",
            intro = "全体攻击+1000,全体血量+30000",
            memberS = "19010038,19010039",
            allAttr = "6||431|1000,7||431|1000,6||432|30000,7||432|30000"
        }
    }
}