MedicinePrescriptionRelation = {
    desc = {
        ID = "#ID",
        needGoodsA = "药方材料",
        getGoods = "合成丹药"
    },
    key = {"ID"},
    items_count = 12,
    items = {
        [1] = {
            ID = 1,
            needGoodsA = "16110307,16110308,16110309",
            getGoods = "1611,16110306,1"
        },
        [2] = {
            ID = 2,
            needGoodsA = "16110310,16110306,16110308",
            getGoods = "1611,16110305,1"
        },
        [3] = {
            ID = 3,
            needGoodsA = "16110607,16110608,16110609",
            getGoods = "1611,16110606,1"
        },
        [4] = {
            ID = 4,
            needGoodsA = "16110609,16110606,16110608",
            getGoods = "1611,16110605,1"
        },
        [5] = {
            ID = 5,
            needGoodsA = "16111007,16111008,16111009",
            getGoods = "1611,16111006,1"
        },
        [6] = {
            ID = 6,
            needGoodsA = "16111009,16111006,16111008",
            getGoods = "1611,16111005,1"
        },
        [7] = {
            ID = 7,
            needGoodsA = "16111307,16111308,16111309",
            getGoods = "1611,16111306,1"
        },
        [8] = {
            ID = 8,
            needGoodsA = "16111309,16111306,16111308",
            getGoods = "1611,16111305,1"
        },
        [9] = {
            ID = 9,
            needGoodsA = "16112007,16112008,16112009",
            getGoods = "1611,16112006,1"
        },
        [10] = {
            ID = 10,
            needGoodsA = "16112009,16112006,16112008",
            getGoods = "1611,16112005,1"
        },
        [11] = {
            ID = 11,
            needGoodsA = "16112507,16112508,16112509",
            getGoods = "1611,16112506,1"
        },
        [12] = {
            ID = 12,
            needGoodsA = "16112509,16112506,16112508",
            getGoods = "1611,16112505,1"
        }
    }
}