PvpinterTopWorship = {
    desc = {
        days = "#膜拜累计天数",
        rewards = "奖励内容"
    },
    key = {"days"},
    items_count = 6,
    items = {
        [1] = {
            days = 1,
            rewards = "1111,1111,200||1605,16050048,50"
        },
        [2] = {
            days = 2,
            rewards = "1605,16050240,10||1605,16050048,50"
        },
        [3] = {
            days = 3,
            rewards = "1129,1129,200||1605,16050048,50"
        },
        [4] = {
            days = 4,
            rewards = "1605,16050034,200||1605,16050048,50"
        },
        [5] = {
            days = 5,
            rewards = "1604,16040019,10||1605,16050048,50"
        },
        [6] = {
            days = 6,
            rewards = "1602,16023005,5||1605,16050048,50"
        }
    }
}