PvpinterSeasonWinRewardModel = {
    desc = {
        winNum = "#胜利次数",
        reward = "奖励"
    },
    key = {"winNum"},
    items_count = 12,
    items = {
        [5] = {
            winNum = 5,
            reward = "1605,16050063,600"
        },
        [10] = {
            winNum = 10,
            reward = "1605,16050063,600||1133,0,100"
        },
        [15] = {
            winNum = 15,
            reward = "1605,16050063,600"
        },
        [20] = {
            winNum = 20,
            reward = "1605,16050063,800||1133,0,150"
        },
        [25] = {
            winNum = 25,
            reward = "1605,16050063,800"
        },
        [30] = {
            winNum = 30,
            reward = "1605,16050063,800||1133,0,200"
        },
        [35] = {
            winNum = 35,
            reward = "1605,16050063,1100"
        },
        [40] = {
            winNum = 40,
            reward = "1605,16050063,1100||1133,0,250"
        },
        [45] = {
            winNum = 45,
            reward = "1605,16050063,1100"
        },
        [55] = {
            winNum = 55,
            reward = "1605,16050063,1300||1133,0,300"
        },
        [65] = {
            winNum = 65,
            reward = "1605,16050063,1300"
        },
        [75] = {
            winNum = 75,
            reward = "1605,16050063,1300||1133,0,350"
        }
    }
}