QuickexpMeetChallengeModel = {
    desc = {
        ID = "#自增ID",
        heroModelId = "战将ID",
        outStr = "产出资源"
    },
    key = {"ID"},
    items_count = 9,
    items = {
        [1] = {
            ID = 1,
            heroModelId = 12011301,
            outStr = "1501,15011301,2||1111,0,5||1012,0,50"
        },
        [2] = {
            ID = 2,
            heroModelId = 12011302,
            outStr = "1501,15011302,2||1111,0,5||1012,0,50"
        },
        [3] = {
            ID = 3,
            heroModelId = 12011303,
            outStr = "1501,15011303,2||1111,0,5||1012,0,50"
        },
        [4] = {
            ID = 4,
            heroModelId = 12012301,
            outStr = "1501,15012301,2||1111,0,5||1012,0,50"
        },
        [5] = {
            ID = 5,
            heroModelId = 12012302,
            outStr = "1501,15012302,2||1111,0,5||1012,0,50"
        },
        [6] = {
            ID = 6,
            heroModelId = 12013303,
            outStr = "1501,15013303,2||1111,0,5||1012,0,50"
        },
        [7] = {
            ID = 7,
            heroModelId = 12013301,
            outStr = "1501,15013301,2||1111,0,5||1012,0,50"
        },
        [8] = {
            ID = 8,
            heroModelId = 12013302,
            outStr = "1501,15013302,2||1111,0,5||1012,0,50"
        },
        [9] = {
            ID = 9,
            heroModelId = 12012303,
            outStr = "1501,15012303,2||1111,0,5||1012,0,50"
        }
    }
}