QuizTopicModel = {
    desc = {
        ID = "#ID",
        topic = "题目",
        answer = "答案"
    },
    key = {"ID"},
    items_count = 1280,
    items = {
        [1] = {
            ID = 1,
            topic = "中华民族的摇篮是：A.黄河流域B.长江流域C.黑龙江流域D.松花江流域",
            answer = "黄河流域"
        },
        [2] = {
            ID = 2,
            topic = "“一日不见，如隔三秋”里的“三秋”是指：A.三个季度B.三个月C.三年D.三天",
            answer = "三个季度"
        },
        [3] = {
            ID = 3,
            topic = "“阳关大道”原是指通往那里的道路？A.西域B.中原C.东海D.南国",
            answer = "西域"
        },
        [4] = {
            ID = 4,
            topic = "我们常说的“鸿雁传书”源自于以下哪个历史故事？A.苏武牧羊B.楚汉相争C.霸王别姬D.十面埋伏",
            answer = "苏武牧羊"
        },
        [5] = {
            ID = 5,
            topic = "秦始皇灭六国后，统一了全国文字，这种汉字称作：A.小篆B.隶书C.楷书D.行书",
            answer = "小篆"
        },
        [6] = {
            ID = 6,
            topic = "台湾自古以来就是我国的神圣领土，祖国大陆的人们开始和台湾接触，早在秦汉时期，台湾在三国是称为：A.夷洲B.流求C.东番D.台湾",
            answer = "夷洲"
        },
        [7] = {
            ID = 7,
            topic = "不属于中国四大佛山的是：A.武当山B.普陀山C.峨眉山D.九华山",
            answer = "武当山"
        },
        [8] = {
            ID = 8,
            topic = "中国第一长洞是：A.双河洞B.青城山洞C.赤城山洞D.王屋山洞",
            answer = "双河洞"
        },
        [9] = {
            ID = 9,
            topic = "下列哪个不是中国六大古都：A.南昌B.西安C.开封D.洛阳",
            answer = "南昌"
        },
        [10] = {
            ID = 10,
            topic = "苗族的传统乐器是：A.芦笙B.萧C.笛D.马头琴",
            answer = "芦笙"
        },
        [11] = {
            ID = 11,
            topic = "中国全部的少数民族语言共分几个语系？A.5个B.6个C.7个D.8个",
            answer = "5个"
        },
        [12] = {
            ID = 12,
            topic = "中国古代宫殿建筑普遍采用什麽颜色？A.红色B.黄色C.蓝色D.绿色",
            answer = "红色"
        },
        [13] = {
            ID = 13,
            topic = "俗话说“一寸光阴一寸金。”这里的“一寸”是用哪种古代计时器量出的时间单位？A.漏刻B.圭表C.日影D.漏壶",
            answer = "漏刻"
        },
        [14] = {
            ID = 14,
            topic = "北方人年夜饭要一般都要吃饺子，其象徵意义是：A.更岁交子B.年年有余C.五福临门D.团团圆圆",
            answer = "更岁交子"
        },
        [15] = {
            ID = 15,
            topic = "一般认为，北宋风俗画，《清明上河图》描绘的是什麽季节的景象？A.春天B.夏天C.秋天D.冬天",
            answer = "春天"
        },
        [16] = {
            ID = 16,
            topic = "《红楼梦》的四大家族中没有下列哪个姓氏？A.吴B.贾C.史D.王",
            answer = "吴"
        },
        [17] = {
            ID = 17,
            topic = "下列不属于我国四大传说故事的是：A.山海经B.牛郎织女C.孟姜女D.白蛇传",
            answer = "山海经"
        },
        [18] = {
            ID = 18,
            topic = "唐代诗人中别称为诗鬼的诗人是：A.李贺B.李白C.杜甫D.白居易",
            answer = "李贺"
        },
        [19] = {
            ID = 19,
            topic = "不属于文房四宝的是：A.河砚B.宣纸C.湖笔D.徽墨",
            answer = "河砚"
        },
        [20] = {
            ID = 20,
            topic = "我们用“羞花”来形容历史上哪位美女？A.杨贵妃B.貂蝉C.西施D.王昭君",
            answer = "杨贵妃"
        },
        [21] = {
            ID = 21,
            topic = "“天知、神知、我知、子知”，最早是汉代人杨震说的，他说这句话的目的是为了：A.拒绝收礼B.劝人投案C.替人投案D.向人发誓",
            answer = "拒绝收礼"
        },
        [22] = {
            ID = 22,
            topic = "微剧是什麽传统戏剧的前身？A.京剧B.川剧C.湘剧D.豫剧",
            answer = "京剧"
        },
        [23] = {
            ID = 23,
            topic = "京剧服装中男性角色蟒袍上的动物是：A.龙B.蛇C.虎D.凤",
            answer = "龙"
        },
        [24] = {
            ID = 24,
            topic = "下列哪部作品不是冯梦龙的着作？A.西厢记B.醒世恒言C.初刻拍案惊奇D.喻世明言",
            answer = "西厢记"
        },
        [25] = {
            ID = 25,
            topic = "四书包括：《论语》、《大学》、《孟子》和A.中庸B.春秋C.周易D.礼记",
            answer = "中庸"
        },
        [26] = {
            ID = 26,
            topic = "五代包括：后梁、后唐、后晋、后汉和A.后周B.东周C.南宋D.北宋",
            answer = "后周"
        },
        [27] = {
            ID = 27,
            topic = "下列哪部作品不是陶渊明的A.岳阳楼记B.归去来兮辞C.归园田居D.桃花源记",
            answer = "岳阳楼记"
        },
        [28] = {
            ID = 28,
            topic = "“交头接耳”这个成语出自下列哪部作品A.单刀会B.西游记C.红楼梦D.三国演义",
            answer = "单刀会"
        },
        [29] = {
            ID = 29,
            topic = "孔子是哪国人A.鲁国B.秦国C.齐国D.韩国",
            answer = "鲁国"
        },
        [30] = {
            ID = 30,
            topic = "地动仪发明于哪个朝代A.东汉B.西汉C.西晋D.东晋",
            answer = "东汉"
        },
        [31] = {
            ID = 31,
            topic = "千古第一才女是谁？A.李清照B.蔡文姬C.鱼玄机D.薛涛",
            answer = "李清照"
        },
        [32] = {
            ID = 32,
            topic = "“初出茅庐”中的“茅庐”本意是指谁的住处？A.诸葛亮B.刘备C.关羽D.司马懿",
            answer = "诸葛亮"
        },
        [33] = {
            ID = 33,
            topic = "如果你生活在唐代，明天就要参加科举考试，如熬夜看书打磕睡，你将可能用哪种方法来提神？A.饮茶B.喝咖啡C.抽烟D.喝酒",
            answer = "饮茶"
        },
        [34] = {
            ID = 34,
            topic = "创造了“望、闻、问、切”的四诊法，一直成为为中国传统医学的主要诊查手段的我国古代名医是？A.扁鹊B.华佗C.葛洪D.李时珍",
            answer = "扁鹊"
        },
        [35] = {
            ID = 35,
            topic = "“大清”的国号是哪位清朝皇帝定的？A.皇太极B.康熙C.雍正D.乾隆",
            answer = "皇太极"
        },
        [36] = {
            ID = 36,
            topic = "魏忠贤是在哪个皇帝当政期间乱政？A.天启B.万历C.永乐D.天顺",
            answer = "天启"
        },
        [37] = {
            ID = 37,
            topic = "我国的传统节日之一端午节相传是为了纪念战国时期的大诗人屈原。他生活在当时的哪一国家？A.楚国B.魏国C.齐国D.燕国",
            answer = "楚国"
        },
        [38] = {
            ID = 38,
            topic = "“开辟荆榛，千秋功业；驱逐荷虏，一代英雄。”此联称颂的英雄是？A.郑成功B.霍去病C.卫青D.刘备",
            answer = "郑成功"
        },
        [39] = {
            ID = 39,
            topic = "第一个横渡大西洋到达美洲的欧洲航海家是？A.哥伦布B.达伽马C.迪亚士D.麦哲伦",
            answer = "哥伦布"
        },
        [40] = {
            ID = 40,
            topic = "指出鸦片“流毒于天下，则为害甚巨，法当从严。若犹泄泄视之，是使数十年后，中原几无可以御敌之兵，且无可以充饷之银。”的人是？A.林则徐B.骆秉章C.左宗棠D.曾国藩",
            answer = "林则徐"
        },
        [41] = {
            ID = 41,
            topic = "郭沫若写的对联“世上疮痍，诗中圣哲；民间疾苦，笔底波澜”概括了谁的伟大成就？A.杜甫B.李白C.李清照D.白居易",
            answer = "杜甫"
        },
        [42] = {
            ID = 42,
            topic = "“写鬼写妖，高人一等；刺贪刺虐，入骨三分。”此联是对何人作品高度而又恰如其分的评价？A.蒲松龄B.曹雪芹C.孔尚任D.纪晓岚",
            answer = "蒲松龄"
        },
        [43] = {
            ID = 43,
            topic = "澳门回归的日期是A.99年12月20B.99年12月21C.99年12月22D.99年12月23",
            answer = "99年12月20"
        },
        [44] = {
            ID = 44,
            topic = "我国科举制度正式形成于A.隋朝B.汉朝C.清朝D.明朝",
            answer = "隋朝"
        },
        [45] = {
            ID = 45,
            topic = "隋炀帝发动的三次战争是对A.高丽B.匈奴C.北魏D.突厥",
            answer = "高丽"
        },
        [46] = {
            ID = 46,
            topic = "626年发动“玄武门之变”的是A.李世民B.李渊C.李元吉D.李建成",
            answer = "李世民"
        },
        [47] = {
            ID = 47,
            topic = "唐太宗时期，先后进谏200多次的着名大臣是A.魏征B.房玄龄C.姚崇D.杜如晦",
            answer = "魏征"
        },
        [48] = {
            ID = 48,
            topic = "历史上把唐太宗统治时期称为A.贞观之治B.开元盛世C.开皇之治D.光武中兴",
            answer = "贞观之治"
        },
        [49] = {
            ID = 49,
            topic = "我国饮茶之风风靡全国始于A.唐朝B.南北朝C.汉朝D.秦朝",
            answer = "唐朝"
        },
        [50] = {
            ID = 50,
            topic = "下列农具中，可用于灌溉的是A.筒车B.水排C.耧车D.曲辕犁",
            answer = "筒车"
        },
        [51] = {
            ID = 51,
            topic = "维吾尔族的祖先在唐玄宗时被称作A.回鹘B.兀儿C.回纥D.突厥",
            answer = "回鹘"
        },
        [52] = {
            ID = 52,
            topic = "唐朝的外国留学生中，人数最多的是A.新罗人B.波斯人C.高丽人D.日本人",
            answer = "新罗人"
        },
        [53] = {
            ID = 53,
            topic = "唐玄宗统治后期的年号是A.天宝B.贞观C.开元D.开皇",
            answer = "天宝"
        },
        [54] = {
            ID = 54,
            topic = "后世尊称的“药王”是A.孙思邈B.僧一行C.李时珍D.扁鹊",
            answer = "孙思邈"
        },
        [55] = {
            ID = 55,
            topic = "欧洲第一部由国家编定并颁布的药典比我国晚了A.800年B.700年C.600年D.900年",
            answer = "800年"
        },
        [56] = {
            ID = 56,
            topic = "隋朝建立于A.581年B.585年C.587年D.589年",
            answer = "581年"
        },
        [57] = {
            ID = 57,
            topic = "杜甫在《八阵图》《蜀相》和《咏怀古迹》诗中都写到同一个人，这个人是A.诸葛亮B.曹操C.孙权D.刘备",
            answer = "诸葛亮"
        },
        [58] = {
            ID = 58,
            topic = "飞《满江红》中，有“笑谈渴饮匈奴血”一句，其中“匈奴”是指A.女真统治者B.西夏统治者C.蒙古统治者D.契丹统治者",
            answer = "女真统治者"
        },
        [59] = {
            ID = 59,
            topic = "下列着作中属于语录体散文集的是A.《论语》B.《左传》C.《战国策》D.《史记》",
            answer = "《论语》"
        },
        [60] = {
            ID = 60,
            topic = "史湘云是下列哪一部作品中的人物？A.红楼梦B.水浒传C.聊斋志异D.西厢记",
            answer = "红楼梦"
        },
        [61] = {
            ID = 61,
            topic = "我国第一部字典是A.说文解字B.康熙字典C.辞源D.尔雅",
            answer = "说文解字"
        },
        [62] = {
            ID = 62,
            topic = "晚唐诗坛上，与温庭筠并称为“温李”、又与杜牧并称为“小李杜”的诗\n\n人是A.李商隐B.李煜C.李白D.李贺",
            answer = "李商隐"
        },
        [63] = {
            ID = 63,
            topic = "“项庄舞剑，意在沛公”这个成语出自A.史记B.汉书C.后汉书D.三国志",
            answer = "史记"
        },
        [64] = {
            ID = 64,
            topic = "我国古代戏曲中的杰作《西厢记》的作者是A.王实甫B.关汉卿C.白朴D.马致远",
            answer = "王实甫"
        },
        [65] = {
            ID = 65,
            topic = "北宋词坛豪放派的代表作家是A.苏轼B.欧阳修C.柳永D.辛弃疾",
            answer = "苏轼"
        },
        [66] = {
            ID = 66,
            topic = "被尊奉为华夏族祖先的人是A.黄帝B.盘古C.女娲D.大禹",
            answer = "黄帝"
        },
        [67] = {
            ID = 67,
            topic = "建立历史上第一个大一统的封建帝国的人是A.秦始皇B.汉高祖C.汉武帝D.秦昭襄王",
            answer = "秦始皇"
        },
        [68] = {
            ID = 68,
            topic = "《天工开物》是我国最早的工艺百科全书，它的作者是明朝的A.宋应星B.郦道元C.沈括D.徐霞客",
            answer = "宋应星"
        },
        [69] = {
            ID = 69,
            topic = "下列作品属于编年体历史着作的是A.左传B.史记C.国语D.战国策",
            answer = "左传"
        },
        [70] = {
            ID = 70,
            topic = "杭州是我国七大古都之一，下列哪个朝代的都城在杭州？A.南宋B.北宋C.西汉D.东汉",
            answer = "南宋"
        },
        [71] = {
            ID = 71,
            topic = "最早设立“太学”培养人才的皇帝是A.汉武帝B.汉高祖C.唐太宗D.秦始皇",
            answer = "汉武帝"
        },
        [72] = {
            ID = 72,
            topic = "“琴挑文君”这个典故的主人公是A.司马相如B.司马光C.司马迁D.杨雄",
            answer = "司马相如"
        },
        [73] = {
            ID = 73,
            topic = "2008年在我国北京举办的奥运会是第几届夏季奥运会？A.29B.27C.30D.19",
            answer = "29"
        },
        [74] = {
            ID = 74,
            topic = "下列哪个奖项不在诺贝尔奖之列?A.数学奖B.医学奖C.物理学奖D.经济学奖",
            answer = "数学奖"
        },
        [75] = {
            ID = 75,
            topic = "悲剧《哈姆雷特》的作者是英国着名戏剧家A.莎士比亚B.托尔斯泰C.狄更斯D.萧伯纳",
            answer = "莎士比亚"
        },
        [76] = {
            ID = 76,
            topic = "下列哪些蚊子会吸人的血？A.雌蚊B.雄蚊C.所有蚊子D.蚊子不吸血",
            answer = "雌蚊"
        },
        [77] = {
            ID = 77,
            topic = "引起煤气中毒的主要气体是A.COB.CO2C.O2D.H2",
            answer = "CO"
        },
        [78] = {
            ID = 78,
            topic = "新疆的哈密瓜之所以甘甜主要是因为A.日夜温差大B.气候乾燥C.雪水灌溉D.日照充足",
            answer = "日夜温差大"
        },
        [79] = {
            ID = 79,
            topic = "一对夫妇生了3个女孩，再生一个女孩的可能性是A.0.5B.0.33C.1D.0",
            answer = "0.5"
        },
        [80] = {
            ID = 80,
            topic = "人体最大的解毒器官是A.肝脏B.肾脏C.肺D.胃",
            answer = "肝脏"
        },
        [81] = {
            ID = 81,
            topic = "青蛙是两栖动物，那麽两栖动物的祖先是以下哪种动物？A.鱼B.鲸C.龟D.人",
            answer = "鱼"
        },
        [82] = {
            ID = 82,
            topic = "人体最大的器官是什麽?A.皮肤B.肾脏C.肝脏D.胃",
            answer = "皮肤"
        },
        [83] = {
            ID = 83,
            topic = "下列水产品中，属于鱼的是?A.黄鳝B.甲鱼C.鲸D.虾",
            answer = "黄鳝"
        },
        [84] = {
            ID = 84,
            topic = "在显微镜下观察小鱼尾鳍的血液流动，其中有的血管红细胞只能单行通过，这种血管是A.毛细血管B.毛细淋巴管C.静脉D.动脉",
            answer = "毛细血管"
        },
        [85] = {
            ID = 85,
            topic = "蟑螂，也就是我们俗称的小强，它的头被切掉后还可以存活多长时间?A.5-10分钟B.1个小时C.1-3天D.7天左右",
            answer = "5-10分钟"
        },
        [86] = {
            ID = 86,
            topic = "世界上最小的鸟是A.蜂鸟B.麻雀C.燕子D.鹦鹉",
            answer = "蜂鸟"
        },
        [87] = {
            ID = 87,
            topic = "鱼儿在一天中的什麽时候最容易因缺氧窒息而翻塘？A.早晨B.中午C.傍晚D.淩晨",
            answer = "早晨"
        },
        [88] = {
            ID = 88,
            topic = "我们所说的“四不像”是指那种动物？A.麋鹿B.马C.牛D.犀牛",
            answer = "麋鹿"
        },
        [89] = {
            ID = 89,
            topic = "生物体是纷繁复杂形态多样的，但最基本的骨架却是由什麽构成的：A.蛋白质B.糖C.脂肪D.核酸",
            answer = "蛋白质"
        },
        [90] = {
            ID = 90,
            topic = "被国际上誉为“杂交水稻之父”的中国科学家是A.袁隆平B.谈家桢C.陈竺D.青先国",
            answer = "袁隆平"
        },
        [91] = {
            ID = 91,
            topic = "蛋白质是由氨基酸组成的，组成蛋白质的天然氨基酸约有多少种:A.20B.25C.22D.18",
            answer = "20"
        },
        [92] = {
            ID = 92,
            topic = "生命活动的基本特徵是A.新陈代谢B.氧化反应C.做功D.运动",
            answer = "新陈代谢"
        },
        [93] = {
            ID = 93,
            topic = "地球上最早出现的进行光合作用的生命是A.蓝藻B.绿藻C.团藻D.衣藻",
            answer = "蓝藻"
        },
        [94] = {
            ID = 94,
            topic = "下列有关沙漠之舟--骆驼的驼峰的说法正确的是A.贮脂肪B.贮水C.驮物品D.美观",
            answer = "贮脂肪"
        },
        [95] = {
            ID = 95,
            topic = "\"红娘\"由来是出自下列哪部古典名剧:A.西厢记B.琵琶记C.长生殿D.桃花扇",
            answer = "西厢记"
        },
        [96] = {
            ID = 96,
            topic = "我国第一部有声影片是A.歌女红牡丹B.定军山C.林则徐D.玉人何处",
            answer = "歌女红牡丹"
        },
        [97] = {
            ID = 97,
            topic = "没有在入海口形成三角洲的河流是A.钱塘江B.长江C.黄河D.珠江",
            answer = "钱塘江"
        },
        [98] = {
            ID = 98,
            topic = "宾士汽车原产于哪一个国家?A.德国B.中国C.美国D.日本",
            answer = "德国"
        },
        [99] = {
            ID = 99,
            topic = "北京大学的第一位校长是A.严复B.蔡元培C.胡适D.林建华",
            answer = "严复"
        },
        [100] = {
            ID = 100,
            topic = "大汶口文化遗址在我国的什麽地方A.山东B.广西C.甘肃D.湖南",
            answer = "山东"
        },
        [101] = {
            ID = 101,
            topic = "被誉为“浑身都是音乐”的着名指挥家是：A.小泽征尔B.梅达C.卡拉扬D.伯恩施坦",
            answer = "小泽征尔"
        },
        [102] = {
            ID = 102,
            topic = "“民为贵,社稷次之,君为轻”这句话出自A.孟子B.孔子C.韩非子D.庄子",
            answer = "孟子"
        },
        [103] = {
            ID = 103,
            topic = "莎士比亚四大悲剧中哪部又称\"王子复仇记\":A.哈姆雷特B.奥赛罗C.麦克白斯D.李尔王",
            answer = "哈姆雷特"
        },
        [104] = {
            ID = 104,
            topic = "世界上最大的宫殿是A.故宫B.白宫C.爱丽舍宫D.克里姆林宫",
            answer = "故宫"
        },
        [105] = {
            ID = 105,
            topic = "六弦琴是什麽乐器的别称A.吉他B.二胡C.小提琴D.古筝",
            answer = "吉他"
        },
        [106] = {
            ID = 106,
            topic = "\"破釜沉舟\"这个成语出于哪次战争?A.巨鹿制作B.长平之战C.官渡之战D.赤壁之战",
            answer = "巨鹿制作"
        },
        [107] = {
            ID = 107,
            topic = "一般而言，肥胖是指超过理想体重的百分之多少A.0.2B.0.1C.0.3D.0.4",
            answer = "0.2"
        },
        [108] = {
            ID = 108,
            topic = "《献血法》规定，献血者两次献血间隔时间不得少于A.六个月B.三个月C.八个月D.一年",
            answer = "六个月"
        },
        [109] = {
            ID = 109,
            topic = "西洋占星术中将一年分成十二个星座，以下哪个不是土像星座？A.牡羊座B.处女座C.金牛座D.摩羯座",
            answer = "牡羊座"
        },
        [110] = {
            ID = 110,
            topic = "下列着名作家哪位不是19世纪英国诗坛三大巨星之一:A.笛福B.济慈C.雪莱D.拜伦",
            answer = "笛福"
        },
        [111] = {
            ID = 111,
            topic = "世界哪一个国家的茶叶产量最多A.印度B.中国C.日本D.韩国",
            answer = "印度"
        },
        [112] = {
            ID = 112,
            topic = "世界读书日是什麽时候A.4.23B.5.13C.9.11D.6.28",
            answer = "4.23"
        },
        [113] = {
            ID = 113,
            topic = "我们通常所说的“北斗七星”，天文学上称之为A.大熊星座B.狮子星座C.小熊星座D.半人马座",
            answer = "大熊星座"
        },
        [114] = {
            ID = 114,
            topic = "下列科学家中哪位是犹太人A.爱因斯坦B.拉瓦锡C.牛顿D.培根",
            answer = "爱因斯坦"
        },
        [115] = {
            ID = 115,
            topic = "《西游记》中的火焰山在哪里？A.中国吐鲁番B.哈萨克斯坦C.巴基斯坦D.中国重庆",
            answer = "中国吐鲁番"
        },
        [116] = {
            ID = 116,
            topic = "按照宇宙大爆炸理论，宇宙的年龄估计有A.120亿年B.150亿年C.50亿年D.200亿年",
            answer = "120亿年"
        },
        [117] = {
            ID = 117,
            topic = "以下历史事件中，与关羽无关的是A.七擒七纵B.单刀赴会C.水淹七军D.大意失荆州",
            answer = "七擒七纵"
        },
        [118] = {
            ID = 118,
            topic = "巴黎凯旋门是为纪念谁而建A.拿破仑B.哥伦布C.路易D.丘吉尔",
            answer = "拿破仑"
        },
        [119] = {
            ID = 119,
            topic = "中国古代的青铜器，造型新颖，种类繁多，以商、周、春秋时期的为多。\n其主要成分是A.铜与锡B.铜与钢C.铜与铁D.铜",
            answer = "铜与锡"
        },
        [120] = {
            ID = 120,
            topic = "下列世界奇迹哪个位于伊拉克A.空中花园B.宙斯神像C.太阳神像D.金字塔",
            answer = "空中花园"
        },
        [121] = {
            ID = 121,
            topic = "弱冠指的是多少岁A.二十岁B.十岁C.三十岁D.四十岁",
            answer = "二十岁"
        },
        [122] = {
            ID = 122,
            topic = "根据有关规定，职工的试用期最长不得超过A.六个月B.一个月C.三个月D.一年",
            answer = "六个月"
        },
        [123] = {
            ID = 123,
            topic = "一度电可供一只50瓦的灯泡照明几小时?A.20B.5C.10D.30",
            answer = "20"
        },
        [124] = {
            ID = 124,
            topic = "不锈钢中的什麽元素使这种合金钢不生锈A.铬B.钼C.钨D.锰",
            answer = "铬"
        },
        [125] = {
            ID = 125,
            topic = "《流星花园》中，饰演花泽类的是哪位男演员？A.周渝民B.言承旭C.朱孝天D.胡歌",
            answer = "周渝民"
        },
        [126] = {
            ID = 126,
            topic = "癞蛤蟆的学名叫什麽？A.蟾蜍B.青蛙C.牛蛙D.美蛙",
            answer = "蟾蜍"
        },
        [127] = {
            ID = 127,
            topic = "知了是哪种昆虫的俗称？A.蝉B.螳螂C.天牛D.蝴蝶",
            answer = "蝉"
        },
        [128] = {
            ID = 128,
            topic = "我国预警信号最高级别的是什麽颜色预警？A.红色B.黄色C.橙色D.蓝色",
            answer = "红色"
        },
        [129] = {
            ID = 129,
            topic = "暴雨预警最低级别额的是什麽颜色的预警？A.蓝色B.橙色C.黄色D.红色",
            answer = "蓝色"
        },
        [130] = {
            ID = 130,
            topic = "“433”“442”“352”阵型是哪种运动的术语？A.足球B.篮球C.乒乓球D.橄榄球",
            answer = "足球"
        },
        [131] = {
            ID = 131,
            topic = "\"抢7”“鹰眼”是哪项运动的术语？A.网球B.乒乓球C.羽毛球D.篮球",
            answer = "网球"
        },
        [132] = {
            ID = 132,
            topic = "《孟子》中讲到，我国古代婚姻讲究父母之命，什麽之言？A.媒妁B.媒婆C.长辈D.姑妈",
            answer = "媒妁"
        },
        [133] = {
            ID = 133,
            topic = "我们常说在分配制度上平均主义，干好干坏都一样叫做吃什麽饭？A.大锅饭B.平均饭C.一锅饭D.大碗饭",
            answer = "大锅饭"
        },
        [134] = {
            ID = 134,
            topic = "去普吉岛旅游应该办理哪个国家的签证？A.泰国B.韩国C.日本D.缅甸",
            answer = "泰国"
        },
        [135] = {
            ID = 135,
            topic = "“凯撒大帝”是古代哪一个国家的杰出军事统帅？A.古罗马B.古希腊C.古印度D.古埃及",
            answer = "古罗马"
        },
        [136] = {
            ID = 136,
            topic = "“三十而立”出自中国哪本古籍？A.论语B.庄子C.孟子D.道德经",
            answer = "论语"
        },
        [137] = {
            ID = 137,
            topic = "《至少还有你》是哪位歌手原唱的？A.林忆莲B.王菲C.林俊杰D.周杰伦",
            answer = "林忆莲"
        },
        [138] = {
            ID = 138,
            topic = "十二生肖排在龙前面一位的是？A.兔B.马C.蛇D.鼠",
            answer = "兔"
        },
        [139] = {
            ID = 139,
            topic = "有“抗癌之王”之称的食物是？A.大蒜B.大葱C.洋葱D.生姜",
            answer = "大蒜"
        },
        [140] = {
            ID = 140,
            topic = "胡萝卜素和下列哪种调料相克？A.醋B.酱油C.味精D.盐",
            answer = "醋"
        },
        [141] = {
            ID = 141,
            topic = "下列哪种花卉是吸收甲醛的好手？A.芦荟B.月季C.雏菊D.喇叭花",
            answer = "芦荟"
        },
        [142] = {
            ID = 142,
            topic = "下列哪种水果有解酒的效果？A.香蕉B.西瓜C.橘子D.梨",
            answer = "香蕉"
        },
        [143] = {
            ID = 143,
            topic = "下列乾果中，脂肪含量最高的是？A.核桃B.花生C.瓜子D.杏仁",
            answer = "核桃"
        },
        [144] = {
            ID = 144,
            topic = "经常服用下列哪种食物可能引起铅中毒？A.松花蛋B.鸭蛋C.鸡蛋D.鹅蛋",
            answer = "松花蛋"
        },
        [145] = {
            ID = 145,
            topic = "在野外吃了有毒的蘑菇，你应该立即服用：A.大量喝水B.喝盐水C.喝牛奶D.喝醋",
            answer = "大量喝水"
        },
        [146] = {
            ID = 146,
            topic = "用温度多高的水洗澡最好？A.40摄氏度B.50摄氏度C.60摄氏度D.30摄氏度",
            answer = "40摄氏度"
        },
        [147] = {
            ID = 147,
            topic = "花椒的果实长在A.树上B.根部C.地表D.地底",
            answer = "树上"
        },
        [148] = {
            ID = 148,
            topic = "大自然中废纸的分解需要几个月A.3到4B.1到2C.5到6D.7到8",
            answer = "3到4"
        },
        [149] = {
            ID = 149,
            topic = "足球最早起源于哪个国家A.中国B.英国C.义大利D.德国",
            answer = "中国"
        },
        [150] = {
            ID = 150,
            topic = "涮羊肉起源于A.元朝B.唐朝C.明朝D.宋朝",
            answer = "元朝"
        },
        [151] = {
            ID = 151,
            topic = "最早的校园歌曲出自于A.日本B.中国C.美国D.英国",
            answer = "日本"
        },
        [152] = {
            ID = 152,
            topic = "人们最初发明滑冰，是把它当做A.交通工具B.运动专案C.娱乐专案D.传统习俗",
            answer = "交通工具"
        },
        [153] = {
            ID = 153,
            topic = "被称为菊月的的月份是？A.九月B.八月C.十月D.十一月",
            answer = "九月"
        },
        [154] = {
            ID = 154,
            topic = "下列哪类食物是酸性食物？A.鸡蛋B.茶叶C.大白菜D.牛奶",
            answer = "鸡蛋"
        },
        [155] = {
            ID = 155,
            topic = "谷类，薯类是我国膳食能量的主要来源，但是其主要的缺陷是缺乏：A.蛋白质B.碳水化合物C.维生素D.脂肪",
            answer = "蛋白质"
        },
        [156] = {
            ID = 156,
            topic = "鸡蛋与什麽同煮会使氨基酸形成果糖机赖氨酸的结合物，不利于身体健康？A.白糖B.红糖C.豆浆D.矿泉水",
            answer = "白糖"
        },
        [157] = {
            ID = 157,
            topic = "黄瓜甘寒，花生仁多油脂，两者共同使用容易导致：A.腹泻B.感冒C.头晕D.咳嗽",
            answer = "腹泻"
        },
        [158] = {
            ID = 158,
            topic = "人们在收拾鱼身是，涂上什麽可以防滑？A.醋B.酱油C.盐水D.酒",
            answer = "醋"
        },
        [159] = {
            ID = 159,
            topic = "感冒忌用下列哪一种食物？A.海鱼B.豆浆C.青菜D.生姜",
            answer = "海鱼"
        },
        [160] = {
            ID = 160,
            topic = "饮酒对一下哪个器官危害最大？A.心脏B.皮肤C.眼睛D.肺",
            answer = "心脏"
        },
        [161] = {
            ID = 161,
            topic = "苹果中含有增强记忆力的微量元素是？A.锌B.钙C.铁D.碘",
            answer = "锌"
        },
        [162] = {
            ID = 162,
            topic = "速食面里面必定含有那种添加剂A.合成抗氧化剂B.防腐剂C.食用色素D.漂白粉",
            answer = "合成抗氧化剂"
        },
        [163] = {
            ID = 163,
            topic = "低盐饮食有助于预防什麽疾病？A.高血压B.糖尿病C.乙肝D.贫血",
            answer = "高血压"
        },
        [164] = {
            ID = 164,
            topic = "自然界中，有智慧元素之称的是A.碘B.锌C.钙D.铁",
            answer = "碘"
        },
        [165] = {
            ID = 165,
            topic = "下列哪种食物可以食用？A.发绿的豆芽B.发霉的茶叶C.变红的汤圆D.发芽的土豆",
            answer = "发绿的豆芽"
        },
        [166] = {
            ID = 166,
            topic = "土豆不宜放在什麽地方？A.日光照射处B.通风处C.乾燥处D.卧室",
            answer = "日光照射处"
        },
        [167] = {
            ID = 167,
            topic = "小明家灯泡灯丝断了，他晃了晃让灯丝搭上，发现亮度跟以前比A.更亮B.更暗C.一样亮D.不亮了",
            answer = "更亮"
        },
        [168] = {
            ID = 168,
            topic = "日光灯引发火灾的主要部件是A.镇流器B.灯座C.灯管D.灯线",
            answer = "镇流器"
        },
        [169] = {
            ID = 169,
            topic = "发现火灾是，最重要的是做什麽？才能及时救火A.报警B.喊人C.逃跑D.自己救火",
            answer = "报警"
        },
        [170] = {
            ID = 170,
            topic = "优质油不应该有的特徵是？A.油色暗淡B.无悬浮物C.清洗透明D.没有沉淀",
            answer = "油色暗淡"
        },
        [171] = {
            ID = 171,
            topic = "哪一种蔬菜具有抵抗肠胃癌的功能？A.包心菜B.白菜C.花菜D.菠菜",
            answer = "包心菜"
        },
        [172] = {
            ID = 172,
            topic = "凉皮面是哪里的特色小吃？A.西安B.武汉C.成都D.重庆",
            answer = "西安"
        },
        [173] = {
            ID = 173,
            topic = "喝啤酒不宜用什麽做下酒菜？A.海鲜B.花生米C.牛肉D.咸菜",
            answer = "海鲜"
        },
        [174] = {
            ID = 174,
            topic = "热咖啡在哪个温度下和最可口？A.70B.60C.50D.80",
            answer = "70"
        },
        [175] = {
            ID = 175,
            topic = "双喜临门。形容哪个省市的名称？A.重庆B.西安C.成都D.北京",
            answer = "重庆"
        },
        [176] = {
            ID = 176,
            topic = "黄种人主要分布在？A.亚种东部B.亚洲西部C.欧洲D.美洲",
            answer = "亚种东部"
        },
        [177] = {
            ID = 177,
            topic = "诺贝尔是哪国人？A.瑞典B.波兰C.挪威D.德国",
            answer = "瑞典"
        },
        [178] = {
            ID = 178,
            topic = "七月流星指天气？A.转凉B.暴雨C.闷热D.燥热",
            answer = "转凉"
        },
        [179] = {
            ID = 179,
            topic = "名不正则言不顺是哪家的思想？A.儒家B.墨家C.兵家D.道家",
            answer = "儒家"
        },
        [180] = {
            ID = 180,
            topic = "昙花是在那个时间段开花？A.晚上B.上午C.中午D.下午",
            answer = "晚上"
        },
        [181] = {
            ID = 181,
            topic = "国色天香最初是形容A.牡丹B.菊花C.桂花D.茉莉花",
            answer = "牡丹"
        },
        [182] = {
            ID = 182,
            topic = "天方夜谭的天方是指A.古阿拉伯B.古希腊C.古印度D.古埃及",
            answer = "古阿拉伯"
        },
        [183] = {
            ID = 183,
            topic = "亢龙有悔出自A.易经B.道德经C.诗经D.楚辞",
            answer = "易经"
        },
        [184] = {
            ID = 184,
            topic = "被称为杏月的是几月A.二月B.一月C.三月D.四月",
            answer = "二月"
        },
        [185] = {
            ID = 185,
            topic = "霜淇淋是哪国传来的外来语A.英国B.法国C.德国D.印度",
            answer = "英国"
        },
        [186] = {
            ID = 186,
            topic = "“冬天来了，春天还会远麽？”出自哪位作家？A.雪莱B.雨果C.拜伦D.普斯金",
            answer = "雪莱"
        },
        [187] = {
            ID = 187,
            topic = "占人体细胞50%以上的有机化合物是？A.蛋白质B.糖元C.脂肪D.核酸",
            answer = "蛋白质"
        },
        [188] = {
            ID = 188,
            topic = "中国象棋双方各有几种棋子？A.七种B.八种C.六种D.五种",
            answer = "七种"
        },
        [189] = {
            ID = 189,
            topic = "人脑中控制平衡的是？A.小脑B.左脑C.右脑D.神经中枢",
            answer = "小脑"
        },
        [190] = {
            ID = 190,
            topic = "山东，山西的山是指什麽山？A.太行山B.衡山C.泰山D.黄山",
            answer = "太行山"
        },
        [191] = {
            ID = 191,
            topic = "下列哪种是能降血压的蔬菜A.芹菜B.韭菜C.菠菜D.包菜",
            answer = "芹菜"
        },
        [192] = {
            ID = 192,
            topic = "一年有几个节气？A.24B.23C.21D.20",
            answer = "24"
        },
        [193] = {
            ID = 193,
            topic = "沙爹牛肉是哪国传入我国的小吃？A.印尼B.日本C.拉美D.欧美",
            answer = "印尼"
        },
        [194] = {
            ID = 194,
            topic = "蟋蟀是靠什麽发出鸣叫的A.翅膀B.触角C.嘴巴D.声道",
            answer = "翅膀"
        },
        [195] = {
            ID = 195,
            topic = "苍蝇飞落某处就冲忙搓脚，它是在？A.品尝味道B.休息C.进食D.辨别方向",
            answer = "品尝味道"
        },
        [196] = {
            ID = 196,
            topic = "新郎官最早是用来指：A.新科进士B.状元C.举人D.新人的南方",
            answer = "新科进士"
        },
        [197] = {
            ID = 197,
            topic = "下列哪个元素污染大气或饮水时，可能引起人的牙齿骨质疏松？A.氟B.碘C.硫D.汞",
            answer = "氟"
        },
        [198] = {
            ID = 198,
            topic = "人们常说的“五金”不包括A.锌B.金C.铁D.锡",
            answer = "锌"
        },
        [199] = {
            ID = 199,
            topic = "营养学家分析了个颜色蔬菜的营养成分，下列哪种颜色蔬菜营养物质最低？A.白色B.绿色C.红色D.黄色",
            answer = "白色"
        },
        [200] = {
            ID = 200,
            topic = "长使用铝制品作为食品溶剂容易引发哪种疾病？A.老年痴呆B.甲状腺肿大C.肠胃疾病D.癌症",
            answer = "老年痴呆"
        },
        [201] = {
            ID = 201,
            topic = "现在美国国旗星条上有多少颗星？A.50B.51C.53D.40",
            answer = "50"
        },
        [202] = {
            ID = 202,
            topic = "废旧电池乱丢可能对人造成A.镉中毒B.铅中毒C.铁中毒D.氰中毒",
            answer = "镉中毒"
        },
        [203] = {
            ID = 203,
            topic = "含磷洗衣粉中的什麽是造成水体富营养化的罪魁祸首？A.磷酸盐B.磷酸C.甲醛D.萤光粉",
            answer = "磷酸盐"
        },
        [204] = {
            ID = 204,
            topic = "数字符号中的“0”起源于A.古印度B.古希腊C.古罗马D.古埃及",
            answer = "古印度"
        },
        [205] = {
            ID = 205,
            topic = "如果你有机会到宝岛台湾一游，建议你到台南市参观当地的名胜古迹----赤嵌楼。这里敬奉着一位民族英雄，他是A.郑成功B.戚继光C.郑和D.林则徐",
            answer = "郑成功"
        },
        [206] = {
            ID = 206,
            topic = "有人认为英国“革命前是国王的议会，革命后是议会的国王”。这表明英国资产阶级革命后确立了A.君主立宪制B.君主专制制度C.总统制D.民主共和制",
            answer = "君主立宪制"
        },
        [207] = {
            ID = 207,
            topic = "我国经济特区和香港、澳门特别行政区的最大区别在于？A.社会制度不同B.外交政策不同C.主权归属不同D.经济政策不同",
            answer = "社会制度不同"
        },
        [208] = {
            ID = 208,
            topic = "三峡游已成为时下的一条旅游热线。以下古代着作中，对三峡两岸景物作了生动描写的是A.水经注B.天工开物C.齐民要术D.九章算术",
            answer = "水经注"
        },
        [209] = {
            ID = 209,
            topic = "初一小明想了解一下秦朝的历史，他应该看下列哪本书?A.史记B.春秋C.左传D.汉书",
            answer = "史记"
        },
        [210] = {
            ID = 210,
            topic = "复旦大学校训“博学而笃志，切问而近思”出自中国某典籍，全句是“博学而笃志，切问而近思，仁在其中矣”。你认为该典籍是A.论语B.道德经C.孙子兵法D.韩非子",
            answer = "论语"
        },
        [211] = {
            ID = 211,
            topic = "状元是“士”中的极品，而工商业是被人看不起的“末业”，在清末偏偏有一位状元“舍本逐末”、“实业救国”，此人是A.张謇B.詹天佑C.严复D.曾国藩",
            answer = "张謇"
        },
        [212] = {
            ID = 212,
            topic = "二战后，亚非拉的许多国家摆脱了殖民枷锁，获得独立。其中走上了与中华人民共和国相同道路的是A.古巴B.纳米比亚C.埃及D.印度",
            answer = "古巴"
        },
        [213] = {
            ID = 213,
            topic = "“列强的炮声惊醒了古老中华帝国的美梦，中华民族的屈辱史——中国近代史开始了”。“列强的炮声”指的是A.鸦片战争B.第二次鸦片战争C.甲午中日战争D.八国联军侵华战争",
            answer = "鸦片战争"
        },
        [214] = {
            ID = 214,
            topic = "五一长假，小聪高兴地实现了到元谋人遗址去参观、探究的愿望。元谋人遗址在我国的A.云南省B.贵州省C.浙江省D.陕西省",
            answer = "云南省"
        },
        [215] = {
            ID = 215,
            topic = "早在战国时期，秦国曾在岷江修筑过类似的水利工程至今还发挥着防洪灌溉的巨大功能。这项工程是A.都江堰B.郑国渠C.灵渠D.黄河",
            answer = "都江堰"
        },
        [216] = {
            ID = 216,
            topic = "2006年7月，第30届世界遗产大会通过中国安阳殷墟入选《世界遗产名录》。“殷墟”为我们研究哪一朝代的历史提供了依据。A.商朝B.夏朝C.秦朝D.西汉",
            answer = "商朝"
        },
        [217] = {
            ID = 217,
            topic = "下面几位科学家中，对人类文化传播贡献最大的是A.蔡伦B.张仲景C.张衡D.华佗",
            answer = "蔡伦"
        },
        [218] = {
            ID = 218,
            topic = "研制出世界先进的制碱工艺，打破西方国家对碱业的垄断，为我国制碱工业做出贡献的科学家是A.侯德榜B.詹天佑C.严复D.魏源",
            answer = "侯德榜"
        },
        [219] = {
            ID = 219,
            topic = "为欧洲资本主义社会的产生奠定了思想文化基础的是A.文艺复兴B.新航路的开辟C.西欧城市的重新兴起D.三角贸易",
            answer = "文艺复兴"
        },
        [220] = {
            ID = 220,
            topic = "说《封神榜》中有关“炮烙之刑”“以酒为池”“悬肉为林”的描写，反映了统治者的极度暴虐腐朽。这与哪位统治者有关A.商王纣B.夏王桀C.周厉王D.周幽王",
            answer = "商王纣"
        },
        [221] = {
            ID = 221,
            topic = "“春种一粒粟，秋收万颗籽。”据考古发现，使用磨制石器、种植粟的是（A.半坡居民B.河姆渡居民C.山顶洞人D.北京人",
            answer = "半坡居民"
        },
        [222] = {
            ID = 222,
            topic = "象棋中的楚河汉界与下列哪个历史事件有关？A.楚汉之争B.张楚政权C.鸿门宴D.霸王别姬",
            answer = "楚汉之争"
        },
        [223] = {
            ID = 223,
            topic = "相传，造出衣裳、舟车、宫室等，为后世的衣食住行奠定基础的“人文初祖”是A.黄帝B.尧C.舜D.禹",
            answer = "黄帝"
        },
        [224] = {
            ID = 224,
            topic = "你知道“苏湖熟，天下足”这句话表明了两宋时哪个流域成为全国最重要的粮仓A.长江流域B.太湖流域C.黄河流域D.珠江流域",
            answer = "长江流域"
        },
        [225] = {
            ID = 225,
            topic = "“周幽王烽火戏诸侯”、“孔子周游列国”，与“诸侯”“列国”的产生相关的制度是A.分封制B.禅让制C.世袭制D.郡县制",
            answer = "分封制"
        },
        [226] = {
            ID = 226,
            topic = "人们总把“秦皇汉武”并称，他们二人在以下哪个问题上采取了相反的措施A.儒家学说B.外族入侵C.经济发展D.中央集权",
            answer = "儒家学说"
        },
        [227] = {
            ID = 227,
            topic = "抗日战争中，中国军队主动出击日军的最大规模战役是A.百团大战B.淞沪会战C.台儿庄战役D.平型关大捷",
            answer = "百团大战"
        },
        [228] = {
            ID = 228,
            topic = "有的人的名字暗含纪念意义，比如有人名叫“国庆”，因为他出生在国庆日，那麽名叫“纪宪”的人可能出生在哪一年A.1954B.1953C.1952D.1951",
            answer = "1954"
        },
        [229] = {
            ID = 229,
            topic = "元素周期表发明家是哪个国家的人？A.俄罗斯B.美国C.瑞典D.德国",
            answer = "俄罗斯"
        },
        [230] = {
            ID = 230,
            topic = "奠定了三国鼎立书面基础的战役是A.赤壁之战B.巨鹿之战C.火烧乌巢D.官渡之战",
            answer = "赤壁之战"
        },
        [231] = {
            ID = 231,
            topic = "“我要扼住命运的咽喉，它决不能使我完全屈服。”此话是谁的精神写照？A.贝多芬B.梵高C.林肯D.托尔斯泰",
            answer = "贝多芬"
        },
        [232] = {
            ID = 232,
            topic = "“皇帝”“朕”成为我国最高封建统治者的称呼开始于A.秦始皇B.唐太宗C.齐桓公D.汉高祖",
            answer = "秦始皇"
        },
        [233] = {
            ID = 233,
            topic = "商朝时，人们把刻在龟甲、兽骨上文字叫A.甲骨文B.象形文字C.楔形文字D.金文",
            answer = "甲骨文"
        },
        [234] = {
            ID = 234,
            topic = "下列帝王中，与秦始皇对待儒学态度截然不同的是A.汉武帝B.汉高祖C.汉景帝D.光武帝",
            answer = "汉武帝"
        },
        [235] = {
            ID = 235,
            topic = "以下属于我国土生土长的宗教的是A.道教B.佛教C.基督教D.伊斯兰教",
            answer = "道教"
        },
        [236] = {
            ID = 236,
            topic = "北朝时期石窟艺术是随着宗教的传播发展起来的，这种宗教是A.佛教B.道教C.基督教D.伊斯兰教",
            answer = "佛教"
        },
        [237] = {
            ID = 237,
            topic = "“功盖三分国，名成八阵图。江流石不转，遗恨失吞吴。”杜甫这道诗所概括的历史与下列哪一位历史人物最为相关？A.诸葛亮B.孙权C.刘备D.关羽",
            answer = "诸葛亮"
        },
        [238] = {
            ID = 238,
            topic = "善于学习是一个民族进步的源泉，从北魏孝文帝改革的内容看，他主要向哪个民族学习A.汉族B.鲜卑族C.匈奴族D.氐族",
            answer = "汉族"
        },
        [239] = {
            ID = 239,
            topic = "我国现存最早的百科全书式农学名着《齐民要术》的作者是A.贾思勰B.司马迁C.郦道元D.张仲景",
            answer = "贾思勰"
        },
        [240] = {
            ID = 240,
            topic = "“苟利国家生死以，岂因祸福避趋之”这个把民族利益看得高于一切的人物是A.林则徐B.道光帝C.邓世昌D.长者",
            answer = "林则徐"
        },
        [241] = {
            ID = 241,
            topic = "“它是1898年中国最轰动的出版物，它介绍了达尔文的进化论思想，提出了‘物竞天择，适者生存’的观点。”这部着作是A.天演论B.海国图志C.敬告青年D.狂人日记",
            answer = "天演论"
        },
        [242] = {
            ID = 242,
            topic = "主持设计和修筑我国第一条铁路干线——京张铁路的杰出工程师A.詹天佑B.严复C.张之洞D.张謇",
            answer = "詹天佑"
        },
        [243] = {
            ID = 243,
            topic = "世界上面积最大的岛屿是格陵兰岛，其位于A.北美洲B.亚洲C.非洲D.南极洲",
            answer = "北美洲"
        },
        [244] = {
            ID = 244,
            topic = "当我们放寒假过春节时，澳大利亚的小朋友在A.放暑假B.放春假C.放秋假D.放寒假",
            answer = "放暑假"
        },
        [245] = {
            ID = 245,
            topic = "青藏高原纬度较低，但气候寒冷，其最主要的影响因素是A.地形因素B.洋流因素C.纬度位置D.海陆位置",
            answer = "地形因素"
        },
        [246] = {
            ID = 246,
            topic = "下列建筑中，属于伊斯兰教的是A.清真寺B.布达拉宫C.龙泉寺D.巴黎圣母院",
            answer = "清真寺"
        },
        [247] = {
            ID = 247,
            topic = "长江是我国水能蕴藏量最丰富的河流，其水能主要集中的河段是A.上游B.中游C.下游D.河口",
            answer = "上游"
        },
        [248] = {
            ID = 248,
            topic = "我国长江源区、黄河源区和澜沧江源区位于：A.青藏地区B.西北地区C.北方地区D.南方地区",
            answer = "青藏地区"
        },
        [249] = {
            ID = 249,
            topic = "“天苍苍，野茫茫，风吹草低见牛羊”是对以下哪个少数民族聚居的草原景观的描述A.蒙古族B.藏族C.壮族D.维吾尔族",
            answer = "蒙古族"
        },
        [250] = {
            ID = 250,
            topic = "我国最大的湖泊是A.青海湖B.洞庭湖C.鄱阳湖D.太湖",
            answer = "青海湖"
        },
        [251] = {
            ID = 251,
            topic = "泼水节是以下哪个少数民族的节日A.傣族B.白族C.壮族D.苗族",
            answer = "傣族"
        },
        [252] = {
            ID = 252,
            topic = "世界人口最多的国家是A.中国B.俄罗斯C.印度D.加拿大",
            answer = "中国"
        },
        [253] = {
            ID = 253,
            topic = "我国领土大部分位于A.北温带B.北寒带C.热带D.南温带",
            answer = "北温带"
        },
        [254] = {
            ID = 254,
            topic = "地球上海洋与陆地面积之比约是A.7:3B.3:7C.8:2D.2:8",
            answer = "07:03:00"
        },
        [255] = {
            ID = 255,
            topic = "黑种人集中分布在A.非洲B.亚洲C.美洲D.大洋洲",
            answer = "非洲"
        },
        [256] = {
            ID = 256,
            topic = "世界上使用人数最多的语言是A.汉语B.英语C.德语D.日语",
            answer = "汉语"
        },
        [257] = {
            ID = 257,
            topic = "我国回族大多数信奉A.伊斯兰教B.佛教C.基督教D.天主教",
            answer = "伊斯兰教"
        },
        [258] = {
            ID = 258,
            topic = "四大洋中，面积最大的是A.太平洋B.印度洋C.大西洋D.北冰洋",
            answer = "太平洋"
        },
        [259] = {
            ID = 259,
            topic = "下列不属于自然资源的是A.水泥B.天然森林C.阳光D.土地",
            answer = "水泥"
        },
        [260] = {
            ID = 260,
            topic = "我国各类土地利用类型中，面积最广的是A.草地B.建筑用地C.耕地D.林地",
            answer = "草地"
        },
        [261] = {
            ID = 261,
            topic = "我国最大的渔场是A.舟山渔场B.黄渤海渔场C.南海沿岸渔场D.北部湾渔场",
            answer = "舟山渔场"
        },
        [262] = {
            ID = 262,
            topic = "我国最大的盐场是A.长芦盐场B.台湾西部盐场C.柴达木盐场D.莺歌海盐场",
            answer = "长芦盐场"
        },
        [263] = {
            ID = 263,
            topic = "全国最大的综合性工业基地是A.沪宁杭地区B.珠江三角洲C.京津唐地区D.辽中南地区",
            answer = "沪宁杭地区"
        },
        [264] = {
            ID = 264,
            topic = "下列工业产品中属于高新技术产品的是A.电脑B.机床C.钢铁D.汽车",
            answer = "电脑"
        },
        [265] = {
            ID = 265,
            topic = "地球的表面积约为多少亿平方千米？A.5.1B.6.1C.7.1D.8.1",
            answer = "5.1"
        },
        [266] = {
            ID = 266,
            topic = "在晴朗的夜空中找到北极星，面对北极星的方向是A.正北方向B.正南方向C.正东方向D.正西方向",
            answer = "正北方向"
        },
        [267] = {
            ID = 267,
            topic = "地球仪上最长的纬线是A.0°纬线B.23.5°N纬线C.90°纬线D.90°S纬线",
            answer = "0°纬线"
        },
        [268] = {
            ID = 268,
            topic = "世界上最大的大陆是A.亚欧大陆B.非洲大陆C.南极大陆D.澳大利亚大陆",
            answer = "亚欧大陆"
        },
        [269] = {
            ID = 269,
            topic = "下列描述中，表示气候的是A.四季如春B.晴转多云C.暴风骤雨D.风和日丽",
            answer = "四季如春"
        },
        [270] = {
            ID = 270,
            topic = "赤道地区降水的主要类型是A.对流雨B.地形雨C.锋面雨D.台风雨",
            answer = "对流雨"
        },
        [271] = {
            ID = 271,
            topic = "马克思主义哲学之所以是科学的，就在于它坚持了A.实践的观点B.阶级的观点C.革命的观点D.历史的观点",
            answer = "实践的观点"
        },
        [272] = {
            ID = 272,
            topic = "国家财政收入最重要的来源是A.税收收入B.利润收入C.债务收入D.罚款收入",
            answer = "税收收入"
        },
        [273] = {
            ID = 273,
            topic = "第二次世界大战后，人口自然增长率最快的大洲是A.非洲B.亚洲C.南美洲D.北美洲",
            answer = "非洲"
        },
        [274] = {
            ID = 274,
            topic = "我国最早在奥运会上夺金牌的是哪位运动员?A.许海峰B.吴佳怩C.李宁D.高凤莲",
            answer = "许海峰"
        },
        [275] = {
            ID = 275,
            topic = "咖啡的故乡是哪里?A.非洲B.大洋洲C.美洲D.亚洲",
            answer = "非洲"
        },
        [276] = {
            ID = 276,
            topic = "我国少数民族分布最多的省份是A.云南省B.四川省C.贵州省D.广西省",
            answer = "云南省"
        },
        [277] = {
            ID = 277,
            topic = "被称为\"画圣\"的古代画家是A.吴道子B.顾恺之C.韩干D.张择端",
            answer = "吴道子"
        },
        [278] = {
            ID = 278,
            topic = "我国发现最早的纸币是在哪个时期A.宋朝B.元朝C.唐朝D.明朝",
            answer = "宋朝"
        },
        [279] = {
            ID = 279,
            topic = "神话《白蛇传》中\"白娘娘盗仙草\"盗的是:A.灵芝B.冬虫夏草C.田七D.人参",
            answer = "灵芝"
        },
        [280] = {
            ID = 280,
            topic = "我国最大的瀑布\"黄果树瀑布\"位于哪个省?A.贵州省B.四川省C.云南省D.广西省",
            answer = "贵州省"
        },
        [281] = {
            ID = 281,
            topic = "着有\"农村三部曲\"的着名作家是:A.茅盾B.巴金C.郭沫若D.陈忠实",
            answer = "茅盾"
        },
        [282] = {
            ID = 282,
            topic = "铅笔有硬软之分,用英文字母来表示,下列符号相比哪个表示较硬:A.HB.HBC.BD.2B",
            answer = "H"
        },
        [283] = {
            ID = 283,
            topic = "\"天下兴亡,匹夫有责\"是哪位思想家的名言?A.顾炎武B.王夫之C.王充D.黄宗羲",
            answer = "顾炎武"
        },
        [284] = {
            ID = 284,
            topic = "“信天游”是民歌的一种属山歌性质，曲调纯朴、高亢、悠长、节奏自由、你知道它流行于哪一带地方吗?A.陕北B.西南C.华北D.北京一带",
            answer = "陕北"
        },
        [285] = {
            ID = 285,
            topic = "唐代诗人有称“诗圣”的杜甫“诗仙”的李白等，你可知道被人颂称“诗魔”的是谁?A.白居易B.王维C.刘禹锡D.李商隐",
            answer = "白居易"
        },
        [286] = {
            ID = 286,
            topic = "\"红娘\"是哪部作品中的人物?A.西厢记B.红楼梦C.红色娘子军D.红灯记",
            answer = "西厢记"
        },
        [287] = {
            ID = 287,
            topic = "阿姆斯特朗是乘哪个飞船成功登月的A.阿波罗11号B.阿波罗12号C.爱国者6号D.和平号",
            answer = "阿波罗11号"
        },
        [288] = {
            ID = 288,
            topic = "古代六艺，\"礼、乐、射、御、书、数\"中的\"御\"是指A.驾车B.射箭C.杂技D.骑马",
            answer = "驾车"
        },
        [289] = {
            ID = 289,
            topic = "“战国四公子”中齐国的孟尝君名为A.田文B.黄歇C.赵胜D.魏无忌",
            answer = "田文"
        },
        [290] = {
            ID = 290,
            topic = "泰戈尔是印度着名作家、诗人，于1913年获得诺贝尔文学奖，为其赢得该奖的作品是A.吉檀迦利B.新月集C.园丁集D.飞鸟集",
            answer = "吉檀迦利"
        },
        [291] = {
            ID = 291,
            topic = "四大名茶之一的龙井茶产地是A.浙江杭州B.河南信阳C.云南普洱D.福建安溪",
            answer = "浙江杭州"
        },
        [292] = {
            ID = 292,
            topic = "白菜属于什麽科？A.十字花科B.蔷薇科C.菊科D.豆科",
            answer = "十字花科"
        },
        [293] = {
            ID = 293,
            topic = "成年人身上有多少块骨骼A.206B.207C.208D.205",
            answer = "206"
        },
        [294] = {
            ID = 294,
            topic = "琵琶曲《十面埋伏》描述的是哪里的情景？A.垓下之战B.巨鹿之战C.赤壁之战D.淝水之战",
            answer = "垓下之战"
        },
        [295] = {
            ID = 295,
            topic = "中国最大的省级单位是?A.新疆B.西藏C.青海D.内蒙古",
            answer = "新疆"
        },
        [296] = {
            ID = 296,
            topic = "黄河注入哪个海？A.渤海B.黄海C.东海D.南海",
            answer = "渤海"
        },
        [297] = {
            ID = 297,
            topic = "中国古代“不惑”是指男子多少岁?A.40B.30C.50D.60",
            answer = "40"
        },
        [298] = {
            ID = 298,
            topic = "吉林省抚松县被人们称为是哪种药材之乡？A.人参B.田七C.枸杞D.当归",
            answer = "人参"
        },
        [299] = {
            ID = 299,
            topic = "\"山城\"是我国哪座城市的雅号?A.重庆B.福州C.西安D.洛阳",
            answer = "重庆"
        },
        [300] = {
            ID = 300,
            topic = "世界石油储量最多是哪一个国家A.沙乌地阿拉伯B.科威特C.伊朗D.伊拉克",
            answer = "沙乌地阿拉伯"
        },
        [301] = {
            ID = 301,
            topic = "下列着名宫殿哪个位于英国?A.白金汉宫B.克里姆林宫C.凡尔赛宫D.故宫",
            answer = "白金汉宫"
        },
        [302] = {
            ID = 302,
            topic = "下列我国哪个古迹被誉为\"世界八大奇迹\":A.秦始皇兵马俑B.敦煌莫高窟C.乐山大佛D.万里长城",
            answer = "秦始皇兵马俑"
        },
        [303] = {
            ID = 303,
            topic = "洲际导弹的射程一般在多少公里以上?A.一万B.十万C.一千D.一百",
            answer = "一万"
        },
        [304] = {
            ID = 304,
            topic = "我国卫星火箭发射基地\"西昌\"位于:A.四川B.青海C.新疆D.西藏",
            answer = "四川"
        },
        [305] = {
            ID = 305,
            topic = "古代军事家曹操是哪个时期的人物?A.东汉B.三国C.南北朝D.西汉",
            answer = "东汉"
        },
        [306] = {
            ID = 306,
            topic = "成语\"闻鸡起舞\"\"中流击楫\"是出自哪个古代将领的故事?A.祖逖B.戚继光C.郑成功D.岳飞",
            answer = "祖逖"
        },
        [307] = {
            ID = 307,
            topic = "目前世界纪元(西元前后的划分)的方法是以什麽为标准:A.耶稣基督教B.中国道教C.佛教D.伊斯兰教",
            answer = "耶稣基督教"
        },
        [308] = {
            ID = 308,
            topic = "下列哪个尊称是对古代太子的尊称:A.殿下B.阁下C.私下D.陛下",
            answer = "殿下"
        },
        [309] = {
            ID = 309,
            topic = "美国第一任总统是谁?A.华盛顿B.林肯C.克林顿D.布希",
            answer = "华盛顿"
        },
        [310] = {
            ID = 310,
            topic = "我国是在哪个时期进入奴隶社会的?A.夏B.商C.秦D.汉",
            answer = "夏"
        },
        [311] = {
            ID = 311,
            topic = "下列农民起义哪次是洪秀全领导的:A.金田起义B.大泽乡起义C.黄巾起义D.赤眉起义",
            answer = "金田起义"
        },
        [312] = {
            ID = 312,
            topic = "被称为酿酒行业的祖师是谁?A.杜康B.柳永C.鲁班D.孔子",
            answer = "杜康"
        },
        [313] = {
            ID = 313,
            topic = "\"文房四宝\"中的毛笔是谁发明的?A.蒙恬B.闻仲C.乐毅D.刘伯温",
            answer = "蒙恬"
        },
        [314] = {
            ID = 314,
            topic = "我国第一颗氢弹研制成功是在哪一年?A.1967B.1964C.1962D.1960",
            answer = "1967"
        },
        [315] = {
            ID = 315,
            topic = "以下哪一个是联合国安理会常任理事国之一?A.法国B.德国C.义大利D.西班牙",
            answer = "法国"
        },
        [316] = {
            ID = 316,
            topic = "杜甫《望岳》：“岱宗夫如何，齐鲁青未了”中的“岱宗”指的是A.泰山B.华山C.恒山D.嵩山",
            answer = "泰山"
        },
        [317] = {
            ID = 317,
            topic = "流行性感冒的病原是A.支原体B.病毒C.细菌D.衣原体",
            answer = "病毒"
        },
        [318] = {
            ID = 318,
            topic = "“江山社稷”中的“稷”在古代是指A.祈求丰收B.五谷之神C.黎民百姓D.土地之神",
            answer = "五谷之神"
        },
        [319] = {
            ID = 319,
            topic = "以下哪个成语是关于匡衡的A.引锥自刺B.凿壁偷光C.卧薪嚐胆D.映雪囊萤",
            answer = "凿壁偷光"
        },
        [320] = {
            ID = 320,
            topic = "《黄河大合唱》的作曲是:A.郑律成B.冼星海C.聂耳D.光未然",
            answer = "冼星海"
        },
        [321] = {
            ID = 321,
            topic = "京剧中的脸谱使人的性格一目了然,一般红色脸谱代表：A.耿直B.忠勇C.圆滑D.奸邪",
            answer = "忠勇"
        },
        [322] = {
            ID = 322,
            topic = "“相敬如宾”最初是指什麽人之间相互尊敬的样子?A.君臣B.夫妻C.兄弟D.朋友",
            answer = "夫妻"
        },
        [323] = {
            ID = 323,
            topic = "能够有效地阻挡太阳的紫外线辐射的气层是A.大气上层B.臭氧层C.大气下层D.外大气层",
            answer = "臭氧层"
        },
        [324] = {
            ID = 324,
            topic = "“打蛇打七寸”的七寸是指A.尾巴B.心脏C.咽喉D.头部",
            answer = "心脏"
        },
        [325] = {
            ID = 325,
            topic = "蜻蜓“点水”的目的是什麽?A.吐食B.产卵C.喝水D.觅食",
            answer = "产卵"
        },
        [326] = {
            ID = 326,
            topic = "下列记忆体中，存储速度最快的是A.软碟B.记忆体C.光碟D.硬碟",
            answer = "记忆体"
        },
        [327] = {
            ID = 327,
            topic = "北京故宫历时多少年建成?A.20B.18C.16D.14",
            answer = "18"
        },
        [328] = {
            ID = 328,
            topic = "清朝晚期,被今人誉为\"开眼看世界第一人\"的是谁?A.魏源B.林则徐C.严复D.龚自珍",
            answer = "林则徐"
        },
        [329] = {
            ID = 329,
            topic = "天长地久有时尽，____绵绵无绝期。A.情仇B.此恨C.此爱D.思念",
            answer = "此恨"
        },
        [330] = {
            ID = 330,
            topic = "此情可待成追忆，只是当时已____A.懵逼B.惘然C.茫然D.淡然",
            answer = "惘然"
        },
        [331] = {
            ID = 331,
            topic = "不要人夸好颜色，只留清气满____A.世间B.乾坤C.天地D.人间",
            answer = "乾坤"
        },
        [332] = {
            ID = 332,
            topic = "羌笛何须怨杨柳，春风不度____关A.鬼门B.玉门C.嘉峪D.山海",
            answer = "玉门"
        },
        [333] = {
            ID = 333,
            topic = "宁可枝头抱香死，何曾吹落____中A.东风B.北风C.南风D.西风",
            answer = "北风"
        },
        [334] = {
            ID = 334,
            topic = "春宵一刻值千金，花有清香月有__A.缺B.阴C.明D.圆",
            answer = "阴"
        },
        [335] = {
            ID = 335,
            topic = "独怜幽草涧边生，上有____深树鸣A.凤凰B.黄鹂C.乌鸦D.斑鸠",
            answer = "黄鹂"
        },
        [336] = {
            ID = 336,
            topic = "无可奈何花落去，似曾相识__归来A.月B.燕C.雁D.人",
            answer = "燕"
        },
        [337] = {
            ID = 337,
            topic = "草长莺飞____天，拂堤杨柳醉春烟。A.四月B.二月C.三月D.一月",
            answer = "二月"
        },
        [338] = {
            ID = 338,
            topic = "小荷才露尖尖角，早有____立上头A.蚊子B.蜻蜓C.蝴蝶D.苍蝇",
            answer = "蜻蜓"
        },
        [339] = {
            ID = 339,
            topic = "千里莺啼__映红，水村山郭酒旗风A.蓝B.绿C.红D.相",
            answer = "绿"
        },
        [340] = {
            ID = 340,
            topic = "诚知此恨人人有，贫贱夫妻百事__A.喜B.哀C.乐D.怒",
            answer = "哀"
        },
        [341] = {
            ID = 341,
            topic = "酒入愁肠，化作____泪A.喜悦B.相思C.思念D.悲伤",
            answer = "相思"
        },
        [342] = {
            ID = 342,
            topic = "身无彩凤____翼，心有灵犀一点通A.三批B.双飞C.三飞D.单飞",
            answer = "双飞"
        },
        [343] = {
            ID = 343,
            topic = "等闲识得东风面，万紫千红总____A.思乡B.是春C.思春D.是村",
            answer = "是春"
        },
        [344] = {
            ID = 344,
            topic = "少壮不努力，____徒伤悲A.老二B.老大C.老来D.老是",
            answer = "老大"
        },
        [345] = {
            ID = 345,
            topic = "宝剑锋从磨砺出，____香自苦寒来A.梨花B.梅花C.菊花D.杏花",
            answer = "梅花"
        },
        [346] = {
            ID = 346,
            topic = "竹外桃花三两枝，春江水暖__先知A.雪B.鸭C.鸡D.燕",
            answer = "鸭"
        },
        [347] = {
            ID = 347,
            topic = "桃花潭水深千尺，不及____送我情A.谢娜B.汪伦C.汪涵D.何炅",
            answer = "汪伦"
        },
        [348] = {
            ID = 348,
            topic = "人不寐，____白发征夫泪A.村民B.将军C.游人D.将士",
            answer = "将军"
        },
        [349] = {
            ID = 349,
            topic = "溪云初起日沉阁,山雨欲来风满__A.街B.楼C.天D.城",
            answer = "楼"
        },
        [350] = {
            ID = 350,
            topic = "春风得意马蹄疾，一日看尽____花A.杭州B.长安C.洛阳D.卞州",
            answer = "长安"
        },
        [351] = {
            ID = 351,
            topic = "相见时难别亦难，东风无力____残A.梅花B.百花C.菊花D.梅花",
            answer = "百花"
        },
        [352] = {
            ID = 352,
            topic = "莫道不销魂，帘卷西风，人比____瘦A.败柳B.黄花C.菊花D.残花",
            answer = "黄花"
        },
        [353] = {
            ID = 353,
            topic = "好风凭藉力，送我上____A.蓝天B.青天C.王者D.城楼",
            answer = "青天"
        },
        [354] = {
            ID = 354,
            topic = "停车__爱枫林晚，霜叶红于二月花A.造B.坐C.做D.作",
            answer = "坐"
        },
        [355] = {
            ID = 355,
            topic = "花径不曾缘客扫，____今始为君开A.心扉B.蓬门C.菊花D.玉门",
            answer = "蓬门"
        },
        [356] = {
            ID = 356,
            topic = "二十四桥明月夜，玉人何处教____A.弹琴B.吹箫C.吹笛D.吹牛",
            answer = "吹箫"
        },
        [357] = {
            ID = 357,
            topic = "商女不知亡国恨，隔江犹唱____花A.花非B.后庭C.蝶恋D.女人",
            answer = "后庭"
        },
        [358] = {
            ID = 358,
            topic = "__潮带雨晚来急，野渡无人舟自横。A.秋B.春C.高D.夏",
            answer = "春"
        },
        [359] = {
            ID = 359,
            topic = "十年生死两茫茫，不思量，__难忘A.艰B.自C.很D.不",
            answer = "自"
        },
        [360] = {
            ID = 360,
            topic = "李白笔下的“飞流直下三千尺,疑是银河落九天”指的是哪个风景区?A.恒山B.庐山C.香山D.华山",
            answer = "庐山"
        },
        [361] = {
            ID = 361,
            topic = "被称为我国最最大的古典艺术宝库的是哪一个?A.秦始皇兵马俑B.敦煌莫高窟C.乐山大佛D.布达拉宫",
            answer = "敦煌莫高窟"
        },
        [362] = {
            ID = 362,
            topic = "世界地球日是哪一天?A.42851B.42847C.42815D.42848",
            answer = "42847"
        },
        [363] = {
            ID = 363,
            topic = "山东山西的“山” 通常指的是：A.神农架B.太行山C.吕梁山D.平顶山",
            answer = "太行山"
        },
        [364] = {
            ID = 364,
            topic = "成语“一字千金”的典故与下列哪位人物有关?A.司马懿B.吕不韦C.司马迁D.曹操",
            answer = "吕不韦"
        },
        [365] = {
            ID = 365,
            topic = "鸡蛋应该怎样保存才好？A.打碎它B.大头朝上C.尖端朝上D.平放",
            answer = "大头朝上"
        },
        [366] = {
            ID = 366,
            topic = "老人应该喝什麽浓度的茶好？A.隔夜茶B.淡茶C.浓茶D.不浓不淡",
            answer = "淡茶"
        },
        [367] = {
            ID = 367,
            topic = "老年人什麽时间进行体育锻炼合适呢？A.淩晨B.傍晚C.早晨D.中午",
            answer = "傍晚"
        },
        [368] = {
            ID = 368,
            topic = "夏季，烈日炎炎，穿衣服比打赤膊热吗？A.你管我B.不是C.是D.一样热",
            answer = "不是"
        },
        [369] = {
            ID = 369,
            topic = "走路比站着耗费体力吗？A.我蹲着B.不是C.是D.一样",
            answer = "不是"
        },
        [370] = {
            ID = 370,
            topic = "古人云：“早卧早起，与鸡俱兴。”早上醒来，然后做什麽？A.发泄起床气B.过几分钟再起C.立刻起床D.继续睡",
            answer = "过几分钟再起"
        },
        [371] = {
            ID = 371,
            topic = "夏天洗冷水浴好不好？A.爽B.不好C.好D.一般",
            answer = "不好"
        },
        [372] = {
            ID = 372,
            topic = "湿头发睡觉易引起什麽症状？A.发烧B.头晕C.眼花D.感冒",
            answer = "头晕"
        },
        [373] = {
            ID = 373,
            topic = "工笔是哪种绘画形式的技法A.水彩画B.国画C.油画D.水粉画",
            answer = "国画"
        },
        [374] = {
            ID = 374,
            topic = "“冰激淩”是从哪国传进的外来语A.俄国B.英国C.法国D.美国",
            answer = "英国"
        },
        [375] = {
            ID = 375,
            topic = "博士作为官名最早出现在A.宋朝B.秦C.汉D.唐",
            answer = "秦"
        },
        [376] = {
            ID = 376,
            topic = "《在那遥远的地方》是哪里的民歌A.四川民歌B.青海民歌C.江苏民歌D.云南民歌",
            answer = "青海民歌"
        },
        [377] = {
            ID = 377,
            topic = "人体含水量百分比最高的器官是A.心B.眼球C.肾D.肝",
            answer = "眼球"
        },
        [378] = {
            ID = 378,
            topic = "土豆不宜存放在什麽地方A.卧室内B.日光照射处C.通风处D.乾燥处",
            answer = "日光照射处"
        },
        [379] = {
            ID = 379,
            topic = "马拉松赛跑中的“马拉松”一词是指A.独创B.地名C.人名D.组织名",
            answer = "地名"
        },
        [380] = {
            ID = 380,
            topic = "什麽时间吃水果比较好A.随时B.饭前食用C.饭后食用D.饭中途",
            answer = "饭前食用"
        },
        [381] = {
            ID = 381,
            topic = "从何时起，对最高统治者称“王”A.周B.商C.夏D.春秋",
            answer = "商"
        },
        [382] = {
            ID = 382,
            topic = "速食面里必然有哪种食品添加剂A.地沟油B.合成抗氧化剂C.防腐剂D.食用色素",
            answer = "合成抗氧化剂"
        },
        [383] = {
            ID = 383,
            topic = "世界上最大最贵的钻石藏在A.梵蒂冈B.英国王室C.中国紫禁城D.美国华尔街",
            answer = "英国王室"
        },
        [384] = {
            ID = 384,
            topic = "世界上最大的熊是?A.熊猫B.棕熊C.黑熊D.浣熊",
            answer = "棕熊"
        },
        [385] = {
            ID = 385,
            topic = "人类不能食用的植物油是A.刺果油B.蓖麻籽油C.红花籽油D.亚麻籽油",
            answer = "蓖麻籽油"
        },
        [386] = {
            ID = 386,
            topic = "北京猿人生活在距今多少万年前？A.200B.50C.100D.150",
            answer = "500"
        },
        [387] = {
            ID = 387,
            topic = "下列海洋中哪一个是我国最大的海A.渤海B.南海C.东海D.黄海",
            answer = "南海"
        },
        [388] = {
            ID = 388,
            topic = "下列哪一个湖泊是在我国江西省的境内A.洪泽湖B.鄱阳湖C.洞庭湖D.太湖",
            answer = "鄱阳湖"
        },
        [389] = {
            ID = 389,
            topic = "\"山城\"是我国哪座城市的雅号A.福州B.重庆C.西安D.成都",
            answer = "重庆"
        },
        [390] = {
            ID = 390,
            topic = "峨眉山位于我国哪个省份A.西藏B.四川C.云南D.贵州",
            answer = "四川"
        },
        [391] = {
            ID = 391,
            topic = "我国第一座国家森林公园是A.九寨沟B.张家界C.武夷山D.长白山",
            answer = "张家界"
        },
        [392] = {
            ID = 392,
            topic = "我国古代\"十恶不赦\"中的首恶是A.不孝B.谋反C.不义D.不道",
            answer = "谋反"
        },
        [393] = {
            ID = 393,
            topic = "我国收入的字最多的字典是哪一部A.《新华字典》B.《康熙字典》C.《方言》D.《说文解字》",
            answer = "《康熙字典》"
        },
        [394] = {
            ID = 394,
            topic = "着名通讯社路透社是哪一个国家的通讯社A.法国B.英国C.中国?D.美国",
            answer = "英国"
        },
        [395] = {
            ID = 395,
            topic = "我国最早的一部医学理论着作是A.《伤寒杂病论》B.《黄帝内经》C.《本草纲目》D.《千金方》",
            answer = "《黄帝内经》"
        },
        [396] = {
            ID = 396,
            topic = "我国姓氏中哪一个姓氏的人口比例最多A.刘B.李C.王D.张",
            answer = "李"
        },
        [397] = {
            ID = 397,
            topic = "我国共有多少个少数民族A.50B.55C.56D.51",
            answer = "55"
        },
        [398] = {
            ID = 398,
            topic = "我国道家学派创始人是A.孟子B.老子C.孔子D.庄子",
            answer = "老子"
        },
        [399] = {
            ID = 399,
            topic = "\"天下兴亡,匹夫有责\"是哪位思想家的名言A.王充B.顾炎武C.黄宗羲D.王夫之",
            answer = "顾炎武"
        },
        [400] = {
            ID = 400,
            topic = "我国第一个获得世界冠军的是谁A.陈镜开B.荣国团C.郑凤荣D.吴传玉",
            answer = "荣国团"
        },
        [401] = {
            ID = 401,
            topic = "\"发展体育运动,增强人民体质\"是我国哪位领导人的题词A.贺龙B.毛泽东C.周恩来D.邓小平",
            answer = "毛泽东"
        },
        [402] = {
            ID = 402,
            topic = "我国最早的一部按国别编写的史书是A.《左传》B.《国语》?C.《史记》D.《春秋》",
            answer = "《国语》"
        },
        [403] = {
            ID = 403,
            topic = "我国境内最早的人类是A.丁村人B.元谋人C.北京人D.山顶洞人",
            answer = "元谋人"
        },
        [404] = {
            ID = 404,
            topic = "以下哪位不是《少年包青天》主演A.邓超B.何冰C.周杰D.陆毅",
            answer = "何冰"
        },
        [405] = {
            ID = 405,
            topic = "泼水节是我国哪个少数民族的传统节日A.彝族B.傣族C.壮族D.回族",
            answer = "傣族"
        },
        [406] = {
            ID = 406,
            topic = "香港回归祖国的时间是A.1999.12B.1997.7C.1996.7D.1998.12",
            answer = "1997.7"
        },
        [407] = {
            ID = 407,
            topic = "我国古代最大的风俗画是A.《千里江山图》B.《清明上河图》C.《韩熙载夜宴图》D.《女史箴图》",
            answer = "《清明上河图》"
        },
        [408] = {
            ID = 408,
            topic = "着名油画《开国大典》是谁的作品A.关山月B.董希文C.范曾D.徐悲鸿",
            answer = "董希文"
        },
        [409] = {
            ID = 409,
            topic = "下列古代名曲哪一首不是古琴曲A.阳光三叠B.十面埋伏C.高山流水D.阳春白雪",
            answer = "十面埋伏"
        },
        [410] = {
            ID = 410,
            topic = "世界电影奖中最高奖项是A.金鸡奖B.奥斯卡C.金球奖D.金犻奖",
            answer = "奥斯卡"
        },
        [411] = {
            ID = 411,
            topic = "相声演员功夫中哪一种是第一基本功A.唱B.说C.学D.逗",
            answer = "说"
        },
        [412] = {
            ID = 412,
            topic = "世界上最大的宫殿是A.爱丽舍宫B.故宫C.卢浮宫D.白宫",
            answer = "故宫"
        },
        [413] = {
            ID = 413,
            topic = "郭沫若的诗集有A.《红烛》B.《女神》C.《野草》D.《死水》",
            answer = "《女神》"
        },
        [414] = {
            ID = 414,
            topic = "馒头是谁发明的A.屈原B.诸葛亮C.李冰D.曹操",
            answer = "诸葛亮"
        },
        [415] = {
            ID = 415,
            topic = "人体最大的器官是A.胃B.皮肤C.脾D.肝脏",
            answer = "皮肤"
        },
        [416] = {
            ID = 416,
            topic = "我国第一大岛是A.舟山群岛B.台湾岛C.海南岛D.崇明岛",
            answer = "台湾岛"
        },
        [417] = {
            ID = 417,
            topic = "神话《白蛇传》中\"白娘娘盗仙草\"盗的是A.冬虫夏草B.灵芝C.人参D.田七",
            answer = "灵芝"
        },
        [418] = {
            ID = 418,
            topic = "你知道胰岛素可治哪种病吗A.肝病B.糖尿病C.心脏病D.胃病",
            answer = "糖尿病"
        },
        [419] = {
            ID = 419,
            topic = "下列哪种动物不属于鱼类A.鲫鱼B.甲鱼C.鲢鱼D.草鱼",
            answer = "甲鱼"
        },
        [420] = {
            ID = 420,
            topic = "世界上最大的动物是哪一种A.大象B.鲸鱼C.水母D.恐龙",
            answer = "鲸鱼"
        },
        [421] = {
            ID = 421,
            topic = "麻婆豆腐的起源是哪A.湖北B.四川C.北京D.湖南",
            answer = "四川"
        },
        [422] = {
            ID = 422,
            topic = "《中华小当家》主角叫什麽名字A.王小二B.刘昂星C.武藤游戏D.三笠",
            answer = "刘昂星"
        },
        [423] = {
            ID = 423,
            topic = "过量的食用哪种食品可能引起脱发？A.粗粮B.肉类C.蔬菜D.豆类",
            answer = "肉类"
        },
        [424] = {
            ID = 424,
            topic = "黄瓜跟什麽一起吃会腹泻?A.土豆B.花生C.红酒D.红薯",
            answer = "花生"
        },
        [425] = {
            ID = 425,
            topic = "下面哪一种是能降血压的蔬菜A.韭黄B.芹菜C.西兰花D.韭菜",
            answer = "芹菜"
        },
        [426] = {
            ID = 426,
            topic = "天气预报起源于哪个国家A.美国B.法国C.中国D.英国",
            answer = "法国"
        },
        [427] = {
            ID = 427,
            topic = "迄今最早的中国象棋谱，出自A.秦朝B.元朝C.宋朝D.唐朝",
            answer = "元朝"
        },
        [428] = {
            ID = 428,
            topic = "酒后喝什麽对身体最有益A.可乐B.蜂蜜水C.咖啡D.浓茶",
            answer = "蜂蜜水"
        },
        [429] = {
            ID = 429,
            topic = "肥皂的起源地A.韩国B.美索不达米亚C.中国D.日本",
            answer = "美索不达米亚"
        },
        [430] = {
            ID = 430,
            topic = "水银的沸点A.摄氏35度B.摄氏357度C.摄氏100度D.摄氏50度",
            answer = "摄氏357度"
        },
        [431] = {
            ID = 431,
            topic = "酸性物质中毒不可以用以下哪个洗胃A.红糖B.白醋C.蛋清D.牛奶",
            answer = "白醋"
        },
        [432] = {
            ID = 432,
            topic = "中国最深的湖A.太湖B.长白山天池C.鄱阳湖D.南北湖",
            answer = "长白山天池"
        },
        [433] = {
            ID = 433,
            topic = "煤气中毒的特徵表现是A.七窍流血B.口唇樱桃红色C.抽搐D.口吐白沫",
            answer = "口唇樱桃红色"
        },
        [434] = {
            ID = 434,
            topic = "从哪一天开始，白天开始渐渐比黑夜长？A.冬至B.春分C.夏至D.立秋",
            answer = "春分"
        },
        [435] = {
            ID = 435,
            topic = "俗称“长生果”是指A.杏仁B.花生C.腰果D.核桃",
            answer = "花生"
        },
        [436] = {
            ID = 436,
            topic = "最明亮的行星是什麽A.火星B.金星C.木星D.土星",
            answer = "金星"
        },
        [437] = {
            ID = 437,
            topic = "宾士汽车原产于哪一个国家A.中国B.德国C.美国D.英国",
            answer = "德国"
        },
        [438] = {
            ID = 438,
            topic = "\"破釜沉舟\"这个成语出于哪次战争?A.官渡之战B.巨鹿之战C.长平之战D.赤壁之战",
            answer = "巨鹿之战"
        },
        [439] = {
            ID = 439,
            topic = "具有止血功能的维生素是A.维生素EB.维生素KC.维生素AD.维生素C",
            answer = "维生素K"
        },
        [440] = {
            ID = 440,
            topic = "世界上有很多种语言，大约有多少种A.近4000种B.近3000种C.近1000种D.近2000种",
            answer = "近3000种"
        },
        [441] = {
            ID = 441,
            topic = "《西游记》中的火焰山在哪里A.哈萨克斯坦B.中国吐鲁番C.中国四川D.巴基斯坦",
            answer = "中国吐鲁番"
        },
        [442] = {
            ID = 442,
            topic = "蜜蜂中的“蜂王”和“工蜂”分别是A.雄峰、雌蜂B.雌蜂、雌蜂C.雌蜂、雄峰D.雄峰、雄峰",
            answer = "雌蜂、雌蜂"
        },
        [443] = {
            ID = 443,
            topic = "根据有关规定，职工的试用期最长不得超过A.12个月B.6个月C.3个月D.1个月",
            answer = "6个月"
        },
        [444] = {
            ID = 444,
            topic = "海洋中最多的生物是A.鱼B.浮游生物C.水生植物D.甲壳动物",
            answer = "浮游生物"
        },
        [445] = {
            ID = 445,
            topic = "下列不是生物技术的是A.基因技术B.DNA工程C.酶工程D.细胞工程",
            answer = "DNA工程"
        },
        [446] = {
            ID = 446,
            topic = "“但愿人长久，千里共婵娟”，其中婵娟指的是什麽A.时间B.月亮C.姻缘D.美女",
            answer = "月亮"
        },
        [447] = {
            ID = 447,
            topic = "古人的婚礼在什麽时间举行A.大半夜B.傍晚C.中午D.早晨",
            answer = "傍晚"
        },
        [448] = {
            ID = 448,
            topic = "身为纯爷们，绝对从不回头看什麽A.凡人B.爆炸C.女神D.战友",
            answer = "爆炸"
        },
        [449] = {
            ID = 449,
            topic = "\"冬天到了,春天还会远吗\"语出A.徐志摩B.雪莱C.雨果D.张俊以",
            answer = "雪莱"
        },
        [450] = {
            ID = 450,
            topic = "胰岛素是一种A.血液B.蛋白质C.纤维素D.脂肪",
            answer = "蛋白质"
        },
        [451] = {
            ID = 451,
            topic = "中国最大的商业银行是A.中国农业银行B.中国工商银行C.中国建设银行D.中国人民银行",
            answer = "中国工商银行"
        },
        [452] = {
            ID = 452,
            topic = "“黑美人”是哪种水果的品种？A.提子B.西瓜C.火龙果D.葡萄",
            answer = "西瓜"
        },
        [453] = {
            ID = 453,
            topic = "柠檬汁有哪些营养含量A.维生素BB.维生素A和维生素CC.维生素B1和维生素CD.维生素C",
            answer = "维生素A和维生素C"
        },
        [454] = {
            ID = 454,
            topic = "“软饮料”是指A.不起泡沫的饮料B.不含酒精的饮料C.不含钙的饮料D.不含二氧化碳的饮料",
            answer = "不含酒精的饮料"
        },
        [455] = {
            ID = 455,
            topic = "飞机上的黑匣子被安放在飞机上的哪个部位？A.机头B.机尾C.机翼内D.机身中部",
            answer = "机尾"
        },
        [456] = {
            ID = 456,
            topic = "鸡蛋最好不要和下面哪种食物一起存放？A.白薯B.生姜C.淀粉D.食油",
            answer = "生姜"
        },
        [457] = {
            ID = 457,
            topic = "下列相同重量的食物中，所含热量最多的是？A.苹果B.奶油C.牛奶D.牛肉",
            answer = "奶油"
        },
        [458] = {
            ID = 458,
            topic = "买回来的蔬菜应该怎样放才合适？A.丢掉B.竖放C.倒放D.平放",
            answer = "竖放"
        },
        [459] = {
            ID = 459,
            topic = "我国的五星级酒店规定总机至少能用多少种外语为客人提供电话服务？A.5种B.3种C.2种D.4种",
            answer = "3种"
        },
        [460] = {
            ID = 460,
            topic = "透过阳光，能将乾燥的纸屑点燃的镜片是？A.反射镜B.凸透镜C.凹透镜D.平光镜",
            answer = "凸透镜"
        },
        [461] = {
            ID = 461,
            topic = "郑和下西洋，最远到达了哪里？A.地中海西岸B.非洲东岸C.西印度群岛D.印度半岛",
            answer = "非洲东岸"
        },
        [462] = {
            ID = 462,
            topic = "长江上建的第一座大桥是？A.放弃回答B.武汉长江大桥C.南京长江大桥D.九江长江大桥",
            answer = "武汉长江大桥"
        },
        [463] = {
            ID = 463,
            topic = "宋代的代表性刑罚是什麽？A.这谁知道B.刺配C.鞭刑D.杖刑",
            answer = "刺配"
        },
        [464] = {
            ID = 464,
            topic = "哈雷慧星的最早记录是哪国人留下的？A.埃及人B.中国人C.义大利人D.英国人",
            answer = "中国人"
        },
        [465] = {
            ID = 465,
            topic = "\"自由女神像\"是哪个国家送给美国的礼物？A.荷兰B.法国C.英国D.西班牙",
            answer = "法国"
        },
        [466] = {
            ID = 466,
            topic = "有\"植物熊猫\"之称的是A.白桦B.银杉C.水杉D.银杏",
            answer = "银杉"
        },
        [467] = {
            ID = 467,
            topic = "发射第一颗人造卫星的国家是A.中国B.前苏联C.美国D.英国",
            answer = "前苏联"
        },
        [468] = {
            ID = 468,
            topic = "欧洲最长的河流是A.这分不要了B.伏尔加河C.莱茵河D.多瑙河",
            answer = "伏尔加河"
        },
        [469] = {
            ID = 469,
            topic = "世界上地势最低的国家是A.菲律宾B.荷兰C.日本D.越南",
            answer = "荷兰"
        },
        [470] = {
            ID = 470,
            topic = "中国的四大发明不包括A.指南针B.地动仪C.活字印刷术D.火药",
            answer = "地动仪"
        },
        [471] = {
            ID = 471,
            topic = "我国着名的赵州桥建于哪个朝代A.宋B.隋C.汉D.唐",
            answer = "隋"
        },
        [472] = {
            ID = 472,
            topic = "世界上流经国家最多的河流是A.恒河B.多瑙河C.尼罗河D.亚马逊河",
            answer = "多瑙河"
        },
        [473] = {
            ID = 473,
            topic = "张家界风景区位于我国哪个省A.贵州B.湖南C.湖北D.四川",
            answer = "湖南"
        },
        [474] = {
            ID = 474,
            topic = "白光是由几种颜色的光合成的A.六种B.七种C.四种D.五种",
            answer = "七种"
        },
        [475] = {
            ID = 475,
            topic = "到了秋天，万木凋零，落叶满地。树枝上哪部分的叶子是最后落叶的A.树顶B.树梢C.树枝的中间部分D.靠树干的部分",
            answer = "树梢"
        },
        [476] = {
            ID = 476,
            topic = "大家在写信时，都会在信的结尾写上“此致”、“敬礼”，此致是什麽意思A.恭敬B.到此为止C.表示致敬D.奉上、敬上",
            answer = "到此为止"
        },
        [477] = {
            ID = 477,
            topic = "大禹治水治的是A.长江B.黄河C.淮河D.海侵",
            answer = "黄河"
        },
        [478] = {
            ID = 478,
            topic = "我国着名的九寨沟，沟内有九个什麽民族的村寨A.羌族B.藏族C.壮族D.回族",
            answer = "藏族"
        },
        [479] = {
            ID = 479,
            topic = "红外线不具备的特徵是A.可用于通讯B.能够穿透墙壁C.有很强的热能D.可用于医疗",
            answer = "能够穿透墙壁"
        },
        [480] = {
            ID = 480,
            topic = "如果一个人不小心鼻孔出血，为了避免流更多的血，那麽他应该A.用两指夹紧鼻梁硬骨B.用两指夹紧鼻尖部位C.仰起头D.卧下",
            answer = "用两指夹紧鼻尖部位"
        },
        [481] = {
            ID = 481,
            topic = "踝关节纽伤，应该A.找神棍医治B.先冷敷C.先热敷D.马上去医院",
            answer = "先冷敷"
        },
        [482] = {
            ID = 482,
            topic = "我国的国家公园指的是A.自然保护区B.风景名胜区C.植物园D.公园",
            answer = "风景名胜区"
        },
        [483] = {
            ID = 483,
            topic = "我们都说昙花一现，那麽昙花开花时间多长A.几分钟B.5小时左右C.1小时左右D.一个晚上",
            answer = "5小时左右"
        },
        [484] = {
            ID = 484,
            topic = "猫为什麽特别喜欢吃老鼠A.鼠比其他小B.弥补体内物质的不足C.喜欢鼠肉的味道D.鼠肉便于消化",
            answer = "弥补体内物质的不足"
        },
        [485] = {
            ID = 485,
            topic = "河马在水中用什麽姿势游泳A.旋转式B.不会游泳C.自由式D.狗爬式",
            answer = "不会游泳"
        },
        [486] = {
            ID = 486,
            topic = "睡觉的最佳方向是A.头北脚南B.头南脚北C.头西脚东D.头东脚西",
            answer = "头南脚北"
        },
        [487] = {
            ID = 487,
            topic = "下列哪种东西可以出去菜刀上的锈迹A.显影粉B.葱头C.酱油D.番茄",
            answer = "葱头"
        },
        [488] = {
            ID = 488,
            topic = "巾帼英雄中的巾帼是指古代妇女A.穿的衣服B.戴的头巾C.戴的发饰D.戴的手饰",
            answer = "戴的头巾"
        },
        [489] = {
            ID = 489,
            topic = "磨杵成针的典故与哪位诗人有关A.韩愈B.李白C.白居易D.杜甫",
            answer = "李白"
        },
        [490] = {
            ID = 490,
            topic = "成语琳琅满目中的琳琅原指什麽A.美玉B.名流人才C.好文章D.各种美好的物品",
            answer = "名流人才"
        },
        [491] = {
            ID = 491,
            topic = "法国人称自己心爱的人为A.大头菜B.卷心菜C.小甜菜D.黄金虫",
            answer = "卷心菜"
        },
        [492] = {
            ID = 492,
            topic = "你知道母亲节是什麽时候吗A.6月的第2个星期日B.5月的第2个星期日C.5月的第1个星期日D.6月的第1个星期日",
            answer = "5月的第2个星期日"
        },
        [493] = {
            ID = 493,
            topic = "沉鱼是指哪位美女A.杨玉环B.西施C.王昭君D.貂禅",
            answer = "西施"
        },
        [494] = {
            ID = 494,
            topic = "卢沟桥上共有多少个石狮子A.524B.485C.249D.365",
            answer = "485"
        },
        [495] = {
            ID = 495,
            topic = "通常被称为第七艺术的是A.雕塑B.电影C.文学D.绘画",
            answer = "电影"
        },
        [496] = {
            ID = 496,
            topic = "宫保鸡丁中的宫保是指A.独创B.官名C.地名D.人名",
            answer = "官名"
        },
        [497] = {
            ID = 497,
            topic = "被鲁迅先生誉为“史家之绝唱，无韵之离骚”的是A.左传B.史记C.春秋D.汉书",
            answer = "史记"
        },
        [498] = {
            ID = 498,
            topic = "“经，史，子，集”中的子，是哪种类型的书籍A.史学系列B.诸子文集C.文学荟萃D.制度记载",
            answer = "诸子文集"
        },
        [499] = {
            ID = 499,
            topic = "我国从哪个皇帝开始使用年号的A.汉高祖B.汉武帝C.唐太宗D.秦始皇",
            answer = "汉武帝"
        },
        [500] = {
            ID = 500,
            topic = "在南极点上，一个昼夜是A.一天B.一年C.一个季度D.半年",
            answer = "一年"
        },
        [501] = {
            ID = 501,
            topic = "我们在市场上买到的鲫鱼大多是A.下一题B.雌性C.雄性D.没有性别",
            answer = "雌性"
        },
        [502] = {
            ID = 502,
            topic = "狮子尾巴又出粗又长，它的主要功能是用来A.霸气B.奔跑时维持平衡C.扇风降温D.赶走飞虫",
            answer = "奔跑时维持平衡"
        },
        [503] = {
            ID = 503,
            topic = "在三国演义里，关羽温酒斩华雄的那杯酒是谁斟上的A.诸葛亮B.曹操C.刘备D.袁绍",
            answer = "曹操"
        },
        [504] = {
            ID = 504,
            topic = "露马脚这个俗语说的是古代那位夫人A.诸葛亮的夫人B.朱元璋的夫人C.孙权的夫人D.刘备的夫人",
            answer = "朱元璋的夫人"
        },
        [505] = {
            ID = 505,
            topic = "名花解语，是形容什麽的A.女子非常美丽B.美女善解人意C.花通人性D.花艳丽",
            answer = "美女善解人意"
        },
        [506] = {
            ID = 506,
            topic = "“中华人民共和国”的名称最早是由谁提出来的A.刘少奇B.任弼时C.周恩来D.毛泽东",
            answer = "任弼时"
        },
        [507] = {
            ID = 507,
            topic = "破除“满汉不通婚”这个祖训的是A.康熙B.乾隆C.咸丰D.道光",
            answer = "乾隆"
        },
        [508] = {
            ID = 508,
            topic = "我国古代通过科举考试选拔文武官吏，科举制度开始于A.元朝B.隋朝C.唐朝D.宋朝",
            answer = "隋朝"
        },
        [509] = {
            ID = 509,
            topic = "京剧中的脸谱使人物的性格一目了然。一般红色脸谱代表A.圆滑B.忠勇C.奸邪D.耿直",
            answer = "忠勇"
        },
        [510] = {
            ID = 510,
            topic = "音乐神童是指哪个音乐家A.舒伯特B.莫紮特C.贝多芬D.巴赫",
            answer = "莫紮特"
        },
        [511] = {
            ID = 511,
            topic = "艺术体操分几种比赛A.五种B.两种C.三种D.四种",
            answer = "两种"
        },
        [512] = {
            ID = 512,
            topic = "下列哪一部是四书五经中五经A.论语B.春秋C.大学D.中庸",
            answer = "春秋"
        },
        [513] = {
            ID = 513,
            topic = "我国是一个众多民族的国家，人口最多的少数民族是A.汉族B.壮族C.蒙古族D.回族",
            answer = "壮族"
        },
        [514] = {
            ID = 514,
            topic = "“豆蔻年华”指的是女子多少岁A.18B.13C.10D.15",
            answer = "13"
        },
        [515] = {
            ID = 515,
            topic = "以下数字哪个日西方人特别忌讳的A.1B.13C.4D.9",
            answer = "13"
        },
        [516] = {
            ID = 516,
            topic = "月饼最初起源于A.明朝B.唐朝C.宋朝D.元朝",
            answer = "唐朝"
        },
        [517] = {
            ID = 517,
            topic = "一般情况下，一根头发最多可以吊起多重的物品A.370克B.170克C.七十克D.270克",
            answer = "170克"
        },
        [518] = {
            ID = 518,
            topic = "睡眠的最好姿势是朝向哪个方向A.趴着B.朝向右侧C.朝向左侧D.平躺",
            answer = "朝向右侧"
        },
        [519] = {
            ID = 519,
            topic = "把新旧电池在一起用会出现什麽效果A.请指教B.费电C.省电D.效果一样",
            answer = "费电"
        },
        [520] = {
            ID = 520,
            topic = "三国中被刘备誉为 “一身都是胆”人物是谁A.马超B.赵云C.关羽D.张飞",
            answer = "赵云"
        },
        [521] = {
            ID = 521,
            topic = "下面哪一历史时期不是奴隶制社会A.春秋B.秦C.商D.周",
            answer = "秦"
        },
        [522] = {
            ID = 522,
            topic = "下列科学家中哪位是犹太人A.拉瓦锡B.爱因斯坦C.培根D.牛顿",
            answer = "爱因斯坦"
        },
        [523] = {
            ID = 523,
            topic = "月球环绕地球一周的时间约为A.一时B.一月C.一年D.一日",
            answer = "一月"
        },
        [524] = {
            ID = 524,
            topic = "我国宋朝以后,没有做过国都的城市有A.杭州B.洛阳C.开封D.南京",
            answer = "洛阳"
        },
        [525] = {
            ID = 525,
            topic = "古诗名句\"谁言寸草心,报得三春晖\"出自A.李清照B.孟郊C.李白D.王维",
            answer = "孟郊"
        },
        [526] = {
            ID = 526,
            topic = "下列哪个人不属于唐宋八大家A.欧阳修B.陆游C.柳宗元D.曾巩",
            answer = "陆游"
        },
        [527] = {
            ID = 527,
            topic = "提出人性善理论的儒家代表人物是A.韩非子B.孟子C.孔子D.荀子",
            answer = "孟子"
        },
        [528] = {
            ID = 528,
            topic = "下列四种情绪情感中，哪一种被认为不是最原始最基本的A.喜悦B.悲哀C.愤怒D.苦恼",
            answer = "悲哀"
        },
        [529] = {
            ID = 529,
            topic = "舌头无法舔到A.头发B.手肘C.肩膀D.脚趾",
            answer = "手肘"
        },
        [530] = {
            ID = 530,
            topic = "悟空上天后，玉帝封了他当A.酱油帝B.弼马温C.武曲星君D.巨灵神",
            answer = "弼马温"
        },
        [531] = {
            ID = 531,
            topic = "西游记种菩萨找的取经人是A.李世民B.陈玄奘C.唐玄奘D.唐僧",
            answer = "陈玄奘"
        },
        [532] = {
            ID = 532,
            topic = "“铁观音”茶的原产发源地在中国的哪个省份？A.山西B.福建C.四川D.浙江",
            answer = "福建"
        },
        [533] = {
            ID = 533,
            topic = "电影《变形金刚》中，与擎天柱作对的反派首领叫什麽？A.红蜘蛛B.威震天C.大黄蜂D.帝释天",
            answer = "威震天"
        },
        [534] = {
            ID = 534,
            topic = "世界上出现麦田怪圈最多的国家是？A.义大利B.英国C.美国D.中国",
            answer = "英国"
        },
        [535] = {
            ID = 535,
            topic = "香港特别行政区的区花是什麽？A.菊花B.紫荆花C.彼岸花D.蝴蝶花",
            answer = "紫荆花"
        },
        [536] = {
            ID = 536,
            topic = "着名的“自由女神”像坐落在美国的哪座城市？A.波斯顿B.纽约C.迈阿密D.曼哈顿",
            answer = "纽约"
        },
        [537] = {
            ID = 537,
            topic = "“狗不理包子”是中国哪个城市的传统风味小吃？A.丽江B.天津C.陕西D.云南",
            answer = "天津"
        },
        [538] = {
            ID = 538,
            topic = "世界上有“钢琴诗人”之称的波澜钢琴家是哪一位？A.毕加索B.肖邦C.贝多芬D.达芬奇",
            answer = "肖邦"
        },
        [539] = {
            ID = 539,
            topic = "马可波罗是在哪个朝代来到中国的？A.宋B.元C.夏D.商",
            answer = "元"
        },
        [540] = {
            ID = 540,
            topic = "现代奥运会起源于哪个国家？A.迪拜B.希腊C.梵蒂冈D.雅典",
            answer = "希腊"
        },
        [541] = {
            ID = 541,
            topic = "中国 2010 年上海世博会吉祥物叫什麽？A.海鸥B.海宝C.海贝D.海尔",
            answer = "海宝"
        },
        [542] = {
            ID = 542,
            topic = "久负盛名的孔雀舞是我国哪个民族的传统舞蹈？A.羌族B.傣族C.回族D.壮族",
            answer = "傣族"
        },
        [543] = {
            ID = 543,
            topic = "童话故事中，一说谎话鼻子就会变长的木偶叫什麽名字？A.皇后B.匹诺曹C.白雪公主D.灰姑娘",
            answer = "匹诺曹"
        },
        [544] = {
            ID = 544,
            topic = "不是电影公司的是A.梦工厂B.玩视动力C.福克斯D.狮门",
            answer = "玩视动力"
        },
        [545] = {
            ID = 545,
            topic = "1992年是什麽生肖A.狗B.猴C.鸡D.猪",
            answer = "猴"
        },
        [546] = {
            ID = 546,
            topic = "以下不是视频直播的是A.触手B.油猴C.熊猫D.斗鱼",
            answer = "油猴"
        },
        [547] = {
            ID = 547,
            topic = "夏天吃什麽蔬菜可以清火去热A.南瓜B.苦瓜C.黄瓜D.冬瓜",
            answer = "苦瓜"
        },
        [548] = {
            ID = 548,
            topic = "菜汤上浮着一层油会使菜汤凉得A.忽快忽慢B.更慢C.更快D.没影响",
            answer = "更慢"
        },
        [549] = {
            ID = 549,
            topic = "电子电脑发明于哪一年？A.1936年B.1946年C.1900年D.1956年",
            answer = "1946年"
        },
        [550] = {
            ID = 550,
            topic = "薄公英靠什麽传播种子？A.水蒸气B.风力C.动物D.昆虫",
            answer = "风力"
        },
        [551] = {
            ID = 551,
            topic = "维纳斯是罗马神话中的A.时间之神B.爱神与美神C.死神D.空间之神",
            answer = "爱神与美神"
        },
        [552] = {
            ID = 552,
            topic = "眉毛的生长周期有多久？A.5个月B.2个月C.3个月D.4个月",
            answer = "2个月"
        },
        [553] = {
            ID = 553,
            topic = "偃武修文的“偃”的意思是A.振兴B.停止C.精简D.提倡",
            answer = "停止"
        },
        [554] = {
            ID = 554,
            topic = "哈雷彗星多少年出现一次A.78年B.76年C.75年D.77年",
            answer = "76年"
        },
        [555] = {
            ID = 555,
            topic = "我国驾驶大型客车的驾驶证准驾车型为A.特种B.A型C.B型D.C型",
            answer = "A型"
        },
        [556] = {
            ID = 556,
            topic = "黄鹤楼在我国的哪一个省A.河南B.湖北C.湖南D.河北",
            answer = "湖北"
        },
        [557] = {
            ID = 557,
            topic = "我国的中央银行是指A.中国招商银行B.中国人民银行C.中国银行D.中国建设银行",
            answer = "中国人民银行"
        },
        [558] = {
            ID = 558,
            topic = "民航客机在高空中飞行时，一般处于大气的哪个层次A.电离层B.平流层C.对流层D.中间层",
            answer = "平流层"
        },
        [559] = {
            ID = 559,
            topic = "钢琴有多少个键A.90个B.88个C.84个D.86个",
            answer = "88个"
        },
        [560] = {
            ID = 560,
            topic = "张衡发明的地动仪是用来干什麽用的A.防范地震B.测定地震的方向C.预测地震D.测定地震的震级",
            answer = "测定地震的方向"
        },
        [561] = {
            ID = 561,
            topic = "我国制造的第一部轿车的牌子是A.上海B.东风C.解放D.红旗",
            answer = "东风"
        },
        [562] = {
            ID = 562,
            topic = "中华民族的摇篮是：A.松花江流域B.黄河流域C.长江流域D.黑龙江流域",
            answer = "黄河流域"
        },
        [563] = {
            ID = 563,
            topic = "“一日不见，如隔三秋”里的“三秋”是指：A.三天B.三个季度C.三个月D.三年",
            answer = "三个季度"
        },
        [564] = {
            ID = 564,
            topic = "“阳关大道”原是指通往那里的道路？A.南国B.西域C.中原D.东海",
            answer = "西域"
        },
        [565] = {
            ID = 565,
            topic = "我们常说的“鸿雁传书”源自于以下哪个历史故事？A.十面埋伏B.苏武牧羊C.楚汉相争D.霸王别姬",
            answer = "苏武牧羊"
        },
        [566] = {
            ID = 566,
            topic = "秦始皇灭六国后，统一了全国文字，这种汉字称作：A.行书B.小篆C.隶书D.楷书",
            answer = "小篆"
        },
        [567] = {
            ID = 567,
            topic = "台湾自古以来就是我国的神圣领土，祖国大陆的人们开始和台湾接触，早在秦汉时期，台湾在三国是称为：A.台湾B.夷洲C.流求D.东番",
            answer = "夷洲"
        },
        [568] = {
            ID = 568,
            topic = "不属于中国四大佛山的是：A.九华山B.武当山C.普陀山D.峨眉山",
            answer = "武当山"
        },
        [569] = {
            ID = 569,
            topic = "中国第一长洞是：A.王屋山洞B.双河洞C.青城山洞D.赤城山洞",
            answer = "双河洞"
        },
        [570] = {
            ID = 570,
            topic = "下列哪个不是中国六大古都：A.洛阳B.南昌C.西安D.开封",
            answer = "南昌"
        },
        [571] = {
            ID = 571,
            topic = "苗族的传统乐器是：A.马头琴B.芦笙C.萧D.笛",
            answer = "芦笙"
        },
        [572] = {
            ID = 572,
            topic = "中国全部的少数民族语言共分几个语系？A.8个B.5个C.6个D.7个",
            answer = "5个"
        },
        [573] = {
            ID = 573,
            topic = "中国古代宫殿建筑普遍采用什麽颜色？A.绿色B.红色C.黄色D.蓝色",
            answer = "红色"
        },
        [574] = {
            ID = 574,
            topic = "俗话说“一寸光阴一寸金。”这里的“一寸”是用哪种古代计时器量出的时间单位？A.漏壶B.漏刻C.圭表D.日影",
            answer = "漏刻"
        },
        [575] = {
            ID = 575,
            topic = "北方人年夜饭要一般都要吃饺子，其象徵意义是：A.团团圆圆B.更岁交子C.年年有余D.五福临门",
            answer = "更岁交子"
        },
        [576] = {
            ID = 576,
            topic = "一般认为，北宋风俗画，《清明上河图》描绘的是什麽季节的景象？A.冬天B.春天C.夏天D.秋天",
            answer = "春天"
        },
        [577] = {
            ID = 577,
            topic = "《红楼梦》的四大家族中没有下列哪个姓氏？A.王B.吴C.贾D.史",
            answer = "吴"
        },
        [578] = {
            ID = 578,
            topic = "下列不属于我国四大传说故事的是：A.白蛇传B.山海经C.牛郎织女D.孟姜女",
            answer = "山海经"
        },
        [579] = {
            ID = 579,
            topic = "唐代诗人中别称为诗鬼的诗人是：A.白居易B.李贺C.李白D.杜甫",
            answer = "李贺"
        },
        [580] = {
            ID = 580,
            topic = "不属于文房四宝的是：A.徽墨B.河砚C.宣纸D.湖笔",
            answer = "河砚"
        },
        [581] = {
            ID = 581,
            topic = "我们用“羞花”来形容历史上哪位美女？A.王昭君B.杨贵妃C.貂蝉D.西施",
            answer = "杨贵妃"
        },
        [582] = {
            ID = 582,
            topic = "“天知、神知、我知、子知”，最早是汉代人杨震说的，他说这句话的目的是为了：A.向人发誓B.拒绝收礼C.劝人投案D.替人投案",
            answer = "拒绝收礼"
        },
        [583] = {
            ID = 583,
            topic = "微剧是什麽传统戏剧的前身？A.豫剧B.京剧C.川剧D.湘剧",
            answer = "京剧"
        },
        [584] = {
            ID = 584,
            topic = "京剧服装中男性角色蟒袍上的动物是：A.凤B.龙C.蛇D.虎",
            answer = "龙"
        },
        [585] = {
            ID = 585,
            topic = "下列哪部作品不是冯梦龙的着作？A.喻世明言B.西厢记C.醒世恒言D.初刻拍案惊奇",
            answer = "西厢记"
        },
        [586] = {
            ID = 586,
            topic = "四书包括：《论语》、《大学》、《孟子》和A.礼记B.中庸C.春秋D.周易",
            answer = "中庸"
        },
        [587] = {
            ID = 587,
            topic = "五代包括：后梁、后唐、后晋、后汉和A.北宋B.后周C.东周D.南宋",
            answer = "后周"
        },
        [588] = {
            ID = 588,
            topic = "下列哪部作品不是陶渊明的A.桃花源记B.岳阳楼记C.归去来兮辞D.归园田居",
            answer = "岳阳楼记"
        },
        [589] = {
            ID = 589,
            topic = "“交头接耳”这个成语出自下列哪部作品A.三国演义B.单刀会C.西游记D.红楼梦",
            answer = "单刀会"
        },
        [590] = {
            ID = 590,
            topic = "孔子是哪国人A.韩国B.鲁国C.秦国D.齐国",
            answer = "鲁国"
        },
        [591] = {
            ID = 591,
            topic = "地动仪发明于哪个朝代A.东晋B.东汉C.西汉D.西晋",
            answer = "东汉"
        },
        [592] = {
            ID = 592,
            topic = "千古第一才女是谁？A.薛涛B.李清照C.蔡文姬D.鱼玄机",
            answer = "李清照"
        },
        [593] = {
            ID = 593,
            topic = "“初出茅庐”中的“茅庐”本意是指谁的住处？A.司马懿B.诸葛亮C.刘备D.关羽",
            answer = "诸葛亮"
        },
        [594] = {
            ID = 594,
            topic = "如果你生活在唐代，明天就要参加科举考试，如熬夜看书打磕睡，你将可能用哪种方法来提神？A.喝酒B.饮茶C.喝咖啡D.抽烟",
            answer = "饮茶"
        },
        [595] = {
            ID = 595,
            topic = "创造了“望、闻、问、切”的四诊法，一直成为为中国传统医学的主要诊查手段的我国古代名医是？A.李时珍B.扁鹊C.华佗D.葛洪",
            answer = "扁鹊"
        },
        [596] = {
            ID = 596,
            topic = "“大清”的国号是哪位清朝皇帝定的？A.乾隆B.皇太极C.康熙D.雍正",
            answer = "皇太极"
        },
        [597] = {
            ID = 597,
            topic = "魏忠贤是在哪个皇帝当政期间乱政？A.天顺B.天启C.万历D.永乐",
            answer = "天启"
        },
        [598] = {
            ID = 598,
            topic = "我国的传统节日之一端午节相传是为了纪念战国时期的大诗人屈原。他生活在当时的哪一国家？A.燕国B.楚国C.魏国D.齐国",
            answer = "楚国"
        },
        [599] = {
            ID = 599,
            topic = "“开辟荆榛，千秋功业；驱逐荷虏，一代英雄。”此联称颂的英雄是？A.刘备B.郑成功C.霍去病D.卫青",
            answer = "郑成功"
        },
        [600] = {
            ID = 600,
            topic = "第一个横渡大西洋到达美洲的欧洲航海家是？A.麦哲伦B.哥伦布C.达伽马D.迪亚士",
            answer = "哥伦布"
        },
        [601] = {
            ID = 601,
            topic = "指出鸦片“流毒于天下，则为害甚巨，法当从严。若犹泄泄视之，是使数十年后，中原几无可以御敌之兵，且无可以充饷之银。”的人是？A.曾国藩B.林则徐C.骆秉章D.左宗棠",
            answer = "林则徐"
        },
        [602] = {
            ID = 602,
            topic = "郭沫若写的对联“世上疮痍，诗中圣哲；民间疾苦，笔底波澜”概括了谁的伟大成就？A.白居易B.杜甫C.李白D.李清照",
            answer = "杜甫"
        },
        [603] = {
            ID = 603,
            topic = "“写鬼写妖，高人一等；刺贪刺虐，入骨三分。”此联是对何人作品高度而又恰如其分的评价？A.纪晓岚B.蒲松龄C.曹雪芹D.孔尚任",
            answer = "蒲松龄"
        },
        [604] = {
            ID = 604,
            topic = "澳门回归的日期是A.99年12月23B.99年12月20C.99年12月21D.99年12月22",
            answer = "99年12月20"
        },
        [605] = {
            ID = 605,
            topic = "我国科举制度正式形成于A.明朝B.隋朝C.汉朝D.清朝",
            answer = "隋朝"
        },
        [606] = {
            ID = 606,
            topic = "隋炀帝发动的三次战争是对A.突厥B.高丽C.匈奴D.北魏",
            answer = "高丽"
        },
        [607] = {
            ID = 607,
            topic = "626年发动“玄武门之变”的是A.李建成B.李世民C.李渊D.李元吉",
            answer = "李世民"
        },
        [608] = {
            ID = 608,
            topic = "唐太宗时期，先后进谏200多次的着名大臣是A.杜如晦B.魏征C.房玄龄D.姚崇",
            answer = "魏征"
        },
        [609] = {
            ID = 609,
            topic = "历史上把唐太宗统治时期称为A.光武中兴B.贞观之治C.开元盛世D.开皇之治",
            answer = "贞观之治"
        },
        [610] = {
            ID = 610,
            topic = "我国饮茶之风风靡全国始于A.秦朝B.唐朝C.南北朝D.汉朝",
            answer = "唐朝"
        },
        [611] = {
            ID = 611,
            topic = "下列农具中，可用于灌溉的是A.曲辕犁B.筒车C.水排D.耧车",
            answer = "筒车"
        },
        [612] = {
            ID = 612,
            topic = "维吾尔族的祖先在唐玄宗时被称作A.突厥B.回鹘C.兀儿D.回纥",
            answer = "回鹘"
        },
        [613] = {
            ID = 613,
            topic = "唐朝的外国留学生中，人数最多的是A.日本人B.新罗人C.波斯人D.高丽人",
            answer = "新罗人"
        },
        [614] = {
            ID = 614,
            topic = "唐玄宗统治后期的年号是A.开皇B.天宝C.贞观D.开元",
            answer = "天宝"
        },
        [615] = {
            ID = 615,
            topic = "后世尊称的“药王”是A.扁鹊B.孙思邈C.僧一行D.李时珍",
            answer = "孙思邈"
        },
        [616] = {
            ID = 616,
            topic = "欧洲第一部由国家编定并颁布的药典比我国晚了A.900年B.800年C.700年D.600年",
            answer = "800年"
        },
        [617] = {
            ID = 617,
            topic = "隋朝建立于A.589年B.581年C.585年D.587年",
            answer = "581年"
        },
        [618] = {
            ID = 618,
            topic = "杜甫在《八阵图》《蜀相》和《咏怀古迹》诗中都写到同一个人，这个人是A.刘备B.诸葛亮C.曹操D.孙权",
            answer = "诸葛亮"
        },
        [619] = {
            ID = 619,
            topic = "飞《满江红》中，有“笑谈渴饮匈奴血”一句，其中“匈奴”是指A.契丹统治者B.女真统治者C.西夏统治者D.蒙古统治者",
            answer = "女真统治者"
        },
        [620] = {
            ID = 620,
            topic = "下列着作中属于语录体散文集的是A.《史记》B.《论语》C.《左传》D.《战国策》",
            answer = "《论语》"
        },
        [621] = {
            ID = 621,
            topic = "史湘云是下列哪一部作品中的人物？A.西厢记B.红楼梦C.水浒传D.聊斋志异",
            answer = "红楼梦"
        },
        [622] = {
            ID = 622,
            topic = "我国第一部字典是A.尔雅B.说文解字C.康熙字典D.辞源",
            answer = "说文解字"
        },
        [623] = {
            ID = 623,
            topic = "晚唐诗坛上，与温庭筠并称为“温李”、又与杜牧并称为“小李杜”的诗\n\n人是A.李贺B.李商隐C.李煜D.李白",
            answer = "李商隐"
        },
        [624] = {
            ID = 624,
            topic = "“项庄舞剑，意在沛公”这个成语出自A.三国志B.史记C.汉书D.后汉书",
            answer = "史记"
        },
        [625] = {
            ID = 625,
            topic = "我国古代戏曲中的杰作《西厢记》的作者是A.马致远B.王实甫C.关汉卿D.白朴",
            answer = "王实甫"
        },
        [626] = {
            ID = 626,
            topic = "北宋词坛豪放派的代表作家是A.辛弃疾B.苏轼C.欧阳修D.柳永",
            answer = "苏轼"
        },
        [627] = {
            ID = 627,
            topic = "被尊奉为华夏族祖先的人是A.大禹B.黄帝C.盘古D.女娲",
            answer = "黄帝"
        },
        [628] = {
            ID = 628,
            topic = "建立历史上第一个大一统的封建帝国的人是A.秦昭襄王B.秦始皇C.汉高祖D.汉武帝",
            answer = "秦始皇"
        },
        [629] = {
            ID = 629,
            topic = "《天工开物》是我国最早的工艺百科全书，它的作者是明朝的A.徐霞客B.宋应星C.郦道元D.沈括",
            answer = "宋应星"
        },
        [630] = {
            ID = 630,
            topic = "下列作品属于编年体历史着作的是A.战国策B.左传C.史记D.国语",
            answer = "左传"
        },
        [631] = {
            ID = 631,
            topic = "杭州是我国七大古都之一，下列哪个朝代的都城在杭州？A.东汉B.南宋C.北宋D.西汉",
            answer = "南宋"
        },
        [632] = {
            ID = 632,
            topic = "最早设立“太学”培养人才的皇帝是A.秦始皇B.汉武帝C.汉高祖D.唐太宗",
            answer = "汉武帝"
        },
        [633] = {
            ID = 633,
            topic = "“琴挑文君”这个典故的主人公是A.杨雄B.司马相如C.司马光D.司马迁",
            answer = "司马相如"
        },
        [634] = {
            ID = 634,
            topic = "2008年在我国北京举办的奥运会是第几届夏季奥运会？A.19B.29C.27D.30",
            answer = "29"
        },
        [635] = {
            ID = 635,
            topic = "下列哪个奖项不在诺贝尔奖之列?A.经济学奖B.数学奖C.医学奖D.物理学奖",
            answer = "数学奖"
        },
        [636] = {
            ID = 636,
            topic = "悲剧《哈姆雷特》的作者是英国着名戏剧家A.萧伯纳B.莎士比亚C.托尔斯泰D.狄更斯",
            answer = "莎士比亚"
        },
        [637] = {
            ID = 637,
            topic = "下列哪些蚊子会吸人的血？A.蚊子不吸血B.雌蚊C.雄蚊D.所有蚊子",
            answer = "雌蚊"
        },
        [638] = {
            ID = 638,
            topic = "引起煤气中毒的主要气体是A.H2B.COC.CO2D.O2",
            answer = "COC"
        },
        [639] = {
            ID = 639,
            topic = "新疆的哈密瓜之所以甘甜主要是因为A.雪水灌溉B.日照充足C.日夜温差大D.气候乾燥",
            answer = "日夜温差大"
        },
        [640] = {
            ID = 640,
            topic = "一对夫妇生了3个女孩，再生一个女孩的可能性是A.1B.0C.0.5D.0.33",
            answer = "0.5"
        },
        [641] = {
            ID = 641,
            topic = "人体最大的解毒器官是A.肺B.胃C.肝脏D.肾脏",
            answer = "肝脏"
        },
        [642] = {
            ID = 642,
            topic = "青蛙是两栖动物，那麽两栖动物的祖先是以下哪种动物？A.龟B.人C.鱼D.鲸",
            answer = "鱼"
        },
        [643] = {
            ID = 643,
            topic = "人体最大的器官是什麽?A.肝脏B.胃C.皮肤D.肾脏",
            answer = "皮肤"
        },
        [644] = {
            ID = 644,
            topic = "下列水产品中，属于鱼的是?A.鲸B.虾C.黄鳝D.甲鱼",
            answer = "黄鳝"
        },
        [645] = {
            ID = 645,
            topic = "在显微镜下观察小鱼尾鳍的血液流动，其中有的血管红细胞只能单行通过，这种血管是A.静脉B.动脉C.毛细血管D.毛细淋巴管",
            answer = "毛细血管"
        },
        [646] = {
            ID = 646,
            topic = "医院妇产科产房内有一产妇急需输血，她本人的血型的AB型，在下列供血中，它应该输入的血液是A.B型B.O型C.AB型D.A型",
            answer = "AB型"
        },
        [647] = {
            ID = 647,
            topic = "蟑螂，也就是我们俗称的小强，它的头被切掉后还可以存活多长时间?A.1-3天B.7天左右C.5-10分钟D.1个小时",
            answer = "5-10分钟"
        },
        [648] = {
            ID = 648,
            topic = "世界上最小的鸟是A.燕子B.鹦鹉C.蜂鸟D.麻雀",
            answer = "蜂鸟"
        },
        [649] = {
            ID = 649,
            topic = "鱼儿在一天中的什麽时候最容易因缺氧窒息而翻塘？A.傍晚B.淩晨C.早晨D.中午",
            answer = "早晨"
        },
        [650] = {
            ID = 650,
            topic = "我们所说的“四不像”是指那种动物？A.牛B.犀牛C.麋鹿D.马",
            answer = "麋鹿"
        },
        [651] = {
            ID = 651,
            topic = "不论是儿童、成年或老年缺钙都会影响健康，患各种疾病，钙的\n\n吸收与什麽有关？A.维生素BB.维生素CC.维生素DD.维生素A",
            answer = "维生素D"
        },
        [652] = {
            ID = 652,
            topic = "下列有关DNA亲子鉴定的说法错误的是A.无时间限制B.无空间限制C.必须双亲参与D.准确率高",
            answer = "必须双亲参与"
        },
        [653] = {
            ID = 653,
            topic = "生物体是纷繁复杂形态多样的，但最基本的骨架却是由什麽构成的：A.脂肪B.核酸C.蛋白质D.糖",
            answer = "蛋白质"
        },
        [654] = {
            ID = 654,
            topic = "被国际上誉为“杂交水稻之父”的中国科学家是A.陈竺B.青先国C.袁隆平D.谈家桢",
            answer = "袁隆平"
        },
        [655] = {
            ID = 655,
            topic = "蛋白质是由氨基酸组成的，组成蛋白质的天然氨基酸约有多少种:A.22B.18C.20D.25",
            answer = "20"
        },
        [656] = {
            ID = 656,
            topic = "生命活动的基本特徵是A.做功B.运动C.新陈代谢D.氧化反应",
            answer = "新陈代谢"
        },
        [657] = {
            ID = 657,
            topic = "地球上最早出现的进行光合作用的生命是A.团藻B.衣藻C.蓝藻D.绿藻",
            answer = "蓝藻"
        },
        [658] = {
            ID = 658,
            topic = "下列有关沙漠之舟--骆驼的驼峰的说法正确的是A.驮物品B.美观C.贮脂肪D.贮水",
            answer = "贮脂肪"
        },
        [659] = {
            ID = 659,
            topic = "\"红娘\"由来是出自下列哪部古典名剧:A.长生殿B.桃花扇C.西厢记D.琵琶记",
            answer = "西厢记"
        },
        [660] = {
            ID = 660,
            topic = "我国第一部有声影片是A.林则徐B.玉人何处C.歌女红牡丹D.定军山",
            answer = "歌女红牡丹"
        },
        [661] = {
            ID = 661,
            topic = "没有在入海口形成三角洲的河流是A.黄河B.珠江C.钱塘江D.长江",
            answer = "钱塘江"
        },
        [662] = {
            ID = 662,
            topic = "宾士汽车原产于哪一个国家?A.美国B.日本C.德国D.中国",
            answer = "德国"
        },
        [663] = {
            ID = 663,
            topic = "北京大学的第一位校长是A.胡适B.林建华C.严复D.蔡元培",
            answer = "严复"
        },
        [664] = {
            ID = 664,
            topic = "大汶口文化遗址在我国的什麽地方A.甘肃B.湖南C.山东D.广西",
            answer = "山东"
        },
        [665] = {
            ID = 665,
            topic = "被誉为“浑身都是音乐”的着名指挥家是：A.卡拉扬B.伯恩施坦C.小泽征尔D.梅达",
            answer = "小泽征尔"
        },
        [666] = {
            ID = 666,
            topic = "“民为贵,社稷次之,君为轻”这句话出自A.韩非子B.庄子C.孟子D.孔子",
            answer = "孟子"
        },
        [667] = {
            ID = 667,
            topic = "莎士比亚四大悲剧中哪部又称\"王子复仇记\":A.麦克白斯B.李尔王C.哈姆雷特D.奥赛罗",
            answer = "哈姆雷特"
        },
        [668] = {
            ID = 668,
            topic = "世界上最大的宫殿是A.爱丽舍宫B.克里姆林宫C.故宫D.白宫",
            answer = "故宫"
        },
        [669] = {
            ID = 669,
            topic = "六弦琴是什麽乐器的别称A.小提琴B.古筝C.吉他D.二胡",
            answer = "吉他"
        },
        [670] = {
            ID = 670,
            topic = "\"破釜沉舟\"这个成语出于哪次战争?A.官渡之战B.赤壁之战C.巨鹿制作D.长平之战",
            answer = "巨鹿制作"
        },
        [671] = {
            ID = 671,
            topic = "一般而言，肥胖是指超过理想体重的百分之多少A.0.3B.0.4C.0.2D.0.1",
            answer = "0.2"
        },
        [672] = {
            ID = 672,
            topic = "《献血法》规定，献血者两次献血间隔时间不得少于A.八个月B.一年C.六个月D.三个月",
            answer = "六个月"
        },
        [673] = {
            ID = 673,
            topic = "具有止血功能的维生素是A.维生素BB.维生素CC.维生素KD.维生素A",
            answer = "维生素K"
        },
        [674] = {
            ID = 674,
            topic = "西洋占星术中将一年分成十二个星座，以下哪个不是土像星座？A.金牛座B.摩羯座C.牡羊座D.处女座",
            answer = "牡羊座"
        },
        [675] = {
            ID = 675,
            topic = "下列着名作家哪位不是19世纪英国诗坛三大巨星之一:A.雪莱B.拜伦C.笛福D.济慈",
            answer = "笛福"
        },
        [676] = {
            ID = 676,
            topic = "世界哪一个国家的茶叶产量最多A.日本B.韩国C.印度D.中国",
            answer = "印度"
        },
        [677] = {
            ID = 677,
            topic = "世界读书日是什麽时候A.9.11B.6.28C.4.23D.5.13",
            answer = "4.23"
        },
        [678] = {
            ID = 678,
            topic = "我们通常所说的“北斗七星”，天文学上称之为A.小熊星座B.半人马座C.大熊星座D.狮子星座",
            answer = "大熊星座"
        },
        [679] = {
            ID = 679,
            topic = "下列科学家中哪位是犹太人A.牛顿B.培根C.爱因斯坦D.拉瓦锡",
            answer = "爱因斯坦"
        },
        [680] = {
            ID = 680,
            topic = "《西游记》中的火焰山在哪里？A.巴基斯坦B.中国重庆C.中国吐鲁番D.哈萨克斯坦",
            answer = "中国吐鲁番"
        },
        [681] = {
            ID = 681,
            topic = "按照宇宙大爆炸理论，宇宙的年龄估计有A.50亿年B.200亿年C.120亿年D.150亿年",
            answer = "120亿年"
        },
        [682] = {
            ID = 682,
            topic = "以下历史事件中，与关羽无关的是A.水淹七军B.大意失荆州C.七擒七纵D.单刀赴会",
            answer = "七擒七纵"
        },
        [683] = {
            ID = 683,
            topic = "巴黎凯旋门是为纪念谁而建A.路易B.丘吉尔C.拿破仑D.哥伦布",
            answer = "拿破仑"
        },
        [684] = {
            ID = 684,
            topic = "中国古代的青铜器，造型新颖，种类繁多，以商、周、春秋时期的为多。\n其主要成分是A.铜与铁B.铜C.铜与锡D.铜与钢",
            answer = "铜与锡"
        },
        [685] = {
            ID = 685,
            topic = "下列世界奇迹哪个位于伊拉克A.太阳神像B.金字塔C.空中花园D.宙斯神像",
            answer = "空中花园"
        },
        [686] = {
            ID = 686,
            topic = "弱冠指的是多少岁A.三十岁B.四十岁C.二十岁D.十岁",
            answer = "二十岁"
        },
        [687] = {
            ID = 687,
            topic = "根据有关规定，职工的试用期最长不得超过A.三个月B.一年C.六个月D.一个月",
            answer = "六个月"
        },
        [688] = {
            ID = 688,
            topic = "一度电可供一只50瓦的灯泡照明几小时?A.10B.30C.20D.5",
            answer = "20"
        },
        [689] = {
            ID = 689,
            topic = "不锈钢中的什麽元素使这种合金钢不生锈A.钨B.锰C.铬D.钼",
            answer = "铬"
        },
        [690] = {
            ID = 690,
            topic = "《流星花园》中，饰演花泽类的是哪位男演员？A.朱孝天B.胡歌C.周渝民D.言承旭",
            answer = "周渝民"
        },
        [691] = {
            ID = 691,
            topic = "AK47是哪一年被定型的自动步枪？A.1946B.1945C.1947D.1948",
            answer = "1947"
        },
        [692] = {
            ID = 692,
            topic = "癞蛤蟆的学名叫什麽？A.牛蛙B.美蛙C.蟾蜍D.青蛙",
            answer = "蟾蜍"
        },
        [693] = {
            ID = 693,
            topic = "知了是哪种昆虫的俗称？A.天牛B.蝴蝶C.蝉D.螳螂",
            answer = "蝉"
        },
        [694] = {
            ID = 694,
            topic = "我国预警信号最高级别的是什麽颜色预警？A.橙色B.蓝色C.红色D.黄色",
            answer = "红色"
        },
        [695] = {
            ID = 695,
            topic = "暴雨预警最低级别额的是什麽颜色的预警？A.黄色B.红色C.蓝色D.橙色",
            answer = "蓝色"
        },
        [696] = {
            ID = 696,
            topic = "“433”“442”“352”阵型是哪种运动的术语？A.乒乓球B.橄榄球C.足球D.篮球",
            answer = "足球"
        },
        [697] = {
            ID = 697,
            topic = "工商管理硕士是用哪三个英文字母表示？A.BAMB.BMWC.MBAD.ABM",
            answer = "MBA"
        },
        [698] = {
            ID = 698,
            topic = "\"抢7”“鹰眼”是哪项运动的术语？A.羽毛球B.篮球C.网球D.乒乓球",
            answer = "网球"
        },
        [699] = {
            ID = 699,
            topic = "《孟子》中讲到，我国古代婚姻讲究父母之命，什麽之言？A.长辈B.姑妈C.媒妁D.媒婆",
            answer = "媒妁"
        },
        [700] = {
            ID = 700,
            topic = "我们常说在分配制度上平均主义，干好干坏都一样叫做吃什麽饭？A.一锅饭B.大碗饭C.大锅饭D.平均饭",
            answer = "大锅饭"
        },
        [701] = {
            ID = 701,
            topic = "去普吉岛旅游应该办理哪个国家的签证？A.日本B.缅甸C.泰国D.韩国",
            answer = "泰国"
        },
        [702] = {
            ID = 702,
            topic = "“凯撒大帝”是古代哪一个国家的杰出军事统帅？A.古印度B.古埃及C.古罗马D.古希腊",
            answer = "古罗马"
        },
        [703] = {
            ID = 703,
            topic = "“三十而立”出自中国哪本古籍？A.孟子B.道德经C.论语D.庄子",
            answer = "论语"
        },
        [704] = {
            ID = 704,
            topic = "《至少还有你》是哪位歌手原唱的？A.林俊杰B.周杰伦C.林忆莲D.王菲",
            answer = "林忆莲"
        },
        [705] = {
            ID = 705,
            topic = "十二生肖排在龙前面一位的是？A.蛇B.鼠C.兔D.马",
            answer = "兔"
        },
        [706] = {
            ID = 706,
            topic = "有“抗癌之王”之称的食物是？A.洋葱B.生姜C.大蒜D.大葱",
            answer = "大蒜"
        },
        [707] = {
            ID = 707,
            topic = "胡萝卜素和下列哪种调料相克？A.味精B.盐C.醋D.酱油",
            answer = "醋"
        },
        [708] = {
            ID = 708,
            topic = "下列哪种花卉是吸收甲醛的好手？A.雏菊B.喇叭花C.芦荟D.月季",
            answer = "芦荟"
        },
        [709] = {
            ID = 709,
            topic = "下列哪种水果有解酒的效果？A.橘子B.梨C.香蕉D.西瓜",
            answer = "香蕉"
        },
        [710] = {
            ID = 710,
            topic = "下列乾果中，脂肪含量最高的是？A.瓜子B.杏仁C.核桃D.花生",
            answer = "核桃"
        },
        [711] = {
            ID = 711,
            topic = "经常服用下列哪种食物可能引起铅中毒？A.鸡蛋B.鹅蛋C.松花蛋D.鸭蛋",
            answer = "松花蛋"
        },
        [712] = {
            ID = 712,
            topic = "在野外吃了有毒的蘑菇，你应该立即服用：A.喝牛奶B.喝醋C.大量喝水D.喝盐水",
            answer = "大量喝水"
        },
        [713] = {
            ID = 713,
            topic = "用温度多高的水洗澡最好？A.60摄氏度B.30摄氏度C.40摄氏度D.50摄氏度",
            answer = "40摄氏度"
        },
        [714] = {
            ID = 714,
            topic = "花椒的果实长在A.地表B.地底C.树上D.根部",
            answer = "树上"
        },
        [715] = {
            ID = 715,
            topic = "大自然中废纸的分解需要几个月A.5到6B.7到8C.3到4D.1到2",
            answer = "3到4"
        },
        [716] = {
            ID = 716,
            topic = "足球最早起源于哪个国家A.义大利B.德国C.中国D.英国",
            answer = "中国"
        },
        [717] = {
            ID = 717,
            topic = "涮羊肉起源于A.明朝B.宋朝C.元朝D.唐朝",
            answer = "元朝"
        },
        [718] = {
            ID = 718,
            topic = "最早的校园歌曲出自于A.美国B.英国C.日本D.中国",
            answer = "日本"
        },
        [719] = {
            ID = 719,
            topic = "人们最初发明滑冰，是把它当做A.娱乐专案B.传统习俗C.交通工具D.运动专案",
            answer = "交通工具"
        },
        [720] = {
            ID = 720,
            topic = "被称为菊月的的月份是？A.十月B.十一月C.九月D.八月",
            answer = "九月"
        },
        [721] = {
            ID = 721,
            topic = "下列哪类食物是酸性食物？A.大白菜B.牛奶C.鸡蛋D.茶叶",
            answer = "鸡蛋"
        },
        [722] = {
            ID = 722,
            topic = "谷类，薯类是我国膳食能量的主要来源，但是其主要的缺陷是缺乏：A.维生素B.脂肪C.蛋白质D.碳水化合物",
            answer = "蛋白质"
        },
        [723] = {
            ID = 723,
            topic = "鸡蛋与什麽同煮会使氨基酸形成果糖机赖氨酸的结合物，不利于身体健康？A.豆浆B.矿泉水C.白糖D.红糖",
            answer = "白糖"
        },
        [724] = {
            ID = 724,
            topic = "黄瓜甘寒，花生仁多油脂，两者共同使用容易导致：A.头晕B.咳嗽C.腹泻D.感冒",
            answer = "腹泻"
        },
        [725] = {
            ID = 725,
            topic = "人们在收拾鱼身是，涂上什麽可以防滑？A.盐水B.酒C.醋D.酱油",
            answer = "醋"
        },
        [726] = {
            ID = 726,
            topic = "感冒忌用下列哪一种食物？A.青菜B.生姜C.海鱼D.豆浆",
            answer = "海鱼"
        },
        [727] = {
            ID = 727,
            topic = "饮酒对一下哪个器官危害最大？A.眼睛B.肺C.心脏D.皮肤",
            answer = "心脏"
        },
        [728] = {
            ID = 728,
            topic = "苹果中含有增强记忆力的微量元素是？A.铁B.碘C.锌D.钙",
            answer = "锌"
        },
        [729] = {
            ID = 729,
            topic = "速食面里面必定含有那种添加剂A.食用色素B.漂白粉C.合成抗氧化剂D.防腐剂",
            answer = "合成抗氧化剂"
        },
        [730] = {
            ID = 730,
            topic = "低盐饮食有助于预防什麽疾病？A.乙肝B.贫血C.高血压D.糖尿病",
            answer = "高血压"
        },
        [731] = {
            ID = 731,
            topic = "自然界中，有智慧元素之称的是A.钙B.铁C.碘D.锌",
            answer = "碘"
        },
        [732] = {
            ID = 732,
            topic = "下列哪种食物可以食用？A.变红的汤圆B.发芽的土豆C.发绿的豆芽D.发霉的茶叶",
            answer = "发绿的豆芽"
        },
        [733] = {
            ID = 733,
            topic = "土豆不宜放在什麽地方？A.乾燥处B.卧室C.日光照射处D.通风处",
            answer = "日光照射处"
        },
        [734] = {
            ID = 734,
            topic = "小明家灯泡灯丝断了，他晃了晃让灯丝搭上，发现亮度跟以前比A.一样亮B.不亮了C.更亮D.更暗",
            answer = "更亮"
        },
        [735] = {
            ID = 735,
            topic = "日光灯引发火灾的主要部件是A.灯管B.灯线C.镇流器D.灯座",
            answer = "镇流器"
        },
        [736] = {
            ID = 736,
            topic = "发现火灾是，最重要的是做什麽？才能及时救火A.逃跑B.自己救火C.报警D.喊人",
            answer = "报警"
        },
        [737] = {
            ID = 737,
            topic = "优质油不应该有的特徵是？A.清洗透明B.没有沉淀C.油色暗淡D.无悬浮物",
            answer = "油色暗淡"
        },
        [738] = {
            ID = 738,
            topic = "哪一种蔬菜具有抵抗肠胃癌的功能？A.花菜B.菠菜C.包心菜D.白菜",
            answer = "包心菜"
        },
        [739] = {
            ID = 739,
            topic = "凉皮面是哪里的特色小吃？A.成都B.重庆C.西安D.武汉",
            answer = "西安"
        },
        [740] = {
            ID = 740,
            topic = "喝啤酒不宜用什麽做下酒菜？A.牛肉B.咸菜C.海鲜D.花生米",
            answer = "海鲜"
        },
        [741] = {
            ID = 741,
            topic = "热咖啡在哪个温度下和最可口？A.50B.80C.70D.60",
            answer = "70"
        },
        [742] = {
            ID = 742,
            topic = "双喜临门。形容哪个省市的名称？A.成都B.北京C.重庆D.西安",
            answer = "重庆"
        },
        [743] = {
            ID = 743,
            topic = "黄种人主要分布在？A.欧洲B.美洲C.亚种东部D.亚洲西部",
            answer = "亚种东部"
        },
        [744] = {
            ID = 744,
            topic = "诺贝尔是哪国人？A.挪威B.德国C.瑞典D.波兰",
            answer = "瑞典"
        },
        [745] = {
            ID = 745,
            topic = "七月流星指天气？A.闷热B.燥热C.转凉D.暴雨",
            answer = "转凉"
        },
        [746] = {
            ID = 746,
            topic = "名不正则言不顺是哪家的思想？A.兵家B.道家C.儒家D.墨家",
            answer = "儒家"
        },
        [747] = {
            ID = 747,
            topic = "昙花是在那个时间段开花？A.中午B.下午C.晚上D.上午",
            answer = "晚上"
        },
        [748] = {
            ID = 748,
            topic = "国色天香最初是形容A.桂花B.茉莉花C.牡丹D.菊花",
            answer = "牡丹"
        },
        [749] = {
            ID = 749,
            topic = "天方夜谭的天方是指A.古印度B.古埃及C.古阿拉伯D.古希腊",
            answer = "古阿拉伯"
        },
        [750] = {
            ID = 750,
            topic = "亢龙有悔出自A.诗经B.楚辞C.易经D.道德经",
            answer = "易经"
        },
        [751] = {
            ID = 751,
            topic = "被称为杏月的是几月A.三月B.四月C.二月D.一月",
            answer = "二月"
        },
        [752] = {
            ID = 752,
            topic = "霜淇淋是哪国传来的外来语A.德国B.印度C.英国D.法国",
            answer = "英国"
        },
        [753] = {
            ID = 753,
            topic = "“冬天来了，春天还会远麽？”出自哪位作家？A.拜伦B.普斯金C.雪莱D.雨果",
            answer = "雪莱"
        },
        [754] = {
            ID = 754,
            topic = "占人体细胞50%以上的有机化合物是？A.脂肪B.核酸C.蛋白质D.糖元",
            answer = "蛋白质"
        },
        [755] = {
            ID = 755,
            topic = "中国象棋双方各有几种棋子？A.六种B.五种C.七种D.八种",
            answer = "七种"
        },
        [756] = {
            ID = 756,
            topic = "人脑中控制平衡的是？A.右脑B.神经中枢C.小脑D.左脑",
            answer = "小脑"
        },
        [757] = {
            ID = 757,
            topic = "山东，山西的山是指什麽山？A.泰山B.黄山C.太行山D.衡山",
            answer = "太行山"
        },
        [758] = {
            ID = 758,
            topic = "下列哪种是能降血压的蔬菜A.菠菜B.包菜C.芹菜D.韭菜",
            answer = "芹菜"
        },
        [759] = {
            ID = 759,
            topic = "一年有几个节气？A.21B.20C.24D.23",
            answer = "24"
        },
        [760] = {
            ID = 760,
            topic = "沙爹牛肉是哪国传入我国的小吃？A.拉美B.欧美C.印尼D.日本",
            answer = "印尼"
        },
        [761] = {
            ID = 761,
            topic = "蟋蟀是靠什麽发出鸣叫的A.嘴巴B.声道C.翅膀D.触角",
            answer = "翅膀"
        },
        [762] = {
            ID = 762,
            topic = "苍蝇飞落某处就冲忙搓脚，它是在？A.进食B.辨别方向C.品尝味道D.休息",
            answer = "品尝味道"
        },
        [763] = {
            ID = 763,
            topic = "新郎官最早是用来指：A.举人B.新人的南方C.新科进士D.状元",
            answer = "新科进士"
        },
        [764] = {
            ID = 764,
            topic = "下列哪个元素污染大气或饮水时，可能引起人的牙齿骨质疏松？A.硫B.汞C.氟D.碘",
            answer = "氟"
        },
        [765] = {
            ID = 765,
            topic = "人们常说的“五金”不包括A.铁B.锡C.锌D.金",
            answer = "锌"
        },
        [766] = {
            ID = 766,
            topic = "营养学家分析了个颜色蔬菜的营养成分，下列哪种颜色蔬菜营养物质最低？A.红色B.黄色C.白色D.绿色",
            answer = "白色"
        },
        [767] = {
            ID = 767,
            topic = "长使用铝制品作为食品溶剂容易引发哪种疾病？A.肠胃疾病B.癌症C.老年痴呆D.甲状腺肿大",
            answer = "老年痴呆"
        },
        [768] = {
            ID = 768,
            topic = "现在美国国旗星条上有多少颗星？A.53B.40C.50D.51",
            answer = "50"
        },
        [769] = {
            ID = 769,
            topic = "废旧电池乱丢可能对人造成A.铁中毒B.氰中毒C.镉中毒D.铅中毒",
            answer = "镉中毒"
        },
        [770] = {
            ID = 770,
            topic = "含磷洗衣粉中的什麽是造成水体富营养化的罪魁祸首？A.甲醛B.萤光粉C.磷酸盐D.磷酸",
            answer = "磷酸盐"
        },
        [771] = {
            ID = 771,
            topic = "数字符号中的“0”起源于A.古罗马B.古埃及C.古印度D.古希腊",
            answer = "古印度"
        },
        [772] = {
            ID = 772,
            topic = "如果你有机会到宝岛台湾一游，建议你到台南市参观当地的名胜古迹----赤嵌楼。这里敬奉着一位民族英雄，他是A.郑和B.林则徐C.郑成功D.戚继光",
            answer = "郑成功"
        },
        [773] = {
            ID = 773,
            topic = "有人认为英国“革命前是国王的议会，革命后是议会的国王”。这表明英国资产阶级革命后确立了A.总统制B.民主共和制C.君主立宪制D.君主专制制度",
            answer = "君主立宪制"
        },
        [774] = {
            ID = 774,
            topic = "我国经济特区和香港、澳门特别行政区的最大区别在于？A.主权归属不同B.经济政策不同C.社会制度不同D.外交政策不同",
            answer = "社会制度不同"
        },
        [775] = {
            ID = 775,
            topic = "三峡游已成为时下的一条旅游热线。以下古代着作中，对三峡两岸景物作了生动描写的是A.齐民要术B.九章算术C.水经注D.天工开物",
            answer = "水经注"
        },
        [776] = {
            ID = 776,
            topic = "初一小明想了解一下秦朝的历史，他应该看下列哪本书?A.左传B.汉书C.史记D.春秋",
            answer = "史记"
        },
        [777] = {
            ID = 777,
            topic = "复旦大学校训“博学而笃志，切问而近思”出自中国某典籍，全句是“博学而笃志，切问而近思，仁在其中矣”。你认为该典籍是A.孙子兵法B.韩非子C.论语D.道德经",
            answer = "论语"
        },
        [778] = {
            ID = 778,
            topic = "状元是“士”中的极品，而工商业是被人看不起的“末业”，在清末偏偏有一位状元“舍本逐末”、“实业救国”，此人是A.严复B.曾国藩C.张謇D.詹天佑",
            answer = "张謇"
        },
        [779] = {
            ID = 779,
            topic = "二战后，亚非拉的许多国家摆脱了殖民枷锁，获得独立。其中走上了与中华人民共和国相同道路的是A.埃及B.印度C.古巴D.纳米比亚",
            answer = "古巴"
        },
        [780] = {
            ID = 780,
            topic = "“列强的炮声惊醒了古老中华帝国的美梦，中华民族的屈辱史——中国近代史开始了”。“列强的炮声”指的是A.甲午中日战争B.八国联军侵华战争C.鸦片战争D.第二次鸦片战争",
            answer = "鸦片战争"
        },
        [781] = {
            ID = 781,
            topic = "五一长假，小聪高兴地实现了到元谋人遗址去参观、探究的愿望。元谋人遗址在我国的A.浙江省B.陕西省C.云南省D.贵州省",
            answer = "云南省"
        },
        [782] = {
            ID = 782,
            topic = "早在战国时期，秦国曾在岷江修筑过类似的水利工程至今还发挥着防洪灌溉的巨大功能。这项工程是A.灵渠B.黄河C.都江堰D.郑国渠",
            answer = "都江堰"
        },
        [783] = {
            ID = 783,
            topic = "2006年7月，第30届世界遗产大会通过中国安阳殷墟入选《世界遗产名录》。“殷墟”为我们研究哪一朝代的历史提供了依据。A.秦朝B.西汉C.商朝D.夏朝",
            answer = "商朝"
        },
        [784] = {
            ID = 784,
            topic = "下面几位科学家中，对人类文化传播贡献最大的是A.张衡B.华佗C.蔡伦D.张仲景",
            answer = "蔡伦"
        },
        [785] = {
            ID = 785,
            topic = "研制出世界先进的制碱工艺，打破西方国家对碱业的垄断，为我国制碱工业做出贡献的科学家是A.严复B.魏源C.侯德榜D.詹天佑",
            answer = "侯德榜"
        },
        [786] = {
            ID = 786,
            topic = "为欧洲资本主义社会的产生奠定了思想文化基础的是A.西欧城市的重新兴起B.三角贸易C.文艺复兴D.新航路的开辟",
            answer = "文艺复兴"
        },
        [787] = {
            ID = 787,
            topic = "说《封神榜》中有关“炮烙之刑”“以酒为池”“悬肉为林”的描写，反映了统治者的极度暴虐腐朽。这与哪位统治者有关A.周厉王B.周幽王C.商王纣D.夏王桀",
            answer = "商王纣"
        },
        [788] = {
            ID = 788,
            topic = "“春种一粒粟，秋收万颗籽。”据考古发现，使用磨制石器、种植粟的是（A.山顶洞人B.北京人C.半坡居民D.河姆渡居民",
            answer = "半坡居民"
        },
        [789] = {
            ID = 789,
            topic = "象棋中的楚河汉界与下列哪个历史事件有关？A.鸿门宴B.霸王别姬C.楚汉之争D.张楚政权",
            answer = "楚汉之争"
        },
        [790] = {
            ID = 790,
            topic = "相传，造出衣裳、舟车、宫室等，为后世的衣食住行奠定基础的“人文初祖”是A.舜B.禹C.黄帝D.尧",
            answer = "黄帝"
        },
        [791] = {
            ID = 791,
            topic = "你知道“苏湖熟，天下足”这句话表明了两宋时哪个流域成为全国最重要的粮仓A.黄河流域B.珠江流域C.长江流域D.太湖流域",
            answer = "长江流域"
        },
        [792] = {
            ID = 792,
            topic = "“周幽王烽火戏诸侯”、“孔子周游列国”，与“诸侯”“列国”的产生相关的制度是A.世袭制B.郡县制C.分封制D.禅让制",
            answer = "分封制"
        },
        [793] = {
            ID = 793,
            topic = "人们总把“秦皇汉武”并称，他们二人在以下哪个问题上采取了相反的措施A.经济发展B.中央集权C.儒家学说D.外族入侵",
            answer = "儒家学说"
        },
        [794] = {
            ID = 794,
            topic = "抗日战争中，中国军队主动出击日军的最大规模战役是A.台儿庄战役B.平型关大捷C.百团大战D.淞沪会战",
            answer = "百团大战"
        },
        [795] = {
            ID = 795,
            topic = "有的人的名字暗含纪念意义，比如有人名叫“国庆”，因为他出生在国庆日，那麽名叫“纪宪”的人可能出生在哪一年A.1952B.1951C.1954D.1953",
            answer = "1954"
        },
        [796] = {
            ID = 796,
            topic = "元素周期表发明家是哪个国家的人？A.瑞典B.德国C.俄罗斯D.美国",
            answer = "俄罗斯"
        },
        [797] = {
            ID = 797,
            topic = "奠定了三国鼎立书面基础的战役是A.火烧乌巢B.官渡之战C.赤壁之战D.巨鹿之战",
            answer = "赤壁之战"
        },
        [798] = {
            ID = 798,
            topic = "“我要扼住命运的咽喉，它决不能使我完全屈服。”此话是谁的精神写照？A.林肯B.托尔斯泰C.贝多芬D.梵高",
            answer = "贝多芬"
        },
        [799] = {
            ID = 799,
            topic = "“皇帝”“朕”成为我国最高封建统治者的称呼开始于A.齐桓公B.汉高祖C.秦始皇D.唐太宗",
            answer = "秦始皇"
        },
        [800] = {
            ID = 800,
            topic = "商朝时，人们把刻在龟甲、兽骨上文字叫A.楔形文字B.金文C.甲骨文D.象形文字",
            answer = "甲骨文"
        },
        [801] = {
            ID = 801,
            topic = "下列帝王中，与秦始皇对待儒学态度截然不同的是A.汉景帝B.光武帝C.汉武帝D.汉高祖",
            answer = "汉武帝"
        },
        [802] = {
            ID = 802,
            topic = "以下属于我国土生土长的宗教的是A.基督教B.伊斯兰教C.道教D.佛教",
            answer = "道教"
        },
        [803] = {
            ID = 803,
            topic = "北朝时期石窟艺术是随着宗教的传播发展起来的，这种宗教是A.基督教B.伊斯兰教C.佛教D.道教",
            answer = "佛教"
        },
        [804] = {
            ID = 804,
            topic = "“功盖三分国，名成八阵图。江流石不转，遗恨失吞吴。”杜甫这道诗所概括的历史与下列哪一位历史人物最为相关？A.刘备B.关羽C.诸葛亮D.孙权",
            answer = "诸葛亮"
        },
        [805] = {
            ID = 805,
            topic = "善于学习是一个民族进步的源泉，从北魏孝文帝改革的内容看，他主要向哪个民族学习A.匈奴族B.氐族C.汉族D.鲜卑族",
            answer = "汉族"
        },
        [806] = {
            ID = 806,
            topic = "我国现存最早的百科全书式农学名着《齐民要术》的作者是A.郦道元B.张仲景C.贾思勰D.司马迁",
            answer = "贾思勰"
        },
        [807] = {
            ID = 807,
            topic = "“苟利国家生死以，岂因祸福避趋之”这个把民族利益看得高于一切的人物是A.邓世昌B.长者C.林则徐D.道光帝",
            answer = "林则徐"
        },
        [808] = {
            ID = 808,
            topic = "“它是1898年中国最轰动的出版物，它介绍了达尔文的进化论思想，提出了‘物竞天择，适者生存’的观点。”这部着作是A.敬告青年B.狂人日记C.天演论D.海国图志",
            answer = "天演论"
        },
        [809] = {
            ID = 809,
            topic = "主持设计和修筑我国第一条铁路干线——京张铁路的杰出工程师A.张之洞B.张謇C.詹天佑D.严复",
            answer = "詹天佑"
        },
        [810] = {
            ID = 810,
            topic = "世界上面积最大的岛屿是格陵兰岛，其位于A.非洲B.南极洲C.北美洲D.亚洲",
            answer = "北美洲"
        },
        [811] = {
            ID = 811,
            topic = "当我们放寒假过春节时，澳大利亚的小朋友在A.放秋假B.放寒假C.放暑假D.放春假",
            answer = "放暑假"
        },
        [812] = {
            ID = 812,
            topic = "青藏高原纬度较低，但气候寒冷，其最主要的影响因素是A.纬度位置B.海陆位置C.地形因素D.洋流因素",
            answer = "地形因素"
        },
        [813] = {
            ID = 813,
            topic = "下列建筑中，属于伊斯兰教的是A.龙泉寺B.巴黎圣母院C.清真寺D.布达拉宫",
            answer = "清真寺"
        },
        [814] = {
            ID = 814,
            topic = "长江是我国水能蕴藏量最丰富的河流，其水能主要集中的河段是A.下游B.河口C.上游D.中游",
            answer = "上游"
        },
        [815] = {
            ID = 815,
            topic = "我国长江源区、黄河源区和澜沧江源区位于：A.北方地区B.南方地区C.青藏地区D.西北地区",
            answer = "青藏地区"
        },
        [816] = {
            ID = 816,
            topic = "“天苍苍，野茫茫，风吹草低见牛羊”是对以下哪个少数民族聚居的草原景观的描述A.壮族B.维吾尔族C.蒙古族D.藏族",
            answer = "蒙古族"
        },
        [817] = {
            ID = 817,
            topic = "我国最大的湖泊是A.鄱阳湖B.太湖C.青海湖D.洞庭湖",
            answer = "青海湖"
        },
        [818] = {
            ID = 818,
            topic = "泼水节是以下哪个少数民族的节日A.壮族B.苗族C.傣族D.白族",
            answer = "傣族"
        },
        [819] = {
            ID = 819,
            topic = "世界人口最多的国家是A.印度B.加拿大C.中国D.俄罗斯",
            answer = "中国"
        },
        [820] = {
            ID = 820,
            topic = "我国领土大部分位于A.热带B.南温带C.北温带D.北寒带",
            answer = "北温带"
        },
        [821] = {
            ID = 821,
            topic = "地球上海洋与陆地面积之比约是A.8比2B.2比8C.7比3D.3比7",
            answer = "7比3"
        },
        [822] = {
            ID = 822,
            topic = "黑种人集中分布在A.美洲B.大洋洲C.非洲D.亚洲",
            answer = "非洲"
        },
        [823] = {
            ID = 823,
            topic = "世界上使用人数最多的语言是A.德语B.日语C.汉语D.英语",
            answer = "汉语"
        },
        [824] = {
            ID = 824,
            topic = "我国回族大多数信奉A.基督教B.天主教C.伊斯兰教D.佛教",
            answer = "伊斯兰教"
        },
        [825] = {
            ID = 825,
            topic = "四大洋中，面积最大的是A.大西洋B.北冰洋C.太平洋D.印度洋",
            answer = "太平洋"
        },
        [826] = {
            ID = 826,
            topic = "下列不属于自然资源的是A.阳光B.土地C.水泥D.天然森林",
            answer = "水泥"
        },
        [827] = {
            ID = 827,
            topic = "我国各类土地利用类型中，面积最广的是A.耕地B.林地C.草地D.建筑用地",
            answer = "草地"
        },
        [828] = {
            ID = 828,
            topic = "我国最大的渔场是A.南海沿岸渔场B.北部湾渔场C.舟山渔场D.黄渤海渔场",
            answer = "舟山渔场"
        },
        [829] = {
            ID = 829,
            topic = "我国最大的盐场是A.柴达木盐场B.莺歌海盐场C.长芦盐场D.台湾西部盐场",
            answer = "长芦盐场"
        },
        [830] = {
            ID = 830,
            topic = "全国最大的综合性工业基地是A.京津唐地区B.辽中南地区C.沪宁杭地区D.珠江三角洲",
            answer = "沪宁杭地区"
        },
        [831] = {
            ID = 831,
            topic = "下列工业产品中属于高新技术产品的是A.钢铁B.汽车C.电脑D.机床",
            answer = "电脑"
        },
        [832] = {
            ID = 832,
            topic = "地球的表面积约为多少亿平方千米？A.7.1B.8.1C.5.1D.6.1",
            answer = "5.1"
        },
        [833] = {
            ID = 833,
            topic = "在晴朗的夜空中找到北极星，面对北极星的方向是A.正东方向B.正西方向C.正北方向D.正南方向",
            answer = "正北方向"
        },
        [834] = {
            ID = 834,
            topic = "地球仪上最长的纬线是A.90°纬线B.90°S纬线C.0°纬线D.23.5°N纬线",
            answer = "0°纬线"
        },
        [835] = {
            ID = 835,
            topic = "世界上最大的大陆是A.南极大陆B.澳大利亚大陆C.亚欧大陆D.非洲大陆",
            answer = "亚欧大陆"
        },
        [836] = {
            ID = 836,
            topic = "下列描述中，表示气候的是A.暴风骤雨B.风和日丽C.四季如春D.晴转多云",
            answer = "四季如春"
        },
        [837] = {
            ID = 837,
            topic = "赤道地区降水的主要类型是A.锋面雨B.台风雨C.对流雨D.地形雨",
            answer = "对流雨"
        },
        [838] = {
            ID = 838,
            topic = "马克思主义哲学之所以是科学的，就在于它坚持了A.革命的观点B.历史的观点C.实践的观点D.阶级的观点",
            answer = "实践的观点"
        },
        [839] = {
            ID = 839,
            topic = "国家财政收入最重要的来源是A.债务收入B.罚款收入C.税收收入D.利润收入",
            answer = "税收收入"
        },
        [840] = {
            ID = 840,
            topic = "第二次世界大战后，人口自然增长率最快的大洲是A.南美洲B.北美洲C.非洲D.亚洲",
            answer = "非洲"
        },
        [841] = {
            ID = 841,
            topic = "我国最早在奥运会上夺金牌的是哪位运动员?A.李宁B.高凤莲C.许海峰D.吴佳怩",
            answer = "许海峰"
        },
        [842] = {
            ID = 842,
            topic = "咖啡的故乡是哪里?A.美洲B.亚洲C.非洲D.大洋洲",
            answer = "非洲"
        },
        [843] = {
            ID = 843,
            topic = "我国少数民族分布最多的省份是A.贵州省B.广西省C.云南省D.四川省",
            answer = "云南省"
        },
        [844] = {
            ID = 844,
            topic = "被称为\"画圣\"的古代画家是A.韩干B.张择端C.吴道子D.顾恺之",
            answer = "吴道子"
        },
        [845] = {
            ID = 845,
            topic = "我国发现最早的纸币是在哪个时期A.唐朝B.明朝C.宋朝D.元朝",
            answer = "宋朝"
        },
        [846] = {
            ID = 846,
            topic = "神话《白蛇传》中\"白娘娘盗仙草\"盗的是:A.田七B.人参C.灵芝D.冬虫夏草",
            answer = "灵芝"
        },
        [847] = {
            ID = 847,
            topic = "我国最大的瀑布\"黄果树瀑布\"位于哪个省?A.云南省B.广西省C.贵州省D.四川省",
            answer = "贵州省"
        },
        [848] = {
            ID = 848,
            topic = "着有\"农村三部曲\"的着名作家是:A.郭沫若B.陈忠实C.茅盾D.巴金",
            answer = "茅盾"
        },
        [849] = {
            ID = 849,
            topic = "铅笔有硬软之分,用英文字母来表示,下列符号相比哪个表示较硬:A.BB.2BC.HD.HB",
            answer = "H"
        },
        [850] = {
            ID = 850,
            topic = "\"天下兴亡,匹夫有责\"是哪位思想家的名言?A.王充B.黄宗羲C.顾炎武D.王夫之",
            answer = "顾炎武"
        },
        [851] = {
            ID = 851,
            topic = "“信天游”是民歌的一种属山歌性质，曲调纯朴、高亢、悠长、节奏自由、你知道它流行于哪一带地方吗?A.华北B.北京一带C.陕北D.西南",
            answer = "陕北"
        },
        [852] = {
            ID = 852,
            topic = "唐代诗人有称“诗圣”的杜甫“诗仙”的李白等，你可知道被人颂称“诗魔”的是谁?A.刘禹锡B.李商隐C.白居易D.王维",
            answer = "白居易"
        },
        [853] = {
            ID = 853,
            topic = "\"红娘\"是哪部作品中的人物?A.红色娘子军B.红灯记C.西厢记D.红楼梦",
            answer = "西厢记"
        },
        [854] = {
            ID = 854,
            topic = "阿姆斯特朗是乘哪个飞船成功登月的A.爱国者6号B.和平号C.阿波罗11号D.阿波罗12号",
            answer = "阿波罗11号"
        },
        [855] = {
            ID = 855,
            topic = "古代六艺，\"礼、乐、射、御、书、数\"中的\"御\"是指A.杂技B.骑马C.驾车D.射箭",
            answer = "驾车"
        },
        [856] = {
            ID = 856,
            topic = "“战国四公子”中齐国的孟尝君名为A.赵胜B.魏无忌C.田文D.黄歇",
            answer = "田文"
        },
        [857] = {
            ID = 857,
            topic = "泰戈尔是印度着名作家、诗人，于1913年获得诺贝尔文学奖，为其赢得该奖的作品是A.园丁集B.飞鸟集C.吉檀迦利D.新月集",
            answer = "吉檀迦利"
        },
        [858] = {
            ID = 858,
            topic = "四大名茶之一的龙井茶产地是A.云南普洱B.福建安溪C.浙江杭州D.河南信阳",
            answer = "浙江杭州"
        },
        [859] = {
            ID = 859,
            topic = "白菜属于什麽科？A.菊科B.豆科C.十字花科D.蔷薇科",
            answer = "十字花科"
        },
        [860] = {
            ID = 860,
            topic = "成年人身上有多少块骨骼A.208B.205C.206D.207",
            answer = "206"
        },
        [861] = {
            ID = 861,
            topic = "琵琶曲《十面埋伏》描述的是哪里的情景？A.赤壁之战B.淝水之战C.垓下之战D.巨鹿之战",
            answer = "垓下之战"
        },
        [862] = {
            ID = 862,
            topic = "中国最大的省级单位是?A.青海B.内蒙古C.新疆D.西藏",
            answer = "新疆"
        },
        [863] = {
            ID = 863,
            topic = "黄河注入哪个海？A.东海B.南海C.渤海D.黄海",
            answer = "渤海"
        },
        [864] = {
            ID = 864,
            topic = "中国古代“不惑”是指男子多少岁?A.50B.60C.40D.30",
            answer = "40"
        },
        [865] = {
            ID = 865,
            topic = "吉林省抚松县被人们称为是哪种药材之乡？A.枸杞B.当归C.人参D.田七",
            answer = "人参"
        },
        [866] = {
            ID = 866,
            topic = "\"山城\"是我国哪座城市的雅号?A.西安B.洛阳C.重庆D.福州",
            answer = "重庆"
        },
        [867] = {
            ID = 867,
            topic = "世界石油储量最多是哪一个国家A.伊朗B.伊拉克C.沙乌地阿拉伯D.科威特",
            answer = "沙乌地阿拉伯"
        },
        [868] = {
            ID = 868,
            topic = "下列着名宫殿哪个位于英国?A.凡尔赛宫B.故宫C.白金汉宫D.克里姆林宫",
            answer = "白金汉宫"
        },
        [869] = {
            ID = 869,
            topic = "下列我国哪个古迹被誉为\"世界八大奇迹\":A.乐山大佛B.万里长城C.秦始皇兵马俑D.敦煌莫高窟",
            answer = "秦始皇兵马俑"
        },
        [870] = {
            ID = 870,
            topic = "洲际导弹的射程一般在多少公里以上?A.一千B.一百C.一万D.十万",
            answer = "一万"
        },
        [871] = {
            ID = 871,
            topic = "我国卫星火箭发射基地\"西昌\"位于:A.新疆B.西藏C.四川D.青海",
            answer = "四川"
        },
        [872] = {
            ID = 872,
            topic = "古代军事家曹操是哪个时期的人物?A.南北朝B.西汉C.东汉D.三国",
            answer = "东汉"
        },
        [873] = {
            ID = 873,
            topic = "成语\"闻鸡起舞\"\"中流击楫\"是出自哪个古代将领的故事?A.郑成功B.岳飞C.祖逖D.戚继光",
            answer = "祖逖"
        },
        [874] = {
            ID = 874,
            topic = "目前世界纪元(西元前后的划分)的方法是以什麽为标准:A.佛教B.伊斯兰教C.耶稣基督教D.中国道教",
            answer = "耶稣基督教"
        },
        [875] = {
            ID = 875,
            topic = "下列哪个尊称是对古代太子的尊称:A.私下B.陛下C.殿下D.阁下",
            answer = "殿下"
        },
        [876] = {
            ID = 876,
            topic = "美国第一任总统是谁?A.克林顿B.布希C.华盛顿D.林肯",
            answer = "华盛顿"
        },
        [877] = {
            ID = 877,
            topic = "我国是在哪个时期进入奴隶社会的?A.秦B.汉C.夏D.商",
            answer = "夏"
        },
        [878] = {
            ID = 878,
            topic = "下列农民起义哪次是洪秀全领导的:A.黄巾起义B.赤眉起义C.金田起义D.大泽乡起义",
            answer = "金田起义"
        },
        [879] = {
            ID = 879,
            topic = "被称为酿酒行业的祖师是谁?A.鲁班B.孔子C.杜康D.柳永",
            answer = "杜康"
        },
        [880] = {
            ID = 880,
            topic = "\"文房四宝\"中的毛笔是谁发明的?A.乐毅B.刘伯温C.蒙恬D.闻仲",
            answer = "蒙恬"
        },
        [881] = {
            ID = 881,
            topic = "我国第一颗氢弹研制成功是在哪一年?A.1962B.1960C.1967D.1964",
            answer = "1967"
        },
        [882] = {
            ID = 882,
            topic = "以下哪一个是联合国安理会常任理事国之一?A.义大利B.西班牙C.法国D.德国",
            answer = "法国"
        },
        [883] = {
            ID = 883,
            topic = "杜甫《望岳》：“岱宗夫如何，齐鲁青未了”中的“岱宗”指的是A.恒山B.嵩山C.泰山D.华山",
            answer = "泰山"
        },
        [884] = {
            ID = 884,
            topic = "流行性感冒的病原是A.衣原体B.支原体C.病毒D.细菌",
            answer = "病毒"
        },
        [885] = {
            ID = 885,
            topic = "“江山社稷”中的“稷”在古代是指A.土地之神B.祈求丰收C.五谷之神D.黎民百姓",
            answer = "五谷之神"
        },
        [886] = {
            ID = 886,
            topic = "以下哪个成语是关于匡衡的A.映雪囊萤B.引锥自刺C.凿壁偷光D.卧薪嚐胆",
            answer = "凿壁偷光"
        },
        [887] = {
            ID = 887,
            topic = "《黄河大合唱》的作曲是:A.光未然B.郑律成C.冼星海D.聂耳",
            answer = "冼星海"
        },
        [888] = {
            ID = 888,
            topic = "京剧中的脸谱使人的性格一目了然,一般红色脸谱代表：A.奸邪B.耿直C.忠勇D.圆滑",
            answer = "忠勇"
        },
        [889] = {
            ID = 889,
            topic = "“相敬如宾”最初是指什麽人之间相互尊敬的样子?A.朋友B.君臣C.夫妻D.兄弟",
            answer = "夫妻"
        },
        [890] = {
            ID = 890,
            topic = "能够有效地阻挡太阳的紫外线辐射的气层是A.外大气层B.大气上层C.臭氧层D.大气下层",
            answer = "臭氧层"
        },
        [891] = {
            ID = 891,
            topic = "“打蛇打七寸”的七寸是指A.头部B.尾巴C.心脏D.咽喉",
            answer = "心脏"
        },
        [892] = {
            ID = 892,
            topic = "蜻蜓“点水”的目的是什麽?A.觅食B.吐食C.产卵D.喝水",
            answer = "产卵"
        },
        [893] = {
            ID = 893,
            topic = "下列记忆体中，存储速度最快的是A.硬碟B.软碟C.记忆体D.光碟",
            answer = "记忆体"
        },
        [894] = {
            ID = 894,
            topic = "北京故宫历时多少年建成?A.14B.20C.18D.16",
            answer = "18"
        },
        [895] = {
            ID = 895,
            topic = "清朝晚期,被今人誉为\"开眼看世界第一人\"的是谁?A.龚自珍B.魏源C.林则徐D.严复",
            answer = "林则徐"
        },
        [896] = {
            ID = 896,
            topic = "天长地久有时尽，____绵绵无绝期。A.思念B.情仇C.此恨D.此爱",
            answer = "此恨"
        },
        [897] = {
            ID = 897,
            topic = "此情可待成追忆，只是当时已____A.淡然B.懵逼C.惘然D.茫然",
            answer = "惘然"
        },
        [898] = {
            ID = 898,
            topic = "不要人夸好颜色，只留清气满____A.人间B.世间C.乾坤D.天地",
            answer = "乾坤"
        },
        [899] = {
            ID = 899,
            topic = "羌笛何须怨杨柳，春风不度____关A.山海B.鬼门C.玉门D.嘉峪",
            answer = "玉门"
        },
        [900] = {
            ID = 900,
            topic = "宁可枝头抱香死，何曾吹落____中A.西风B.东风C.北风D.南风",
            answer = "北风"
        },
        [901] = {
            ID = 901,
            topic = "春宵一刻值千金，花有清香月有__A.圆B.缺C.阴D.明",
            answer = "阴"
        },
        [902] = {
            ID = 902,
            topic = "独怜幽草涧边生，上有____深树鸣A.斑鸠B.凤凰C.黄鹂D.乌鸦",
            answer = "黄鹂"
        },
        [903] = {
            ID = 903,
            topic = "无可奈何花落去，似曾相识__归来A.人B.月C.燕D.雁",
            answer = "燕"
        },
        [904] = {
            ID = 904,
            topic = "草长莺飞____天，拂堤杨柳醉春烟。A.一月B.四月C.二月D.三月",
            answer = "二月"
        },
        [905] = {
            ID = 905,
            topic = "小荷才露尖尖角，早有____立上头A.苍蝇B.蚊子C.蜻蜓D.蝴蝶",
            answer = "蜻蜓"
        },
        [906] = {
            ID = 906,
            topic = "千里莺啼__映红，水村山郭酒旗风A.相B.蓝C.绿D.红",
            answer = "绿"
        },
        [907] = {
            ID = 907,
            topic = "诚知此恨人人有，贫贱夫妻百事__A.怒B.喜C.哀D.乐",
            answer = "哀"
        },
        [908] = {
            ID = 908,
            topic = "酒入愁肠，化作____泪A.悲伤B.喜悦C.相思D.思念",
            answer = "相思"
        },
        [909] = {
            ID = 909,
            topic = "身无彩凤____翼，心有灵犀一点通A.单飞B.三批C.双飞D.三飞",
            answer = "双飞"
        },
        [910] = {
            ID = 910,
            topic = "等闲识得东风面，万紫千红总____A.是村B.思乡C.是春D.思春",
            answer = "是春"
        },
        [911] = {
            ID = 911,
            topic = "少壮不努力，____徒伤悲A.老是B.老二C.老大D.老来",
            answer = "老大"
        },
        [912] = {
            ID = 912,
            topic = "宝剑锋从磨砺出，____香自苦寒来A.杏花B.梨花C.梅花D.菊花",
            answer = "梅花"
        },
        [913] = {
            ID = 913,
            topic = "竹外桃花三两枝，春江水暖__先知A.燕B.雪C.鸭D.鸡",
            answer = "鸭"
        },
        [914] = {
            ID = 914,
            topic = "桃花潭水深千尺，不及____送我情A.何炅B.谢娜C.汪伦D.汪涵",
            answer = "汪伦"
        },
        [915] = {
            ID = 915,
            topic = "人不寐，____白发征夫泪A.将士B.村民C.将军D.游人",
            answer = "将军"
        },
        [916] = {
            ID = 916,
            topic = "溪云初起日沉阁,山雨欲来风满__A.城B.街C.楼D.天",
            answer = "楼"
        },
        [917] = {
            ID = 917,
            topic = "春风得意马蹄疾，一日看尽____花A.卞州B.杭州C.长安D.洛阳",
            answer = "长安"
        },
        [918] = {
            ID = 918,
            topic = "相见时难别亦难，东风无力____残A.梅花B.梅花C.百花D.菊花",
            answer = "百花"
        },
        [919] = {
            ID = 919,
            topic = "莫道不销魂，帘卷西风，人比____瘦A.残花B.败柳C.黄花D.菊花",
            answer = "黄花"
        },
        [920] = {
            ID = 920,
            topic = "好风凭藉力，送我上____A.城楼B.蓝天C.青天D.王者",
            answer = "青天"
        },
        [921] = {
            ID = 921,
            topic = "停车__爱枫林晚，霜叶红于二月花A.作B.造C.坐D.做",
            answer = "坐"
        },
        [922] = {
            ID = 922,
            topic = "花径不曾缘客扫，____今始为君开A.玉门B.心扉C.蓬门D.菊花",
            answer = "蓬门"
        },
        [923] = {
            ID = 923,
            topic = "二十四桥明月夜，玉人何处教____A.吹牛B.弹琴C.吹箫D.吹笛",
            answer = "吹箫"
        },
        [924] = {
            ID = 924,
            topic = "商女不知亡国恨，隔江犹唱____花A.女人B.花非C.后庭D.蝶恋",
            answer = "后庭"
        },
        [925] = {
            ID = 925,
            topic = "__潮带雨晚来急，野渡无人舟自横。A.夏B.秋C.春D.高",
            answer = "春"
        },
        [926] = {
            ID = 926,
            topic = "十年生死两茫茫，不思量，__难忘A.不B.艰C.自D.很",
            answer = "自"
        },
        [927] = {
            ID = 927,
            topic = "李白笔下的“飞流直下三千尺,疑是银河落九天”指的是哪个风景区?A.华山B.恒山C.庐山D.香山",
            answer = "庐山"
        },
        [928] = {
            ID = 928,
            topic = "被称为我国最最大的古典艺术宝库的是哪一个?A.布达拉宫B.秦始皇兵马俑C.敦煌莫高窟D.乐山大佛",
            answer = "敦煌莫高窟"
        },
        [929] = {
            ID = 929,
            topic = "山东山西的“山” 通常指的是：A.平顶山B.神农架C.太行山D.吕梁山",
            answer = "太行山"
        },
        [930] = {
            ID = 930,
            topic = "成语“一字千金”的典故与下列哪位人物有关?A.曹操B.司马懿C.吕不韦D.司马迁",
            answer = "吕不韦"
        },
        [931] = {
            ID = 931,
            topic = "鸡蛋应该怎样保存才好？A.平放B.打碎它C.大头朝上D.尖端朝上",
            answer = "大头朝上"
        },
        [932] = {
            ID = 932,
            topic = "老人应该喝什麽浓度的茶好？A.不浓不淡B.隔夜茶C.淡茶D.浓茶",
            answer = "淡茶"
        },
        [933] = {
            ID = 933,
            topic = "老年人什麽时间进行体育锻炼合适呢？A.中午B.淩晨C.傍晚D.早晨",
            answer = "傍晚"
        },
        [934] = {
            ID = 934,
            topic = "夏季，烈日炎炎，穿衣服比打赤膊热吗？A.一样热B.你管我C.不是D.是",
            answer = "不是"
        },
        [935] = {
            ID = 935,
            topic = "走路比站着耗费体力吗？A.一样B.我蹲着C.不是D.是",
            answer = "不是"
        },
        [936] = {
            ID = 936,
            topic = "古人云：“早卧早起，与鸡俱兴。”早上醒来，然后做什麽？A.继续睡B.发泄起床气C.过几分钟再起D.立刻起床",
            answer = "过几分钟再起"
        },
        [937] = {
            ID = 937,
            topic = "夏天洗冷水浴好不好？A.一般B.爽C.不好D.好",
            answer = "不好"
        },
        [938] = {
            ID = 938,
            topic = "湿头发睡觉易引起什麽症状？A.感冒B.发烧C.头晕D.眼花",
            answer = "头晕"
        },
        [939] = {
            ID = 939,
            topic = "工笔是哪种绘画形式的技法A.水粉画B.水彩画C.国画D.油画",
            answer = "国画"
        },
        [940] = {
            ID = 940,
            topic = "“冰激淩”是从哪国传进的外来语A.美国B.俄国C.英国D.法国",
            answer = "英国"
        },
        [941] = {
            ID = 941,
            topic = "博士作为官名最早出现在A.唐B.宋朝C.秦D.汉",
            answer = "秦"
        },
        [942] = {
            ID = 942,
            topic = "《在那遥远的地方》是哪里的民歌A.云南民歌B.四川民歌C.青海民歌D.江苏民歌",
            answer = "青海民歌"
        },
        [943] = {
            ID = 943,
            topic = "人体含水量百分比最高的器官是A.肝B.心C.眼球D.肾",
            answer = "眼球"
        },
        [944] = {
            ID = 944,
            topic = "土豆不宜存放在什麽地方A.乾燥处B.卧室内C.日光照射处D.通风处",
            answer = "日光照射处"
        },
        [945] = {
            ID = 945,
            topic = "马拉松赛跑中的“马拉松”一词是指A.组织名B.独创C.地名D.人名",
            answer = "地名"
        },
        [946] = {
            ID = 946,
            topic = "什麽时间吃水果比较好A.饭中途B.随时C.饭前食用D.饭后食用",
            answer = "饭前食用"
        },
        [947] = {
            ID = 947,
            topic = "从何时起，对最高统治者称“王”A.春秋B.周C.商D.夏",
            answer = "商"
        },
        [948] = {
            ID = 948,
            topic = "速食面里必然有哪种食品添加剂A.食用色素B.地沟油C.合成抗氧化剂D.防腐剂",
            answer = "合成抗氧化剂"
        },
        [949] = {
            ID = 949,
            topic = "世界上最大最贵的钻石藏在A.美国华尔街B.梵蒂冈C.英国王室D.中国紫禁城",
            answer = "英国王室"
        },
        [950] = {
            ID = 950,
            topic = "世界上最大的熊是?A.浣熊B.熊猫C.棕熊D.黑熊",
            answer = "棕熊"
        },
        [951] = {
            ID = 951,
            topic = "人类不能食用的植物油是A.亚麻籽油B.刺果油C.蓖麻籽油D.红花籽油",
            answer = "蓖麻籽油"
        },
        [952] = {
            ID = 952,
            topic = "北京猿人生活在距今多少万年前？A.150B.200C.50D.100",
            answer = "50"
        },
        [953] = {
            ID = 953,
            topic = "下列海洋中哪一个是我国最大的海A.黄海B.渤海C.南海D.东海",
            answer = "南海"
        },
        [954] = {
            ID = 954,
            topic = "下列哪一个湖泊是在我国江西省的境内A.太湖B.洪泽湖C.鄱阳湖D.洞庭湖",
            answer = "鄱阳湖"
        },
        [955] = {
            ID = 955,
            topic = "\"山城\"是我国哪座城市的雅号A.成都B.福州C.重庆D.西安",
            answer = "重庆"
        },
        [956] = {
            ID = 956,
            topic = "峨眉山位于我国哪个省份A.贵州B.西藏C.四川D.云南",
            answer = "四川"
        },
        [957] = {
            ID = 957,
            topic = "我国第一座国家森林公园是A.长白山B.九寨沟C.张家界D.武夷山",
            answer = "张家界"
        },
        [958] = {
            ID = 958,
            topic = "我国古代\"十恶不赦\"中的首恶是A.不道B.不孝C.谋反D.不义",
            answer = "谋反"
        },
        [959] = {
            ID = 959,
            topic = "我国收入的字最多的字典是哪一部A.《说文解字》B.《新华字典》C.《康熙字典》D.《方言》",
            answer = "《康熙字典》"
        },
        [960] = {
            ID = 960,
            topic = "着名通讯社路透社是哪一个国家的通讯社A.美国B.法国C.英国D.中国",
            answer = "英国"
        },
        [961] = {
            ID = 961,
            topic = "我国最早的一部医学理论着作是A.《伤寒杂病论》B.《本草纲目》C.《千金方》D.《黄帝内经》",
            answer = "《黄帝内经》"
        },
        [962] = {
            ID = 962,
            topic = "我国姓氏中哪一个姓氏的人口比例最多A.刘B.王C.张D.李",
            answer = "李"
        },
        [963] = {
            ID = 963,
            topic = "我国共有多少个少数民族A.50B.56C.51D.55",
            answer = "55"
        },
        [964] = {
            ID = 964,
            topic = "我国道家学派创始人是A.孟子B.孔子C.庄子D.老子",
            answer = "老子"
        },
        [965] = {
            ID = 965,
            topic = "\"天下兴亡,匹夫有责\"是哪位思想家的名言A.王充B.黄宗羲C.王夫之D.顾炎武",
            answer = "顾炎武"
        },
        [966] = {
            ID = 966,
            topic = "我国第一个获得世界冠军的是谁A.陈镜开B.郑凤荣C.吴传玉D.荣国团",
            answer = "荣国团"
        },
        [967] = {
            ID = 967,
            topic = "\"发展体育运动,增强人民体质\"是我国哪位领导人的题词A.贺龙B.周恩来C.邓小平D.毛泽东",
            answer = "毛泽东"
        },
        [968] = {
            ID = 968,
            topic = "我国最早的一部按国别编写的史书是A.《左传》B.《史记》C.《春秋》?D.《国语》",
            answer = "《国语》"
        },
        [969] = {
            ID = 969,
            topic = "我国境内最早的人类是A.丁村人B.北京人C.山顶洞人D.元谋人",
            answer = "元谋人"
        },
        [970] = {
            ID = 970,
            topic = "以下哪位不是《少年包青天》主演A.邓超B.周杰C.陆毅D.何冰",
            answer = "何冰"
        },
        [971] = {
            ID = 971,
            topic = "泼水节是我国哪个少数民族的传统节日A.彝族B.壮族C.回族D.傣族",
            answer = "傣族"
        },
        [972] = {
            ID = 972,
            topic = "香港回归祖国的时间是A.1999.12B.1996.7C.1998.12D.1997.7",
            answer = "1997.7"
        },
        [973] = {
            ID = 973,
            topic = "我国古代最大的风俗画是A.《千里江山图》B.《韩熙载夜宴图》C.《女史箴图》D.《清明上河图》",
            answer = "《清明上河图》"
        },
        [974] = {
            ID = 974,
            topic = "着名油画《开国大典》是谁的作品A.关山月B.范曾C.徐悲鸿D.董希文",
            answer = "董希文"
        },
        [975] = {
            ID = 975,
            topic = "下列古代名曲哪一首不是古琴曲A.阳光三叠B.高山流水C.阳春白雪D.十面埋伏",
            answer = "十面埋伏"
        },
        [976] = {
            ID = 976,
            topic = "世界电影奖中最高奖项是A.金鸡奖B.金球奖C.金犻奖D.奥斯卡",
            answer = "奥斯卡"
        },
        [977] = {
            ID = 977,
            topic = "相声演员功夫中哪一种是第一基本功A.唱B.学C.逗D.说",
            answer = "说"
        },
        [978] = {
            ID = 978,
            topic = "世界上最大的宫殿是A.爱丽舍宫B.卢浮宫C.白宫D.故宫",
            answer = "故宫"
        },
        [979] = {
            ID = 979,
            topic = "郭沫若的诗集有A.《红烛》B.《野草》C.《死水》D.《女神》",
            answer = "《女神》"
        },
        [980] = {
            ID = 980,
            topic = "馒头是谁发明的A.屈原B.李冰C.曹操D.诸葛亮",
            answer = "诸葛亮"
        },
        [981] = {
            ID = 981,
            topic = "人体最大的器官是A.胃B.脾C.肝脏D.皮肤",
            answer = "皮肤"
        },
        [982] = {
            ID = 982,
            topic = "我国第一大岛是A.舟山群岛B.海南岛C.崇明岛D.台湾岛",
            answer = "台湾岛"
        },
        [983] = {
            ID = 983,
            topic = "神话《白蛇传》中\"白娘娘盗仙草\"盗的是A.冬虫夏草B.人参C.田七D.灵芝",
            answer = "灵芝"
        },
        [984] = {
            ID = 984,
            topic = "你知道胰岛素可治哪种病吗A.肝病B.心脏病C.胃病?D.糖尿病",
            answer = "糖尿病"
        },
        [985] = {
            ID = 985,
            topic = "下列哪种动物不属于鱼类A.鲫鱼B.鲢鱼C.草鱼D.甲鱼",
            answer = "甲鱼"
        },
        [986] = {
            ID = 986,
            topic = "世界上最大的动物是哪一种A.大象B.水母C.恐龙D.鲸鱼",
            answer = "鲸鱼"
        },
        [987] = {
            ID = 987,
            topic = "麻婆豆腐的起源是哪A.湖北B.北京C.湖南D.四川",
            answer = "四川"
        },
        [988] = {
            ID = 988,
            topic = "《中华小当家》主角叫什麽名字A.王小二B.武藤游戏C.三笠D.刘昂星",
            answer = "刘昂星"
        },
        [989] = {
            ID = 989,
            topic = "过量的食用哪种食品可能引起脱发？A.粗粮B.蔬菜C.豆类D.肉类",
            answer = "肉类"
        },
        [990] = {
            ID = 990,
            topic = "黄瓜跟什麽一起吃会腹泻?A.土豆B.红酒C.红薯D.花生",
            answer = "花生"
        },
        [991] = {
            ID = 991,
            topic = "下面哪一种是能降血压的蔬菜A.韭黄B.西兰花C.韭菜D.芹菜",
            answer = "芹菜"
        },
        [992] = {
            ID = 992,
            topic = "天气预报起源于哪个国家A.美国B.中国C.英国D.法国",
            answer = "法国"
        },
        [993] = {
            ID = 993,
            topic = "迄今最早的中国象棋谱，出自A.秦朝B.宋朝C.唐朝D.元朝",
            answer = "元朝"
        },
        [994] = {
            ID = 994,
            topic = "酒后喝什麽对身体最有益A.可乐B.咖啡C.浓茶D.蜂蜜水",
            answer = "蜂蜜水"
        },
        [995] = {
            ID = 995,
            topic = "肥皂的起源地A.韩国B.中国C.日本D.美索不达米亚",
            answer = "美索不达米亚"
        },
        [996] = {
            ID = 996,
            topic = "水银的沸点A.摄氏35度B.摄氏100度C.摄氏50度D.摄氏357度",
            answer = "摄氏357度"
        },
        [997] = {
            ID = 997,
            topic = "酸性物质中毒不可以用以下哪个洗胃A.红糖B.蛋清C.牛奶D.白醋",
            answer = "白醋"
        },
        [998] = {
            ID = 998,
            topic = "中国最深的湖A.太湖B.鄱阳湖C.南北湖D.长白山天池",
            answer = "长白山天池"
        },
        [999] = {
            ID = 999,
            topic = "煤气中毒的特徵表现是A.七窍流血B.抽搐C.口吐白沫D.口唇樱桃红色",
            answer = "口唇樱桃红色"
        },
        [1000] = {
            ID = 1000,
            topic = "从哪一天开始，白天开始渐渐比黑夜长？A.冬至B.夏至C.立秋D.春分",
            answer = "春分"
        },
        [1001] = {
            ID = 1001,
            topic = "俗称“长生果”是指A.杏仁B.腰果C.核桃D.花生",
            answer = "花生"
        },
        [1002] = {
            ID = 1002,
            topic = "最明亮的行星是什麽A.火星B.木星C.土星D.金星",
            answer = "金星"
        },
        [1003] = {
            ID = 1003,
            topic = "宾士汽车原产于哪一个国家A.中国B.美国C.英国D.德国",
            answer = "德国"
        },
        [1004] = {
            ID = 1004,
            topic = "\"破釜沉舟\"这个成语出于哪次战争?A.官渡之战B.长平之战C.赤壁之战D.巨鹿之战",
            answer = "巨鹿之战"
        },
        [1005] = {
            ID = 1005,
            topic = "具有止血功能的维生素是A.维生素EB.维生素AC.维生素CD.维生素K",
            answer = "维生素K"
        },
        [1006] = {
            ID = 1006,
            topic = "世界上有很多种语言，大约有多少种A.近4000种B.近1000种C.近2000种D.近3000种",
            answer = "近3000种"
        },
        [1007] = {
            ID = 1007,
            topic = "《西游记》中的火焰山在哪里A.哈萨克斯坦B.中国四川C.巴基斯坦D.中国吐鲁番",
            answer = "中国吐鲁番"
        },
        [1008] = {
            ID = 1008,
            topic = "蜜蜂中的“蜂王”和“工蜂”分别是A.雄峰、雌蜂B.雌蜂、雄峰C.雄峰、雄峰D.雌蜂、雌蜂",
            answer = "雌蜂、雌蜂"
        },
        [1009] = {
            ID = 1009,
            topic = "根据有关规定，职工的试用期最长不得超过A.12个月B.3个月C.1个月D.6个月",
            answer = "6个月"
        },
        [1010] = {
            ID = 1010,
            topic = "海洋中最多的生物是A.鱼B.水生植物C.甲壳动物D.浮游生物",
            answer = "浮游生物"
        },
        [1011] = {
            ID = 1011,
            topic = "下列不是生物技术的是A.基因技术B.酶工程C.细胞工程D.DNA工程",
            answer = "DNA工程"
        },
        [1012] = {
            ID = 1012,
            topic = "“但愿人长久，千里共婵娟”，其中婵娟指的是什麽A.时间B.姻缘C.美女D.月亮",
            answer = "月亮"
        },
        [1013] = {
            ID = 1013,
            topic = "古人的婚礼在什麽时间举行A.大半夜B.中午C.早晨D.傍晚",
            answer = "傍晚"
        },
        [1014] = {
            ID = 1014,
            topic = "身为纯爷们，绝对从不回头看什麽A.凡人B.女神C.战友D.爆炸",
            answer = "爆炸"
        },
        [1015] = {
            ID = 1015,
            topic = "\"冬天到了,春天还会远吗\"语出A.徐志摩B.雨果C.张俊以D.雪莱",
            answer = "雪莱"
        },
        [1016] = {
            ID = 1016,
            topic = "胰岛素是一种A.血液B.纤维素C.脂肪D.蛋白质",
            answer = "蛋白质"
        },
        [1017] = {
            ID = 1017,
            topic = "中国最大的商业银行是A.中国农业银行B.中国建设银行C.中国人民银行D.中国工商银行",
            answer = "中国工商银行"
        },
        [1018] = {
            ID = 1018,
            topic = "“黑美人”是哪种水果的品种？A.提子B.火龙果C.葡萄D.西瓜",
            answer = "西瓜"
        },
        [1019] = {
            ID = 1019,
            topic = "柠檬汁有哪些营养含量A.维生素BB.维生素B1和维生素CC.维生素CD.维生素A和维生素C",
            answer = "维生素A和维生素C"
        },
        [1020] = {
            ID = 1020,
            topic = "“软饮料”是指A.不起泡沫的饮料B.不含钙的饮料C.不含二氧化碳的饮料D.不含酒精的饮料",
            answer = "不含酒精的饮料"
        },
        [1021] = {
            ID = 1021,
            topic = "飞机上的黑匣子被安放在飞机上的哪个部位？A.机头B.机翼内C.机身中部D.机尾",
            answer = "机尾"
        },
        [1022] = {
            ID = 1022,
            topic = "鸡蛋最好不要和下面哪种食物一起存放？A.白薯B.淀粉C.食油D.生姜",
            answer = "生姜"
        },
        [1023] = {
            ID = 1023,
            topic = "下列相同重量的食物中，所含热量最多的是？A.苹果B.牛奶C.牛肉D.奶油",
            answer = "奶油"
        },
        [1024] = {
            ID = 1024,
            topic = "买回来的蔬菜应该怎样放才合适？A.丢掉B.倒放C.平放D.竖放",
            answer = "竖放"
        },
        [1025] = {
            ID = 1025,
            topic = "我国的五星级酒店规定总机至少能用多少种外语为客人提供电话服务？A.5种B.2种C.4种D.3种",
            answer = "3种"
        },
        [1026] = {
            ID = 1026,
            topic = "透过阳光，能将乾燥的纸屑点燃的镜片是？A.反射镜B.凹透镜C.平光镜D.凸透镜",
            answer = "凸透镜"
        },
        [1027] = {
            ID = 1027,
            topic = "郑和下西洋，最远到达了哪里？A.地中海西岸B.西印度群岛C.印度半岛D.非洲东岸",
            answer = "非洲东岸"
        },
        [1028] = {
            ID = 1028,
            topic = "长江上建的第一座大桥是？A.放弃回答B.南京长江大桥C.九江长江大桥D.武汉长江大桥",
            answer = "武汉长江大桥"
        },
        [1029] = {
            ID = 1029,
            topic = "宋代的代表性刑罚是什麽？A.这谁知道B.鞭刑C.杖刑D.刺配",
            answer = "刺配"
        },
        [1030] = {
            ID = 1030,
            topic = "哈雷慧星的最早记录是哪国人留下的？A.埃及人B.义大利人C.英国人D.中国人",
            answer = "中国人"
        },
        [1031] = {
            ID = 1031,
            topic = "\"自由女神像\"是哪个国家送给美国的礼物？A.荷兰B.英国C.西班牙D.法国",
            answer = "法国"
        },
        [1032] = {
            ID = 1032,
            topic = "有\"植物熊猫\"之称的是A.白桦B.水杉C.银杏D.银杉",
            answer = "银杉"
        },
        [1033] = {
            ID = 1033,
            topic = "发射第一颗人造卫星的国家是A.中国B.美国C.英国D.前苏联",
            answer = "前苏联"
        },
        [1034] = {
            ID = 1034,
            topic = "欧洲最长的河流是A.这分不要了B.莱茵河C.多瑙河D.伏尔加河",
            answer = "伏尔加河"
        },
        [1035] = {
            ID = 1035,
            topic = "世界上地势最低的国家是A.菲律宾B.日本C.越南D.荷兰",
            answer = "荷兰"
        },
        [1036] = {
            ID = 1036,
            topic = "中国的四大发明不包括A.指南针B.活字印刷术C.火药D.地动仪",
            answer = "地动仪"
        },
        [1037] = {
            ID = 1037,
            topic = "我国着名的赵州桥建于哪个朝代A.宋B.汉C.唐D.隋",
            answer = "隋"
        },
        [1038] = {
            ID = 1038,
            topic = "世界上流经国家最多的河流是A.恒河B.尼罗河C.亚马逊河D.多瑙河",
            answer = "多瑙河"
        },
        [1039] = {
            ID = 1039,
            topic = "张家界风景区位于我国哪个省A.贵州B.湖北C.四川D.湖南",
            answer = "湖南"
        },
        [1040] = {
            ID = 1040,
            topic = "白光是由几种颜色的光合成的A.六种B.四种C.五种D.七种",
            answer = "七种"
        },
        [1041] = {
            ID = 1041,
            topic = "到了秋天，万木凋零，落叶满地。树枝上哪部分的叶子是最后落叶的A.树顶B.树枝的中间部分C.靠树干的部分D.树梢",
            answer = "树梢"
        },
        [1042] = {
            ID = 1042,
            topic = "大家在写信时，都会在信的结尾写上“此致”、“敬礼”，此致是什麽意思A.恭敬B.表示致敬C.奉上、敬上D.到此为止",
            answer = "到此为止"
        },
        [1043] = {
            ID = 1043,
            topic = "大禹治水治的是A.长江B.淮河C.海侵D.黄河",
            answer = "黄河"
        },
        [1044] = {
            ID = 1044,
            topic = "我国着名的九寨沟，沟内有九个什麽民族的村寨A.羌族B.壮族C.回族D.藏族",
            answer = "藏族"
        },
        [1045] = {
            ID = 1045,
            topic = "红外线不具备的特徵是A.可用于通讯B.有很强的热能C.可用于医疗D.能够穿透墙壁",
            answer = "能够穿透墙壁"
        },
        [1046] = {
            ID = 1046,
            topic = "如果一个人不小心鼻孔出血，为了避免流更多的血，那麽他应该A.用两指夹紧鼻梁硬骨B.仰起头C.卧下D.用两指夹紧鼻尖部位",
            answer = "用两指夹紧鼻尖部位"
        },
        [1047] = {
            ID = 1047,
            topic = "踝关节纽伤，应该A.找神棍医治B.先热敷C.马上去医院D.先冷敷",
            answer = "先冷敷"
        },
        [1048] = {
            ID = 1048,
            topic = "我国的国家公园指的是A.自然保护区B.植物园C.公园D.风景名胜区",
            answer = "风景名胜区"
        },
        [1049] = {
            ID = 1049,
            topic = "我们都说昙花一现，那麽昙花开花时间多长A.几分钟B.1小时左右C.一个晚上D.5小时左右",
            answer = "5小时左右"
        },
        [1050] = {
            ID = 1050,
            topic = "猫为什麽特别喜欢吃老鼠A.鼠比其他小B.喜欢鼠肉的味道C.鼠肉便于消化D.弥补体内物质的不足",
            answer = "弥补体内物质的不足"
        },
        [1051] = {
            ID = 1051,
            topic = "河马在水中用什麽姿势游泳A.旋转式B.自由式C.狗爬式D.不会游泳",
            answer = "不会游泳"
        },
        [1052] = {
            ID = 1052,
            topic = "睡觉的最佳方向是A.头北脚南B.头西脚东C.头东脚西D.头南脚北",
            answer = "头南脚北"
        },
        [1053] = {
            ID = 1053,
            topic = "下列哪种东西可以出去菜刀上的锈迹A.显影粉B.酱油C.番茄D.葱头",
            answer = "葱头"
        },
        [1054] = {
            ID = 1054,
            topic = "巾帼英雄中的巾帼是指古代妇女A.穿的衣服B.戴的发饰C.戴的手饰D.戴的头巾",
            answer = "戴的头巾"
        },
        [1055] = {
            ID = 1055,
            topic = "磨杵成针的典故与哪位诗人有关A.韩愈B.白居易C.杜甫D.李白",
            answer = "李白"
        },
        [1056] = {
            ID = 1056,
            topic = "成语琳琅满目中的琳琅原指什麽A.美玉B.好文章C.各种美好的物品D.名流人才",
            answer = "名流人才"
        },
        [1057] = {
            ID = 1057,
            topic = "法国人称自己心爱的人为A.大头菜B.小甜菜C.黄金虫D.卷心菜",
            answer = "卷心菜"
        },
        [1058] = {
            ID = 1058,
            topic = "你知道母亲节是什麽时候吗A.6月的第2个星期日B.5月的第1个星期日C.6月的第1个星期日D.5月的第2个星期日",
            answer = "5月的第2个星期日"
        },
        [1059] = {
            ID = 1059,
            topic = "沉鱼是指哪位美女A.杨玉环B.王昭君C.貂禅D.西施",
            answer = "西施"
        },
        [1060] = {
            ID = 1060,
            topic = "卢沟桥上共有多少个石狮子A.524B.249C.365D.485",
            answer = "485"
        },
        [1061] = {
            ID = 1061,
            topic = "通常被称为第七艺术的是A.雕塑B.文学C.绘画D.电影",
            answer = "电影"
        },
        [1062] = {
            ID = 1062,
            topic = "宫保鸡丁中的宫保是指A.独创B.地名C.人名D.官名",
            answer = "官名"
        },
        [1063] = {
            ID = 1063,
            topic = "被鲁迅先生誉为“史家之绝唱，无韵之离骚”的是A.左传B.春秋C.汉书D.史记",
            answer = "史记"
        },
        [1064] = {
            ID = 1064,
            topic = "“经，史，子，集”中的子，是哪种类型的书籍A.史学系列B.文学荟萃C.制度记载D.诸子文集",
            answer = "诸子文集"
        },
        [1065] = {
            ID = 1065,
            topic = "我国从哪个皇帝开始使用年号的A.汉高祖B.唐太宗C.秦始皇D.汉武帝",
            answer = "汉武帝"
        },
        [1066] = {
            ID = 1066,
            topic = "在南极点上，一个昼夜是A.一天B.一个季度C.半年D.一年",
            answer = "一年"
        },
        [1067] = {
            ID = 1067,
            topic = "我们在市场上买到的鲫鱼大多是A.下一题B.雄性C.没有性别D.雌性",
            answer = "雌性"
        },
        [1068] = {
            ID = 1068,
            topic = "狮子尾巴又出粗又长，它的主要功能是用来A.霸气B.扇风降温C.赶走飞虫D.奔跑时维持平衡",
            answer = "奔跑时维持平衡"
        },
        [1069] = {
            ID = 1069,
            topic = "在三国演义里，关羽温酒斩华雄的那杯酒是谁斟上的A.诸葛亮B.刘备C.袁绍D.曹操",
            answer = "曹操"
        },
        [1070] = {
            ID = 1070,
            topic = "露马脚这个俗语说的是古代那位夫人A.诸葛亮的夫人B.孙权的夫人C.刘备的夫人D.朱元璋的夫人",
            answer = "朱元璋的夫人"
        },
        [1071] = {
            ID = 1071,
            topic = "名花解语，是形容什麽的A.女子非常美丽B.花通人性C.花艳丽D.美女善解人意",
            answer = "美女善解人意"
        },
        [1072] = {
            ID = 1072,
            topic = "“中华人民共和国”的名称最早是由谁提出来的A.刘少奇B.周恩来C.毛泽东D.任弼时",
            answer = "任弼时"
        },
        [1073] = {
            ID = 1073,
            topic = "破除“满汉不通婚”这个祖训的是A.康熙B.咸丰C.道光D.乾隆",
            answer = "乾隆"
        },
        [1074] = {
            ID = 1074,
            topic = "我国古代通过科举考试选拔文武官吏，科举制度开始于A.元朝B.唐朝C.宋朝D.隋朝",
            answer = "隋朝"
        },
        [1075] = {
            ID = 1075,
            topic = "京剧中的脸谱使人物的性格一目了然。一般红色脸谱代表A.圆滑B.奸邪C.耿直D.忠勇",
            answer = "忠勇"
        },
        [1076] = {
            ID = 1076,
            topic = "音乐神童是指哪个音乐家A.舒伯特B.贝多芬C.巴赫D.莫紮特",
            answer = "莫紮特"
        },
        [1077] = {
            ID = 1077,
            topic = "艺术体操分几种比赛A.五种B.三种C.四种D.两种",
            answer = "两种"
        },
        [1078] = {
            ID = 1078,
            topic = "下列哪一部是四书五经中五经A.论语B.大学C.中庸D.春秋",
            answer = "春秋"
        },
        [1079] = {
            ID = 1079,
            topic = "我国是一个众多民族的国家，人口最多的少数民族是A.汉族B.蒙古族C.回族D.壮族",
            answer = "壮族"
        },
        [1080] = {
            ID = 1080,
            topic = "“豆蔻年华”指的是女子多少岁A.18B.10C.15D.13",
            answer = "13"
        },
        [1081] = {
            ID = 1081,
            topic = "以下数字哪个日西方人特别忌讳的A.1B.4C.9D.13",
            answer = "13"
        },
        [1082] = {
            ID = 1082,
            topic = "月饼最初起源于A.明朝B.宋朝C.元朝D.唐朝",
            answer = "唐朝"
        },
        [1083] = {
            ID = 1083,
            topic = "一般情况下，一根头发最多可以吊起多重的物品A.370克B.七十克C.270克D.170克",
            answer = "170克"
        },
        [1084] = {
            ID = 1084,
            topic = "睡眠的最好姿势是朝向哪个方向A.趴着B.朝向左侧C.平躺D.朝向右侧",
            answer = "朝向右侧"
        },
        [1085] = {
            ID = 1085,
            topic = "把新旧电池在一起用会出现什麽效果A.请指教B.省电C.效果一样D.费电",
            answer = "费电"
        },
        [1086] = {
            ID = 1086,
            topic = "三国中被刘备誉为 “一身都是胆”人物是谁A.马超B.关羽C.张飞D.赵云",
            answer = "赵云"
        },
        [1087] = {
            ID = 1087,
            topic = "下面哪一历史时期不是奴隶制社会A.春秋B.商C.周D.秦",
            answer = "秦"
        },
        [1088] = {
            ID = 1088,
            topic = "下列科学家中哪位是犹太人A.拉瓦锡B.培根C.牛顿D.爱因斯坦",
            answer = "爱因斯坦"
        },
        [1089] = {
            ID = 1089,
            topic = "月球环绕地球一周的时间约为A.一时B.一年C.一日D.一月",
            answer = "一月"
        },
        [1090] = {
            ID = 1090,
            topic = "我国宋朝以后,没有做过国都的城市有A.杭州B.开封C.南京D.洛阳",
            answer = "洛阳"
        },
        [1091] = {
            ID = 1091,
            topic = "古诗名句\"谁言寸草心,报得三春晖\"出自A.李清照B.李白C.王维D.孟郊",
            answer = "孟郊"
        },
        [1092] = {
            ID = 1092,
            topic = "下列哪个人不属于唐宋八大家A.欧阳修B.柳宗元C.曾巩D.陆游",
            answer = "陆游"
        },
        [1093] = {
            ID = 1093,
            topic = "提出人性善理论的儒家代表人物是A.韩非子B.孔子C.荀子D.孟子",
            answer = "孟子"
        },
        [1094] = {
            ID = 1094,
            topic = "下列四种情绪情感中，哪一种被认为不是最原始最基本的A.喜悦B.愤怒C.苦恼D.悲哀",
            answer = "悲哀"
        },
        [1095] = {
            ID = 1095,
            topic = "舌头无法舔到A.头发B.肩膀C.脚趾D.手肘",
            answer = "手肘"
        },
        [1096] = {
            ID = 1096,
            topic = "悟空上天后，玉帝封了他当A.酱油帝B.武曲星君C.巨灵神D.弼马温",
            answer = "弼马温"
        },
        [1097] = {
            ID = 1097,
            topic = "西游记种菩萨找的取经人是A.李世民B.唐玄奘C.唐僧D.陈玄奘",
            answer = "陈玄奘"
        },
        [1098] = {
            ID = 1098,
            topic = "“铁观音”茶的原产发源地在中国的哪个省份？A.山西B.四川C.浙江D.福建",
            answer = "福建"
        },
        [1099] = {
            ID = 1099,
            topic = "电影《变形金刚》中，与擎天柱作对的反派首领叫什麽？A.红蜘蛛B.大黄蜂C.帝释天D.威震天",
            answer = "威震天"
        },
        [1100] = {
            ID = 1100,
            topic = "世界上出现麦田怪圈最多的国家是？A.义大利B.美国C.中国D.英国",
            answer = "英国"
        },
        [1101] = {
            ID = 1101,
            topic = "香港特别行政区的区花是什麽？A.菊花B.彼岸花C.蝴蝶花D.紫荆花",
            answer = "紫荆花"
        },
        [1102] = {
            ID = 1102,
            topic = "着名的“自由女神”像坐落在美国的哪座城市？A.波斯顿B.迈阿密C.曼哈顿D.纽约",
            answer = "纽约"
        },
        [1103] = {
            ID = 1103,
            topic = "“狗不理包子”是中国哪个城市的传统风味小吃？A.丽江B.陕西C.云南D.天津",
            answer = "天津"
        },
        [1104] = {
            ID = 1104,
            topic = "世界上有“钢琴诗人”之称的波澜钢琴家是哪一位？A.毕加索B.贝多芬C.达芬奇D.肖邦",
            answer = "肖邦"
        },
        [1105] = {
            ID = 1105,
            topic = "马可波罗是在哪个朝代来到中国的？A.宋B.夏C.商D.元",
            answer = "元"
        },
        [1106] = {
            ID = 1106,
            topic = "现代奥运会起源于哪个国家？A.迪拜B.梵蒂冈C.雅典D.希腊",
            answer = "希腊"
        },
        [1107] = {
            ID = 1107,
            topic = "中国 2010 年上海世博会吉祥物叫什麽？A.海鸥B.海贝C.海尔D.海宝",
            answer = "海宝"
        },
        [1108] = {
            ID = 1108,
            topic = "久负盛名的孔雀舞是我国哪个民族的传统舞蹈？A.羌族B.回族C.壮族D.傣族",
            answer = "傣族"
        },
        [1109] = {
            ID = 1109,
            topic = "童话故事中，一说谎话鼻子就会变长的木偶叫什麽名字？A.皇后B.白雪公主C.灰姑娘D.匹诺曹",
            answer = "匹诺曹"
        },
        [1110] = {
            ID = 1110,
            topic = "不是电影公司的是A.梦工厂B.福克斯C.狮门D.玩视动力",
            answer = "玩视动力"
        },
        [1111] = {
            ID = 1111,
            topic = "1992年是什麽生肖A.狗B.鸡C.猪D.猴",
            answer = "猴"
        },
        [1112] = {
            ID = 1112,
            topic = "以下不是视频直播的是A.触手B.熊猫C.斗鱼D.油猴",
            answer = "油猴"
        },
        [1113] = {
            ID = 1113,
            topic = "夏天吃什麽蔬菜可以清火去热A.南瓜B.黄瓜C.冬瓜D.苦瓜",
            answer = "苦瓜"
        },
        [1114] = {
            ID = 1114,
            topic = "菜汤上浮着一层油会使菜汤凉得A.忽快忽慢B.更快C.没影响D.更慢",
            answer = "更慢"
        },
        [1115] = {
            ID = 1115,
            topic = "电子电脑发明于哪一年？A.1936年B.1900年C.1956年D.1946年",
            answer = "1946年"
        },
        [1116] = {
            ID = 1116,
            topic = "薄公英靠什麽传播种子？A.水蒸气B.动物C.昆虫D.风力",
            answer = "风力"
        },
        [1117] = {
            ID = 1117,
            topic = "维纳斯是罗马神话中的A.时间之神B.死神C.空间之神D.爱神与美神",
            answer = "爱神与美神"
        },
        [1118] = {
            ID = 1118,
            topic = "眉毛的生长周期有多久？A.5个月B.3个月C.4个月D.2个月",
            answer = "2个月"
        },
        [1119] = {
            ID = 1119,
            topic = "偃武修文的“偃”的意思是A.振兴B.精简C.提倡D.停止",
            answer = "停止"
        },
        [1120] = {
            ID = 1120,
            topic = "哈雷彗星多少年出现一次A.78年B.75年C.77年D.76年",
            answer = "76年"
        },
        [1121] = {
            ID = 1121,
            topic = "我国驾驶大型客车的驾驶证准驾车型为A.特种B.B型C.C型D.A型",
            answer = "A型"
        },
        [1122] = {
            ID = 1122,
            topic = "黄鹤楼在我国的哪一个省A.河南B.湖南C.河北D.湖北",
            answer = "湖北"
        },
        [1123] = {
            ID = 1123,
            topic = "我国的中央银行是指A.中国招商银行B.中国银行C.中国建设银行D.中国人民银行",
            answer = "中国人民银行"
        },
        [1124] = {
            ID = 1124,
            topic = "民航客机在高空中飞行时，一般处于大气的哪个层次A.电离层B.对流层C.中间层D.平流层",
            answer = "平流层"
        },
        [1125] = {
            ID = 1125,
            topic = "钢琴有多少个键A.90个B.84个C.86个D.88个",
            answer = "88个"
        },
        [1126] = {
            ID = 1126,
            topic = "张衡发明的地动仪是用来干什麽用的A.防范地震B.预测地震C.测定地震的震级D.测定地震的方向",
            answer = "测定地震的方向"
        },
        [1127] = {
            ID = 1127,
            topic = "我国制造的第一部轿车的牌子是A.上海B.解放C.红旗D.东风",
            answer = "东风"
        },
        [1128] = {
            ID = 1128,
            topic = "我国第一部长篇讽刺小说A.八声甘州B.老残游记C.警世通言D.儒林外史",
            answer = "儒林外史"
        },
        [1129] = {
            ID = 1129,
            topic = "《鲁滨逊漂流记》主角在孤岛上生存了多少年？A.24B.29C.18D.28",
            answer = "28"
        },
        [1130] = {
            ID = 1130,
            topic = "下列不是《红楼梦》别称的是？A.石头记B.情僧庐C.风月宝鉴D.绦珠仙草",
            answer = "绦珠仙草"
        },
        [1131] = {
            ID = 1131,
            topic = "人们常说“颠张醉素”，下列哪个是颠张的作品？A.黄州寒食贴B.自述贴C.中秋贴D.自言贴",
            answer = "自言贴"
        },
        [1132] = {
            ID = 1132,
            topic = "“明天，又是新的一天”是哪本名着的结语A.羊脂球B.基督山伯爵C.傲慢与偏见D.乱世佳人",
            answer = "乱世佳人"
        },
        [1133] = {
            ID = 1133,
            topic = "“四羊方尊”是哪朝文物A.元B.夏C.周D.商",
            answer = "商"
        },
        [1134] = {
            ID = 1134,
            topic = "“天道有常，不为尧存，不为桀亡”是哪位思想家的观点？A.庄子B.老子C.孟子D.荀子",
            answer = "荀子"
        },
        [1135] = {
            ID = 1135,
            topic = "下列属于建安七子的是？A.山涛B.曹植C.嵇康D.阮瑀",
            answer = "阮瑀"
        },
        [1136] = {
            ID = 1136,
            topic = "下列那一项称呼由来跟伍子胥有关？A.新郎B.月老C.岳父D.千金小姐",
            answer = "千金小姐"
        },
        [1137] = {
            ID = 1137,
            topic = "“形存则神存,形谢则神灭”是谁说的？A.孔子B.柳宗元C.王阳明D.范缜",
            answer = "范缜"
        },
        [1138] = {
            ID = 1138,
            topic = "“菩提本无树，明镜亦非台，本来无一物，何处惹尘埃”出自A.菩提达摩B.玄奘C.神秀D.慧能",
            answer = "慧能"
        },
        [1139] = {
            ID = 1139,
            topic = "《搜神记》的作者是A.施耐庵B.贾谊C.毛亨D.干宝",
            answer = "干宝"
        },
        [1140] = {
            ID = 1140,
            topic = "《诗经》分“风、雅、颂”，属于民间歌谣的是？A.颂B.大雅C.小雅D.国风",
            answer = "国风"
        },
        [1141] = {
            ID = 1141,
            topic = "苏轼的《水调歌头·明月几时有》与哪个节日有关？A.重阳B.清明C.春节D.中秋",
            answer = "中秋"
        },
        [1142] = {
            ID = 1142,
            topic = "不属于唐宋八大家的是A.欧阳修B.王安石C.柳宗元D.王勃",
            answer = "王勃"
        },
        [1143] = {
            ID = 1143,
            topic = "《神曲》的主要内容取材于A.历史B.圣经C.神话传说D.义大利现实生活",
            answer = "义大利现实生活"
        },
        [1144] = {
            ID = 1144,
            topic = "在《神曲》中维吉尔象徵的是A.智慧B.信仰C.神学D.理性",
            answer = "理性"
        },
        [1145] = {
            ID = 1145,
            topic = "以下哪个不是丁代表作《神曲》的组成部分A.天堂B.炼狱C.地狱D.人间",
            answer = "人间"
        },
        [1146] = {
            ID = 1146,
            topic = "塞万提斯在《堂·吉诃德》中没用到哪种艺术手法。A.对比B.夸张C.讽刺D.写诗",
            answer = "写诗"
        },
        [1147] = {
            ID = 1147,
            topic = "《堂·吉诃德》第二部中塞万提斯塑造的卡拉斯科这一人物，是一个A.骑士B.哲学家C.牧师D.文学士",
            answer = "文学士"
        },
        [1148] = {
            ID = 1148,
            topic = "以下哪位是第一位从西班牙语翻译《堂·吉诃德》的译者。A.傅东华B.林纾C.陈家麟D.杨绦",
            answer = "杨绦"
        },
        [1149] = {
            ID = 1149,
            topic = "包法利夫人的丈夫是A.赖昂B.罗道尔弗        C.玉斯旦      D.查理",
            answer = "查理"
        },
        [1150] = {
            ID = 1150,
            topic = "《伪君子》的主人公（   ）是典型的宗教骗子。A.奥尔贡      B.大密斯C.艾耳密尔        D.达尔杜弗",
            answer = "达尔杜弗"
        },
        [1151] = {
            ID = 1151,
            topic = "歌德创作的《浮士德》，从构思到脱稿，前后延续的时间是？A.30年B.50年C.40年D.60年",
            answer = "60年"
        },
        [1152] = {
            ID = 1152,
            topic = "按照浮士德和魔鬼打赌的约定，语涉（  ），浮士德就失败了A.欲望B.快乐C.爱情D.停留",
            answer = "停留"
        },
        [1153] = {
            ID = 1153,
            topic = "以下哪一个剧集不是美剧A.破产姐妹B.行屍走肉C.生活大爆炸D.卖房子的女人",
            answer = "卖房子的女人"
        },
        [1154] = {
            ID = 1154,
            topic = "______是《死魂灵》这部作品的主要艺术风格。A.犀利讽刺B.委婉含蓄C.黑色幽默D.含泪的笑",
            answer = "含泪的笑"
        },
        [1155] = {
            ID = 1155,
            topic = "十九世纪俄罗斯现实主义长篇小说《罪与罚》的作者是A.高尔基B.托尔斯泰C.屠格涅夫D.陀思妥耶夫斯基",
            answer = "陀思妥耶夫斯基"
        },
        [1156] = {
            ID = 1156,
            topic = "妈妈买碗时常把两只碗碰一碰，听听发出的声音。她判断碗的好坏时主要的根据是声音的A.响度B.音量C.音调D.音色",
            answer = "音色"
        },
        [1157] = {
            ID = 1157,
            topic = "11，111，1111，11111，…中，完全平方数的个数为A.无穷多B.1C.10D.0",
            answer = "0"
        },
        [1158] = {
            ID = 1158,
            topic = "|-2|的相反数是A.1/2B.2C.0D.-2",
            answer = "-2"
        },
        [1159] = {
            ID = 1159,
            topic = "一个二项式乘以一个三项式，最后结果是几项式？A.四B.二C.三D.无法确定",
            answer = "无法确定"
        },
        [1160] = {
            ID = 1160,
            topic = "下列数据表示出生率和死亡率，自然增长率最高的一组是？A.1.0% 0.7%B.2.2% 1.7%C.2.1% 1.5%D.1.5% 0.7%",
            answer = "1.5% 0.7%"
        },
        [1161] = {
            ID = 1161,
            topic = "被称为伊斯兰教的“圣城”的是A.纳格兰B.巴格达C.开罗D.麦加",
            answer = "麦加"
        },
        [1162] = {
            ID = 1162,
            topic = "亚洲南部的夏季风来自A.北冰洋B.大西洋C.太平洋D.印度洋",
            answer = "印度洋"
        },
        [1163] = {
            ID = 1163,
            topic = "“亚细亚”以为A.日落之地B.西方日落之地C.日出之地D.东方日出之地",
            answer = "东方日出之地"
        },
        [1164] = {
            ID = 1164,
            topic = "下列国家经济中以加工贸易为主的是？A.俄罗斯B.印度C.中国D.日本",
            answer = "日本"
        },
        [1165] = {
            ID = 1165,
            topic = "恶性肿瘤的形成是因为细胞A.不断分化B.不断分化而不分裂C.不断分裂D.不断分裂而不分化",
            answer = "不断分裂而不分化"
        },
        [1166] = {
            ID = 1166,
            topic = "高大的面包树和短小的面包虫相比，缺少的结构层是？A.细胞B.器官C.组织D.系统",
            answer = "系统"
        },
        [1167] = {
            ID = 1167,
            topic = "古人的婚礼在什麽时间举行A.大半夜B.中午C.早晨D.傍晚",
            answer = "傍晚"
        },
        [1168] = {
            ID = 1168,
            topic = "身为纯爷们，绝对从不回头看什麽A.凡人B.女神C.战友D.爆炸",
            answer = "爆炸"
        },
        [1169] = {
            ID = 1169,
            topic = "\"冬天到了,春天还会远吗\"语出A.徐志摩B.雨果C.张俊以D.雪莱",
            answer = "雪莱"
        },
        [1170] = {
            ID = 1170,
            topic = "胰岛素是一种A.血液B.纤维素C.脂肪D.蛋白质",
            answer = "蛋白质"
        },
        [1171] = {
            ID = 1171,
            topic = "中国最大的商业银行是A.中国农业银行B.中国建设银行C.中国人民银行D.中国工商银行",
            answer = "中国工商银行"
        },
        [1172] = {
            ID = 1172,
            topic = "“黑美人”是哪种水果的品种？A.提子B.火龙果C.葡萄D.西瓜",
            answer = "西瓜"
        },
        [1173] = {
            ID = 1173,
            topic = "柠檬汁有哪些营养含量A.维生素BB.维生素B1和维生素CC.维生素CD.维生素A和维生素C",
            answer = "维生素A和维生素C"
        },
        [1174] = {
            ID = 1174,
            topic = "“软饮料”是指A.不起泡沫的饮料B.不含钙的饮料C.不含二氧化碳的饮料D.不含酒精的饮料",
            answer = "不含酒精的饮料"
        },
        [1175] = {
            ID = 1175,
            topic = "飞机上的黑匣子被安放在飞机上的哪个部位？A.机头B.机翼内C.机身中部D.机尾",
            answer = "机尾"
        },
        [1176] = {
            ID = 1176,
            topic = "鸡蛋最好不要和下面哪种食物一起存放？A.白薯B.淀粉C.食油D.生姜",
            answer = "生姜"
        },
        [1177] = {
            ID = 1177,
            topic = "下列相同重量的食物中，所含热量最多的是？A.苹果B.牛奶C.牛肉D.奶油",
            answer = "奶油"
        },
        [1178] = {
            ID = 1178,
            topic = "买回来的蔬菜应该怎样放才合适？A.丢掉B.倒放C.平放D.竖放",
            answer = "竖放"
        },
        [1179] = {
            ID = 1179,
            topic = "我国的五星级酒店规定总机至少能用多少种外语为客人提供电话服务？A.5种B.2种C.4种D.3种",
            answer = "3种"
        },
        [1180] = {
            ID = 1180,
            topic = "透过阳光，能将乾燥的纸屑点燃的镜片是？A.反射镜B.凹透镜C.平光镜D.凸透镜",
            answer = "凸透镜"
        },
        [1181] = {
            ID = 1181,
            topic = "郑和下西洋，最远到达了哪里？A.地中海西岸B.西印度群岛C.印度半岛D.非洲东岸",
            answer = "非洲东岸"
        },
        [1182] = {
            ID = 1182,
            topic = "长江上建的第一座大桥是？A.放弃回答B.南京长江大桥C.九江长江大桥D.武汉长江大桥",
            answer = "武汉长江大桥"
        },
        [1183] = {
            ID = 1183,
            topic = "宋代的代表性刑罚是什麽？A.这谁知道B.鞭刑C.杖刑D.刺配",
            answer = "刺配"
        },
        [1184] = {
            ID = 1184,
            topic = "哈雷慧星的最早记录是哪国人留下的？A.埃及人B.义大利人C.英国人D.中国人",
            answer = "中国人"
        },
        [1185] = {
            ID = 1185,
            topic = "\"自由女神像\"是哪个国家送给美国的礼物？A.荷兰B.英国C.西班牙D.法国",
            answer = "法国"
        },
        [1186] = {
            ID = 1186,
            topic = "有\"植物熊猫\"之称的是A.白桦B.水杉C.银杏D.银杉",
            answer = "银杉"
        },
        [1187] = {
            ID = 1187,
            topic = "发射第一颗人造卫星的国家是A.中国B.美国C.英国D.前苏联",
            answer = "前苏联"
        },
        [1188] = {
            ID = 1188,
            topic = "欧洲最长的河流是A.这分不要了B.莱茵河C.多瑙河D.伏尔加河",
            answer = "伏尔加河"
        },
        [1189] = {
            ID = 1189,
            topic = "世界上地势最低的国家是A.菲律宾B.日本C.越南D.荷兰",
            answer = "荷兰"
        },
        [1190] = {
            ID = 1190,
            topic = "中国的四大发明不包括A.指南针B.活字印刷术C.火药D.地动仪",
            answer = "地动仪"
        },
        [1191] = {
            ID = 1191,
            topic = "我国着名的赵州桥建于哪个朝代A.宋B.汉C.唐D.隋",
            answer = "隋"
        },
        [1192] = {
            ID = 1192,
            topic = "世界上流经国家最多的河流是A.恒河B.尼罗河C.亚马逊河D.多瑙河",
            answer = "多瑙河"
        },
        [1193] = {
            ID = 1193,
            topic = "张家界风景区位于我国哪个省A.贵州B.湖北C.四川D.湖南",
            answer = "湖南"
        },
        [1194] = {
            ID = 1194,
            topic = "白光是由几种颜色的光合成的A.六种B.四种C.五种D.七种",
            answer = "七种"
        },
        [1195] = {
            ID = 1195,
            topic = "到了秋天，万木凋零，落叶满地。树枝上哪部分的叶子是最后落叶的A.树顶B.树枝的中间部分C.靠树干的部分D.树梢",
            answer = "树梢"
        },
        [1196] = {
            ID = 1196,
            topic = "大家在写信时，都会在信的结尾写上“此致”、“敬礼”，此致是什麽意思A.恭敬B.表示致敬C.奉上、敬上D.到此为止",
            answer = "到此为止"
        },
        [1197] = {
            ID = 1197,
            topic = "大禹治水治的是A.长江B.淮河C.海侵D.黄河",
            answer = "黄河"
        },
        [1198] = {
            ID = 1198,
            topic = "我国着名的九寨沟，沟内有九个什麽民族的村寨A.羌族B.壮族C.回族D.藏族",
            answer = "藏族"
        },
        [1199] = {
            ID = 1199,
            topic = "红外线不具备的特徵是A.可用于通讯B.有很强的热能C.可用于医疗D.能够穿透墙壁",
            answer = "能够穿透墙壁"
        },
        [1200] = {
            ID = 1200,
            topic = "如果一个人不小心鼻孔出血，为了避免流更多的血，那麽他应该A.用两指夹紧鼻梁硬骨B.仰起头C.卧下D.用两指夹紧鼻尖部位",
            answer = "用两指夹紧鼻尖部位"
        },
        [1201] = {
            ID = 1201,
            topic = "踝关节纽伤，应该A.找神棍医治B.先热敷C.马上去医院D.先冷敷",
            answer = "先冷敷"
        },
        [1202] = {
            ID = 1202,
            topic = "我国的国家公园指的是A.自然保护区B.植物园C.公园D.风景名胜区",
            answer = "风景名胜区"
        },
        [1203] = {
            ID = 1203,
            topic = "我们都说昙花一现，那麽昙花开花时间多长A.几分钟B.1小时左右C.一个晚上D.5小时左右",
            answer = "5小时左右"
        },
        [1204] = {
            ID = 1204,
            topic = "猫为什麽特别喜欢吃老鼠A.鼠比其他小B.喜欢鼠肉的味道C.鼠肉便于消化D.弥补体内物质的不足",
            answer = "弥补体内物质的不足"
        },
        [1205] = {
            ID = 1205,
            topic = "河马在水中用什麽姿势游泳A.旋转式B.自由式C.狗爬式D.不会游泳",
            answer = "不会游泳"
        },
        [1206] = {
            ID = 1206,
            topic = "睡觉的最佳方向是A.头北脚南B.头西脚东C.头东脚西D.头南脚北",
            answer = "头南脚北"
        },
        [1207] = {
            ID = 1207,
            topic = "下列哪种东西可以出去菜刀上的锈迹A.显影粉B.酱油C.番茄D.葱头",
            answer = "葱头"
        },
        [1208] = {
            ID = 1208,
            topic = "巾帼英雄中的巾帼是指古代妇女A.穿的衣服B.戴的发饰C.戴的手饰D.戴的头巾",
            answer = "戴的头巾"
        },
        [1209] = {
            ID = 1209,
            topic = "磨杵成针的典故与哪位诗人有关A.韩愈B.白居易C.杜甫D.李白",
            answer = "李白"
        },
        [1210] = {
            ID = 1210,
            topic = "成语琳琅满目中的琳琅原指什麽A.美玉B.好文章C.各种美好的物品D.名流人才",
            answer = "名流人才"
        },
        [1211] = {
            ID = 1211,
            topic = "法国人称自己心爱的人为A.大头菜B.小甜菜C.黄金虫D.卷心菜",
            answer = "卷心菜"
        },
        [1212] = {
            ID = 1212,
            topic = "你知道母亲节是什麽时候吗A.6月的第2个星期日B.5月的第1个星期日C.6月的第1个星期日D.5月的第2个星期日",
            answer = "5月的第2个星期日"
        },
        [1213] = {
            ID = 1213,
            topic = "沉鱼是指哪位美女A.杨玉环B.王昭君C.貂禅D.西施",
            answer = "西施"
        },
        [1214] = {
            ID = 1214,
            topic = "卢沟桥上共有多少个石狮子A.524B.249C.365D.485",
            answer = "485"
        },
        [1215] = {
            ID = 1215,
            topic = "通常被称为第七艺术的是A.雕塑B.文学C.绘画D.电影",
            answer = "电影"
        },
        [1216] = {
            ID = 1216,
            topic = "宫保鸡丁中的宫保是指A.独创B.地名C.人名D.官名",
            answer = "官名"
        },
        [1217] = {
            ID = 1217,
            topic = "被鲁迅先生誉为“史家之绝唱，无韵之离骚”的是A.左传B.春秋C.汉书D.史记",
            answer = "史记"
        },
        [1218] = {
            ID = 1218,
            topic = "“经，史，子，集”中的子，是哪种类型的书籍A.史学系列B.文学荟萃C.制度记载D.诸子文集",
            answer = "诸子文集"
        },
        [1219] = {
            ID = 1219,
            topic = "我国从哪个皇帝开始使用年号的A.汉高祖B.唐太宗C.秦始皇D.汉武帝",
            answer = "汉武帝"
        },
        [1220] = {
            ID = 1220,
            topic = "在南极点上，一个昼夜是A.一天B.一个季度C.半年D.一年",
            answer = "一年"
        },
        [1221] = {
            ID = 1221,
            topic = "我们在市场上买到的鲫鱼大多是A.下一题B.雄性C.没有性别D.雌性",
            answer = "雌性"
        },
        [1222] = {
            ID = 1222,
            topic = "狮子尾巴又出粗又长，它的主要功能是用来A.霸气B.扇风降温C.赶走飞虫D.奔跑时维持平衡",
            answer = "奔跑时维持平衡"
        },
        [1223] = {
            ID = 1223,
            topic = "在三国演义里，关羽温酒斩华雄的那杯酒是谁斟上的A.诸葛亮B.刘备C.袁绍D.曹操",
            answer = "曹操"
        },
        [1224] = {
            ID = 1224,
            topic = "露马脚这个俗语说的是古代那位夫人A.诸葛亮的夫人B.孙权的夫人C.刘备的夫人D.朱元璋的夫人",
            answer = "朱元璋的夫人"
        },
        [1225] = {
            ID = 1225,
            topic = "名花解语，是形容什麽的A.女子非常美丽B.花通人性C.花艳丽D.美女善解人意",
            answer = "美女善解人意"
        },
        [1226] = {
            ID = 1226,
            topic = "“中华人民共和国”的名称最早是由谁提出来的A.刘少奇B.周恩来C.毛泽东D.任弼时",
            answer = "任弼时"
        },
        [1227] = {
            ID = 1227,
            topic = "破除“满汉不通婚”这个祖训的是A.康熙B.咸丰C.道光D.乾隆",
            answer = "乾隆"
        },
        [1228] = {
            ID = 1228,
            topic = "我国古代通过科举考试选拔文武官吏，科举制度开始于A.元朝B.唐朝C.宋朝D.隋朝",
            answer = "隋朝"
        },
        [1229] = {
            ID = 1229,
            topic = "京剧中的脸谱使人物的性格一目了然。一般红色脸谱代表A.圆滑B.奸邪C.耿直D.忠勇",
            answer = "忠勇"
        },
        [1230] = {
            ID = 1230,
            topic = "音乐神童是指哪个音乐家A.舒伯特B.贝多芬C.巴赫D.莫紮特",
            answer = "莫紮特"
        },
        [1231] = {
            ID = 1231,
            topic = "倚天屠龙记中和纪晓芙订有婚约的是谁？A.范遥B.杨逍C.张翠山D.殷梨亭",
            answer = "殷梨亭"
        },
        [1232] = {
            ID = 1232,
            topic = "下列哪一部不是金庸的小说A.倚天屠龙记B.白马啸西风C.书剑恩仇录D.流星蝴蝶剑",
            answer = "流星蝴蝶剑"
        },
        [1233] = {
            ID = 1233,
            topic = "瑛姑在哪里第一次遇见了周伯通A.黑龙潭B.全真教C.天山D.大理国",
            answer = "大理国"
        },
        [1234] = {
            ID = 1234,
            topic = "周伯通，瑛姑，一灯三人最后在哪里隐居A.桃花岛B.黑龙潭C.终南山D.百花谷",
            answer = "百花谷"
        },
        [1235] = {
            ID = 1235,
            topic = "九花玉露丸是谁的独创灵药A.瑛姑B.黄蓉C.王重阳D.黄药师",
            answer = "黄药师"
        },
        [1236] = {
            ID = 1236,
            topic = "倚天屠龙记中阳顶天死在了哪里？A.枯井B.密室C.峨眉D.密道",
            answer = "密道"
        },
        [1237] = {
            ID = 1237,
            topic = "宋青书没有加入过那个帮派A.丐帮B.武当C.峨眉D.明教",
            answer = "明教"
        },
        [1238] = {
            ID = 1238,
            topic = "郭靖在草原时，喜欢郭靖的女子是谁？A.包惜弱B.穆念慈C.黄蓉D.华筝",
            answer = "华筝"
        },
        [1239] = {
            ID = 1239,
            topic = "郭靖的母亲是谁？A.没有B.包惜弱C.冯蘅D.李萍",
            answer = "李萍"
        },
        [1240] = {
            ID = 1240,
            topic = "下列那个不是段正淳的情人A.阮星竹B.甘宝宝C.刀白凤D.慕容夫人",
            answer = "慕容夫人"
        },
        [1241] = {
            ID = 1241,
            topic = "黄蓉在什麽地方中了裘千仞的铁砂掌A.桃花岛B.终南山C.草原D.铁掌山",
            answer = "铁掌山"
        },
        [1242] = {
            ID = 1242,
            topic = "射雕中成吉思汗临死前一直念叨着什麽A.弓箭B.华筝C.金雕D.英雄",
            answer = "英雄"
        },
        [1243] = {
            ID = 1243,
            topic = "郭靖有几位师父?A.5B.7C.6D.8",
            answer = "8"
        },
        [1244] = {
            ID = 1244,
            topic = "段誉和阿朱是什麽关系？A.没有关系 B.情人C.夫妻D.兄妹",
            answer = "兄妹"
        },
        [1245] = {
            ID = 1245,
            topic = "武当七侠中的一侠是谁？ A.张松溪B.张翠山C.俞岱岩D.宋远桥",
            answer = "宋远桥"
        },
        [1246] = {
            ID = 1246,
            topic = "朱聪偷杨康怀里的鞋子质地是A.布B.玛瑙C.宝石D.翡翠",
            answer = "翡翠"
        },
        [1247] = {
            ID = 1247,
            topic = "洪七公传授郭靖第二招为A.潜龙勿用B.亢龙有悔C.神龙摆尾D.飞龙在天",
            answer = "飞龙在天"
        },
        [1248] = {
            ID = 1248,
            topic = "杨康珍藏的小鞋正面鞋底字是A.杨B.过C.穆D.比",
            answer = "比"
        },
        [1249] = {
            ID = 1249,
            topic = "第一次华山论剑后天下第一是谁A.一灯B.欧阳锋C.林朝英D.王重阳",
            answer = "王重阳"
        },
        [1250] = {
            ID = 1250,
            topic = "华山论剑第一次在何时A.北宋末年B.南宋末年C.北宋初年D.南宋初年",
            answer = "南宋初年"
        },
        [1251] = {
            ID = 1251,
            topic = "郭靖擒裘千丈，点中他的什麽穴道A.神庭穴B.百会穴C.太阳穴D.天突穴",
            answer = "天突穴"
        },
        [1252] = {
            ID = 1252,
            topic = "韦小宝的妈妈叫什麽名字A.韦春B.韦春儿C.韦春天D.韦春花",
            answer = "韦春花"
        },
        [1253] = {
            ID = 1253,
            topic = "铁掌帮帮主是谁？A.柯镇恶B.裘千尺C.段天德D.裘千仞",
            answer = "裘千仞"
        },
        [1254] = {
            ID = 1254,
            topic = "下列那一项不是古墓派的秘笈？A.捕雀功B.玉女剑法C.美女拳法D.金雁功",
            answer = "金雁功"
        },
        [1255] = {
            ID = 1255,
            topic = "杨过占了寒玉床，小龙女睡在什麽上？A.普通床B.寒玉床C.地上D.绳子",
            answer = "绳子"
        },
        [1256] = {
            ID = 1256,
            topic = "古墓的建造者是谁A.孙婆婆B.林朝英C.丘处机D.王重阳",
            answer = "王重阳"
        },
        [1257] = {
            ID = 1257,
            topic = "神雕侠侣原着中霍都喜欢什麽样的武器？A.铁枪B.狼牙棒C.虎头刀D.扇子",
            answer = "扇子"
        },
        [1258] = {
            ID = 1258,
            topic = "神雕侠侣原着中柯镇恶是江南七怪第几怪？A.7B.5C.2D.1",
            answer = "1"
        },
        [1259] = {
            ID = 1259,
            topic = "神雕侠侣原着中杨过在雕兄身上学会了什麽武功？A.神照心经B.黯然销魂掌C.玉女心经D.独孤九剑",
            answer = "独孤九剑"
        },
        [1260] = {
            ID = 1260,
            topic = "下列哪个不是全真七子A.马钰B.丘处机C.王处一D.尹志平",
            answer = "尹志平"
        },
        [1261] = {
            ID = 1261,
            topic = "李莫愁为什麽灭陆家满门A.因为爱情B.因为仇恨C.没有原因D.因爱生恨",
            answer = "因爱生恨"
        },
        [1262] = {
            ID = 1262,
            topic = "杨过用什麽武功击败了金轮法王A.全真剑法B.独孤九剑C.玉女剑法D.黯然销魂掌",
            answer = "黯然销魂掌"
        },
        [1263] = {
            ID = 1263,
            topic = "新五绝之中没有谁？A.杨过B.黄药师C.周伯通D.王重阳",
            answer = "王重阳"
        },
        [1264] = {
            ID = 1264,
            topic = "郭襄15岁时，杨过送了她什麽礼物A.没有礼物B.玄铁重剑C.紫薇软剑D.三枚金针",
            answer = "三枚金针"
        },
        [1265] = {
            ID = 1265,
            topic = "倚天剑和屠龙刀中藏了什麽秘笈A.嫁衣神功B.九阳神功C.洗髓经D.九阴真经",
            answer = "九阴真经"
        },
        [1266] = {
            ID = 1266,
            topic = "郭靖在第三次华山论剑后，成为新五绝之一，他的名号是什麽？A.南斗B.北斗C.南侠D.北侠",
            answer = "北侠"
        },
        [1267] = {
            ID = 1267,
            topic = "张无忌和赵敏最后去了哪里？A.不知道B.波斯C.桃花岛D.蒙古",
            answer = "蒙古"
        },
        [1268] = {
            ID = 1268,
            topic = "张无忌将武穆遗书给了谁？A.周芷若B.朱元璋C.赵敏D.徐达",
            answer = "徐达"
        },
        [1269] = {
            ID = 1269,
            topic = "谢逊在哪里潜心研究屠龙刀的秘密？A.光明顶B.桃花岛C.灵蛇岛D.冰火岛",
            answer = "冰火岛"
        },
        [1270] = {
            ID = 1270,
            topic = "张无忌和周芷若的初吻发生在哪里？A.冰火岛B.光明顶C.峨眉D.灵蛇岛",
            answer = "灵蛇岛"
        },
        [1271] = {
            ID = 1271,
            topic = "明教总教在哪里？A.印度B.光明顶C.蒙古D.波斯",
            answer = "波斯"
        },
        [1272] = {
            ID = 1272,
            topic = "张无忌和赵敏因为谁的原因没有拜堂成亲？A.殷离B.小昭C.蛛儿D.周芷若",
            answer = "周芷若"
        },
        [1273] = {
            ID = 1273,
            topic = "郭靖和黄蓉第一次见面是在哪里？A.赵家口B.王家口C.李家口D.张家口",
            answer = "张家口"
        },
        [1274] = {
            ID = 1274,
            topic = "杨康被黄蓉用什麽所杀？A.打狗棒B.剑C.刀D.蛇毒",
            answer = "蛇毒"
        },
        [1275] = {
            ID = 1275,
            topic = "下列那个不是郭靖和黄蓉的子女A.郭芙B.郭破虏C.郭襄D.郭德纲",
            answer = "郭德纲"
        },
        [1276] = {
            ID = 1276,
            topic = "梅超风死在了谁的手上？A.黄老邪B.郭靖C.洪七公D.欧阳锋",
            answer = "欧阳锋"
        },
        [1277] = {
            ID = 1277,
            topic = "洪七公为什麽只有九个手指？A.欠债被砍B.比武被砍C.天生如此D.惩戒自己",
            answer = "惩戒自己"
        },
        [1278] = {
            ID = 1278,
            topic = "乔峰是第几代丐帮帮主？A.8B.7C.5D.6",
            answer = "6"
        },
        [1279] = {
            ID = 1279,
            topic = "欲练神功，引刀自宫是哪一门绝学？A.神照心经B.九阴真经C.嫁衣神功D.葵花宝典",
            answer = "葵花宝典"
        },
        [1280] = {
            ID = 1280,
            topic = "日月神教的独门暗器是什麽？A.无影神针B.冰魄银针C.含沙射影D.黑血神针",
            answer = "黑血神针"
        }
    }
}