local Items = {
	{q_id = 'a1',q_event = 1,q_probability = 70,q_word = '{"自己挖矿好累啊!有没有快一些的法子呢？","喂！那个眼睛不老实的，你瞅啥？","你个歪鼻子+三角眼，瞅你咋地？","你说啥？有种大声点？你再说一遍试试？","旁边似乎有个肥羊啊……","喂，我说，要不要一起把那个新来的……"}',},
	{q_id = 'a2',q_event = 2,q_probability = 70,q_word = '{"对不住了！只怪你包里的矿石太闪眼！","谁让你挖的快呢？大爷我不高兴了！","把矿石交出来，就给你个痛快的！","终于养肥了！大爷我等不及了！让你知道这块地跟谁姓！"}',},
	{q_id = 'a3',q_event = 3,q_probability = 100,q_word = '{"看起来你最弱，就那你开刀！","哈哈，还是守株待兔来的轻松啊！"}',},
	{q_id = 'a4',q_event = 4,q_probability = 30,q_word = '{"我的矿石……不……","十八年后，又是一条好……噗……","咱们……走……走着……瞧……","算……我看……走眼……","你这家伙……怎么……这么厉害……"}',},
	{q_id = 'a5',q_event = 5,q_probability = 100,q_word = '{"这些宵小，真是目光短浅！","这是战备物资，有我在，你们休想得逞！","中州也不太平了啊！人心的堕落，比魔族入侵更可怕！"}',},
	{q_id = 'a6',q_event = 6,q_probability = 35,q_word = '{"弟兄们，跟我冲啊！","肥羊来啦！抢钱！抢药！抢装备！","大伙上啊！干完这一票，就能回老家娶媳妇啦！"}',},
	{q_id = 'a7',q_event = 7,q_probability = 25,q_word = '{"十八年后，又是一条好……噗……","咱们……走……走着……瞧……","算……我看……走眼……","你这家伙……怎么……这么厉害……"}',},
	{q_id = 'a8',q_event = 8,q_probability = 70,q_word = '{"对面不弱，我好像开始紧张了！","深呼吸……呼……呼……","要小心，若是被三个人集火，要快速拉开距离！"}',},
	{q_id = 'a9',q_event = 9,q_probability = 30,q_word = '{"吃我一招！","让你见识见识我的厉害！","有种正面硬钢啊！","我的热血开始沸腾！"}',},
	{q_id = 'a10',q_event = 10,q_probability = 100,q_word = '{"就是现在！大家集中攻击他！"}',},
	{q_id = 'a11',q_event = 11,q_probability = 50,q_word = '{"哎，大意了！早知道先去强化装备了！","有种别跑，待会再来一局！","哎呀！忘记喝药了！"}',},
};
return Items
