-- Automatically generated, do not edit
Config = Config or {}
Config.db_version_num = {
 ["0"]  = {channel_id=[[0]], display=1, des=[[Default Info]], version_str=[[]], notice=[[Boycott bad games and say no to piracy. Protect yourself against frauds.]]},
 ["develop"]  = {channel_id=[[develop]], display=1, des=[[Development Server plate number intro]], version_str=[[]], notice=[[Boycott bad games and say no to piracy. Protect yourself against frauds.]]},
 ["112803"]  = {channel_id=[[112803]], display=1, des=[[经典安卓1]], version_str=[[]], notice=[[Boycott bad games and say no to piracy. Protect yourself against frauds.]]},
 ["112806"]  = {channel_id=[[112806]], display=1, des=[[经典安卓2]], version_str=[[]], notice=[[Boycott bad games and say no to piracy. Protect yourself against frauds.]]},
 ["112807"]  = {channel_id=[[112807]], display=1, des=[[经典安卓3]], version_str=[[]], notice=[[Boycott bad games and say no to piracy. Protect yourself against frauds.]]},
 ["112809"]  = {channel_id=[[112809]], display=1, des=[[经典ysdk1]], version_str=[[]], notice=[[Boycott bad games and say no to piracy. Protect yourself against frauds.]]},
 ["112981"]  = {channel_id=[[112981]], display=1, des=[[经典ysdk2]], version_str=[[审批文号：新出审字【2018】1391号  出版物号：ISBN 978-7-498-03751-0 运营单位：上海触萌网络科技有限公司  
著作权单位：广州君海网络科技有限公司 出版单位：上海科学技术文献出版社有限公司]], notice=[[Boycott bad games and say no to piracy. Protect yourself against frauds.]]},
 ["112982"]  = {channel_id=[[112982]], display=1, des=[[经典ysdk3]], version_str=[[审批文号：新出审字【2017】1213号  出版物号：ISBN 978-7-498-03129-7 运营单位：上海触萌网络科技有限公司  
著作权单位：广州赫墨拉信息科技有限公司 出版单位：上海绿岸网络科技股份有限公司]], notice=[[Boycott bad games and say no to piracy. Protect yourself against frauds.]]},
 ["114104"]  = {channel_id=[[114104]], display=1, des=[[幻兽大陆的版号信息]], version_str=[[审批文号：科技与数字[2011]395号  出版物号：ISBN 978-7-7979-4717-8 运营单位：上海游爱数码科技有限公司  
著作权单位：上海游爱数码科技有限公司 出版单位：浦东电子出版社]], notice=[[Boycott bad games and say no to piracy. Protect yourself against frauds.]]},
 ["114114"]  = {channel_id=[[114114]], display=1, des=[[幻兽大陆的版号信息-ios]], version_str=[[审批文号：科技与数字[2011]395号  出版物号：ISBN 978-7-7979-4717-8 运营单位：上海游爱数码科技有限公司  
著作权单位：上海游爱数码科技有限公司 出版单位：浦东电子出版社]], notice=[[Boycott bad games and say no to piracy. Protect yourself against frauds.]]},
 ["111648"]  = {channel_id=[[111648]], display=1, des=[[4.14国内包]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1  出版服务单位名称：上海科学技术文献出版社有限公司 
 游戏著作权人：广州星湾网络科技有限公司；广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114510"]  = {channel_id=[[114510]], display=1, des=[[魅族安卓1]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1   出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114522"]  = {channel_id=[[114522]], display=1, des=[[oppo安卓1]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1   出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114523"]  = {channel_id=[[114523]], display=1, des=[[vivo安卓1]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1   出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114545"]  = {channel_id=[[114545]], display=1, des=[[华为安卓1]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1   出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114525"]  = {channel_id=[[114525]], display=1, des=[[小米安卓1]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1   出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114526"]  = {channel_id=[[114526]], display=1, des=[[奇虎360安卓1]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1   出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114527"]  = {channel_id=[[114527]], display=1, des=[[金立安卓1]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1   出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114528"]  = {channel_id=[[114528]], display=1, des=[[努比亚安卓1]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1   出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114529"]  = {channel_id=[[114529]], display=1, des=[[酷派安卓1]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1   出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114530"]  = {channel_id=[[114530]], display=1, des=[[应用宝安卓1]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1   出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114531"]  = {channel_id=[[114531]], display=1, des=[[九游uc安卓1]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1   出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114532"]  = {channel_id=[[114532]], display=1, des=[[哔哩哔哩安卓1]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1   出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114559"]  = {channel_id=[[114559]], display=1, des=[[应用宝新增]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1   出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114678"]  = {channel_id=[[114678]], display=2, des=[[汇智众通越狱1]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1   出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114692"]  = {channel_id=[[114692]], display=1, des=[[多游安卓1]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1   出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114695"]  = {channel_id=[[114695]], display=1, des=[[汇智众通安卓1]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1   出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114759"]  = {channel_id=[[114759]], display=1, des=[[八加一安卓1]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1   出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114693"]  = {channel_id=[[114693]], display=1, des=[[峰宏安卓1]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1   出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114623"]  = {channel_id=[[114623]], display=1, des=[[峰宏越狱1]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1   出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114626"]  = {channel_id=[[114626]], display=1, des=[[峰宏正版1]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1   出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114778"]  = {channel_id=[[114778]], display=1, des=[[快接(3011)安卓1]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1   出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114739"]  = {channel_id=[[114739]], display=1, des=[[游境-大臣安卓1]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1   出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114815"]  = {channel_id=[[114815]], display=1, des=[[宜游安卓1]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1   出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114827"]  = {channel_id=[[114827]], display=1, des=[[游镜-小七]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1   出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114893"]  = {channel_id=[[114893]], display=1, des=[[游境-TT语音越狱]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1  出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114894"]  = {channel_id=[[114894]], display=1, des=[[游境-游戏fan越狱]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1  出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114895"]  = {channel_id=[[114895]], display=1, des=[[游境-桃子游戏越狱]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1  出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114896"]  = {channel_id=[[114896]], display=1, des=[[游境-曼巴越狱]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1  出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114897"]  = {channel_id=[[114897]], display=1, des=[[游境-哥们越狱]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1  出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114898"]  = {channel_id=[[114898]], display=1, des=[[游境-哪吒越狱]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1  出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114899"]  = {channel_id=[[114899]], display=1, des=[[游境-重庆越狱]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1  出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114900"]  = {channel_id=[[114900]], display=1, des=[[游境-魔豆越狱]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1  出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["115036"]  = {channel_id=[[115036]], display=0, des=[[坚果安卓2-幻兽大陆]], version_str=[[登记号：科技与数字[2011]395号        文号：科技与数字[2011]395号 ISBN 978-7-7979-4717-8   出版单位：浦东电子出版社
软著作权人：上海游爱数码科技有限公司  ]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["115100"]  = {channel_id=[[115100]], display=1, des=[[果盘]], version_str=[[登记号：科技与数字[2011]395号        文号：科技与数字[2011]395号 ISBN 978-7-7979-4717-8   出版单位：浦东电子出版社
软著作权人：上海游爱数码科技有限公司  ]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["115072"]  = {channel_id=[[115072]], display=0, des=[[坚果-游戏fan]], version_str=[[登记号：科技与数字[2011]395号        文号：科技与数字[2011]395号 ISBN 978-7-7979-4717-8   出版单位：浦东电子出版社
软著作权人：上海游爱数码科技有限公司  ]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["115101"]  = {channel_id=[[115101]], display=1, des=[[久游堂]], version_str=[[登记号：科技与数字[2011]395号        文号：科技与数字[2011]395号 ISBN 978-7-7979-4717-8   出版单位：浦东电子出版社
软著作权人：上海游爱数码科技有限公司  ]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["115071"]  = {channel_id=[[115071]], display=0, des=[[坚果-九妖]], version_str=[[登记号：科技与数字[2011]395号        文号：科技与数字[2011]395号 ISBN 978-7-7979-4717-8   出版单位：浦东电子出版社
软著作权人：上海游爱数码科技有限公司  ]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["115073"]  = {channel_id=[[115073]], display=0, des=[[坚果-277]], version_str=[[登记号：科技与数字[2011]395号        文号：科技与数字[2011]395号 ISBN 978-7-7979-4717-8   出版单位：浦东电子出版社
软著作权人：上海游爱数码科技有限公司  ]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114861"]  = {channel_id=[[114861]], display=1, des=[[火箭聚合安卓1]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1  出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114878"]  = {channel_id=[[114878]], display=1, des=[[简玩安卓1]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1   出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["114959"]  = {channel_id=[[114959]], display=1, des=[[简玩越狱1]], version_str=[[批准文号：国新出审[2020]725号  网络游戏出版物号：ISBN 978-7-498-07545-1   出版服务单位名称：上海科学技术文献出版社有限公司
游戏著作权人：广州星湾网络科技有限公司、广州君海网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["115300"]  = {channel_id=[[115300]], display=1, des=[[奇侠传OL]], version_str=[[文号：	科技与数字[2010]225号   网络游戏出版物号：  ISBN 978-5-7979-4521-1   出版单位：深圳华强智能技术有限公司
软著作权人：深圳市巨蛋网络科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["115352"]  = {channel_id=[[115352]], display=1, des=[[最终契约（坚果安卓4）]], version_str=[[文号：新广出审[2017]195号    网络游戏出版物号： ISBN 978-7-7979-3766-5  出版单位：上海方寸信息科技有限公司
软件著作权人：广州位面信息科技有限公司]], notice=[[请勿相信游戏内的折扣，返现，返币等虚假信息，否则后果自负！
抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。]]},
 ["dy101"]  = {channel_id=[[dy101]], display=1, des=[[点悦常规安卓《幻龙战记》]], version_str=[[文号：科技与数字[2011]077号    网络游戏出版物号：ISBN 978-7-89328-304-6  出版单位：北京艺术与科学电子出版社
软件著作权人：杭州大熊科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["51"]  = {channel_id=[[51]], display=1, des=[[点悦常规IOS果盘《幻龙战记》]], version_str=[[文号：科技与数字[2011]077号    网络游戏出版物号：ISBN 978-7-89328-304-6  出版单位：北京艺术与科学电子出版社
软件著作权人：杭州大熊科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["478"]  = {channel_id=[[478]], display=1, des=[[点悦常规IOS游戏Fan《幻龙战记》]], version_str=[[文号：科技与数字[2011]077号    网络游戏出版物号：ISBN 978-7-89328-304-6  出版单位：北京艺术与科学电子出版社
软件著作权人：杭州大熊科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["956"]  = {channel_id=[[956]], display=1, des=[[点悦常规IOS曼巴《幻龙战记》]], version_str=[[文号：科技与数字[2011]077号    网络游戏出版物号：ISBN 978-7-89328-304-6  出版单位：北京艺术与科学电子出版社
软件著作权人：杭州大熊科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["1454"]  = {channel_id=[[1454]], display=1, des=[[点悦常规IOS可盘游戏《幻龙战记》]], version_str=[[文号：科技与数字[2011]077号    网络游戏出版物号：ISBN 978-7-89328-304-6  出版单位：北京艺术与科学电子出版社
软件著作权人：杭州大熊科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]},
 ["1519"]  = {channel_id=[[1519]], display=1, des=[[点悦常规IOS重庆星游《幻龙战记》]], version_str=[[文号：科技与数字[2011]077号    网络游戏出版物号：ISBN 978-7-89328-304-6  出版单位：北京艺术与科学电子出版社
软件著作权人：杭州大熊科技有限公司]], notice=[[抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。
本网络游戏适合16周岁以上的用户使用。为了您的健康，请合理控制游戏时间。]]}
}
