-- Automatically generated, do not edit
Config = Config or {}
Config.db_welfare_notice_reward = {
 [1]  = {id=1, name=[[Update Notice]], content=[[Hi~亲爱的勇士： 
《荣耀召唤》将于8月7日10点——8月14日(星期三)12:00进行精英测试，每日12点、18点、21点将会不定期进行钻石等福利的发放哦！若期间有遇到游戏问题，可联系玩家群客服进行提交，如有优化建议、问题反馈均有游戏礼包领取哦！
本次测试内容不代表最终游戏版本内容，我们会进行更努力的调优哒！
感谢您对游戏的支持与热爱，祝您生活愉快！

《荣耀召唤》官方运营团队
 ]], reward=[[{{11140,2,1},{10015,2,1},{55000,5,1}}]], start_time=[[2019-01-14 00:00:00]], end_time=[[2020-01-16 23:59:59]], state=1},
 [2]  = {id=2, name=[[Info]], content=[[1. 未成年人玩家（18周岁以下）在上线进行游戏时，每过一个小时都会收到系统的防沉迷信息提示
2. 未成年人玩家在线游戏累计3小时后将进入“防沉迷”状态，在游戏中的收益将会减半，同时无法正常交接任务
3. 未成年人玩家在线游戏累计5小时后将进入高度“防沉迷”状态，在游戏中的收益将会为0，同时无法正常交接任务，只有玩家连续离线时间超过5个小时再上线，才会解除防沉迷状态

具体说明：
1. 离线时间和在线时间并不是只计算单次的持续在线或离线时间，都是连续累计计算的。所以您不能通过频繁上下线或者其他办法来规避“防沉迷游戏规则”，同样也不会因为在累积离线时间时又不小心进入一次游戏而导致离线时间重新开始累积。
2. 离线时间和在线时间是根据实际游戏时间和离线时间进行累积。每当累积到3小时的在线时间就会进入”防沉迷”状态，此后不可能再累积到在线时间(因为已经无法进入游戏)。每当累积到5小时的离线时间就会清除之前累积的在线时间或者清除之前的”防沉迷”状态(如果之前已经进入”防沉迷”状态)。
3. 离线时间如果超过5小时以上就不再累计。也就是说不能通过1次休息15个小时来实现连续玩9小时的游戏模式。
4. 离线时间和在线时间完全根据真实发生的时长连续累计，不存在固定的累积周期，也就是说不存在一天中每8个小时为一周期开始重新累积的情况，也不存在每到新的一天开始重新累积的情况。
5. 由于身份证号和真实姓名是标识会员账户所有权的重要依据，今后若有账号被盗等有关账号归属权纠纷的问题，都需要提供有效身份证明等依据来帮助找回会员账号。所以请广大玩家务必按照个人的真实情况进行注册或修改，以免日后带来不必要的麻烦。]], reward=[[{}]], start_time=[[2019-01-14 00:00:00]], end_time=[[2020-01-16 23:59:59]], state=1},
 [3]  = {id=3, name=[[Joyful Game Intro]], content=[[祝您游戏愉快，生活愉快，生活美满！
祝您游戏愉快，生活愉快，生活美满！
祝您游戏愉快，生活愉快，生活美满！
祝您游戏愉快，生活愉快，生活美满！
祝您游戏愉快，生活愉快，生活美满！
祝您游戏愉快，生活愉快，生活美满！祝您游戏愉快，生活愉快，生活美满！
祝您游戏愉快，生活愉快，生活美满！
祝您游戏愉快，生活愉快，生活美满！
祝您游戏愉快，生活愉快，生活美满！
祝您游戏愉快，生活愉快，生活美满！
祝您游戏愉快，生活愉快，生活美满！祝您游戏愉快，生活愉快，生活美满！
祝您游戏愉快，生活愉快，生活美满！
祝您游戏愉快，生活愉快，生活美满！
祝您游戏愉快，生活愉快，生活美满！
祝您游戏愉快，生活愉快，生活美满！
祝您游戏愉快，生活愉快，生活美满！]], reward=[[{}]], start_time=[[2019-01-14 00:00:00]], end_time=[[2020-01-16 23:59:59]], state=1}
}
