--[[
	id:int#编号
	name:string#活动名称
	des:string[]#活动描述
	startDate:string#活动开启时间（闭区间）(yyyy-MM-dd hh:59:59)
	endDate:string#活动结束时间（开区间）(yyyy-MM-dd hh:59:59)
	rewardStr:int[]#奖励ID（与reward对应）
]]

local cfg={
	[101]={
		id=101,
		name="",
		des={"价值580","价值2300","价值9000"},
		startDate="2018-10-25 00:00:00",
		endDate="2018-11-01 00:00:00",
		rewardStr={1101,1102,1103}
	},
	[102]={
		id=102,
		name="",
		des={"价值580","价值2300","价值9000"},
		startDate="2018-11-01 00:00:00",
		endDate="2018-11-08 00:00:00",
		rewardStr={1104,1105,1106}
	},
	[103]={
		id=103,
		name="",
		des={"价值580","价值2300","价值9000"},
		startDate="2018-11-08 00:00:00",
		endDate="2018-11-16 00:00:00",
		rewardStr={1104,1105,1106}
	},
	[104]={
		id=104,
		name="",
		des={"价值580","价值2300","价值9000"},
		startDate="2018-11-16 00:00:00",
		endDate="2018-11-24 00:00:00",
		rewardStr={1101,1102,1103}
	},
	[105]={
		id=105,
		name="",
		des={"价值580","价值2300","价值9000"},
		startDate="2018-11-24 00:00:00",
		endDate="2018-12-01 00:00:00",
		rewardStr={1104,1105,1106}
	},
	[106]={
		id=106,
		name="",
		des={"价值580","价值2300","价值9000"},
		startDate="2018-12-01 00:00:00",
		endDate="2018-12-08 00:00:00",
		rewardStr={1101,1102,1103}
	},
	[107]={
		id=107,
		name="",
		des={"价值580","价值2300","价值9000"},
		startDate="2018-12-08 00:00:00",
		endDate="2018-12-16 00:00:00",
		rewardStr={1104,1105,1106}
	},
	[108]={
		id=108,
		name="",
		des={"价值580","价值2300","价值9000"},
		startDate="2018-12-16 00:00:00",
		endDate="2018-12-24 00:00:00",
		rewardStr={1101,1102,1103}
	},
	[109]={
		id=109,
		name="",
		des={"价值580","价值2300","价值9000"},
		startDate="2018-12-24 00:00:00",
		endDate="2018-12-31 00:00:00",
		rewardStr={1104,1105,1106}
	},
	[110]={
		id=110,
		name="",
		des={"价值580","价值2300","价值9000"},
		startDate="2018-12-31 00:00:00",
		endDate="2019-01-07 00:00:00",
		rewardStr={1101,1102,1103}
	},
	[111]={
		id=111,
		name="",
		des={"价值580","价值2300","价值9000"},
		startDate="2019-01-07 00:00:00",
		endDate="2020-06-07 00:00:00",
		rewardStr={1104,1105,1106}
	}
}

function cfg:Get( key )
	return cfg[key]
end
return cfg