--------------------------------------------------------------------------------------
-- 文件名:	Config_CityMgr.lua
-- 版  权:	(C)深圳美天互动科技有限公司
-- 创建人:	陆奎安
-- 日  期:	2013-2-26 15:24
-- 版  本:	1.0
-- 描  述:	省份和城市的数据
-- 应  用:  
---------------------------------------------------------------------------------------
g_ProvinceCity = 
{
	[1] = 
	{
		Title = "安徽",
		Option = {
			"安庆","蚌埠","毫州","巢湖","池州","滁州","阜阳","淮北","合肥","淮南","黄山","刘安",
			"马鞍山","宿州","铜陵","芜湖","宣城",
		}
	},
	[2] = 
	{
		Title = "澳门",
		Option = {
			"大堂区","氹仔","风顺堂区","花地玛堂区","路环岛圣安多尼堂区","望德堂区"
		}
	},
	[3] = 
	{
		Title = "北京",
		Option = {
			"昌平","朝阳","东城","大兴","房山","丰台","海淀","怀柔","门头沟","密云","平谷","石景山",
			"顺义","通州","西城延庆"
		}
	},
	[4] = 
	{
		Title = "重庆",
		Option = {
			"北碚","巴南","璧山","城口","长寿","大渡口","垫江","大足","丰都","奉节","涪陵","合川","江北",
			"江津","九龙坡","开县","两江新区","梁平","南岸","南川","彭水","綦江","黔江","荣昌","沙坪坝",
			"双桥","石柱","铜梁","潼南","武隆","万盛","巫山","巫溪","万州","秀山","渝北","永川","云阳",
			"酉阳","渝中","忠县"
		}
	},
	[5] = 
	{
		Title = "福建",
		Option = {
			"福州","龙岩","宁德","南平","莆田","泉州","三明","厦门","漳州",
		}
	},
	[6] = 
	{
		Title = "广东",
		Option = {
			"潮州","东莞","佛山","广州","河源","惠州","江门","揭阳","茂名","梅州","清远","韶关","汕头",
			"汕尾","深圳","云浮","阳江","珠海","湛江","肇庆","中山",
		}
	},
	[7] = 
	{
		Title = "甘肃",
		Option = {
			"白银","定西","甘南","金昌","酒泉","嘉峪关","陇南","临夏","兰州","平凉","庆阳","天水","武威","张掖",
		}
	},
	[8] = 
	{
		Title = "广西",
		Option = {
			"北海","百色","崇左","防城港","贵港","桂林","河池","贺州","来宾","柳州","南宁","钦州","梧州","玉林","宾阳",
		}
	},
	[9] = 
	{
		Title = "贵州",
		Option = {
			"安顺","毕节","贵阳","六盘水","黔东南","黔南","黔西南","同仁","遵义",
		}
		
	},
	[10] = 
	{
		Title = "湖北",
		Option = {
			"恩施","鄂州","黄冈","黄石","荆门","荆州","潜江","神农架","十堰","随州","天门","武汉","孝感","咸宁",
			"仙桃","襄阳","宜昌",
		}
	},
	[11] = 
	{
		Title = "河北",
		Option = {
			"保定","承德","沧州","邯郸","衡水","廊坊","秦始皇","石家庄","唐山","邢台","张家口",
		}
	},
	[12] = 
	{
		Title = "黑龙江",
		Option = {
			"大庆","大兴安岭","哈尔滨","鹤岗","黑河","佳木斯","鸡西","牡丹江","齐齐哈尔","七台河","绥化","双鸭山","伊春",
		}
	},
	[13] = 
	{
		Title = "湖南",
		Option = {
			"常德","长沙","郴州","怀化","衡阳","娄底","邵阳","湘潭","湘西","益阳","岳阳","永州","张家界","株洲",
		}
	},
	[14] = 
	{
		Title = "河南",
		Option = {
			"安阳","鹤壁","济源","焦作","开封","漯河","洛阳","南阳","平顶山","濮阳","三门峡",
			"商丘","许昌","新乡","信阳","周口","驻马店","郑州",
		}
	},
	[15] = 
	{
		Title = "海南",
		Option = {
			"白沙","保亭","昌江","澄迈","定安","东方","儋州","海口","乐东","临高","陵水","南沙","琼海",
			"琼中","三亚","屯昌","文昌","万宁","五指山","西沙","中沙",
		}
	},
	[16] = 
	{
		Title = "吉林",
		Option = {
			"白城","白山","长春","吉林","辽源","四平","松原","通化","延边",
		}
	},
	[17] = 
	{
		Title = "江苏",
		Option = {
			"常州","淮安","连云港","南京","南通","宿迁","苏州","泰州","无锡","徐州","盐城","扬州","镇江",
		}
	},
	[18] = 
	{	
		Title = "江西",
		Option = {
			"抚州","赣州","吉安","景德镇","九江","南昌","萍乡","上饶","新余","宜春","鹰潭",
		}
		
	},
	[19] = 
	{
		Title = "辽宁",
		Option = {
			"鞍山","本溪","朝阳","丹东","大连","抚顺","阜新","葫芦岛","锦州","辽阳","盘锦","沈阳","铁岭","营口",
		}
	},
	[20] = 
	{
		Title = "内蒙古",
		Option = {
			"阿拉善","包头","巴彦淖尔","赤峰","鄂尔多斯","呼和浩特","呼伦贝尔","通辽","乌海","乌兰察市","兴安","锡林郭勒",
		}
	},
	[21] = 
	{
		Title = "宁夏",
		Option = {
			"固原","石嘴山","吴忠","银川","中卫",
		}
	},
	[22] = 
	{
		Title = "青海",
		Option = {
			"果洛","海北","海东","黄南","海南","海西","西宁","玉树",
		}
	},
	[23] = 
	{
		Title = "四川",
		Option = {
			"阿坝","巴中","成都","德阳","达州","广安","广元","甘牧","凉山","乐山","泸州","眉山","绵阳",
			"南充","内江","攀枝花","遂宁","雅安","宜宾","自贡","资阳",
		}
	},
	[24] = 
	{
		Title = "山东",
		Option = {
			"滨州","东营","德州","菏泽","济南","济宁","聊城","莱芜","临沂","青岛","日照",
			"泰安","潍坊","威海","烟台","淄博","枣庄",
		}
	},
	[25] = 
	{
		Title = "上海",
		Option = {
			"宝山","崇明","长宁","奉贤","虹口","黄浦","静安","嘉定","金山","卢湾","闵行",
			"浦东","普陀","青浦","松江","徐汇","杨浦","闸北",
		}
	},
	[26] = 
	{
		Title = "陕西",
		Option = {
			"安康","宝鸡","汉中","商洛","铜川","渭南","西安","咸阳","延安","榆林",
		}
	},
	[27] = 
	{
		Title = "山西",
		Option = {
			"长治","大同","晋城","晋中","临汾","吕梁","朔州","太原","忻州","运城","阳泉",

		}
	},
	[28] = 
	{
		Title = "天津",
		Option = {
			"北辰","宝坻","滨海","东丽","河北","河东","和平","红桥","河西","静海","津南","蓟县","宁河","南开","武清","西青",
		}
	},
	[29] = 
	{
		Title = "台湾",
		Option = {
			"高雄市","花莲县","基隆市","金门县","嘉义市","嘉义县","连江县","苗栗县","南投县","屏东县","澎湖县",
			"台北市","台东县","台南市","桃园县","台中市","新北市","新竹县","云林县","宜兰县","彰化县",
		}
	},
	[30] = 
	{
		Title = "西藏",
		Option = {
			"阿里","昌都","拉萨","林芝","那曲","日喀则","山南",
		}
	},
	[31] = 
	{
		Title = "香港",
		Option = {
			"北区","大埔区","东区","观塘区","黄大仙区","九龙城区","葵青区","离岛区","南区","荃湾区",
			"深水埗区","沙田区","屯门区","湾仔区","西贡区","油尖旺区","元朗区","中西区",
		}
	},
	[32] = 
	{
		Title = "新疆",
		Option = {
			"阿克苏","阿拉尔","阿勒泰","博尔塔拉","巴音郭楞","昌吉","哈密","和田","克拉玛依","喀什","克孜勒苏",
			"石河子","塔城","吐鲁番","图木舒克","五家渠","乌鲁木齐","伊犁",
		}
	},
	[33] = 
	{
		Title = "云南",
		Option = {
			"保山","楚雄","德宏","大理","迪庆","红河","昆明","临沧","丽江","怒江","普洱","曲靖","文山",
			"西双版纳","玉溪",
		}
	},
	[34] = 
	{
		Title = "浙江",
		Option = {
			"湖州","杭州","金华","嘉兴","丽水","宁波","衢州","绍兴","台州","温州","舟山",
		}
	},
}

g_ProvinceCity_Viet = 
{
	[1] = 
	{
		Title = "Việt Nam",
		Option = {
			"An Giang",
			"Bà Rịa - Vũng Tàu",
			"Bắc Giang",
			"Bắc Kạn",
			"Bạc Liêu",
			"Bắc Ninh",
			"Bến Tre",
			"Bình Định",
			"Bình Dương",
			"Bình Phước",
			"Bình Thuận",
			"Cà Mau",
			"Cao Bằng",
			"Đắk Lắk",
			"Đắk Nông",
			"Điện Biên",
			"Đồng Nai",
			"Đồng Tháp",
			"Gia Lai",
			"Hà Giang",
			"Hà Nam",
			"Hà Tĩnh",
			"Hải Dương",
			"Hậu Giang",
			"Hòa Bình",
			"Hưng Yên",
			"Khánh Hòa",
			"Kiên Giang",
			"Kon Tum",
			"Lai Châu",
			"Lâm Đồng",
			"Lạng Sơn",
			"Lào Cai",
			"Long An",
			"Nam Định",
			"Nghệ An",
			"Ninh Bình",
			"Ninh Thuận",
			"Phú Thọ",
			"Quảng Bình",
			"Quảng Nam",
			"Quảng Ngãi",
			"Quảng Ninh",
			"Quảng Trị",
			"Sóc Trăng",
			"Sơn La",
			"Tây Ninh",
			"Thái Bình",
			"Thái Nguyên",
			"Thanh Hóa",
			"Thừa Thiên Huế",
			"Tiền Giang",
			"Trà Vinh",
			"Tuyên Quang",
			"Vĩnh Long",
			"Vĩnh Phúc",
			"Yên Bái",
			"Phú Yên",
			"Cần Thơ",
			"Đà Nẵng",
			"Hải Phòng",
			"Hà Nội",
			"TP HCM",
		}
	},
}

g_ProvinceCity_Taiwan = 
{
	[1] = 
	{
		Title = "臺灣",
		Option = {
			"高雄市","花蓮縣","基隆市","金門縣","嘉義市","嘉義縣","連江縣","苗栗縣","南投縣","屏東縣","澎湖縣",
			"臺北市","台東縣","台南市","桃園縣","台中市","新北市","新竹縣","雲林縣","宜蘭縣","彰化縣",
		}
	},
	[2] = 
	{
		Title = "香港",
		Option = {
			"北區","大埔區","東區","觀塘區","黃大仙區","九龍城區","葵青區","離島區","南區","荃灣區",
			"深水埗區","沙田區","屯門區","灣仔區","西貢區","油尖旺區","元朗區","中西區",
		}
	},
	[3] = 
	{
		Title = "澳門",
		Option = {
			"大堂區","氹仔","風順堂區","花地瑪堂區","路環島聖安多尼堂區","望德堂區"
		}
	},
}