--------------------------------------------------------------------------------------
-- 文件名:	Config_Notice.lua
-- 版  权:	(C)深圳美天互动科技有限公司
-- 创建人:	
-- 日  期:	
-- 版  本:	1.0
-- 描  述:	
-- 应  用:  
 
---------------------------------------------------------------------------------------


-- "#00"] = ccc3(255, 255, 255),	--白色/white
-- "#01"] = ccc3(180, 180, 180),	--灰色/gray
-- "#02"] = ccc3(35, 220, 55),		--深绿/deep green
-- "#03"] = ccc3(0, 191, 255),		--深蓝/deep blue
-- "#04"] = ccc3(255, 0, 255),		--洋红/fuchsin
-- "#05"] = ccc3(255, 241, 0),		--金色/gold
-- "#06"] = ccc3(255, 0, 0),		--纯红/red
-- "#07"] = ccc3(255, 255, 255),	--白色/white
-- "#08"] = ccc3(144, 238, 144),	--浅绿/lime green
-- "#09"] = ccc3(135, 206, 250),	--浅蓝/light blue
-- "#10"] = ccc3(238, 130, 238),	--粉色/pink
-- "#11"] = ccc3(153, 50, 204),		--紫色/purple
-- "#12"] = ccc3(207, 181, 59),		--暗金色/dark gold
-- "#13"] = ccc3(255, 140, 0),		--橙色/orange
-- "#14"] = ccc3(255, 69, 0),		--橘红/red orange
-- "#15"] = ccc3(255, 20, 147),		--深粉/deep pink
-- "#16"] = ccc3(245, 222, 179),	--麦色/wheat
-- "#17"] = ccc3(255, 184, 17),		--橙色/light orange
-- "#18"] = ccc3(181, 174, 156),	--暗黄/dark yellow
-- "#19"] = ccc3(205, 92, 92),		--印度红/india red
-- "#20"] = ccc3(50, 255, 50),		--亮绿/light green
-- "#21"] = ccc3(100, 100, 100),	--灰色/deep gray
-- "#22"] = ccc3(0, 255, 0),		--绿色/green

--系统公告
--每行最多34个汉字

gNoticeConfig_China = {
	{
		title = "#05欢迎来到《仙圣奇缘》",
		contentfontsize = 24,
		content = {
			"亲爱的玩家:",
			"欢迎您来到#05《仙圣奇缘》",
			"#10不删档公测已正式开启！",
			"海量开服活动和丰厚奖励助您畅玩！",
			"您在游戏中遇到任何问题可与客服联系！",
			"祝您游戏愉快，创造属于您的仙侠传说！",
			"客服电话:#20 4006668223",
			"客服QQ号:#20 800069894",
			"官方QQ群:#20 306883452(入群签到送礼包！)",
			"客服邮箱:#20 800069894@b.qq.com",
			"",
		},
	},
}

gNoticeConfig_shandang = {
	{
		title = "#05欢迎来到《仙圣奇缘》",
		contentfontsize = 24,
		content = {
			"亲爱的玩家：",
			"欢迎您来到#05《仙圣奇缘》",
			"#10删档封测时间：2016年10月17日0:00 - 2016年10月23日23:59",
			"#10删档封测期间充值可在公测后获得双倍返还#05（不包括月卡和开服基金）！" ,
            "您在游戏中遇到任何问题可与客服联系。",
            "祝您游戏愉快，创造属于您的仙侠传说！",
			"客服电话：#20 4006668223  ",
			"客服QQ号：#20 800069894 ",
			"官方QQ群：#20 544046614（入群签到送礼包！）",
			"客服邮箱:#20 800069894@b.qq.com",
		},
	},
}

gNoticeConfig_China_XiaoXiaoXianSheng = {
	{
		title = "#05欢迎来到《小小仙圣》",
		contentfontsize = 24,
		content = {
			"亲爱的玩家:",
			"欢迎您来到#05《小小仙圣》",
			"#10不删档公测已正式开启！",
			"海量开服活动和丰厚奖励助您畅玩！",
			"您在游戏中遇到任何问题可与客服联系！",
			"祝您游戏愉快，创造属于您的仙侠传说！",
			"客服电话:#20 4006668223",
			"客服QQ号:#20 800069894",
			"官方QQ群:#20 151251778(入群签到送礼包！)",
			"客服邮箱:#20 800069894@b.qq.com",
			"",
		},
	},
}

