--------------------------------------------------------------------------------------
-- 文件名:	Config_Notice.lua
-- 版  权:	(C)深圳美天互动科技有限公司
-- 创建人:	
-- 日  期:	
-- 版  本:	1.0
-- 描  述:	
-- 应  用:  
 
---------------------------------------------------------------------------------------


-- "#00"] = ccc3(255, 255, 255),	--白色/white
-- "#01"] = ccc3(180, 180, 180),	--灰色/gray
-- "#02"] = ccc3(35, 220, 55),		--深绿/deep green
-- "#03"] = ccc3(0, 191, 255),		--深蓝/deep blue
-- "#04"] = ccc3(255, 0, 255),		--洋红/fuchsin
-- "#05"] = ccc3(255, 241, 0),		--金色/gold
-- "#06"] = ccc3(255, 0, 0),		--纯红/red
-- "#07"] = ccc3(255, 255, 255),	--白色/white
-- "#08"] = ccc3(144, 238, 144),	--浅绿/lime green
-- "#09"] = ccc3(135, 206, 250),	--浅蓝/light blue
-- "#10"] = ccc3(238, 130, 238),	--粉色/pink
-- "#11"] = ccc3(153, 50, 204),		--紫色/purple
-- "#12"] = ccc3(207, 181, 59),		--暗金色/dark gold
-- "#13"] = ccc3(255, 140, 0),		--橙色/orange
-- "#14"] = ccc3(255, 69, 0),		--橘红/red orange
-- "#15"] = ccc3(255, 20, 147),		--深粉/deep pink
-- "#16"] = ccc3(245, 222, 179),	--麦色/wheat
-- "#17"] = ccc3(255, 184, 17),		--橙色/light orange
-- "#18"] = ccc3(181, 174, 156),	--暗黄/dark yellow
-- "#19"] = ccc3(205, 92, 92),		--印度红/india red
-- "#20"] = ccc3(50, 255, 50),		--亮绿/light green
-- "#21"] = ccc3(100, 100, 100),	--灰色/deep gray
-- "#22"] = ccc3(0, 255, 0),		--绿色/green

--系统公告
--每行最多34个汉字
gNoticeConfig_Taiwan = {
	{
		title = "#05逍遙封魔錄最新公告",
		contentfontsize = 24,
    	content = {
			"歡迎來到#05逍遙封魔錄#00。",
			"遊戲將於每#22週四#00進行固定維護。",
			"維護時間：#2011:00 am - 12:00 am#00",
			"為了保障您的權益，#17維護期間請勿嘗試登入避免出現異常。",
			"現在快來活動網頁按讚，就送你按讚禮包。",
			"官方粉絲團：#03https://www.facebook.com/xyfmlgame",
			"定期關注我們粉絲團訊息，各種優惠活動讓你掌握先機。",
			"感謝您對遊戲的支持，祝您遊戲愉快。",
			"",
		},
	},
}

gNoticeConfig_Taiwan_SYL = {
	{
		title = "#05神御靈最新公告",
		contentfontsize = 24,
    	content = {
			"歡迎來到#05神御靈#00。",
			"遊戲將於每#22週四#00進行固定維護。",
			"維護時間：#2011:00 am - 12:00 am#00",
			"為了保障您的權益，#17維護期間請勿嘗試登入避免出現異常。",
			"現在快來活動網頁按讚，就送你按讚禮包。",
			"官方粉絲團：#03https://www.facebook.com/godrivesoul/",
			"定期關注我們粉絲團訊息，各種優惠活動讓你掌握先機。",
			"感謝您對遊戲的支持，祝您遊戲愉快。",
			"",
		},
	},
}