local data_message_message = {
  [1] = {
    id = 1,
    text = "侠客数量不足",
    remarks = "卡牌强化时，背包中没有可被强化的侠客，点自动添加弹出的提示"
  },
  [2] = {
    id = 2,
    text = "您的侠客背包已满",
    remarks = "侠客残魂合成时，侠客背包已满，点击合成弹出的提示"
  },
  [3] = {
    id = 3,
    text = "您的装备背包已满"
  },
  [4] = {
    id = 4,
    text = "您当前挑战次数已用完"
  },
  [5] = {
    id = 5,
    text = "您今日购买次数已用完，无法购买"
  },
  [6] = {
    id = 6,
    text = "您当前挑战次数未用完，无法购买"
  },
  [7] = {
    id = 7,
    text = "元宝不足"
  },
  [8] = {
    id = 8,
    text = "银币不足"
  },
  [9] = {
    id = 9,
    text = "侠客需要达到"
  },
  [10] = {
    id = 10,
    text = "级才能进阶"
  },
  [11] = {
    id = 11,
    text = "1、炼化后，所炼化物品将会永久消失。\n2、炼化侠客：可炼化4星、5星未进阶侠客，炼化后返还所有强化花费并获得魂玉。\n3、炼化装备：可炼化2星、3星、4星装备，炼化后返还所有强化花费，并根据洗炼属性返还洗炼石。\n4、炼化武学：可炼化5星武学，炼化后返还所有强化所花费的银币，并依据强化武学所消耗的经验值返还经验道具。\n5、精炼过的武学不可炼化。\n6、炼化宠物：未强化的宠物（包含进阶使用的宠物）会依据星级返还一定数量的灵玉，进阶书和银币。强化过的宠物还会返还包含所有经验值的宠物经验丹和部分进阶、强化材料。炼化后的宠物消失。\n7、只有未强化的时装才可以炼化，且限时时装禁止炼化。\n8、所有秘笈均可炼化，炼化秘笈返还所有研习及突破消耗外加基础修为。",
    remarks = "炼化炉说明"
  },
  [12] = {
    id = 12,
    text = "1、每次重生，需要花费一定元宝，所重生的物品不会消失。\n2、重生侠客：可重生4星、5星，强化等级大于1级的侠客，且重生后返还所有强化、进阶花费，重生后的侠客将恢复进阶等级为0阶，等级为1级。\n3、重生装备：可重生4星、5星，强化等级大于0级的装备，且重生后返还所有强化花费，并根据洗炼属性返还洗炼石，重生后的装备将恢复等级为0级，洗炼属性为0。\n4、重生武学：可重生4星、5星武学，强化等级大于0或精炼过的武学，且重生后返还所有强化花费，并返还所有精炼武学所消耗的物品。精炼属性为0。\n5、重生时装：可以重生强化等级大于0的时装，重生后将返还所有翠云彩缎。",
    remarks = "玩家没有放入重生物品、侠客时，点击重生"
  },
  [13] = {
    id = 13,
    text = "该侠客已加锁，不会出现在炼化列表中",
    remarks = "侠客加锁"
  },
  [14] = {
    id = 14,
    text = "该侠客已解锁，可以进行炼化",
    remarks = "侠客解锁"
  },
  [15] = {
    id = 15,
    text = "您没有可更换的装备"
  },
  [16] = {
    id = 16,
    text = "您没有可替换的真气"
  },
  [17] = {
    id = 17,
    text = "1.每次抽取都将获得10点活动积分，活动结束后会根据积分排名发放奖励。\n\n2.每次抽取若没有抽到本次限时侠客，有概率获得幸运值，幸运越高，抽取本次限时侠客的概率越高，当幸运大于等于100时，下次招募必得本次限时侠客。\n\n3.每获得150点活动积分将额外获得高额幸运值。\n\n4.每次抽取时若抽到了本次限时侠客，幸运值将清空为0。\n\n5.活动时间内获得积分超过60，可在活动结束发奖时获得奖励经验妹妹*10、银币*200000、进阶丹*500",
    remarks = "限时豪杰说明"
  },
  [18] = {
    id = 18,
    text = "时间未到，您不能免费抽取",
    remarks = "限时豪杰免费抽取时间未到"
  },
  [19] = {
    id = 19,
    text = "大侠鸿星高照，下次招募必得",
    remarks = "限时豪杰幸运值100"
  },
  [20] = {
    id = 20,
    text = "免费抽取次数用完，下次招募需要消耗元宝",
    remarks = "限时豪杰免费抽取用完"
  },
  [21] = {
    id = 21,
    text = "1.皇宫之中藏有秘宝，玩家每次探宝，随机获得一种奖励物品。每次可以探宝一次或探宝十次。\n2.今日免费次数若当日未使用完，次日不予保留。\n3.活动期间内，每天可获得免费探宝次数。使用探宝十次时，优先扣除免费次数。\n4.黑市中的道具数量有限，先买先得。",
    remarks = "皇宫探宝活动说明"
  },
  [22] = {
    id = 22,
    text = "活动期间内，玩家可用指定兑换材料兑换物品。\n每次刷新时，会刷新指定兑换材料与兑换物品。\n活动结束后，未消耗的兑换材料不会消失。",
    remarks = "限时兑换活动说明"
  },
  [23] = {
    id = 23,
    text = "1.楼兰古城中有神秘宝藏，玩家可选择“挖一次”或“全部挖取”来获得宝藏。\n2.系统每日赠送给玩家3次免费挖宝机会。\n3.使用“全部挖取”可获得宝库中所有的宝藏，花费的元宝价格更划算；全部挖取时将优先消耗免费挖宝次数。\n4.如果您对宝库中的宝物不满意或者想要的宝物都已挖取后，可刷新宝库重置宝库中的奖励。\n5.每隔一段时间都可以获得系统赠送的免费挖宝次数，赠送的免费挖宝次数最多只能积累3次，请尽快使用哦！",
    remarks = "迷宫挖宝活动说明"
  },
  [24] = {
    id = 24,
    text = "免费刷新次数用完，下次刷新需要消耗元宝",
    remarks = "限时兑换免费刷新用完"
  },
  [25] = {
    id = 25,
    text = "1、装备淬炼提高的是装备的属性，包括装备的基础属性、强化属性、洗炼属性。\n2、更换装备后装备淬炼阶数会直接继承。\n3、每次淬炼时都有一定概率直接升阶，淬炼值越高，直接升阶概率越高。",
    remarks = "装备淬炼说明"
  },
  [26] = {
    id = 26,
    text = "畅销团购参与条件：\n\n玩家必需在活动期间充值才能参与畅销团购，充值额度不限",
    remarks = "畅销团购说明"
  },
  [27] = {
    id = 27,
    text = "豪华团购参与条件：\n\n玩家必需在活动期间充值才能参与豪华团购，充值额度不限",
    remarks = "豪华团购说明"
  },
  [28] = {
    id = 28,
    text = "该宠物已加锁，不会出现在吞噬与出售的列表中",
    remarks = "宠物加锁"
  },
  [29] = {
    id = 29,
    text = "该宠物已解锁，可以进行出售与吞噬",
    remarks = "宠物解锁"
  },
  [30] = {
    id = 30,
    text = "宠物需要达到2级才能进阶"
  },
  [31] = {
    id = 31,
    text = "1.天降灵宠，快快点击召唤按钮，稀有宠物、宠物残魂、宠物进阶材料、宠物强化材料、经验宠物应有尽有！\n2.38级以上的侠客每天均可获得1次免费召唤宠物的机会，请一定不要忘记召唤哦！\n3.十连抽必出宠物，手头阔绰的侠客切记多多十连，必有惊喜等着你\n4.选择10连抽时不会消耗免费次数还请诸位侠客放心。",
    remarks = "宠物抽卡说明"
  },
  [32] = {
    id = 32,
	text = "1.活动期间只要充值即可获得积分，每充值1元即可获得10点积分，充值越多，获得积分越多。\n2.活动结束时，未使用完的积分将会清空，还请诸位大侠及时使用您宝贵的积分。",
    --text = "1.活动期间只要充值即可获得积分，每充值1元即可获得10点积分，充值越多，获得积分越多。\n2.活动期间，单次消费满10元宝即可获得1积分，例如在商城中购买黄金钥匙花费25元宝，则可获得2积分，超出的5元宝不计入。\n3.活动结束时，未使用完的积分将会清空，还请诸位大侠及时使用您宝贵的积分。",
    remarks = "积分商城说明"
  },
  [33] = {
    id = 33,
    text = "即日起武侠大宗师与借贷宝开启联合推广活动\n凡是通过点击页面下方按钮下载注册并成功绑定银行卡的用户\n不但可以获得价值20元的借贷宝推广现金\n还可以获得价值200元RMB的武侠大宗师豪华游戏礼包\n礼包包含：元宝*888，黄金宝箱*8，体力丹*8，耐力丹*8，金卡残魂包*8，银币*88888\n点击下载借贷宝\n完成注册并绑定银行卡后，请注意查收您的手机短信，届时礼包兑换码将以短信的形式发送到您的手机上\n在游戏设置界面-礼包兑换处输入礼包兑换码，即可领取价值200元RMB的武侠大宗师豪华游戏礼包\n借贷宝是国内顶级私募机构九鼎控股倾力打造的熟人间借贷平台。以借款人实名、出借人匿名的单向匿名借贷模式，使借款人能够快速获得借款，出借人根据借款人身份主动评估风险，获得更安全的高收益，是你手机上必备的借钱神器，赚钱利器。实现人人办金融，人人都是金融家的梦想。\nQA：\nQ：我没有银行卡可以领取礼包吗？\nA：不绑定银行卡一样可以注册借贷宝并获得20元借贷宝推广现金，但是不能获得武侠大宗师豪华游戏礼包\nQ：我已经注册了借贷宝还能领取游戏礼包吗？\nA：对不起，本次活动仅限未注册过借贷宝的用户，已注册的用户请关注后续活动\nQ：我可以注册多个借贷宝账户领取多个礼包吗？\nA：不可以，每个玩家最多只能兑换一次推广礼包\nQ：完成注册并绑定银行卡后为什么收不到短信？\nA：请稍等，短信的发送可能存在一定的延迟，如果依然收不到短信请联系相关客服\nQ：兑换码怎么使用？\nA：在游戏内的设置界面，点击礼包兑换按钮，在弹出的窗口输入兑换码后点击确定，之后返回首页就可以收到礼包内的道具了",
    remarks = "借贷宝说明"
  },
  [34] = {
    id = 34,
    text = "您的宠物背包已满",
    remarks = "宠物残魂合成时，宠物背包已满，点击合成弹出的提示"
  },
  [35] = {
    id = 35,
    text = "1.幸运大奖池活动期间，您可以通过商城招募侠客或天降灵宠活动中召唤宠物来获取幸运点，并消耗幸运点进行抽奖\n2.每期活动获取幸运点的途径并不相同，本期活动中仅在您通过商城招募且招募“武林高手”和“名震江湖”时方可获得幸运点\n3.当您在商城中通过“武林高手”或“名震江湖”招募侠客时，可根据不同的档次获得不同额度的幸运点；招募“武林高手”每次获得80幸运点，招募“名震江湖”每次280幸运点\n4.使用系统赠送的免费招募次数进行侠客招募时同样可以获得幸运点\n5.活动结束后未用尽的幸运点将全部清空，还请您尽快使用",
    remarks = "幸运奖池说明1"
  },
  [36] = {
    id = 36,
    text = "1.幸运大奖池活动期间，您可以通过商城招募侠客或天降灵宠活动中召唤宠物来获取幸运点，并消耗幸运点进行抽奖\n2.每期活动获取幸运点的途径并不相同，本期活动中仅在您通过天降灵宠活动召唤宠物时方可获得幸运点\n3.当您在天降灵宠活动中召唤宠物时，每次可获得300幸运点，使用十连，则可获得3000幸运点\n4.使用系统赠送的免费召唤次数进行宠物召唤时同样可以获得幸运点\n5.只有38级以上的侠客才能参与天降灵宠活动，等级不足的侠客还需努力升级哦\n6.活动结束后未用尽的幸运点将全部清空，还请您尽快使用",
    remarks = "幸运奖池说明2"
  },
  [37] = {
    id = 37,
    text = "1.钓金鲤每期活动限时开放，活动珍稀道具限量供应，单次钓鱼需消耗300元宝，钓鱼十次将消耗3000元宝。\n2.垂钓将有机会钓得金鲤鱼，金鲤鱼上携带有金色武学、武学秘录、庚金石和青琅玕4种珍稀道具，也可能获得银鲤鱼，银鲤鱼上携带有蕴神、藏魄、大还丹、虎骨丸4种材料。\n3.本期活动鱼塘中共有500条鲤鱼，其中金鲤鱼220条，银鲤鱼280条，全部鲤鱼被钓光后活动结束，将无法继续垂钓。\n4.金鲤鱼身上一次最多只会携带1个道具，而银鲤鱼身上一次可能携带大量同一道具哦。",
    remarks = "钓金鲤活动说明"
  },
  [38] = {
    id = 38,
    text = "1.本期跨服战参与的服务器如下：#v1#\n2.每期跨服战以一周7天为周期，周一10:00到周五22:00为选拔赛阶段。选拔赛阶段中，防守方必然优先出手。选拔赛将会在每晚21:30-22:00结算奖励，奖励结算期间无法进行选拔赛战斗，选拔赛具体奖励可在奖励预览列表中查看。\n3.周五22:00到周日12:00为报名阶段，凡是参与过选拔赛的玩家均可报名，报名期间无法参加跨服战，不报名的将视为放弃参与跨服战决赛。\n4.跨服战决赛从周日12:00开始，先进行淘汰赛，淘汰赛由服务器随机匹配对战，累计负3盘的玩家将出局，最终筛选出16位玩家参与武林至尊组的决赛，并将出局的玩家重新随机匹配，再筛选出16位玩家参与名动江湖组的决赛。\n5.武林至尊组和名动江湖组的决赛同步进行，最终选拔出各自赛组的8强、4强及冠亚军，并在全部比赛结束时发放奖励。\n6.决赛期间可以进行押注来为您认可的选手投票，如果该选手获胜，则押注金额将双倍返还，每轮比赛的每个赛组最多只能押注一名选手。\n7.跨服战处于淘汰赛以及决赛正式比赛阶段时，无法调整阵容。",
    remarks = "常规跨服活动说明"
  },
  [39] = {
    id = 39,
    text = "1.幸运大奖池活动期间，您可以直接使用元宝抽取对应奖池的道具。\n2.抽取时每消耗1元宝就将获得1点幸运点，活动结束后，将根据您幸运点在全服玩家中的排名发放奖励。",
    remarks = "益玩幸运奖池说明"
  },
  [40] = {
    id = 40,
    text = "1.每周三、周六晚8点可参加帮派攻城战。\n2.帮派战持续30分钟，击杀守城神兽或战斗时间达到30分钟，则攻城战结束。\n3.守城神兽会受到东、南、西、北四方的守备军加成，击败守备军可使加成失效。\n4.击败守备军可获得30功勋。\n5.单次战斗中每对守城神兽造成10w伤害可获得15功勋。\n6.在时间结束前，如果成功击败守城神兽则进攻方胜利，功勋最高的帮派占领城池，没能击杀则攻城失败。\n7.只有20级以上的侠客才能上阵攻城战，在攻城战中阵亡的侠客不能再次上阵。\n8.在非攻城战期间，帮派成员可以自行选择城门进行守备。\n9.点选对应城门后选择加入守备即可进入到城门守备。\n10.不同的城门可以为守城神兽提供加成效果，请合理分配战力。\n11.帮主或副帮主可以调整守备成员。\n12.攻城战开始前10分钟不可再调配守备",
    remarks = "帮派战说明"
  },
  [41] = {
    id = 41,
    text = "1.派遣侠客到各个地方进行闯荡可以获得心法秘笈。\n2.普通闯荡每30分钟获得一次收益，高级闯荡每20分钟获得一次收益。\n3.高级闯荡包含所有普通闯荡的掉落，并且可以获得稀有物品秘笈。\n4.派遣地图指定的特殊侠客进行闯荡，还有几率获得专属掉落物品秘笈。"
  }
}
return data_message_message
