local data_ui_ui = {
  [1] = {
    id = 1,
    cehuabeizhu = "世界BOSS排行榜内容",
    content = "伤害排名前三的玩家会获得高额奖励哟~\n最后击杀烛龙的玩家会额外获得一份\n个人击杀奖励！"
  },
  [2] = {
    id = 2,
    cehuabeizhu = "充值界面的月卡描述",
    content = "30日每日都可领取60元宝和豪华奖励"
  },
  [3] = {
    id = 3,
    cehuabeizhu = "夺宝界面的武学碎片描述内容",
    content = "集齐所有碎片可合成武学"
  },
  [4] = {
    id = 4,
    cehuabeizhu = "帮主禅让提示",
    content = "禅让后帮主之位会自动被副帮主接替，你将成为帮派普通成员"
  },
  [5] = {
    id = 5,
    cehuabeizhu = "自荐帮主提示",
    content = "帮主离开5天未上线，所有成员可自荐为帮主，等待24小时后帮主依然未上线，则职位最高的自荐者成为帮主，若职位相同，则本帮总贡献最高者胜出，是否进行自荐？"
  },
  [6] = {
    id = 6,
    cehuabeizhu = "成功开启自荐提示",
    content = "已开启自荐倒计时，24小时内帮主未上线，则报名自荐者中职位最高的成为帮主，若职位相同，则本帮总贡献最高者自动成为帮主"
  },
  [7] = {
    id = 7,
    cehuabeizhu = "退出帮派提示",
    content = "退出帮派后24小时内无法加入帮派和创建帮派，帮派贡献将会保留"
  },
  [8] = {
    id = 8,
    cehuabeizhu = "青龙堂排行榜内容",
    content = "伤害排名前三的玩家会获得高额奖励哟~\n最后击杀青龙的玩家会额外获得一份\n个人击杀奖励！"
  },
  [9] = {
    id = 9,
    cehuabeizhu = "押镖说明",
    content = "1.每天12:00-13:00、19:00-20:00期间内开始押镖，奖励额外增加50%，抢夺同样拥有额外奖励\n2.点击押镖按钮开始押镖\n3.点击其他玩家镖车可以进行抢夺\n4.每天可押镖3次，抢夺3次\n5.每次抢夺成功可获得镖车部分奖励\n6.每次镖车被抢会损失部分奖励，每辆镖车最多被抢2次"
  },
  [10] = {
    id = 10,
    cehuabeizhu = "帮派副本说明",
    content = "1、帮派副本可战斗时间为周一00：30到周日23：30。\n2、帮派副本建筑等级提高后，可开启更多帮派副本BOSS。\n3、首次通关上一关帮派副本BOSS后，下一关才能被攻打。\n4、帮派成员个人需要通关江湖中指定的关卡后，才能攻打相应的帮派副本BOSS。\n5、每次挑战帮派副本BOSS，都可获得掉落奖励。\n6、帮派副本BOSS被击杀后，在该BOSS关进行过战斗的成员可领取通关奖励。\n7、帮派副本每周日24点将自动重置BOSS血量，建议帮派成员在一周内合理击杀BOSS。\n8、只有20级以上的侠客可参与挑战，每位侠客每天只能挑战1次。主角指定上阵，且可重复上阵。\n9、伤害奖励每周日结算并发放。"
  },
  [11] = {
    id = 11,
    cehuabeizhu = "帮派副本伤害排名说明",
    content = "记录本帮成员副本伤害总值,每周清空数据并重新记录\n进入伤害排名记录的玩家可以领取通关奖励"
  },
  [12] = {
    id = 12,
    cehuabeizhu = "帮派副本参战侠客选择说明",
    content = "20级以上侠客才能参战\n每位侠客每日只能参与1次战斗"
  },
  [13] = {
    id = 13,
    cehuabeizhu = "青龙堂说明",
    content = "1.升级青龙堂可以提升青龙等级上限\n2.战胜青龙可获得大量银币、贡献和声望\n3.青龙等级越高获得奖励越多\n4.召唤青龙需要消耗500帮派资金\n5.帮主和副帮主可以设定自动开启青龙挑战的时间"
  },
  [14] = {
    id = 14,
    cehuabeizhu = "论剑参战侠客选择说哦名",
    content = "20级以上侠客才能参加"
  },
  [15] = {
    id = 15,
    cehuabeizhu = "帮派副本通关奖励领取说明",
    content = "只有在此关进行过战斗，才可以领取通关奖励"
  },
  [16] = {
    id = 16,
    cehuabeizhu = "帮战说明",
    content = "1.白虎堂达到3级具备报名资格/n2.帮派成员不低于20人才能报名/n3.报名时间为每周一到周四/n4.帮主/副帮主可以报名/n5.报名消耗1000资金/n6.报名后入帮的成员无法参加帮战/n7.报名结束后，报名的帮派数量少于4个，将不会开启帮派战"
  },
  [17] = {
    id = 17,
    cehuabeizhu = "东门效果",
    content = "为守城神兽提供物理免疫效果"
  },
  [18] = {
    id = 18,
    cehuabeizhu = "南门效果",
    content = "为守城神兽提供2500%生命值"
  },
  [19] = {
    id = 19,
    cehuabeizhu = "西门效果",
    content = "为守城神兽提供法术免疫效果"
  },
  [20] = {
    id = 20,
    cehuabeizhu = "北门效果",
    content = "为守城神兽提供2500%生命值"
  },
  [21] = {
    id = 21,
    cehuabeizhu = "城池说明1",
    content = "每周三、周六晚8点开始攻城战"
  },
  [22] = {
    id = 22,
    cehuabeizhu = "城池说明2",
    content = "每击破一个城门，可使守城神兽失去对应的效果"
  },
  [23] = {
    id = 23,
    cehuabeizhu = "帮派战排行榜内容",
    content = "伤害排名前三的玩家会获得高额奖励哟~\n最后击杀守城神兽的玩家会额外获得一份\n个人击杀奖励！"
  },
  [24] = {
    id = 24,
    cehuabeizhu = "占领说明",
    content = "击杀守城神兽后，功勋排行第一的帮派将占领城池。\n占领帮派额外功勋奖励:帮主200、副帮主150、帮众100"
  }
}
return data_ui_ui
