local data_tips_tips = {
  [1] = {
    id = 1,
    tips = "少侠，你的元宝不足哦"
  },
  [2] = {
    id = 2,
    tips = "少侠，你的银币不足哦"
  },
  [3] = {
    id = 3,
    tips = "少侠，你的体力不足哦"
  },
  [4] = {
    id = 4,
    tips = "少侠，你的耐力不足哦"
  },
  [5] = {
    id = 5,
    tips = "少侠，你的声望不足哦"
  },
  [6] = {
    id = 6,
    tips = "少侠，你的侠魂不足哦"
  },
  [7] = {
    id = 7,
    tips = "少侠，你的贡献不足哦"
  },
  [8] = {
    id = 8,
    tips = "少侠，你的魂玉不足哦"
  },
  [9] = {
    id = 9,
    tips = "少侠，你的真气不足哦"
  },
  [10] = {
    id = 10,
    tips = "少侠，你的洗炼石不足"
  },
  [11] = {
    id = 11,
    tips = "少侠，你的黄金钥匙不足"
  },
  [12] = {
    id = 12,
    tips = "少侠，你的白银钥匙不足"
  },
  [13] = {
    id = 13,
    tips = "少侠，你的青铜钥匙不足"
  },
  [14] = {
    id = 14,
    tips = "少侠，你没有黄金宝箱"
  },
  [15] = {
    id = 15,
    tips = "少侠，你没有白银宝箱"
  },
  [16] = {
    id = 16,
    tips = "少侠，你没有青铜宝箱"
  },
  [17] = {
    id = 17,
    tips = "少侠，您的网络状态不稳定，请重新连接。"
  },
  [18] = {
    id = 18,
    tips = "少侠，您的道具背包数量已达上限，请整理或扩充该背包"
  },
  [19] = {
    id = 19,
    tips = "少侠，您的侠客背包数量已达上限，请整理或扩充该背包"
  },
  [20] = {
    id = 20,
    tips = "少侠，您的装备背包数量已达上限，请整理或扩充该背包"
  },
  [21] = {
    id = 21,
    tips = "少侠，侠客等级不能超过主人等级，请提升主人等级"
  },
  [22] = {
    id = 22,
    tips = "少侠，该侠客的进阶次数已达上限"
  },
  [23] = {
    id = 23,
    tips = "少侠，该装备的强化等级已达上限，需提升主人等级"
  },
  [24] = {
    id = 24,
    tips = "少侠，该物品今日的购买次数已达上限"
  },
  [25] = {
    id = 25,
    tips = "少侠，您的vip等级不够，请提升"
  }
}
return data_tips_tips
