local data_chuangdangtext_chuangdangtext = {
  [1001] = {
    id = 1001,
    content = "#v1#跑到山下酒店喝了一顿美酒，获得#v2##v3#"
  },
  [1002] = {
    id = 1002,
    content = "#v1#在与华山弟子的切磋中获得了胜利，得到#v2##v3#"
  },
  [1011] = {
    id = 1011,
    content = "忽降大雨，#v1#无奈之下躲进一旁的山洞，发现了#v2#个#v3#"
  },
  [1012] = {
    id = 1012,
    content = "#v1#在华山论剑比武大会中取得优异成绩并赢得了#v2#个#v3#"
  },
  [1013] = {
    id = 1013,
    content = "从一恶汉手中救下一只小猴子后，猴子将#v1#带到一隐蔽处，得到#v2#个#v3#"
  },
  [1021] = {
    id = 1021,
    content = "#v1#在华山禁地挥舞了一套万剑归宗后福至心灵，领悟了部分剑法奥义，获得#v2#个#v3#"
  },
  [1022] = {
    id = 1022,
    content = "一气化三清、白日焰火术，#v1#在华山险峻的威势施展了几招，并记下了#v2#篇#v3#收入囊中"
  },
  [1101] = {
    id = 1101,
    content = "#v1#在少室山下偶遇觉悟禅师，与其交谈一番后领悟颇多，获得#v2##v3#"
  },
  [1102] = {
    id = 1102,
    content = "#v1#从小和尚手中购得大力丸一颗，吃下后获得#v2##v3#"
  },
  [1103] = {
    id = 1103,
    content = "#v1#在大雄宝殿外宁心静听众僧参佛，获得#v2##v3#"
  },
  [1111] = {
    id = 1111,
    content = "#v1#协助少林众僧制服了心魔侵体的弟子，获得#v2#个#v3#"
  },
  [1112] = {
    id = 1112,
    content = "#v1#误入少林十八铜人阵，一番苦战后最终落败。在寺中修养一番后获得了#v2#个#v3#作为补偿"
  },
  [1113] = {
    id = 1113,
    content = "与小和尚在山下市集比试经文朗诵，围观群众喝彩阵阵。当比赛进入高潮阶段时居然有一神秘人扔了#v2#个#v3#给#v1#"
  },
  [1121] = {
    id = 1121,
    content = "#v1#前往挑战少林十八铜人阵，一番苦战后最终通过大阵。获得了#v2#个#v3#作为奖励"
  },
  [1122] = {
    id = 1122,
    content = "听闻藏经阁经书被窃，#v1#在少室山下遇一人形迹可疑，遂与其交手一番。击败对方后在其身上搜出了#v2#本#v3#"
  },
  [1123] = {
    id = 1123,
    content = "#v1#误入少林寺菜园，偶遇冰蚕，在寺中修炼一番后获得了#v2#个#v3#"
  },
  [1201] = {
    id = 1201,
    content = "发现六大派弟子与明教弟子厮杀战斗，#v1#躲在一旁偷偷观战学习，获得了#v2##v3#"
  },
  [1202] = {
    id = 1202,
    content = "#v1#帮助一蒙面少女离开光明顶后，获赠一颗修为大补丸，吃下后获得了#v2##v3#"
  },
  [1211] = {
    id = 1211,
    content = "#v1#遇到战死的六大派弟子，在其身上搜到了#v2#个#v3#"
  },
  [1212] = {
    id = 1212,
    content = "#v1#遇到战死的明教弟子，在其身上搜到了#v2#个#v3#"
  },
  [1213] = {
    id = 1213,
    content = "发现光明顶密道，#v1#进入后迷失在密道中，七拐八绕捡了#v2#个#v3#后又回到了入口处"
  },
  [1221] = {
    id = 1221,
    content = "发现光明顶密道，在经过神奇般的走位后#v1#进入了一个密室，发现#v2#个#v3#"
  },
  [1301] = {
    id = 1301,
    content = "#v1#坐在山洞外凝视天空翱翔的雄鹰，似乎感悟到了一些飞行的奥义，获得#v2##v3#"
  },
  [1311] = {
    id = 1311,
    content = "#v1#在洞中发现一个布口袋，里边有#v2#个#v3#"
  },
  [1312] = {
    id = 1312,
    content = "#v1#尾随人形大雕进入山洞后发现一间洞中密室，获得#v2#个#v3#"
  },
  [1313] = {
    id = 1313,
    content = "陪一只人形大雕“闲聊”了许久，离开时大雕不舍，送了#v2#个#v3#给#v1#"
  },
  [1321] = {
    id = 1321,
    content = "#v1#在洞中打坐静修，领悟出了部分明玉功，获得#v2#个#v3#"
  },
  [1401] = {
    id = 1401,
    content = "#v1#在冰泉旁打坐修炼，获得#v2##v3#"
  },
  [1411] = {
    id = 1411,
    content = "#v1#在与三十六洞弟子的划拳较量中赢得了#v2#个#v3#"
  },
  [1412] = {
    id = 1412,
    content = "#v1#在与七十二岛弟子切磋较量中赢得了#v2#个#v3#"
  },
  [1413] = {
    id = 1413,
    content = "#v1#潜入灵鹫冰泉中意外发现了一个密室，获得#v2#个#v3#"
  },
  [1421] = {
    id = 1421,
    content = "#v1#回到灵鹫大殿触景生情，随手写下#v2#篇#v3#"
  },
  [1422] = {
    id = 1422,
    content = "#v1#在翻阅曾经的笔记时无意间发现了#v2#篇#v3#"
  },
  [1501] = {
    id = 1501,
    content = "#v1#在神仙姐姐石像前修炼时睡着了，梦中偶遇神仙姐姐受到指点获得了#v2##v3#"
  },
  [1506] = {
    id = 1506,
    content = "#v1#在洞中修行数个时辰后获得了#v2##v3#"
  },
  [1511] = {
    id = 1511,
    content = "#v1#无意间发现一人影，刚想上前结交一番人影却消失不见，只在地上留下了#v2#个#v3#"
  },
  [1512] = {
    id = 1512,
    content = "#v1#路过洞中一池塘时发现池塘中有一物闪闪发光，捞出后发现是一宝箱。打开获得了#v2#个#v3#"
  },
  [1521] = {
    id = 1521,
    content = "#v1#在洞中偶然领悟天地法则，写下了#v2#篇#v3#"
  },
  [1522] = {
    id = 1522,
    content = "#v1#在神仙姐姐石像前的蒲团中发现了#v2#篇#v3#"
  }
}
return data_chuangdangtext_chuangdangtext
