local data_lingjiang_lingjiang = {
  [1] = {
    id = 1,
    type = 1,
    name = "竞技场",
    describe = "恭喜你在{%s}的竞技场中取得了{%s}名的成绩，奖励如下："
  },
  [2] = {
    id = 2,
    type = 2,
    name = "精英回归",
    describe = "新版本新气象"
  },
  [3] = {
    id = 3,
    type = 3,
    name = "系统补偿",
    describe = "很抱歉因一些问题影响到您的游戏体验，特发游戏补偿如下："
  },
  [4] = {
    id = 4,
    type = 4,
    name = "门派闯关",
    describe = "恭喜你在门派闯关中突破了{%s}关的成绩，奖励如下："
  },
  [5] = {
    id = 5,
    type = 5,
    name = "老玩家回馈",
    describe = "回馈老玩家金币"
  },
  [6] = {
    id = 6,
    type = 6,
    name = "vip升级奖励",
    describe = "恭喜您的vip等级提升，赠送您的奖励如下："
  },
  [7] = {
    id = 7,
    type = 7,
    name = "烛龙殿活动奖励",
    describe = "恭喜您在本次烛龙殿活动中取得优异成绩，获得以下奖励："
  },
  [8] = {
    id = 8,
    type = 8,
    name = "击杀烛龙奖励",
    describe = "恭喜您在本次烛龙殿活动中成功击杀烛龙，获得以下奖励："
  },
  [9] = {
    id = 9,
    type = 9,
    name = "充值异常",
    describe = "很抱歉因一些问题影响您的充值未实时到账，奖励如下："
  },
  [10] = {
    id = 10,
    type = 10,
    name = "首充礼包",
    describe = "恭喜您获得首充礼包，奖励如下："
  },
  [11] = {
    id = 11,
    type = 11,
    name = "活动奖励",
    describe = "{%s}"
  },
  [12] = {
    id = 12,
    type = 12,
    name = "青龙堂活动奖励",
    describe = "恭喜您在本次青龙堂活动中取得优异成绩，获得以下奖励："
  },
  [13] = {
    id = 13,
    type = 13,
    name = "击败青龙奖励",
    describe = "恭喜您在本次青龙堂活动中成功击败青龙，获得以下奖励："
  },
  [14] = {
    id = 14,
    type = 14,
    name = "限时豪杰积分奖励",
    describe = "恭喜您在限时豪杰活动中达到{%s}积分，获得以下奖励："
  },
  [15] = {
    id = 15,
    type = 15,
    name = "限时豪杰排名奖励",
    describe = "恭喜您在限时豪杰活动中排名第{%s}，获得以下奖励："
  },
  [16] = {
    id = 16,
    type = 16,
    name = "比武排名奖励",
    describe = "恭喜你在{%s}的比武活动中取得了{%s}名的成绩，奖励如下："
  },
  [17] = {
    id = 17,
    type = 17,
    name = "帮派副本伤害奖励",
    describe = "恭喜您在本周帮派副本的伤害值达到了{%s}，获得以下奖励:"
  },
  [18] = {
    id = 18,
    type = 18,
    name = "幸运奖池排名奖励",
    describe = "恭喜您在幸运大奖池活动中排名第{%s}，获得以下奖励："
  },
  [19] = {
    id = 19,
    type = 19,
    name = "跨服战选拔赛",
    describe = "恭喜你在本届的武林大会选拔赛中取得了第{%s}名的成绩，奖励如下："
  },
  [20] = {
    id = 20,
    type = 20,
    name = "跨服战决赛",
    describe = "恭喜您在本届的武林大会决赛武林至尊组夺得{%s}，奖励如下："
  },
  [21] = {
    id = 21,
    type = 21,
    name = "跨服战决赛",
    describe = "恭喜您在本届的武林大会决赛名动江湖组夺得{%s}，奖励如下："
  },
  [22] = {
    id = 22,
    type = 22,
    name = "跨服战决赛",
    describe = "恭喜您所在的服务器的绝世高手{%s}在本届武林大会中勇夺总冠军！全服发放如下奖励："
  },
  [23] = {
    id = 23,
    type = 23,
    name = "跨服战决赛",
    describe = "恭喜您所在的服务器的绝世高手{%s}在本届武林大会中勇夺武林至尊组亚军！全服发放如下奖励："
  },
  [24] = {
    id = 24,
    type = 24,
    name = "跨服战决赛",
    describe = "恭喜您所在的服务器的顶级高手{%s}在本届武林大会中勇夺名动江湖组冠军！全服发放如下奖励："
  },
  [25] = {
    id = 25,
    type = 25,
    name = "跨服战决赛",
    describe = "恭喜您在淘汰赛的残酷选拔中脱颖而出，进入武林至尊组的总决赛！"
  },
  [26] = {
    id = 26,
    type = 26,
    name = "跨服战决赛",
    describe = "恭喜您在淘汰赛的残酷选拔中脱颖而出，进入名动江湖组的总决赛！"
  },
  [27] = {
    id = 27,
    type = 27,
    name = "跨服战决赛押注",
    describe = "您在跨服战决赛押注中获取的奖励未及时领取，特此补发："
  },
  [28] = {
    id = 28,
    type = 28,
    name = "帮派战伤害排行奖励",
    describe = "恭喜您在本次帮派攻城战中取得优异成绩，获得以下奖励："
  },
  [29] = {
    id = 29,
    type = 29,
    name = "帮派战击杀守城神兽奖励",
    describe = "恭喜您在本次帮派攻城战中击杀守城神兽，获得以下奖励："
  },
  [30] = {
    id = 30,
    type = 30,
    name = "帮派城池占领奖励",
    describe = "恭喜您所在帮派成功占领襄阳城，获得以下奖励："
  },
  [31] = {
    id = 31,
    type = 31,
    name = "精英回归礼包",
    describe = "欢迎回到武侠世界，我们为您准备了回归礼包"
  },
  [32] = {
    id = 32,
    type = 32,
    name = "推广奖励",
    describe = "为了回报您的热心推广，特此奖励如下"
  },  
  [33] = {
    id = 33,
    type = 33,
    name = "世界进度补偿机制",
    describe = "客官，您终于来啦？从开服那天起，我们每天都为您准备了一份礼物，直到您登陆游戏。请收好，祝您游戏愉快！"
  }

}
return data_lingjiang_lingjiang
