local data_kaifushuoming_sheet1 = {
  [1] = {
    id = 1,
    shop_des = {
      "腾蛟套装",
      "大量侠魂",
      "黄金钥匙",
      "大量进阶丹",
      "大量银币",
      "寂灭套装",
      "武学秘录"
    },
    shop_limit = {
      3000,
      2500,
      2000,
      1500,
      500,
      500,
      500
    },
    card_id = {
      151,
      162,
      165,
      166
    },
    card_des = {
      "郭大侠：高格挡，攻防兼备",
      "过儿：高输出，眩晕暴击流",
      "蒙古国师：有无敌，硬邦邦",
      "巫行云：高输出，冰冻减怒"
    }
  },
  [2] = {
    id = 2,
    shop_des = {
      "大量体力丹",
      "黄金宝箱",
      "大量洗炼石",
      "大量银币",
      "大量真气丹礼包",
      "大量淬炼石",
      "武学秘录"
    },
    shop_limit = {
      3000,
      2500,
      2000,
      1500,
      1000,
      500,
      500
    },
    card_id = {
      160,
      157,
      167,
      158
    },
    card_des = {
      "龙姑娘：单体爆发，点控",
      "欧阳毒物：直线攻击，高伤害，概率毒伤",
      "阳教主：强力点控，团队加怒",
      "任教主：攻守兼备，强力点控"
    }
  },
  [3] = {
    id = 3,
    shop_des = {
      "大量侠魂",
      "黄金宝箱",
      "大量洗炼石",
      "大量银币",
      "大量真气丹礼包",
      "大量淬炼石",
      "武学秘录"
    },
    shop_limit = {
      3000,
      2500,
      2000,
      1500,
      1000,
      500,
      500
    },
    card_id = {
      162,
      160,
      163,
      155
    },
    card_des = {
      "独臂大侠：直线攻击，强控",
      "龙姑娘：单体攻击，随机点控",
      "大理世子：随机3个敌人，强力输出",
      "西夏皇妃：超强点控，万能搭配"
    }
  },
  [4] = {
    id = 4,
    shop_des = {
      "猴年大吉礼包",
      "大量银币",
      "宠物进阶丹",
      "中级宠物秘籍",
      "高级宠物秘籍",
      "大量淬炼石",
      "武学秘录"
    },
    shop_limit = {
      8888,
      6666,
      2888,
      1666,
      888,
      666,
      168
    },
    card_id = {
      162,
      160,
      163,
      159
    },
    card_des = {
      "独臂大侠：直线攻击，强控",
      "龙姑娘：单体攻击，随机点控",
      "大理世子：单体打后排，怒气减攻",
      "王姑娘：强力治疗，增伤回怒"
    }
  }
}
return data_kaifushuoming_sheet1
