--迷仙阵 配置

--迷仙阵事件
--事件类型
MazeEventType = 
{
	NoLockedBox = 1,	--未上锁的宝箱
	LockedBox = 2,		--上锁的宝箱
	SealedBox = 3,		--被封印的宝箱
	CursedBox = 4,		--被诅咒的宝箱
	NaughtyBox = 5,		--调皮的小鬼
	BoredBox = 6,		--无聊的树妖
	LosedBox = 7,		--迷失的信使
	LittleBossBox = 8,	--小首领的宝箱
	BossBox = 9,		--首领的宝箱
}

--事件状态
MazeEventState = 
{
	Inactive = 0,		--未激活
	Active = 1,		--激活
	Complete = 2,		--完成
}

--事件配置
--事件类型 地图Id 进入点坐标 刷怪信息 波数 时间(结算类型) 奖励池(随机奖励)
mazeEventCfgData = {
	{q_id = 1,F1 = '未上锁的宝箱',q_map_id = 2304,q_enter_xy = '25,22',q_maxCircle = 0,q_time = 0,q_reward = '[32,42,79],[43,47,79],[48,52,79],[53,57,79],[58,62,79],[63,70,79]',q_left_xy = '9,22',q_right_xy = '41,22',q_up_xy = '26,11',q_down_xy = '25,32',q_prob = 30,q_lighteffect = 0,},
	{q_id = 2,F1 = '上锁的宝箱',q_map_id = 2303,q_enter_xy = '24,20',q_maxCircle = 0,q_time = 0,q_reward = '[32,42,80],[43,47,80],[48,52,80],[53,57,80],[58,62,80],[63,70,80]',q_left_xy = '9,20',q_right_xy = '40,22',q_up_xy = '24,9',q_down_xy = '25,30',q_prob = 20,q_lighteffect = 0,},
	{q_id = 3,F1 = '被封印的宝箱',q_map_id = 2302,q_enter_xy = '27,20',q_monster = '[1,[[32,42,112],[43,47,113],[48,52,114],[53,57,115],[58,62,116],[63,70,117]],4,29,24,[[27,24],[33,24],[30,21],[30,27]]] ',q_maxCircle = 1,q_time = 0,q_reward = '[32,42,81],[43,47,81],[48,52,81],[53,57,81],[58,62,81],[63,70,81]',q_left_xy = '8,23',q_right_xy = '51,23',q_up_xy = '29,9',q_down_xy = '29,38',q_prob = 15,q_lighteffect = 1,},
	{q_id = 4,F1 = '被诅咒的宝箱',q_map_id = 2301,q_enter_xy = '33,25',q_monster = '[1,[[32,42,118],[43,47,119],[48,52,120],[53,57,121],[58,62,122],[63,70,123]],10,37,32],[2,[[32,42,124],[43,47,125],[48,52,126],[53,57,127],[58,62,128],[63,70,129]],10,37,32],[3,[[32,42,130],[43,47,131],[48,52,132],[53,57,133],[58,62,134],[63,70,135]],10,37,32] ',q_maxCircle = 60,q_time = 60,q_reward = '[0,20,[[32,42,82],[43,47,82],[48,52,82],[53,57,82],[58,62,82],[63,70,82]]],[20,40,[[32,42,83],[43,47,83],[48,52,83],[53,57,83],[58,62,83],[63,70,83]]],[40,60,[[32,42,84],[43,47,84],[48,52,84],[53,57,84],[58,62,84],[63,70,84]]] ',q_left_xy = '12,31',q_right_xy = '55,29',q_up_xy = '37,15',q_down_xy = '33,44',q_prob = 10,q_lighteffect = 1,},
	{q_id = 5,F1 = '调皮的小鬼',q_map_id = 2307,q_enter_xy = '29,21',q_maxCircle = 0,q_time = 0,q_reward = '[32,42,85],[43,47,85],[48,52,85],[53,57,85],[58,62,85],[63,70,85]',q_left_xy = '7,26',q_right_xy = '54,26',q_up_xy = '30,10',q_down_xy = '31,43',q_prob = 10,q_lighteffect = 0,},
	{q_id = 6,F1 = '无聊的树妖',q_map_id = 2306,q_enter_xy = '37,32',q_monster = '[1,136,1,37,32,[[37,32],]] ',q_maxCircle = 1,q_time = 60,q_reward = '[0,100000,[[32,42,86],[43,47,86],[48,52,86],[53,57,86],[58,62,86],[63,70,86]]],[100001,250000,[[32,42,87],[43,47,87],[48,52,87],[53,57,87],[58,62,87],[63,70,87]]],[250001,10000000,[[32,42,88],[43,47,88],[48,52,88],[53,57,88],[58,62,88],[63,70,88]]] ',q_left_xy = '13,34',q_right_xy = '60,31',q_up_xy = '37,17',q_down_xy = '35,49',q_prob = 10,q_lighteffect = 0,},
	{q_id = 7,F1 = '迷失的信使',q_map_id = 2300,q_enter_xy = '34,29',q_monster = '[1,137,1,39,28,[[39,28],]] ',q_maxCircle = 1,q_time = 0,q_left_xy = '14,32',q_right_xy = '60,30',q_up_xy = '40,16',q_down_xy = '36,47',q_prob = 5,q_lighteffect = 0,},
	{q_id = 8,F1 = '小首领的宝箱',q_map_id = 2305,q_enter_xy = '29,23',q_maxCircle = 0,q_time = 0,q_reward = '[32,42,90],[43,47,90],[48,52,90],[53,57,90],[58,62,90],[63,70,90]',q_left_xy = '10,24',q_right_xy = '49,22',q_up_xy = '30,11',q_down_xy = '28,35',q_lighteffect = 2,},
	{q_id = 9,F1 = '首领的宝箱',q_map_id = 2308,q_enter_xy = '22,17',q_maxCircle = 0,q_time = 0,q_reward = '[32,42,91],[43,47,91],[48,52,91],[53,57,91],[58,62,91],[63,70,91]',q_left_xy = '6,18',q_right_xy = '39,17',q_up_xy = '23,8',q_down_xy = '21,30',q_lighteffect = 2,},
};

MazeNeedLv = 37
MazeEmailID = 2					--迷仙阵邮件ID
MazeSource = 240				--迷仙阵LOG ID
MazeKeyItemID = 999				--钥匙ID
MazeKeyItemCount = 1
MazeEnterNPC = 11114
