ltzdzBuildingCfg={
    {  --大城版主城
        type=1,
        maxLevel=5, -- 等级上限
        mineConsumeArr={0,1600,3600,14000,39900,}, -- 升级代币消耗
        timeConsumeArr={0,900,1800,2700,3600,}, -- 升级时间消耗
        mineProducetArr={0,0.3,0.5,0.9,1.4,}, -- 代币产出
        oilProducetArr={0,0.3,0.5,0.9,1.4,}, -- 石油产出
        tankProducetArr={0,0.15,0.25,0.45,0.7,}, -- 预备役产出
        capacity={15000,18000,21000,24000,30000,}, -- 预备役上限
    },
    {  --小城版主城
        type=2,
        maxLevel=3, -- 等级上限
        mineConsumeArr={0,1600,3600,}, -- 升级代币消耗
        timeConsumeArr={0,900,1800,}, -- 升级时间消耗
        mineProducetArr={0,0.3,0.5,}, -- 代币产出
        oilProducetArr={0,0.3,0.5,}, -- 石油产出
        tankProducetArr={0,0.15,0.25,}, -- 预备役产出
        capacity={15000,18000,21000,}, -- 预备役上限
    },
    {  --油井
        type=3,
        maxLevel=15,
        mineConsumeArr={500,100,200,300,450,650,850,1100,1400,2000,2700,3500,4300,5200,6200,}, -- 升级代币消耗
        timeConsumeArr={3,13,42,90,160,250,375,525,700,920,1165,1450,1775,2135,2540,}, -- 升级时间消耗
        oilProducetArr={0.1,0.2,0.3,0.4,0.5,0.6,0.7,0.8,0.9,1,1.2,1.3,1.4,1.7,2.2,}, -- 代币产出
    },
    {  --坦克工厂
        type=4,
        maxLevel=15,
        mineConsumeArr={500,100,200,300,450,650,850,1100,1400,2000,2700,3500,4300,5200,6200,}, -- 升级代币消耗
        timeConsumeArr={3,13,42,90,160,250,375,525,700,920,1165,1450,1775,2135,2540,}, -- 升级时间消耗
        tankProducetArr={0.05,0.1,0.15,0.2,0.25,0.3,0.35,0.4,0.45,0.5,0.6,0.65,0.7,0.85,1.1,}, -- 预备役产出
    },
    {  --造币厂
        type=5,
        maxLevel=15,
        mineConsumeArr={500,100,200,300,450,650,850,1100,1400,2000,2700,3500,4300,5200,6200,}, -- 升级代币消耗
        timeConsumeArr={3,13,42,90,160,250,375,525,700,920,1165,1450,1775,2135,2540,}, -- 升级时间消耗
        mineProducetArr={0.1,0.2,0.3,0.4,0.5,0.6,0.7,0.8,0.9,1,1.2,1.3,1.4,1.7,2.2,}, -- 石油产出
    },
}
