local Items = {
	{q_id = 1,q_txt = '我是见证爱情的月老。达到48级的勇士，可以与相爱之人一起来找我，我将为你们的结合做见证。\n巡礼任务需要男方触发接取。',q_info = '未满48级玩家查看',},
	{q_id = 2,q_txt = '无论你是否强大，无论你是否历经沧桑。你永远无法独自面对爱情。\n去寻找属于你的那另一半，与其组队，一起来见我。我会见证你们的结合。\n巡礼任务需要男方触发接取。',q_info = '婚前，不符合组队条件，不处于巡礼状态的玩家查看',},
	{q_id = 3,q_txt = '1.每对夫妻可以开启一次婚礼。\n2.婚礼开启后，夫妻会得到请柬，在聊天频道中分享请柬，其他玩家可以通过点击请柬进入婚礼会场。',q_info = '1.已婚，婚礼未办，查看婚礼页签\n2.已婚，婚礼进行中，查看婚礼页签\n3.已婚，婚礼已办，查看婚礼页签',},
	{q_id = 4,q_txt = '经典婚礼说明：\n广播：婚礼开始后15分钟，每5分钟全服公告。\n婚礼：使用时间180分钟。免费开启花瓣雨、召唤礼乐师、开启随机婚礼玩法。',q_info = '已婚，婚礼未办，查看婚礼页签-经典婚礼',},
	{q_id = 5,q_txt = '豪华婚礼说明：\n广播：提前15分钟，每5分钟全服公告。豪华婚车巡游中州城。\n婚礼：使用时间200分钟。免费开启花瓣雨、召唤礼乐师、开启随机婚礼玩法。',q_info = '已婚，婚礼未办，查看婚礼页签-豪华婚礼',},
	{q_id = 6,q_txt = '1.每对夫妻可以开启一次婚礼。\n2.婚礼开启后，夫妻会得到请柬，在聊天频道中分享请柬，其他玩家可以通过点击请柬进入婚礼会场。',q_info = '已婚，婚礼进行中，查看婚礼页签',},
	{q_id = 7,q_txt = '您可以通过宾客列表，查看当前所有的宾客。',q_info = '婚礼会场中，当前夫妻查看会场月老-会场页签',},
	{q_id = 8,q_txt = '浪漫花瓣：持续15分钟的花瓣雨很漂亮的呢，还有经验奖励哦。\n礼乐师：很能活跃现场哦，我很喜欢他们的演奏呢。',q_info = '婚礼会场中，当前夫妻查看会场月老-气氛页签',},
	{q_id = 9,q_txt = '一些雅俗共赏的玩法，正适合同好友一起乐呵。\n你问是什么玩法？试试不就知道了？',q_info = '婚礼会场中，当前夫妻查看会场月老-玩法页签',},
	{q_id = 10,q_txt = '您赠送的红包，会在婚礼结束后全额会发送到新娘手中。',q_info = '婚礼会场中，其他玩家查看会场月老-贺礼页签',},
	{q_id = 11,q_txt = '夫妻任务每周一上午5点刷新。\n这是对你们心意的考验，必须组队完成。',q_info = '已婚，任务页签',},
	{q_id = 12,q_txt = '婚姻象征着幸福与神圣。\n同时，婚姻也是两个人的事情。\n如果你已找到了你的另一半，\n与TA组队，来中州找我吧。',q_info = '婚前，玩家到48级，开启自身界面中，月老的台词',},
	{q_id = 13,q_txt = '与其与我着老头子闲聊，何不如与你那携手之人周游这世间呢？\n有些事，多考虑一下，可能会有不同的答案。',q_info = '已婚，月老-其他页签',},
	{q_id = 14,q_txt = '当这个时间走到尽头，你们的婚姻也将成为往事。\n若还有补救的可能，请告诉我，我来让一切重归于好。',q_info = '已婚，冷静期中，月老-其他页签',},
};
return Items
