local Items=
{
  {q_lv=88.0,q_tips='初出茅庐，你的升级速度已经打败传世史上%s的玩家',},
  {q_lv=88.0,q_tips='羽翼渐丰，你的升级速度已经打败传世史上%s的玩家',},
  {q_lv=88.0,q_tips='进步神速，你的升级速度已经打败传世史上%s的玩家',},
  {q_lv=88.0,q_tips='高手妙招，你的打怪数量已经打败传世史上%s的玩家',},
  {q_lv=88.0,q_tips='勇士好威武，你在目前地图的等级已经打败传世史上%s的玩家',},
  {q_lv=88.0,q_tips='珠光宝气，你在目前地图所拥有的财富已经打败传世史上%s的玩家',},
  {q_lv=88.0,q_tips='鲤跃龙门，你目前的等级已经打败传世史上%s的玩家',},
  {q_lv=88.0,q_tips='身经百战，你目前的升级速度已经打败传世史上%s的玩家',},
  {q_lv=88.0,q_tips='有两把刷子，你的打怪数量已打败传世史上%s的玩家',},
  {q_lv=88.0,q_tips='纵横天下，你目前手撕敌对玩家数量已打败传世史上%s的玩家',},
}

return Items