i3k_db_newYear_red = 
{
	gift = 
		{
			{date = 1548950400, npcIds = {10060,10061,10066,}, startTime = 18000, endTime = 82800, rewards70Up = {{id =66932, count = 1},{id =66834, count = 2},{id =67818, count = 1},}, rewards70 = {{id =66933, count = 1},{id =66834, count = 2},{id =67818, count = 1},}},
			{date = 1549036800, npcIds = {10060,10067,10068,}, startTime = 18000, endTime = 82800, rewards70Up = {{id =66932, count = 1},{id =66834, count = 2},{id =67818, count = 1},}, rewards70 = {{id =66933, count = 1},{id =66834, count = 2},{id =67818, count = 1},}},
			{date = 1549123200, npcIds = {10060,10070,10116,}, startTime = 18000, endTime = 82800, rewards70Up = {{id =66932, count = 1},{id =66834, count = 2},{id =67818, count = 1},}, rewards70 = {{id =66933, count = 1},{id =66834, count = 2},{id =67818, count = 1},}},
			{date = 1549209600, npcIds = {10060,10063,10132,}, startTime = 18000, endTime = 82800, rewards70Up = {{id =66932, count = 1},{id =66834, count = 2},{id =67818, count = 1},}, rewards70 = {{id =66933, count = 1},{id =66834, count = 2},{id =67818, count = 1},}},
			{date = 1549296000, npcIds = {10060,10061,10066,}, startTime = 18000, endTime = 82800, rewards70Up = {{id =66932, count = 1},{id =66834, count = 2},{id =67818, count = 1},}, rewards70 = {{id =66933, count = 1},{id =66834, count = 2},{id =67818, count = 1},}},
			{date = 1549382400, npcIds = {10060,10067,10068,}, startTime = 18000, endTime = 82800, rewards70Up = {{id =66932, count = 1},{id =66834, count = 2},{id =67818, count = 1},}, rewards70 = {{id =66933, count = 1},{id =66834, count = 2},{id =67818, count = 1},}},
			{date = 1549468800, npcIds = {10060,10070,10116,}, startTime = 18000, endTime = 82800, rewards70Up = {{id =66932, count = 1},{id =66834, count = 2},{id =67818, count = 1},}, rewards70 = {{id =66933, count = 1},{id =66834, count = 2},{id =67818, count = 1},}},
			{date = 1549555200, npcIds = {10060,10063,10132,}, startTime = 18000, endTime = 82800, rewards70Up = {{id =66932, count = 1},{id =66834, count = 2},{id =67818, count = 1},}, rewards70 = {{id =66933, count = 1},{id =66834, count = 2},{id =67818, count = 1},}},
			{date = 1549641600, npcIds = {10060,10061,10066,}, startTime = 18000, endTime = 82800, rewards70Up = {{id =66932, count = 1},{id =66834, count = 2},{id =67818, count = 1},}, rewards70 = {{id =66933, count = 1},{id =66834, count = 2},{id =67818, count = 1},}},
			{date = 1549728000, npcIds = {10060,10067,10068,}, startTime = 18000, endTime = 82800, rewards70Up = {{id =66932, count = 1},{id =66834, count = 2},{id =67818, count = 1},}, rewards70 = {{id =66933, count = 1},{id =66834, count = 2},{id =67818, count = 1},}},
			{date = 1549814400, npcIds = {10060,10070,10116,}, startTime = 18000, endTime = 82800, rewards70Up = {{id =66932, count = 1},{id =66834, count = 2},{id =67818, count = 1},}, rewards70 = {{id =66933, count = 1},{id =66834, count = 2},{id =67818, count = 1},}},
			{date = 1549900800, npcIds = {10060,10063,10132,}, startTime = 18000, endTime = 82800, rewards70Up = {{id =66932, count = 1},{id =66834, count = 2},{id =67818, count = 1},}, rewards70 = {{id =66933, count = 1},{id =66834, count = 2},{id =67818, count = 1},}},
		},
	npcBlessing = 
		{
			[10060] = {'老身代表泫勃派給少俠拜年了！\n（今天泫勃派還有兩位在發紅包，少俠自己去找吧）', '老身代表泫勃派給少俠拜年了！\n（今天泫勃派還有兩位在發紅包，少俠自己去找吧）', '老身代表泫勃派給少俠拜年了！\n（今天泫勃派還有兩位在發紅包，少俠自己去找吧）'},
			[10061] = {'年年歲歲花相似，歲歲年年人不同。\n新春快樂！大吉大利！', '千門萬戶曈曈日，總把新桃換舊符。\n新春快樂！大吉大利！', '調露初迎綺春節，承雲遽踐蒼霄馭。\n新春快樂！大吉大利！'},
			[10066] = {'爆竹聲中一歲除，春風送暖入屠蘇。\n新春快樂！大吉大利！', '通宵燈火人如織，一派歌聲喜欲狂。\n新春快樂！大吉大利！', '北風吹雪四更初，嘉瑞天教及歲除。\n新春快樂！大吉大利！'},
			[10067] = {'歷添新歲月，春滿舊山河。\n新春快樂！大吉大利！', '鼓角梅花添一部，五更歡笑拜新年。\n新春快樂！大吉大利！', '千門萬戶曈曈日，總把新桃換舊符。\n新春快樂！大吉大利！'},
			[10068] = {'共慶新年笑語嘩，紅巖士女贈梅花。\n新春快樂！大吉大利！', '寒隨一夜去，春逐五更來。\n新春快樂！大吉大利！', '一年滴盡蓮花漏，碧井酴酥沈凍酒。\n新春快樂！大吉大利！'},
			[10070] = {'北風吹雪四更初，嘉瑞天教及歲除。\n新春快樂！大吉大利！', '調露初迎綺春節，承雲遽踐蒼霄馭。\n新春快樂！大吉大利！', '年年歲歲花相似，歲歲年年人不同。\n新春快樂！大吉大利！'},
			[10116] = {'萬物迎春送殘臘，一年結局在今宵。\n新春快樂！大吉大利！', '北風吹雪四更初，嘉瑞天教及歲除。\n新春快樂！大吉大利！', '爆竹聲中一歲除，春風送暖入屠蘇。\n新春快樂！大吉大利！'},
			[10063] = {'鶯啼燕語報新年，馬邑龍堆路幾千。\n新春快樂！大吉大利！', '千門萬戶曈曈日，總把新桃換舊符。\n新春快樂！大吉大利！', '歷添新歲月，春滿舊山河。\n新春快樂！大吉大利！'},
			[10132] = {'陪都歌舞迎佳節，遙祝延安景物華。\n新春快樂！大吉大利！', '一年滴盡蓮花漏，碧井酴酥沈凍酒。\n新春快樂！大吉大利！', '共慶新年笑語嘩，紅巖士女贈梅花。\n新春快樂！大吉大利！'},
		}
};