i3k_db_magic_machine = {
	openLvl = 50,
	openWeekDay = {2, 6, },
	showTeamNum = 20,
	slowDownSpeed = 200,
	joinTimes = 1,
	maxTime = 600,
	countTimes = 10,
	machinePosRadius = 2,
	moveEffectModleId = 4707,
	checkId = 61501,
	openTime = {
		{startTime = '10:00:00',lifeTime = 46800},
	},
	rankRewards = {
		{rank = 2200, rewards = {{id = 67935, count = 900},{id = 67936, count = 150},}, showTxt = '2200分以上',},
		{rank = 1800, rewards = {{id = 67935, count = 810},{id = 67936, count = 135},}, showTxt = '1800到2199分',},
		{rank = 1600, rewards = {{id = 67935, count = 720},{id = 67936, count = 120},}, showTxt = '1600到1799分',},
		{rank = 1000, rewards = {{id = 67935, count = 630},{id = 67936, count = 105},}, showTxt = '1000到1599分',},
		{rank = 1, rewards = {{id = 67935, count = 450},{id = 67936, count = 75},}, showTxt = '1到1000分',},
	},
	lvl2map = {
		{uprLmt = 70, mapID = 61501}, 
		{uprLmt = 90, mapID = 61511}, 
		{uprLmt = 110, mapID = 61521}, 
		{uprLmt = 200, mapID = 61531}, 
	},
	rectanglePoints =  {{ x = -73.28609, y = 23.6, z = 15.1038284 }, { x = -73.09892, y = 22.6, z = 5.361779 }, { x = -16.3181, y = 24.9715233, z = 5.84 }, { x = -16.12899, y = 22.6, z = 13.9108772 }},
	moveNpcId = 19121,
	initNpcPos = { x = -73.69132, y = 23.6, z = 9.541456 },
	initNpcAngl = { x = 0.0, y = 360.0, z = 0.0 },
	hideBossRewards = {
		{id = 67937, count = 1},
	},
	manhua = { 9835, 9836, 9837, 9838,  }
}
i3k_db_magic_machine_area = {
	[61501] = {eventType = 0, eventDelay = 0, tips = '積極參與不劃水才會有更高的積分。如果你在活動中得了0分，將不會有任何獎勵。' },
	[61502] = {eventType = 0, eventDelay = 0, tips = '前方高能怪物，對其造成傷害越多獲得積分越高' },
	[61503] = {eventType = 1, eventDelay = 1, tips = '劍皇的庇護：前方為減速區域，注意跟隨劍皇記名弟子姬軒軒腳步在劍陣內行走並儘快通過' },
	[61504] = {eventType = 0, eventDelay = 0, tips = '前方高能怪物，對其造成傷害越多獲得積分越高' },
	[61505] = {eventType = 2, eventDelay = 0, tips = '箭陣的攻擊範圍之外才是安全道路，被攻擊次數越少分數越高' },
	[61506] = {eventType = 0, eventDelay = 0, tips = '前方高能怪物，對其造成傷害越多獲得積分越高' },
	[61511] = {eventType = 0, eventDelay = 0, tips = '積極參與不劃水才會有更高的積分。如果你在活動中得了0分，將不會有任何獎勵。' },
	[61512] = {eventType = 0, eventDelay = 0, tips = '前方高能怪物，對其造成傷害越多獲得積分越高' },
	[61513] = {eventType = 1, eventDelay = 1, tips = '劍皇的庇護：前方為減速區域，注意跟隨劍皇記名弟子姬軒軒腳步在劍陣內行走並儘快通過' },
	[61514] = {eventType = 0, eventDelay = 0, tips = '前方高能怪物，對其造成傷害越多獲得積分越高' },
	[61515] = {eventType = 2, eventDelay = 0, tips = '箭陣的攻擊範圍之外才是安全道路，被攻擊次數越少分數越高' },
	[61516] = {eventType = 0, eventDelay = 0, tips = '前方高能怪物，對其造成傷害越多獲得積分越高' },
	[61521] = {eventType = 0, eventDelay = 0, tips = '積極參與不劃水才會有更高的積分。如果你在活動中得了0分，將不會有任何獎勵。' },
	[61522] = {eventType = 0, eventDelay = 0, tips = '前方高能怪物，對其造成傷害越多獲得積分越高' },
	[61523] = {eventType = 1, eventDelay = 1, tips = '劍皇的庇護：前方為減速區域，注意跟隨劍皇記名弟子姬軒軒腳步在劍陣內行走並儘快通過' },
	[61524] = {eventType = 0, eventDelay = 0, tips = '前方高能怪物，對其造成傷害越多獲得積分越高' },
	[61525] = {eventType = 2, eventDelay = 0, tips = '箭陣的攻擊範圍之外才是安全道路，被攻擊次數越少分數越高' },
	[61526] = {eventType = 0, eventDelay = 0, tips = '前方高能怪物，對其造成傷害越多獲得積分越高' },
	[61531] = {eventType = 0, eventDelay = 0, tips = '積極參與不劃水才會有更高的積分。如果你在活動中得了0分，將不會有任何獎勵。' },
	[61532] = {eventType = 0, eventDelay = 0, tips = '前方高能怪物，對其造成傷害越多獲得積分越高' },
	[61533] = {eventType = 1, eventDelay = 1, tips = '劍皇的庇護：前方為減速區域，注意跟隨劍皇記名弟子姬軒軒腳步在劍陣內行走並儘快通過' },
	[61534] = {eventType = 0, eventDelay = 0, tips = '前方高能怪物，對其造成傷害越多獲得積分越高' },
	[61535] = {eventType = 2, eventDelay = 0, tips = '箭陣的攻擊範圍之外才是安全道路，被攻擊次數越少分數越高' },
	[61536] = {eventType = 0, eventDelay = 0, tips = '前方高能怪物，對其造成傷害越多獲得積分越高' },
	[61541] = {eventType = 0, eventDelay = 0, tips = '積極參與不劃水才會有更高的積分。如果你在活動中得了0分，將不會有任何獎勵。' },
	[61542] = {eventType = 0, eventDelay = 0, tips = '前方高能怪物，對其造成傷害越多獲得積分越高' },
	[61543] = {eventType = 1, eventDelay = 1, tips = '劍皇的庇護：前方為減速區域，注意跟隨劍皇記名弟子姬軒軒腳步在劍陣內行走並儘快通過' },
	[61544] = {eventType = 0, eventDelay = 0, tips = '前方高能怪物，對其造成傷害越多獲得積分越高' },
	[61545] = {eventType = 2, eventDelay = 0, tips = '箭陣的攻擊範圍之外才是安全道路，被攻擊次數越少分數越高' },
	[61546] = {eventType = 0, eventDelay = 0, tips = '前方高能怪物，對其造成傷害越多獲得積分越高' },
	[61551] = {eventType = 0, eventDelay = 0, tips = '積極參與不劃水才會有更高的積分。如果你在活動中得了0分，將不會有任何獎勵。' },
	[61552] = {eventType = 0, eventDelay = 0, tips = '前方高能怪物，對其造成傷害越多獲得積分越高' },
	[61553] = {eventType = 1, eventDelay = 1, tips = '劍皇的庇護：前方為減速區域，注意跟隨劍皇記名弟子姬軒軒腳步在劍陣內行走並儘快通過' },
	[61554] = {eventType = 0, eventDelay = 0, tips = '前方高能怪物，對其造成傷害越多獲得積分越高' },
	[61555] = {eventType = 2, eventDelay = 0, tips = '箭陣的攻擊範圍之外才是安全道路，被攻擊次數越少分數越高' },
	[61556] = {eventType = 0, eventDelay = 0, tips = '前方高能怪物，對其造成傷害越多獲得積分越高' },
}
i3k_db_move_road_points = {
	[1] = {extTime = 25, points = {{ x = -71.69619, y = 23.6, z = 9.546329 }, { x = -68.72297, y = 23.6, z = 9.627969 }, { x = -65.63445, y = 23.6, z = 9.744944 }, { x = -62.37531, y = 23.6, z = 9.879802 }, { x = -62.53715, y = 23.6, z = 6.657564 }, { x = -59.28889, y = 23.6, z = 6.440166 }, { x = -56.10153, y = 23.6, z = 6.457899 }, { x = -53.01873, y = 23.6, z = 6.294599 }, { x = -53.07595, y = 23.6, z = 9.551363 }, { x = -49.91775, y = 23.6, z = 9.650345 }, { x = -46.6832, y = 23.6, z = 9.84906 }, { x = -43.39647, y = 23.6, z = 9.71068 }, { x = -40.41522, y = 23.6, z = 9.611098 }, { x = -40.3539, y = 23.6, z = 12.74408 }, { x = -37.19101, y = 23.6, z = 12.8301 }, { x = -34.05711, y = 23.6, z = 12.92068 }, { x = -30.8629, y = 23.6, z = 12.78435 }, { x = -27.32298, y = 23.61722, z = 12.97052 }, { x = -27.31294, y = 23.65422, z = 9.571251 }, { x = -23.90514, y = 23.67492, z = 9.663816 }, { x = -20.46001, y = 23.696, z = 9.743318 }, { x = -17.30384, y = 23.70422, z = 9.770657 }, },
	arrayPoints = {{pos = { -71.69619, 23.6,9.546329 }}, {pos = { -68.72297, 23.6,9.627969 }}, {pos = { -65.63445, 23.6,9.744944 }}, {pos = { -62.37531, 23.6,9.879802 }}, {pos = { -62.53715, 23.6,6.657564 }}, {pos = { -59.28889, 23.6,6.440166 }}, {pos = { -56.10153, 23.6,6.457899 }}, {pos = { -53.01873, 23.6,6.294599 }}, {pos = { -53.07595, 23.6,9.551363 }}, {pos = { -49.91775, 23.6,9.650345 }}, {pos = { -46.6832, 23.6,9.84906 }}, {pos = { -43.39647, 23.6,9.71068 }}, {pos = { -40.41522, 23.6,9.611098 }}, {pos = { -40.3539, 23.6,12.74408 }}, {pos = { -37.19101, 23.6,12.8301 }}, {pos = { -34.05711, 23.6,12.92068 }}, {pos = { -30.8629, 23.6,12.78435 }}, {pos = { -27.32298, 23.61722,12.97052 }}, {pos = { -27.31294, 23.65422,9.571251 }}, {pos = { -23.90514, 23.67492,9.663816 }}, {pos = { -20.46001, 23.696,9.743318 }}, {pos = { -17.30384, 23.70422,9.770657 }}, }
	},
	[2] = {extTime = 25, points = {{ x = -71.69619, y = 23.6, z = 9.546329 }, { x = -68.72297, y = 23.6, z = 9.627969 }, { x = -65.63445, y = 23.6, z = 9.744944 }, { x = -62.37531, y = 23.6, z = 9.879802 }, { x = -62.53715, y = 23.6, z = 6.657564 }, { x = -59.28889, y = 23.6, z = 6.440166 }, { x = -56.10153, y = 23.6, z = 6.457899 }, { x = -53.01873, y = 23.6, z = 6.294599 }, { x = -53.07595, y = 23.6, z = 9.551363 }, { x = -49.91775, y = 23.6, z = 9.650345 }, { x = -46.6832, y = 23.6, z = 9.84906 }, { x = -43.39647, y = 23.6, z = 9.71068 }, { x = -40.41522, y = 23.6, z = 9.611098 }, { x = -40.3539, y = 23.6, z = 12.74408 }, { x = -37.19101, y = 23.6, z = 12.8301 }, { x = -34.05711, y = 23.6, z = 12.92068 }, { x = -30.8629, y = 23.6, z = 12.78435 }, { x = -27.32298, y = 23.61722, z = 12.97052 }, { x = -27.31294, y = 23.65422, z = 9.571251 }, { x = -23.90514, y = 23.67492, z = 9.663816 }, { x = -20.46001, y = 23.696, z = 9.743318 }, { x = -17.30384, y = 23.70422, z = 9.770657 }, { x = -16.4351521, y = 23.7030354, z = 9.803843 }, },
	arrayPoints = {{pos = { -71.69619, 23.6,9.546329 }}, {pos = { -68.72297, 23.6,9.627969 }}, {pos = { -65.63445, 23.6,9.744944 }}, {pos = { -62.37531, 23.6,9.879802 }}, {pos = { -62.53715, 23.6,6.657564 }}, {pos = { -59.28889, 23.6,6.440166 }}, {pos = { -56.10153, 23.6,6.457899 }}, {pos = { -53.01873, 23.6,6.294599 }}, {pos = { -53.07595, 23.6,9.551363 }}, {pos = { -49.91775, 23.6,9.650345 }}, {pos = { -46.6832, 23.6,9.84906 }}, {pos = { -43.39647, 23.6,9.71068 }}, {pos = { -40.41522, 23.6,9.611098 }}, {pos = { -40.3539, 23.6,12.74408 }}, {pos = { -37.19101, 23.6,12.8301 }}, {pos = { -34.05711, 23.6,12.92068 }}, {pos = { -30.8629, 23.6,12.78435 }}, {pos = { -27.32298, 23.61722,12.97052 }}, {pos = { -27.31294, 23.65422,9.571251 }}, {pos = { -23.90514, 23.67492,9.663816 }}, {pos = { -20.46001, 23.696,9.743318 }}, {pos = { -17.30384, 23.70422,9.770657 }}, {pos = { -16.4351521, 23.7030354,9.803843 }}, }
	},
}
i3k_db_magic_machine_miniMap =
{
	[61501] = {mapId = 61501, mapName = '神机藏海50-70级', imageId = 8774, titleImgId = 8773, scaleX = 0.74, scaleY = 0.58, scale = 0.33, worldMapScale = 0.65, worldMapScaleX = 0.5, worldMapScaleY = 0.4 },
	[61511] = {mapId = 61511, mapName = '神机藏海71-90级', imageId = 8774, titleImgId = 8773, scaleX = 0.74, scaleY = 0.58, scale = 0.33, worldMapScale = 0.65, worldMapScaleX = 0.5, worldMapScaleY = 0.4 },
	[61521] = {mapId = 61521, mapName = '神机藏海91-110级', imageId = 8774, titleImgId = 8773, scaleX = 0.74, scaleY = 0.58, scale = 0.33, worldMapScale = 0.65, worldMapScaleX = 0.5, worldMapScaleY = 0.4 },
	[61531] = {mapId = 61531, mapName = '神机藏海111级以上', imageId = 8774, titleImgId = 8773, scaleX = 0.74, scaleY = 0.58, scale = 0.33, worldMapScale = 0.65, worldMapScaleX = 0.5, worldMapScaleY = 0.4 },
}

i3k_db_magic_machine_miniShowCfg =
{
	[1] = {iconType = 1, iconId = 2830, pos = { x = -145.472977, y = 14.84424, z = 10.2953491 }, des = '出生点' },
	[2] = {iconType = 2, iconId = 3571, pos = { x = -116.032234, y = 19.1320343, z = 10.0142469 }, des = 'BOSS' },
	[3] = {iconType = 3, iconId = 3567, pos = { x = -49.83501, y = 23.6166039, z = 8.793674 }, des = '机关通道' },
	[4] = {iconType = 2, iconId = 3571, pos = { x = 32.20739, y = 28.9320354, z = 0.2192354 }, des = 'BOSS' },
	[5] = {iconType = 4, iconId = 3570, pos = { x = 31.4504738, y = 29.1189079, z = -44.4069939 }, des = '箭阵' },
	[6] = {iconType = 2, iconId = 3571, pos = { x = 31.79471, y = 23.5320358, z = -83.5708 }, des = 'BOSS' },
}
