i3k_db_push_service =
{
	[1] = { id = 1, name = '正能量补给',days = 127, times = { {h = 11, m = 30,s = 0}, {h = 14, m = 0,s = 0},  }, push = 1, desc = '正能量补给：好吃的鸡腿已经准备好，大侠们快来享用！', type = 1 },
	[2] = { id = 2, name = '镖行天下',days = 127, times = { {h = 14, m = 0,s = 0}, {h = 15, m = 0,s = 0},  }, push = 1, desc = '镖行天下：帮人运镖能赚钱，这等好事赶紧来参加！', type = 2 },
	[3] = { id = 3, name = '正能量补给',days = 127, times = { {h = 17, m = 30,s = 0}, {h = 20, m = 0,s = 0},  }, push = 1, desc = '正能量补给：好吃的鸡腿已经准备好，大侠们快来享用！', type = 3 },
	[4] = { id = 4, name = '会武场',days = 63, times = { {h = 19, m = 0,s = 0}, {h = 23, m = 0,s = 0},  }, push = 1, desc = '会武场：不知诸位武艺如何，赶紧来乱斗场比试一番！', type = 4 },
	[5] = { id = 5, name = '镖行天下',days = 127, times = { {h = 19, m = 30,s = 0}, {h = 20, m = 30,s = 0},  }, push = 1, desc = '镖行天下：帮人运镖能赚钱，这等好事赶紧来参加！', type = 2 },
	[6] = { id = 6, name = '势力战',days = 37, times = { {h = 20, m = 0,s = 0}, {h = 23, m = 30,s = 0},  }, push = 1, desc = '势力战：正邪不两立，战火已燃，诸位大侠快来参加势力对决！', type = 5 },
	[7] = { id = 7, name = '正能量补给',days = 127, times = { {h = 21, m = 0,s = 0}, {h = 23, m = 0,s = 0},  }, push = 1, desc = '正能量补给：好吃的鸡腿已经准备好，大侠们快来享用！', type = 6 },
};
