i3k_db_create_kungfu_args =
{
	[1] = {  id = 1, name = '勁', desc = '[勁]:影響傷害值' },
	[2] = {  id = 2, name = '切', desc = '[切]:影響武功命中與暴擊' },
	[3] = {  id = 3, name = '連', desc = '[連]:影響武功傷害次數' },
	[4] = {  id = 4, name = '禦', desc = '[禦]:影響武功冷卻與怒氣獲得' },
	[5] = {  id = 5, name = '纏', desc = '[纏]:影響武功傷害範圍' },
	[6] = {  id = 6, name = '追', desc = '[追]:為武功附加額外效果' },
	[7] = {  id = 7, name = '破', desc = '[破]:產生虛弱類效果' },
	[8] = {  id = 8, name = '控', desc = '[控]:產生控制類效果' },
	[9] = {  id = 9, name = '幻', desc = '[幻]:產生增益類效果' },
};
