i3k_db_desert_generals =
{
	[1] = { id = 1, name = '無雙劍', desc = '劍法飄逸,能攻能守\n普通攻擊有30%概率使人減速', classImg = 7896, modelID = 2891, hpOrg = 240000.0, hpInc1 = 0, hpInc2 = 0, atkNOrg = 10000.0, atkNInc1 = 0, atkNInc2 = 0, defNOrg = 3000.0, defNInc1 = 0, defNInc2 = 0, atrOrg = 0, atrInc1 = 0, atrInc2 = 0, ctrOrg = 0, ctrInc1 = 0, ctrInc2 = 0, acrNOrg = 400.0, acrNInc1 = 0, acrNInc2 = 0, touOrg = 0.0, touInc1 = 0, touInc2 = 0, atkAOrg = 15000.0, atkAInc1 = 0, atkAInc2 = 0, attacks = { 93010, 93011, }, skills = { 93012, 93013, 93014 }, dodgeSkill = 93018, ultraSkill = -1, attkLst = { 0, 1, 0, 0, 2, 0, 3, }, speed = 800, radius = 75, checkRange = 1500 },
	[2] = { id = 2, name = '鎮魔琵琶', desc = '縹緲之音,攝人心魄\n普通攻擊有10%概率使人中毒', classImg = 7898, modelID = 2892, hpOrg = 220000.0, hpInc1 = 0, hpInc2 = 0, atkNOrg = 10000.0, atkNInc1 = 0, atkNInc2 = 0, defNOrg = 3000.0, defNInc1 = 0, defNInc2 = 0, atrOrg = 0, atrInc1 = 0, atrInc2 = 0, ctrOrg = 0, ctrInc1 = 0, ctrInc2 = 0, acrNOrg = 200.0, acrNInc1 = 0, acrNInc2 = 0, touOrg = 200.0, touInc1 = 0, touInc2 = 0, atkAOrg = 18000.0, atkAInc1 = 0, atkAInc2 = 0, attacks = { 93001, }, skills = { 93002, 93003, 93004 }, dodgeSkill = 93019, ultraSkill = -1, attkLst = { 0, 1, 0, 0, 2, 0, 3, }, speed = 900, radius = 75, checkRange = 1500 },
	[3] = { id = 3, name = '翻天錘', desc = '雙錘震天,血量極高\n普通攻擊有10%概率使人短暫眩暈', classImg = 7897, modelID = 2893, hpOrg = 260000.0, hpInc1 = 0, hpInc2 = 0, atkNOrg = 11000.0, atkNInc1 = 0, atkNInc2 = 0, defNOrg = 2000.0, defNInc1 = 0, defNInc2 = 0, atrOrg = 0, atrInc1 = 0, atrInc2 = 0, ctrOrg = 0, ctrInc1 = 0, ctrInc2 = 0, acrNOrg = 0.0, acrNInc1 = 0, acrNInc2 = 0, touOrg = 400.0, touInc1 = 0, touInc2 = 0, atkAOrg = 15000.0, atkAInc1 = 0, atkAInc2 = 0, attacks = { 93005, 93006, }, skills = { 93007, 93008, 93009 }, dodgeSkill = 93020, ultraSkill = -1, attkLst = { 0, 1, 0, 0, 2, 0, 3, }, speed = 800, radius = 75, checkRange = 1500 },
	[4] = { id = 4, name = '小香', desc = '召喚野獸,協同作戰\n普通攻擊有10%幾率使人流血', classImg = 493, modelID = 2006, hpOrg = 240000.0, hpInc1 = 0, hpInc2 = 0, atkNOrg = 10000.0, atkNInc1 = 0, atkNInc2 = 0, defNOrg = 3000.0, defNInc1 = 0, defNInc2 = 0, atrOrg = 0, atrInc1 = 0, atrInc2 = 0, ctrOrg = 0, ctrInc1 = 0, ctrInc2 = 0, acrNOrg = 200.0, acrNInc1 = 0, acrNInc2 = 0, touOrg = 200.0, touInc1 = 0, touInc2 = 0, atkAOrg = 15000.0, atkAInc1 = 0, atkAInc2 = 0, attacks = { 93021, 93022, }, skills = { 93023, 93024, 93025 }, dodgeSkill = 93026, ultraSkill = -1, attkLst = { 2, 0, 0, 1, 0, 0, 3, }, speed = 850, radius = 75, checkRange = 1500 },
};
i3k_db_desert_battle_base = {
	gameName = '決戰荒漠',
	countPerDay = 3,
	punishTime = 300,
	bagRow = 20,
	effectId = 0,
	poisonEffectRadius = 8,
	poisonModelID = 2906,
	drugEffectID = 30116,
	reviveEffectID = 30173,
	openDayTxt = '2018-6-17',
	closeDayTxt = '2038-01-01',
	openDayDate = 1529164800,
	closeDayDate = 2145888000,
	openWeekDay = {2,4},
	openLvl = 50,
	showLvl = 30,
	maxLife = 1800,
	autoCloseTimeWhenGameEnd = 10,
	ghostTime = 5,
	reviveCount = 2,
	openTime = {
		[1] = {startTime = '21:45:00',openOffsetTime = 78300,lifeTime = 2700},
	},
	teamPersonNum = 4,
	roomTeamNum = 4,
	maxMatchTime = 600,
	killScore = 10,
	outScore = 20
};
i3k_db_desert_battle_poisonCircle = 
{
	poisonCircle = {
		[1] = {round = 1,radius = 90,safeTime = 10,startTime = 300,endTime = 360},

		[2] = {round = 2,radius = 30,safeTime = 361,startTime = 660,endTime = 720},

		[3] = {round = 3,radius = 10,safeTime = 721,startTime = 900,endTime = 960},
	},
	firstRadius = {pos = {x = 0.0, y = 0.0, z = 0.0},radius = 210	},
	circlePoint = {
		[1] = {id = 1,pos = {x = -39.725716, y = 4.345679, z = 25.009462},},

		[2] = {id = 2,pos = {x = -43.846569, y = 4.365259, z = -5.707473},},

		[3] = {id = 3,pos = {x = -42.58548, y = 4.370263, z = -2.130677},},

		[4] = {id = 4,pos = {x = -4.373963, y = 4.425915, z = 11.208776},},

		[5] = {id = 5,pos = {x = 15.749174, y = 4.384109, z = -27.91283},},

		[6] = {id = 6,pos = {x = 5.474085, y = 4.510162, z = 2.64308},},

		[7] = {id = 7,pos = {x = 46.737267, y = 4.330293, z = 30.735161},},

		[8] = {id = 8,pos = {x = 15.660699, y = 4.385511, z = -33.108948},},

		[9] = {id = 9,pos = {x = 10.887888, y = 4.631327, z = 62.478966},},

		[10] = {id = 10,pos = {x = 43.443623, y = 4.38992, z = -21.587469},},

		[11] = {id = 11,pos = {x = 23.012074, y = 4.378254, z = -24.038467},},

		[12] = {id = 12,pos = {x = -20.168224, y = 4.363617, z = -0.513213},},

		[13] = {id = 13,pos = {x = -37.434988, y = 4.362244, z = 18.572157},},

		[14] = {id = 14,pos = {x = 18.976116, y = 4.369476, z = -2.779305},},

		[15] = {id = 15,pos = {x = 25.76436, y = 4.368286, z = -3.294693},},

		[16] = {id = 16,pos = {x = -47.447079, y = 3.8995, z = -26.051922},},

		[17] = {id = 17,pos = {x = 14.025238, y = 4.351711, z = 11.699206},},

		[18] = {id = 18,pos = {x = 45.489117, y = 4.345125, z = 27.956202},},

		[19] = {id = 19,pos = {x = 3.814446, y = 4.364655, z = -0.921691},},

		[20] = {id = 20,pos = {x = 21.27006, y = 4.387846, z = -32.404732},},

		[21] = {id = 21,pos = {x = 43.264557, y = 4.365252, z = 14.798719},},

		[22] = {id = 22,pos = {x = 30.62929, y = 4.360626, z = 0.620852},},

		[23] = {id = 23,pos = {x = 13.409209, y = 4.365, z = 22.503658},},

		[24] = {id = 24,pos = {x = -14.595125, y = 4.359015, z = -25.397635},},

		[25] = {id = 25,pos = {x = 10.698193, y = 4.651746, z = 4.159214},},

		[26] = {id = 26,pos = {x = -3.201048, y = 4.498848, z = 9.58598},},

		[27] = {id = 27,pos = {x = 46.351524, y = 4.325701, z = 31.541845},},

		[28] = {id = 28,pos = {x = 47.878963, y = 4.361718, z = 27.514109},},

		[29] = {id = 29,pos = {x = 63.598938, y = 3.327576, z = 17.763924},},

		[30] = {id = 30,pos = {x = -4.073799, y = 3.865837, z = -60.630615},},

		[31] = {id = 31,pos = {x = -11.312983, y = 3.643436, z = -63.705208},},

		[32] = {id = 32,pos = {x = -18.858715, y = 4.364785, z = -25.248877},},

		[33] = {id = 33,pos = {x = -26.368095, y = 4.387516, z = -23.110424},},

		[34] = {id = 34,pos = {x = -34.647297, y = 4.364133, z = 19.585955},},

		[35] = {id = 35,pos = {x = -17.93491, y = 4.799042, z = 78.33876},},

		[36] = {id = 36,pos = {x = -55.894539, y = 3.526547, z = 74.934181},},

		[37] = {id = 37,pos = {x = -61.717209, y = 3.647263, z = 80.991013},},

		[38] = {id = 38,pos = {x = -25.941, y = 4.577487, z = 75.75901},},

		[39] = {id = 39,pos = {x = 47.088638, y = 3.348731, z = 70.541298},},

		[40] = {id = 40,pos = {x = 41.296341, y = 4.299521, z = -80.975876},},

		[41] = {id = 41,pos = {x = 15.579764, y = 3.752218, z = -73.79348},},

		[42] = {id = 42,pos = {x = -71.830399, y = 3.924955, z = 69.212593},},

		[43] = {id = 43,pos = {x = -63.046799, y = 3.647533, z = -46.620094},},

		[44] = {id = 44,pos = {x = -63.87392, y = 3.632081, z = -24.578934},},

		[45] = {id = 45,pos = {x = 6.6541562, y = 4.64, z = 65.348122},},

		[46] = {id = 46,pos = {x = -6.98825, y = 3.658898, z = -70.803322},},

		[47] = {id = 47,pos = {x = 50.765854, y = 3.327576, z = 2.716515},},

		[48] = {id = 48,pos = {x = 64.067101, y = 3.355558, z = 78.222931},},

		[49] = {id = 49,pos = {x = 11.506152, y = 3.945407, z = -66.277596},},

		[50] = {id = 50,pos = {x = 34.338558, y = 4.51236, z = 7.746922},},

		[51] = {id = 51,pos = {x = 13.972622, y = 4.047916, z = -62.305695},},

		[52] = {id = 52,pos = {x = -10.211931, y = 4.357232, z = -26.272026},},

		[53] = {id = 53,pos = {x = -51.416031, y = 3.832315, z = -23.584469},},

		[54] = {id = 54,pos = {x = -59.234959, y = 4.31092, z = 30.142883},},

		[55] = {id = 55,pos = {x = -2.449263, y = 4.517883, z = 6.774488},},

		[56] = {id = 56,pos = {x = 55.553314, y = 3.327545, z = 1.432693},},

		[57] = {id = 57,pos = {x = -67.720764, y = 3.65092, z = -38.930687},},

		[58] = {id = 58,pos = {x = 20.566019, y = 4.383695, z = -26.795406},},

		[59] = {id = 59,pos = {x = 54.303704, y = 3.327576, z = -1.351384},},

		[60] = {id = 60,pos = {x = 3.814446, y = 4.364655, z = -0.921691},},

		[61] = {id = 61,pos = {x = 64.254143, y = 4.287932, z = -68.334457},},

		[62] = {id = 62,pos = {x = 61.712112, y = 3.327606, z = -13.500662},},

		[63] = {id = 63,pos = {x = 63.838448, y = 3.327545, z = 17.321899},},

		[64] = {id = 64,pos = {x = 53.797513, y = 3.316452, z = 63.178623},},

		[65] = {id = 65,pos = {x = -46.266251, y = 3.907379, z = -27.272574},},

		[66] = {id = 66,pos = {x = 10.698193, y = 4.651746, z = 4.159214},},

		[67] = {id = 67,pos = {x = 36.177158, y = 4.368225, z = -2.272593},},

		[68] = {id = 68,pos = {x = 61.182487, y = 3.345983, z = 73.765497},},

		[69] = {id = 69,pos = {x = 73.357193, y = 4.493805, z = -1.310333},},

		[70] = {id = 70,pos = {x = 107.115519, y = 4.347308, z = 34.769859},},

		[71] = {id = 71,pos = {x = -2.823975, y = 4.470543, z = -118.710541},},

		[72] = {id = 72,pos = {x = -57.8153, y = 3.693944, z = -97.086685},},

		[73] = {id = 73,pos = {x = -57.170975, y = 3.649278, z = -46.058285},},

		[74] = {id = 74,pos = {x = -66.571007, y = 3.650921, z = -38.299706},},

		[75] = {id = 75,pos = {x = -73.779884, y = 3.611062, z = -20.62825},},

		[76] = {id = 76,pos = {x = -72.916234, y = 3.689415, z = 77.628654},},

		[77] = {id = 77,pos = {x = -110.784332, y = 4.365068, z = 83.421951},},

		[78] = {id = 78,pos = {x = -101.406296, y = 3.653469, z = 122.68457},},

		[79] = {id = 79,pos = {x = -5.889453, y = 3.991177, z = 127.052597},},

		[80] = {id = 80,pos = {x = 54.429337, y = 3.335272, z = 120.882294},},

		[81] = {id = 81,pos = {x = 91.224762, y = 4.4, z = -91.103439},},

		[82] = {id = 82,pos = {x = 31.668091, y = 4.632961, z = -124.92424},},

		[83] = {id = 83,pos = {x = -76.835648, y = 3.651, z = 83.763573},},

		[84] = {id = 84,pos = {x = -46.78111, y = 3.651, z = -35.977982},},

		[85] = {id = 85,pos = {x = -66.933739, y = 3.650742, z = -39.740594},},

		[86] = {id = 86,pos = {x = -1.594721, y = 4.645067, z = 80.267563},},

		[87] = {id = 87,pos = {x = -19.977602, y = 4.786033, z = -84.416069},},

		[88] = {id = 88,pos = {x = 58.540836, y = 3.327545, z = -11.44278},},

		[89] = {id = 89,pos = {x = 55.443214, y = 3.300425, z = 65.557869},},

		[90] = {id = 90,pos = {x = -4.674452, y = 3.663975, z = -76.048714},},

		[91] = {id = 91,pos = {x = 19.003466, y = 4.365295, z = -1.180391},},

		[92] = {id = 92,pos = {x = 2.268751, y = 3.786132, z = -68.141449},},

		[93] = {id = 93,pos = {x = -22.61591, y = 4.376748, z = -26.859838},},

		[94] = {id = 94,pos = {x = -62.454582, y = 3.648901, z = -35.415977},},

		[95] = {id = 95,pos = {x = -67.00396, y = 4.313682, z = 43.469578},},

		[96] = {id = 96,pos = {x = 6.984887, y = 4.368988, z = -2.575072},},

		[97] = {id = 97,pos = {x = 69.408768, y = 4.493744, z = 1.554812},},

		[98] = {id = 98,pos = {x = -69.558357, y = 3.651, z = -29.287464},},

		[99] = {id = 99,pos = {x = 11.386486, y = 4.382404, z = -25.839466},},

		[100] = {id = 100,pos = {x = 51.981434, y = 3.327545, z = 3.497339},},

		[101] = {id = 101,pos = {x = 3.814446, y = 4.364655, z = -0.921691},},

		[102] = {id = 102,pos = {x = 66.842323, y = 4.383387, z = -79.962578},},

		[103] = {id = 103,pos = {x = 67.524849, y = 3.327576, z = -25.222237},},

		[104] = {id = 104,pos = {x = 70.812683, y = 3.327576, z = 26.821075},},

		[105] = {id = 105,pos = {x = 55.965215, y = 3.328366, z = 72.356186},},

		[106] = {id = 106,pos = {x = -48.39394, y = 4.362265, z = -14.426208},},

		[107] = {id = 107,pos = {x = 10.698193, y = 4.651746, z = 4.159214},},

		[108] = {id = 108,pos = {x = 39.557411, y = 4.378774, z = 8.464222},},

		[109] = {id = 109,pos = {x = 66.227676, y = 3.343295, z = 63.763607},},

		[110] = {id = 110,pos = {x = 55.519291, y = 3.327545, z = -0.570555},},

		[111] = {id = 111,pos = {x = 115.590553, y = 3.382514, z = 46.194756},},

		[112] = {id = 112,pos = {x = -4.702559, y = 4.64, z = -133.36824},},

		[113] = {id = 113,pos = {x = -61.754245, y = 3.64685, z = -113.724798},},

		[114] = {id = 114,pos = {x = -65.43956, y = 3.650998, z = -60.64532},},

		[115] = {id = 115,pos = {x = -85.768814, y = 3.640119, z = -41.906902},},

		[116] = {id = 116,pos = {x = -90.234215, y = 3.6208, z = -26.677116},},

		[117] = {id = 117,pos = {x = -85.447571, y = 3.651657, z = 87.41954},},

		[118] = {id = 118,pos = {x = -123.485283, y = 4.66939, z = 79.257507},},

		[119] = {id = 119,pos = {x = -117.156311, y = 4.859689, z = 131.380219},},

		[120] = {id = 120,pos = {x = 9.792274, y = 3.957076, z = 136.667557},},

		[121] = {id = 121,pos = {x = 64.304703, y = 2.359086, z = 132.099304},},

		[122] = {id = 122,pos = {x = 106.556061, y = 4.409324, z = -100.964836},},

		[123] = {id = 123,pos = {x = 38.254997, y = 4.186027, z = -135.557007},},
	},

}
i3k_db_desert_resInfo =
{
	resCfg = {
		[1] = {round =1, refreshTime =1, resList = {'37101,37102,37103,37104,37105,37106'}},
		[2] = {round =2, refreshTime =220, resList = {'37201,37202,37203,37204,37205,37206'}},
		[3] = {round =3, refreshTime =400, resList = {'37301,37302,37303,37304,37305,37306'}},
		[4] = {round =4, refreshTime =520, resList = {'37401,37402,37403,37404,37405,37406'}},
		[5] = {round =5, refreshTime =640, resList = {'37501,37502,37503,37504,37505,37506'}},
		[6] = {round =6, refreshTime =760, resList = {'37601,37602,37603,37604,37605,37606'}},
		[7] = {round =7, refreshTime =880, resList = {'37701,37702,37703,37704,37705,37706'}},
	},
	 resPos = {

		[1] = {id = 1,pos= {x = -69.80327, y = 3.874378, z = -135.089355}},
		[2] = {id = 2,pos= {x = -70.76927, y = 4.67437744, z = -2.588348}},
		[3] = {id = 3,pos= {x = -78.82061, y = 3.874378, z = 105.946182}},
		[4] = {id = 4,pos= {x = 107.806557, y = 4.04674, z = -132.216171}},
		[5] = {id = 5,pos= {x = 74.24554, y = 4.46437744, z = -3.36706114}},
		[6] = {id = 6,pos= {x = 109.4852, y = 2.302714, z = 108.913292}},	 },
};

i3k_db_desert_battle_map =
{
	[60100] = { mapName = '決戰荒漠', imageId = 7879, titleImgId = 7880, scaleX = 0.5, scaleY = 0.5, scale = 0.125, worldMapScale = 1.0, worldMapScaleX = 0.5, worldMapScaleY = 0.5 },
};

i3k_db_desert_rank =
{
	[1] = { rankDesc = '大吉大利，我是第一' },
	[2] = { rankDesc = '可惜可惜，差點第一' },
	[3] = { rankDesc = '可惜可惜，差點第一' },
	[4] = { rankDesc = '發揮欠佳,仍需努力' },
	[5] = { rankDesc = '發揮欠佳,仍需努力' },
	[6] = { rankDesc = '發揮欠佳,仍需努力' },
	[7] = { rankDesc = '不要灰心，下次第一' },
};

i3k_db_desert_battle_show_award = {
	personAward = {
		[1] = {
			des = '150分以上',
			items = {
				[1] = {itemId = 67703,itemCount = 30},
				[2] = {itemId = 67702,itemCount = 15},
			},
		},
		[2] = {
			des = '140分-150分',
			items = {
				[1] = {itemId = 67703,itemCount = 28},
				[2] = {itemId = 67702,itemCount = 12},
			},
		},
		[3] = {
			des = '125分-139分',
			items = {
				[1] = {itemId = 67703,itemCount = 24},
				[2] = {itemId = 67702,itemCount = 9},
			},
		},
		[4] = {
			des = '110分-124分',
			items = {
				[1] = {itemId = 67703,itemCount = 21},
				[2] = {itemId = 67702,itemCount = 6},
			},
		},
		[5] = {
			des = '90分-109分',
			items = {
				[1] = {itemId = 67703,itemCount = 19},
				[2] = {itemId = 67702,itemCount = 3},
			},
		},
		[6] = {
			des = '70分-89分',
			items = {
				[1] = {itemId = 67703,itemCount = 13},
				[2] = {itemId = 67702,itemCount = 2},
			},
		},
		[7] = {
			des = '50分-69分',
			items = {
				[1] = {itemId = 67703,itemCount = 7},
				[2] = {itemId = 67702,itemCount = 1},
			},
		},
		[8] = {
			des = '30分-49分',
			items = {
				[1] = {itemId = 67703,itemCount = 5},
			},
		},
		[9] = {
			des = '0分-29分',
			items = {
				[1] = {itemId = 67703,itemCount = 3},
			},
		},
	},
	teamAward = {
		[1] = {
		des = '第1名',
		items = {
				[1] = {itemId = 67702,itemCount = 8},
				[2] = {itemId = 67684,itemCount = 8},
				[3] = {itemId = 67903,itemCount = 3},
			},
		},
		[2] = {
		des = '第2名',
		items = {
				[1] = {itemId = 67702,itemCount = 6},
				[2] = {itemId = 67684,itemCount = 6},
				[3] = {itemId = 67903,itemCount = 2},
			},
		},
		[3] = {
		des = '第3名',
		items = {
				[1] = {itemId = 67702,itemCount = 5},
				[2] = {itemId = 67684,itemCount = 4},
				[3] = {itemId = 67903,itemCount = 2},
			},
		},
		[4] = {
		des = '第4名',
		items = {
				[1] = {itemId = 67702,itemCount = 4},
				[2] = {itemId = 67684,itemCount = 3},
				[3] = {itemId = 67903,itemCount = 1},
			},
		},
		[5] = {
		des = '第5名',
		items = {
				[1] = {itemId = 67702,itemCount = 3},
				[2] = {itemId = 67684,itemCount = 2},
				[3] = {itemId = 67903,itemCount = 1},
			},
		},
		[6] = {
		des = '第6名',
		items = {
				[1] = {itemId = 67702,itemCount = 2},
				[2] = {itemId = 67684,itemCount = 1},
				[3] = {itemId = 67903,itemCount = 1},
			},
		},
		[7] = {
		des = '第7名',
		items = {
				[1] = {itemId = 67702,itemCount = 2},
			},
		},
	},
};
i3k_db_desert_battle_out_cfg = {
	[1] = {preShowTime = 120, beginOutTime = 480, outNum = 20},
	[2] = {preShowTime = 120, beginOutTime = 840, outNum = 10},
};
i3k_db_desert_battle_ui_up_chat_show_cfg = {
	[1] = { beginTime = 1, endTime = 360, type = 1},
	[2] = { beginTime = 361, endTime = 480, type = 2},
	[3] = { beginTime = 481, endTime = 720, type = 1},
	[4] = { beginTime = 721, endTime = 840, type = 2},
	[5] = { beginTime = 841, endTime = 960, type = 1},
};