-- 动作名统称
local cfg = {}
cfg.ActionEmnu={ -- [动作id] = 动作名
	[1]=	"idle",			--待机
	[2]=	"run",			--跑步
	[3]=	"collecting",
	[4]=	"hit",			--受击
	[5]=	"vertigo",		--眩晕
	[6]=	"defend",		--格挡
	[7]=	"retreat",		--击退
	[8]=	"hitup",		--击飞
	
	[10]=	"appear",		--登场
	[11]=	"attack_01",		--普攻1
	[12]=	"attack_02",		--普攻2
	[13]=	"attack_03",		--普攻3
	[17]=	"skill_01",		--施法1
	[18]=	"skill_02",		--施法2
	[19]=	"skill_03",		--施法3
	[20]=	"skill_04",		--施法4
	[21]=	"skill_05",		--施法5

	[23]=	"wakeup",		--起身
	[14]=	"warmup_01",	--起手动作1
	[15]=	"sing_01",			--吟唱1
	[16]=	"storage_01",		--蓄力1
	[24]=	"warmup_02",	--起手动作2
	[25]=	"sing_02",			--吟唱2
	[26]=	"storage_02",		--蓄力2
	[27]=	"warmup_03",	--起手动作3
	[28]=	"sing_03",			--吟唱3
	[29]=	"storage_03",		--蓄力3
	[30]=	"warmup_04",	--起手动作4
	[31]=	"sing_04",			--吟唱4
	[32]=	"storage_04",		--蓄力4
	[33]=	"warmup_05",	--起手动作5
	[34]=	"sing_05",			--吟唱5
	[35]=	"storage_05",		--蓄力5
	[36]=	"warmup_06",	--起手动作6
	[37]=	"sing_06",			--吟唱6
	[38]=	"storage_06",		--蓄力6
	
	[41]=	"wakeup_01",		--起身
	[42]=	"hitup",		--击飞
	
	[999]=	"die",			--死亡

	[998] = "talk",
	[997] = "relax",
	[996] = "showidle",
}

cfg.ActionPriority={ -- [动作id] = 动作优先级
	[1]=	0,		--待机
	[3]=	0,
	[2]=	2,		--跑步
	[4]=	0,		--受击
	[5]=	5,		--眩晕
	[6]=	5,		--格挡
	[7]=	5,		--击退
	[8]=	5,		--击飞

	[10]=	5,		--登场
	[11]=	5,		--普攻1
	[12]=	5,		--普攻2
	[13]=	5,		--普攻3
	[17]=	5,		--施法1
	[18]=	5,		--施法2
	[19]=	5,		--施法3
	[20]=	5,		--施法4
	[21]=	5,		--施法5
	[22]=	5,		--施法6
	[23]=	5,		--起身
	[14]=	5,		--起手动作1
	[15]=	5,		--吟唱1
	[16]=	5,		--蓄力1
	[24]=	5,		--起手动作2
	[25]=	5,		--吟唱2
	[26]=	5,		--蓄力2
	[27]=	5,		--起手动作3
	[28]=	5,		--吟唱3
	[29]=	5,		--蓄力3
	[30]=	5,		--起手动作4
	[31]=	5,		--吟唱4
	[32]=	5,		--蓄力4
	[33]=	5,		--起手动作5
	[34]=	5,		--吟唱5
	[35]=	5,		--蓄力5
	[36]=	5,		--起手动作6
	[37]=	5,		--吟唱6
	[38]=	5,		--蓄力6
	
	[41]=	5,		--起身
	[42]=	5,		--击飞

	[999]=	9,		--死亡
	[998] = 0,
	[997] = 0,
	[996] = 0,
}

-- 是否循环
cfg.Loop={
	[1] = true,
	[2] = true,
	[3] = true,
	[5] = true,
	[15] = true,
	[16] = true,
	[25] = true,
	[26] = true,
	[28] = true,
	[29] = true,
	[31] = true,
	[32] = true,
	[34] = true,
	[35] = true,
	[37] = true,
	[38] = true,
	[42] = true,
}

return cfg