module(...)
--auto generate data
Rule={
	[1]={
		apply_cost=100,
		breakup_cost=1000,
		change_cost=100,
		free_change_count=1,
		max_len=150,
		min_len=30,
	},
}

DefaultText={
	[1]={
		text=[[亲爱的，
我对你的爱啊，

连丁点儿的标点符号都没有停顿。
]],
	},
	[2]={
		text=[[请注意，
我正在满足你的花痴少女心。
以后每一天我都会对你
表白一次，
以后每一天我都会送你
一朵玫瑰，
以后每一天我都会
亲吻你三次，
为什么嫌弃，
你知道每天只能亲吻你三次
我有多吃亏吗
想你、爱你、陪你的每一个时刻
都想亲吻你]],
	},
	[3]={
		text=[[从今天起，
我要练习情话技能，
清晨、
午后、
黄昏、
从今天起
我要努力升战力，
茶会、
竞技、
修行
我为什么这么辛苦还不是因为你的迟钝
拜托你，
早点认识到自己超级可爱
拜托你，
只对我笑对我闹对我对我好
拜托你
接受了让我独享你的可爱好不好
]],
	},
	[4]={
		text=[[都怪你，
为什么不能多提升点战力，

你知道你每次受伤，
都让我的心难受得要蹦出来吗？

战力渣还不肯老实待在我身边，
你怎么能这么可恶。

啊，不行了。
一想到你在我不知道的地方受伤，
我就痛得连呼吸都变得困难。
你真是太可恶了。
你这恶人，
我不能容忍你祸害别人，
你以后就当我的恋人吧。]],
	},
	[5]={
		text=[[你在看吧？

我跟你商量个事情。

你知道的，
我不喜欢把事情搞得很复杂。

我会给你提供两个选项，
和1分钟的考虑时间。

那么，
你可以成为我的恋人吗？]],
	},
	[6]={
		text=[[我很霸道。
情侣、
情人、
恋人、
爱人、
甜心、
伴侣、
宝贝、
亲爱的、
达令、
我对象、
挚爱。
除此之外的称呼，
我均不能接受。
你选吧。]],
	},
	[7]={
		text=[[你那些恶作剧，
我是故意中招的，

因为想看见你的笑脸。
只要你微微一笑，
我就成了笨蛋。]],
	},
	[8]={
		text=[[在你身后众多追随者中，
我和其他人不同吧，

我是这样希望的。
非常自以为是的希望
自己对你来说是最特别的人，

因为你对我来说就是

唯一。]],
	},
	[9]={
		text=[[终于明白，
我为什么会心情烦躁。

一直很在意，
有没有人
也见过你的笑容，
发现了你的搞怪。

一直很在意，
有没有人也说过你可爱，
有没有人也得到过你的温柔。

但现在已经没事了，
因为今天此后，
我终于可以对他们说，
这是我爱人]],
	},
	[10]={
		text=[[凝视掌心短短的生命线，
期待它突然
拥有异能。

不需要
拯救世界的能力，
只想要
能越过空间和距离，

和你执手偕老。]],
	},
	[11]={
		text=[[你怎么这么蠢，
你都没发现自己多么有魅力吗？

就算你不想，
只要你淡淡一笑，
花就绽放在你脸上，
绚烂夺目。

只要你微微抬眸，
星光就落在你眼里，
无与伦比。

所有男人都会被征服。
请你有点自知之明，
认识到自己超级无敌可爱！
好不好。]],
	},
	[12]={
		text=[[你什么时候上线呢？
等你的时间
也是快乐的。

想着
左下角叮咚的一声
你就可能会出现，
我就很高兴。

如果
恰好是你上来了，
那就更好了。]],
	},
	[13]={
		text=[[喜欢一个人，
只要对方开心就好，

什么鬼，谁信啊，
反正我不信。
我喜欢你，
你只能跟我在一起。

你以后只准看我一个人，
只能爱我一个人。
除了你，
我谁都不要。]],
	},
	[14]={
		text=[[我喜欢你，
在不早不晚，
天气刚刚好的今天。

我喜欢你，
没有一丝迟疑，
没有一点顾虑。

我喜欢你，
因为这个就是我的人生设定，
与生带来。
]],
	},
	[15]={
		text=[[真是的，
你那么菜，
那么笨，

可为什么一想起你，
我就忍不住泛起
微笑。]],
	},
	[16]={
		text=[[很遗憾，
没能在你生气的时候
将你拥入怀中

很遗憾，
没能早一点认识你，
没能每天亲吻你一次

很遗憾，
今天才告诉你
我喜欢你
]],
	},
	[17]={
		text=[[即使你整天挂机，
即使你战力上场就是送人头，

即使你最喜欢装尸体，
也没关系。

因为是你，
所以没关系。]],
	},
	[18]={
		text=[[你这个磨人的小妖精，
今天我不会再心软放过你了。

我要将你捆绑着，
牢牢地拴在我身边，

谁都不能抢走你。]],
	},
	[19]={
		text=[[你要上课？
没关系我给你挂号。
你要考试？
 没关系我给你挂号。
你心情不好啊？
没关系去逛街吧，
我陪你。

不管是什么，
都会帮你挂号的，
不管是什么
都会陪着你
只给你。

所以记得上线，
因为这里有个人一直在等你。]],
	},
	[20]={
		text=[[和你在一起的时候，
我的心就会变得很小。
小到只能用来挂念你，
想你。

和你在一起的时候，
我就变得很自私，
自私到你的生命里
只有我

每时每刻都想着能触摸到你。
却发现所及之处空无一物，
于是心就抓狂。
]],
	},
	[21]={
		text=[[你也觉得身边那群家伙很讨厌吧。
我教你个办法，
你做我的恋人，
然后我天天带你去撒狗粮。

你不必为给好友撒狗粮而愧疚，
因为其实狗粮还挺好吃的，
不是吗？]],
	},
	[22]={
		text=[[进组吗？
不想来吗？
进组吗？
在忙啊。

如果不想来，
那换我进你的组吧。]],
	},
	[23]={
		text=[[茶会去吗？
修行去吗？
人形讨伐去吗？
梦魇副本去吗？
......

你知道吗？
我最想问的是，

教堂，
可以就我们两个人去吗？]],
	},
	[24]={
		text=[[从今天起，
你不能再回避他们的问题，

光想到在我不知道的角落
还有人和我一样时刻想着你，
我就要抓狂了。

所以，
你接受了吧。
成为我的恋人。
不要让我再痛苦了]],
	},
	[25]={
		text=[[竞技场又被虐了菜，
即使如此
却还想再上来，
因为想再次

遇见你。]],
	},
	[26]={
		text=[[和你聊天敲下的每个字符，
都似有山间清爽的风拂过，
似被古城温暖的光染上温度，

似正是恰好的时间，
我是不是可以
敲下这样一行话语

我喜欢你。]],
	},
	[27]={
		text=[[喂，
小蠢蛋，
你要快点提升战力啊。
虽然你也是由数值创造出来，
但还是不准你比我先挂。

我害怕我挂的时候会压疼了你。
我是不是很废材，
可是即使如此，
我还是喜欢你。

你能容许我继续喜欢你吗？
更或者，
你能容许这样的我，
向你表白吗？]],
	},
	[28]={
		text=[[无论明天
还是后天
或是未来，
我一定还会像现在这样难以自拔的
喜欢你。

因为你在我的心，
早已刻上了永久的门牌。]],
	},
	[29]={
		text=[[好像有点异想天开，
我竟觉得
我就应该是你的恋人。
然后慢慢的一路走下去，
直到世界
被颠倒黑白，
风霜
被染上色彩。]],
	},
	[30]={
		text=[[你何其可爱，
我何其帅，
我俩不在一起何其不幸。
为了世界再添善意与正能量，
我们就在一起了吧。]],
	},
	[31]={
		text=[[从现在开始，
一年365天，
一天24小时，
一分钟60秒，
我想能一直陪着你。]],
	},
	[32]={
		text=[[你在干什么？
在发呆？
还是在挂修行？

我在做什么？

我在等你的回信，

可惜不能这样和你说。
于是我只好回你：
“哦，我也在挂机。”]],
	},
	[33]={
		text=[[我本可以忍受孤独，
如果我不曾遇见你。
然而你的笑容使我的心变得柔软，
开始因为你的一颦一笑而牵动。]],
	},
	[34]={
		text=[[如果
我对你很凶，
如果
我对你很坏，
如果
我对你很冷漠，
统统都
不要相信。
因为那只是为了让你的眼里

只有我。]],
	},
	[35]={
		text=[[我曾向每一个星星许愿，
希望你每天
都能做个好梦，
希望你的美梦
能有一个我。]],
	},
	[36]={
		text=[[你很可爱
生气的你
流泪的你
吃饭的你
吐槽的你
挂机的你
打架的你
不论何时
你都很可爱]],
	},
	[37]={
		text=[[听着，
不管你是男是女，
菜鸟还是大神，
地球人还是外星人，
我统统都不想计较，
也不能计较。

因为我喜欢你。

在不小心接近你这危险生物的瞬间，
在看你生我气，又哭笑不得的时候，

在很多不可思议叠加起来的时候，
我就喜欢你了。]],
	},
	[38]={
		text=[[我去过所有的
地图，

绕过很多的
路，

知道所有的
分叉口，

却从没有认真停驻流连。

因为，都没有你。]],
	},
	[39]={
		text=[[与装备没关系，
与排名没关系。

不可思议，
即使被虐菜虐得体无完肤，

只要一想到你，
就觉得一切都美好得不可思议。]],
	},
	[40]={
		text=[[最近很忙，
忙着打造装备，
忙着提升战力，
忙着培养伙伴，
忙着给你

写情书。]],
	},
	[41]={
		text=[[我们是怎样开始聊天的，
我已经不记得了。

只记得你总是絮絮说着，
可是说着什么呢？
我已经不记得了。

我以为我会忘记很多东西，
后来发现，

你爽朗的气息早已沾染我全身，
于是我便记住了你的味道，

再也不能忘记。]],
	},
	[42]={
		text=[[你说你讨厌
异地恋，

那些距离的美
于你是毒药。

那我可能要经常吃药了，
因为我一直在远距离

暗恋你。]],
	},
	[43]={
		text=[[谢谢你这么努力地升级，
看你痛苦却在一旁窃喜的我，
可不能让你知道。

谢谢你这么不懈地升级，
我所期待的有你的未来已经到来。

谢谢你这么认真地升级，
现在我终于有勇气告诉你，
我喜欢你。
请和我交往吧。]],
	},
	[44]={
		text=[[被虐得想弃坑时对我说
“没事，我给你打回去”，

结果我在你轰然倒下的壮烈身影中
对屏惆怅。

我想着，
横竖也打不过别人，
不如当个情侣吧。

至少倒下也能秀个生死与共，
喂对方一盆狗粮。]],
	},
}
