--[[
	文件名: NetworkStates.lua
	描述:服务端错误号定义
	创建人: shuaixitao
	创建时间:2014.07.13
	修改时间: 2017-02-16
--]]

NetworkStates = {}

--- 内部账号错误号
NetworkStates.account = {
	[-1110002] = TR("账号错误"),
	[-1110001] = TR("账号不存在"),
	[-1110003] = TR("禁止登录"),
	[-1110004] = TR("该账号已被占用"),
	[-1110007] = TR("账号不符合规则"),
	[-1110008] = TR("邮箱不正确"),
}

--- 服务器列表错误号
NetworkStates.server = {
	[-1] = TR("请检查当前网络连接是否可用。"),
	[1] = TR("合作商ID不存在"),
	[2] = TR("合作商不存在"),
	[3] = TR("验证失败"),
	[4] = TR("发生异常"),
	[5] = TR("输入信息错误"),
	[6] = TR("有新资源"),
	[403] = TR("当前服务器暂未开放，敬请期待~"),
	[503] = TR("服务器正在维护或已关闭，请重新登录"),
	[404] = TR("服务器正在维护或已关闭，请重新登录"),
	[302] = TR("服务器正在维护或已关闭，请重新登录"),
	[500] = TR("服务器正在维护或已关闭，请重新登录"),
}
