FightTaskInfo={}

--scene 场景名字
--effect 音效名字
--dialog 对话
--dir 1左边人说话 2 右边人说话 3 中间人说话
--例 {data = "7_8",,dir = 1,scene = "dh_cj01.png",effect ="geye.mp3",dialog="奉宗主之命一点补偿。",},
FightTaskInfo["1"]={
           [1]={
           		begin ={
                        --[1] = {data = "7_148",dir = 3,scene = "dh_cj02.png",dialog="萧炎，今天算你赢了，但你我的战争才刚刚开始！",},
                        --[2] = {data = "7_88",dir = 3,dialog="你肉身已废，还有什么能耐！",},
                        --[3] = {data = "7_148",dir = 3,dialog="我魂族……不会善罢甘休……哈哈……",},
                        --[4] = {data = "7_98",dir = 3,dialog="萧族的废物，等我回来！",},     
                        [1] = {scene = "dh_cj04.png",talk="斗气大陆，乱世！！！为对抗“魂殿”，在药老主持下天府联盟成立……",},
                        [2] = {scene = "dh_cj02.png",talk="魂殿殿主——魂灭生！终于迎来了他最强劲的对手——萧炎，药老最得意的关门弟子……决战，生与死的较量！",},
                        --[3] = {talk="决战，生与死的较量！",},
             },
               ended = { 
                        [1] = {data = "7_148",dir = 3,scene = "dh_cj02.png",dialog="萧炎，今天算你赢了，但你我的战争才刚刚开始！",},
                        [2] = {data = "7_88",dir = 3,dialog="你肉身已废，还有什么能耐！",},
                        [3] = {data = "7_148",dir = 3,dialog="我魂族不会善罢甘休……哈哈……",},
                        [4] = {data = "7_98",dir = 3,dialog="萧族的废物，我会回来的！",},
                        [5] = {scene = "dh_cj02.png",talk="“废物”两个字多年来一直萦绕在萧炎心头，那是往日挥之不去的屈辱，而如今已不复存在……（让故事回到起点）",},
                        
                        --[5] = {scene = "dh_cj02.png",talk="萧炎跟随小医仙的佣兵队进入魔兽山脉后，偶然发现小医仙鬼鬼祟祟的身影，跟踪之后竟然发现了一个山洞！",},
                        --[4] = {data = "7_88",dir = 3,dialog="这，这怎么好意思呢！我看这位长老也受伤了，不如我送你们回去吧！",},
                        --[5] = {data = "7_51",dir = 3,dialog="那就有劳小少爷了！",},
                    },         
               },
           [2]={
                begin ={
                		[1] = {scene = "dh_cj04.png",talk="六年前，乌坦城萧家，天才少年萧炎一夜之间斗气全失，沦为“废物”"},
                		--[1] = {scene = "dh_cj04.png",talk=""},
                        [2] = {scene = "dh_cj06.png",dialog="萧炎，斗之气三段！",},
                        [3] = {data = "7_95",dir = 3,dialog="没想到都三年了，萧炎你还是一无长进，太让我失望了！",},
                        [4] = {data = "7_88",dir = 3,dialog="纳兰嫣然，你怎么来了？",},
                        [5] = {data = "7_95",dir = 3,dialog="我这次来是奉我师父云岚宗宗主之命， 解除和你的婚约！",}, 
                        [6] = {data = "7_88",dir = 3,dialog="这婚事是两家祖上订下的，你一句话就解除，让我萧家颜面何存！",},
                        [7] = {data = "7_95",dir = 3,dialog="丹药，功法，斗技，你要什么我都可以补偿给你！但是我纳兰嫣然绝不能让一个……（欲言又止）……做我夫君！",},
                        [8] = {data = "7_88",dir = 3,dialog="你是想说”废物“吧……",},
                        [9] = {data = "7_95",dir = 3,dialog="我……",},
                        [10] = {data = "7_88",dir = 3,dialog="罢了罢了……云岚宗少宗主，还真不是我这一介废物高攀得起的……但是，今天的事——由不得你！",},
                        [11] = {data = "7_95",dir = 3,dialog="你想怎样！",},
                        [12] = {data = "7_88",dir = 3,dialog="本少爷这就休了你，从今以后，你，纳兰嫣然，与我萧家，再无半点瓜葛！",},
                        [13] = {dir = 3,},
                        [14] = {data = "7_95",dir = 3,dialog="你……你竟敢休我！",},
             },
                ended = {
                        [1] = {data = "7_95",dir = 3,scene = "dh_cj06.png",dialog="我可以暂时收回解除婚约的要求，但三年后，你要来云岚宗向我挑战。赢了我为奴为婢。输了你就乖乖解除婚约！",},
                        [2] = {data = "7_88",dir = 3,dialog="纳兰家的大小姐，我萧炎奉劝你一句，三十年河东，三十年河西，莫欺少年穷！",},
                        [3] = {data = "7_95",dir = 3,dialog="希望三年后你还能有这么无用的傲气！哼！我们走！",},
                        [4] = {data = "7_88",dir = 3,dialog="三年之后，我定会去云岚宗，洗刷今日之辱！",},
                        --[5] = {data = "7_136",dir = 3,dialog="萧炎哥哥，你不要灰心！薰儿都会一直陪在萧炎哥哥身边支持你的！",},
                        --[6] = {data = "7_88",dir = 3,dialog="好薰儿，陪我去后山走走吧！",},
                    },         
                },
           [3]={
                begin ={
                        --[1] = {data = "7_2",dir = 3,scene = "dh_cj04.png",dialog="没想到在这遇到了雅妃小姐，缘分啊！",},
                        --[2] = {data = "7_88",dir = 3,dialog="加列奥你个色胚，出门都不带脑子的么！（竟然敢觊觎我看上的女人！）",},
                        [1] = {data = "7_2",dir = 3,dialog="哎哟，这不是萧家的废物么！癞蛤蟆想吃天鹅肉，云岚宗纳兰小姐也是你配得上的！",},
                        [2] = {data = "7_88",dir = 3,dialog="萧家平日对加列家族百般忍让，可是……今天，是你自找的！",},
                        [3] = {data = "7_2",dir = 3,dialog="哟！想打架？区区三段斗气，连加列家族六岁孩童都不如……你这废物凭什么跟小爷我打？",},
                        [4] = {data = "7_88",dir = 3,dialog="莫欺少年穷！",},
                   },       
                ended = {
                        [1] = {data = "7_135",dir = 3,scene = "dh_cj02.png",dialog="小子，够狼狈的啊！",},
                        [2] = {data = "7_88",dir = 3,dialog="你到底是谁？",},
                        [3] = {data = "7_135",dir = 3,dialog="嘿嘿，老夫在戒指里沉睡多年，多亏了你这三年的斗气润养，老夫今日才能苏醒！",},
                        [4] = {data = "7_88",dir = 3,dialog="你……我的斗气……我这三年所受的屈辱……",},
                        [5] = {data = "7_135",dir = 3,dialog="小朋友，不要激动，以你的天份，最多也就是个斗王，跟着我就不一样了！要不要考虑一下？",},
                        [6] = {data = "7_88",dir = 3,dialog="……",},
                        [7] = {data = "7_135",dir = 3,dialog="用不了多久你就会升级进阶，迎娶白富美，走向人生巅峰。想想是不是还有点小激动，嗯？",},
                        [8] = {data = "7_88",dir = 3,dialog="只要你能让我恢复实力，我就拜你为师！",},
                        [9] = {data = "7_135",dir = 3,dialog="一言为定！先去把这些药材准备好吧！！",},
                    },         
                }, 
           [4]={
                begin ={
                        [1] = {data = "7_512",dir = 3,scene = "dh_cj04.png",dialog="萧家的小杂种，竟然当街欺负我儿，果真是不把我加列家族放在眼里！",},
                        [2] = {data = "7_88",dir = 3,dialog="唉，永远都是打了小的，老的就出来找场子了！",},
                        [3] = {data = "7_512",dir = 3,dialog="老夫今天就替萧战好好管教一下儿子！",},
                        [4] = {data = "7_88",dir = 3,dialog="还敢不敢再流氓点，这么大岁数了，欺负小辈，不害臊！",},
                   },   
                ended = {
                        [1] = {data = "7_36",dir = 3,scene = "dh_cj04.png",dialog="炎儿，为父来晚了，加列毕那老畜生有没有伤到你？",},
                        [2] = {data = "7_88",dir = 3,dialog="不碍事！父亲你放心，从今日起，我不会再让这些人看低我萧家父子！",},
                        [3] = {data = "7_36",dir = 3,dialog="有志气，为父相信你！",},
                        [4] = {data = "7_88",dir = 3,dialog="嗯。",},
                        [5] = {data = "7_136",dir = 3,dialog="薰儿也相信你……萧炎哥哥一定会重新崛起！",},
                    },         
               }, 
           [5]={
                begin ={
                        [1] = {scene = "dh_cj01.png",talk="在药老的指导下，萧炎的实力恢复并逐步提高，终于迎来了萧家的成人礼！",},
                        [2] = {data = "7_36",dir = 3,scene = "dh_cj01.png",dialog="炎儿，今日便是成人礼了，那斗气测试你可有把握……",},
                        [3] = {data = "7_88",dir = 3,dialog="（淡淡一笑）父亲，请放心，今日炎儿定会为您洗刷往日之辱！",},
                        [4] = {data = "7_36",dir = 3,dialog="去吧，轮到你测试了！",},
                        [5] = {scene = "dh_cj03.png",dialog="萧炎，斗之气七段！",},
                        [6] = {data = "7_88",dir = 3,dialog="皇天不负有心人！",},
                        [7] = {data = "7_136",dir = 3,dialog="恭喜萧炎哥哥终于恢复实力了，薰儿好开心……哥哥是什么时候恢复的，怎么薰儿一点都不知道。",},
                        [8] = {data = "7_88",dir = 3,dialog="这是个秘密！（坏笑）",},
                   
                        [9] = {data = "7_1",dir = 3,dialog="不，不可能！！一年提升四段，难道这个废物……",},
                        [10] = {data = "7_88",dir = 3,dialog="你再叫一句“废物”试试！",},
                        [11] = {data = "7_1",dir = 3,dialog="（今日一定要废了这个家伙，不然我以后在萧家的地位……可恶）萧炎你使诈，你敢不敢跟我比试一场！！",},
                        [12] = {data = "7_88",dir = 3,dialog="有何不敢，咱两这三年的旧账也是时候算一算了！",},
                        [13] = {data = "7_136",dir = 3,dialog="这萧宁没安好心，萧炎哥哥一定要小心应付。",},
                        [14] = {data = "7_88",dir = 3,dialog="薰儿放心，他伤不了我！",},
                    },        
                },
           [6]={
               begin ={
                        [1] = {data = "7_38",dir = 3,scene = "dh_cj01.png",dialog="刚从迦南学院回来，就看到你欺负萧宁，怎么说他也是你表哥，你下手未免也太狠了！",},
                        [2] = {data = "7_88",dir = 3,dialog="他萧宁是人，我萧炎就不是人？你萧玉除了会偏袒人之外，还会什么？",},
                        [3] = {data = "7_38",dir = 3,dialog="狡辩！你伤了我亲弟弟，现在我向你挑战，如果有本事，就接下来！",},
                        [4] = {data = "7_88",dir = 3,dialog="萧炎奉陪到底！不过，你到底是为萧宁出头，还是记恨当年我摸你大腿的事情？",},
                        [5] = {data = "7_38",dir = 3,dialog="你……你……无耻！",},
                    },

                    
                ended = {
                        [1] = {data = "7_88",dir = 3,scene = "dh_cj02.png",dialog="萧玉也不过如此嘛！",},
                        [2] = {data = "7_135",dir = 3,dialog="这萧玉擅长的是“入场控制技”，是合适的替补位英雄人选，今日以主力位出战实力发挥不到五层，你小子别得意！",},
                        [3] = {data = "7_88",dir = 3,dialog="原来如此，这小妮子什么时候学会了入场技，迦南学院果然名不虚传！",},
                        [4] = {data = "7_135",dir = 3,dialog="作为这片大陆上最闻名的斗气学府，实力远超你的想象！正好迦南学院来乌坦城招生了，你去报名吧。",},
                        [5] = {data = "7_88",dir = 3,dialog="我去那里做什么？我功法斗技都不缺，他们还能教什么？",},
                        [6] = {data = "7_135",dir = 3,dialog="迦南学院的“陨落心炎”可是排名第14位的异火！若能得到它，对你来说好处可不小！",},
                        [7] = {data = "7_88",dir = 3,dialog="陨落心炎么。。很好！明天我就去报名！",},
                    },                 
                },  
           [7]={
                begin ={
                        [1] = {data = "7_88",dir = 3,scene = "dh_cj04.png",dialog="你好，我是萧家萧炎，来参加迦南学院的招生报名的！",},
                        [2] = {data = "7_515",dir = 3,dialog="你就是欺负玉儿的萧炎！今天我就替玉儿好好教训教训你！",},
                    },
                ended = {
                        [1] = {data = "7_135",dir = 3,scene = "dh_cj01.png",dialog="我们现在还不能去学院，学院的教学并不能让你赢得三年之战！",},
                        [2] = {data = "7_88",dir = 3,dialog="那老师我们之后去哪？",},
                        [3] = {data = "7_135",dir = 3,dialog="我想带你出去修行历练，此次修行，时间有些长，或许要一年多。",},
                        [4] = {data = "7_88",dir = 3,dialog="好，一年多就一年多，我去请假！",},
                        [5] = {data = "7_51",dir = 3,dialog="雅妃见过萧家小少爷。",},
                        [6] = {data = "7_88",dir = 3,dialog="你是……米特尔拍卖场的首席美女拍卖师（果然是人间尤物）",},
                        [7] = {data = "7_51",dir = 3,dialog="正是小女子，听闻小少爷恢复了实力，特地前来贺喜。",},
                        [8] = {data = "7_88",dir = 3,dialog="（坏笑）姐姐太疼爱萧炎了！",},
                        [9] = {data = "7_51",dir = 3,dialog="小少爷若不嫌弃，我们可以交个朋友，这份礼包还请笑纳。",},
                        [10] = {data = "7_88",dir = 3,dialog="姐姐太客气了，萧炎收下了。",},
                        [11] = {data = "7_51",dir = 3,dialog="那小少爷以后的成长所需都由我米特尔家族一力承当。",},
                    },    
                },  
           [8]={
                begin ={
                        [1] = {data = "7_52",dir = 3,scene = "dh_cj04.png",dialog="欢迎加入迦南学院，我是你的导师若琳！",},
                        [2] = {data = "7_88",dir = 3,dialog="若琳导师，我暂时不能跟你去学院，有件事情需要我去完成，我想请一年的假！",},
                        [3] = {data = "7_52",dir = 3,dialog="还没入学就要请假，还一请就一年，就算你天赋不错，也不要太嚣张。",},
                        [4] = {data = "7_88",dir = 3,dialog="这一年对我很重要，如果不行，我就不去迦南学院了。",},
                        [5] = {data = "7_52",dir = 3,dialog="那好，只要你能从我手中走过十招，请假的事情我帮你搞定。",},
                        [6] = {data = "7_88",dir = 3,dialog="那还望若琳导师手下留情了！",},
                    },
                ended = {
                        [1] = {data = "7_52",dir = 3,scene = "dh_cj04.png",dialog="你居然撑过来了，这一年的假期，便给你吧。",},
                        [2] = {data = "7_88",dir = 3,dialog="多谢若琳导师成全！",},
                        [3] = {data = "7_135",dir = 3,scene = "dh_cj01.png",dialog="既然迦南学院的事情已经搞定了，我们也是时候离开乌坦城开始历练了！",},
                        [4] = {data = "7_88",dir = 3,dialog="老师，我们要去什么地方呢？",},
                        [5] = {data = "7_135",dir = 3,dialog="我打算让你在魔兽山脉中，晋级成斗师！现在你所欠缺的，是铁与血的磨练。",},
                        [6] = {data = "7_88",dir = 3,dialog="魔兽山脉么。。我来了！",},
                    },                  
                },          
}

FightTaskInfo["2"]={
           [9]={
                begin ={
                        [1] = {data = "7_135",dir = 3,scene = "dh_cj02.png",dialog="我们现在已经到了魔兽山脉的外围了, 从今天开始一切都必须依靠你自己, 我不会出手！",},
                        [2] = {data = "7_88",dir = 3,dialog="要不要这么狠。。好吧, 为了实力，拼了。",},
                        [3] = {data = "7_135",dir = 3,dialog="走吧, 开始你的苦修之路吧。",},
                        [4] = {data = "7_88",dir = 3,dialog="唉，受苦受难的日子要开始了。。咦，这是。。果然是血莲精么！",},
                        [5] = {data = "7_135",dir = 3,dialog="小子你狗屎运也太旺了吧！这都能被你捡到！",},
                        [6] = {data = "7_88",dir = 3,dialog="哈哈，难道你不知道什么是主角光环么！爷就是这么牛×的存在！",},
                        [7] = {data = "7_509",dir = 3,dialog="- -，小子，把你手上的血莲精交出来，不然别怪我不客气。",},
                        [8] = {data = "7_88",dir = 3,dialog=".....要不要这么恶俗！",},
                        [9] = {data = "7_135",dir = 3,dialog="剧情需要，表在意细节！牛×的存在！去吧！",},
                      },
                },
           [10]={
                begin ={
                        [1] = {data = "7_135",dir = 3,scene = "dh_cj02.png",dialog="魔兽山脉危机重重，不如找个佣兵工会寻个庇护。",},
                        [2] = {data = "7_88",dir = 3,dialog="这也行？",},
                        [3] = {data = "7_135",dir = 3,dialog="大树底下好乘凉，相信我，老江湖！",},
                        [4] = {data = "7_88",dir = 3,dialog="……信你一回！",},
                    },
                middle = {
                        {fight = 1,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "我想加入佣兵团！<face=0>"}},
                        {fight = 1,round = 1,talk = {dir = 0,name="佣兵",cardID=508,dialog = "身高，体重，学历，几年工作经验？"}},
                        {fight = 1,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "<face=7>...你们这是新东方办事处怎么的！"}},
                        {fight = 1,round = 1,talk = {dir = 0,name="佣兵",cardID=508,dialog = "哪里来的小屁孩？毛都没长齐，就出来乱晃荡！家蹲着和泥玩去！"}},
                        {fight = 1,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "<face=4>老虎不发威你当我helloKitty啊！看打！"}},
                    },      
                ended = {
                        [1] = {data = "7_89",dir = 3,scene = "dh_cj02.png",dialog="就是你想要加入我们万药斋的佣兵团？",},
                        [2] = {data = "7_88",dir = 3,dialog="以我的实力应该够格加入你们吧！",},
                        [3] = {data = "7_89",dir = 3,dialog="你的实力确实足够了，但是我也要提醒你一句，进了山脉之后不要到处乱跑！落了单，小心小命不保！",},
                    },         
                },  
           [11]={
                begin ={
                        [1] = {data = "7_508",dir = 3,scene = "dh_cj02.png",dialog="马上就要进入山脉了，大家注意保持队形，小心魔兽！",},
                        [2] = {data = "7_88",dir = 3,dialog="切！用不用这么小心！",},
                        [3] = {data = "7_89",dir = 3,dialog="不好，是兽群！",},
                        [4] = {data = "7_88",dir = 3,dialog="放着我来！",},
                    },
                middle = {
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "这是什么魔兽！这么厉害！"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="药老",cardID=135,dialog = "嘿嘿，小子，早就告诉你别太狂妄，这是二阶魔兽冰霜独角狼！可不是好惹的！"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="药老",cardID=135,dialog = "<face=2>呸，小爷也不是好惹的！"}},
                    },      
                },  		
           [12]={
                begin ={
                        [1] = {scene = "dh_cj02.png",talk="萧炎跟随小医仙的佣兵队进入魔兽山脉后，偶然发现小医仙鬼鬼祟祟的身影，跟踪之后竟然发现了一个山洞！",},
                    }, 
                --middle = {
                --        {fight = 1,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "不好，竟然有魔兽守护！"}},
                --    },  
                ended = {
                        [1] = {data = "7_135",dir = 3,scene = "dh_cj02.png",dialog="这个山洞这么隐蔽，小子，看来你摊上事了！",},
                        [2] = {data = "7_88",dir = 3,dialog="这么隐蔽的山洞，遇上了邪魔看守，小医仙到底在搞什么鬼！进去看看！",},
                    },         
                },         
           [13]={
                begin ={
                        [1] = {data = "7_89",dir = 3,scene = "dh_cj02.png",dialog="谁？竟然是你，你跟踪我？",},
                        [2] = {data = "7_88",dir = 3,dialog="不跟踪你，我怎么知道你鬼鬼祟祟的有什么阴谋！",},
                        [3] = {data = "7_89",dir = 3,dialog="我只是来这里采点草药！",},
                        [4] = {data = "7_88",dir = 3,dialog="采草药？你当我三岁小孩，这个山洞这么隐蔽想必是有什么宝物吧！",},
                        [5] = {data = "7_89",dir = 3,dialog="既然被你发现了，看来留你不得了！",},
                        [6] = {data = "7_508",dir = 3,dialog="你们两个谁都别想留，识相的乖乖把宝物交出来",},
                    }, 
                ended = {
                        [1] = {data = "7_89",dir = 3,scene = "dh_cj02.png",dialog="谢谢你出手相助，这宝藏算你一份。不过,你最好别打什么独吞的主意",},
                        [2] = {data = "7_88",dir = 3,dialog="放心吧, 独吞这种事, 我可做不出来！",},
                        [3] = {data = "7_89",dir = 3,dialog="（小医仙半信半疑的盯着萧炎，突然感到心里有些许异样，眼前这个男人突带给她一种从未有过的信赖）",},
                        [4] = {data = "7_88",dir = 3,dialog="这些就是宝藏？",},
                        [5] = {data = "7_89",dir = 3,dialog="对！这本毒经归我！草药平分，剩下的这瓶丹药给你！",},
                    },         
                },
           [14]={
                begin ={
                        [1] = {data = "7_89",dir = 3,scene = "dh_cj02.png",dialog="东西也给你了，现在可以回去了吧！",},
                        [2] = {data = "7_88",dir = 3,dialog="嘘！有声音！好像又有人来了！",},
                        [3] = {data = "7_508",dir = 3,scene = "dh_cj02.png",dialog="杀了我狼头佣兵团的人还想跑！少爷有令，抓活的！",},
                        --[4] = {data = "7_88",dir = 3,dialog="不是吧！比我还卑鄙！跟踪我？",},
                        --[5] = {data = "7_89",dir = 3,dialog="都是你惹的祸！你来解决！",},
                        --[6] = {data = "7_88",dir = 3,dialog="要不要这么现实！跟我抢东西，那就让小爷好好教训教训你们！",},
                    }, 
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="佣兵",cardID=508,dialog = "宝藏就在他们手里，杀！别让他们跑了！"}},
                    },    
                },         
           [15]={
                begin ={
                        [1] = {data = "7_89",dir = 3,scene = "dh_cj02.png",dialog="狼头佣兵团人太多了，我们怎么办！",},
                        [2] = {data = "7_88",dir = 3,dialog="能怎么办，凉拌！唉呀呀，你们女人真是好能惹麻烦！",},
                        [3] = {data = "7_4",dir = 3,dialog="小子，只要你把小医仙和宝物交出来，我可以放你一条生路。",},
                        [4] = {data = "7_88",dir = 3,dialog="小爷我从来不会出卖女人，我也给你一个生路，带着你人赶紧滚！",},
                        [5] = {data = "7_4",dir = 3,dialog="死到临头还嘴硬！",},
                    }, 
                ended = {
                        [1] = {data = "7_89",scene = "dh_cj02.png",dir = 3,dialog="谢谢你救了我，但是狼头佣兵团不会善罢甘休的！你有什么打算？",},
                        [2] = {data = "7_88",dir = 3,dialog="我准备进入魔兽山脉，你愿意和我一起么？",},
                        [3] = {data = "7_89",dir = 3,dialog="我……（一句愿意差点脱口而出，却被生生咽了回去）",},
                        [4] = {data = "7_88",dir = 3,dialog="魔兽山脉危险重重，你跟着我太危险了，你回到万药斋自然有人庇护，想必狼头佣兵团也不敢动你！",},
                        [5] = {data = "7_89",dir = 3,dialog="那你自己保重……路上小心！（萧炎，你一定要活着回来！）",},
                    },         
                },
}

FightTaskInfo["3"]={
           [16]={
                middle = {
                        {fight = 3,round = 1,talk = {dir = 0,name="穆力",cardID=508,dialog = "追！别让他们跑了！"}},
                        {fight = 3,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "妈的，狼头佣兵团，你有种就弄死小爷，不然我迟早拆了你们老窝！"}},
                    },
                },
            [18]={
                begin ={
                        [1] = {data = "7_135",dir = 3,scene = "dh_cj02.png",dialog="魔兽山脉药材众多，正好锻炼下你的炼药能力。",},
                        [2] = {data = "7_88",dir = 3,dialog="咦，这是。。竟然是回灵赤果,太好了，炼制丹药的药材终于找全了！",},
                        [3] = {data = "7_135",dir = 3,dialog="凡是能量浓郁之所的珍稀药草, 大多都有着魔兽的守卫。小心！",},
                    },
                middle = {
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "守护兽竟然是二阶魔兽？！没办法了，只能拼了！"}},
                    }, 
                ended = {
                        [1] = {data = "7_135",dir = 3,scene = "dh_cj02.png",dialog="区区一个二阶魔兽就把你折腾成这样，我这有把兵器，把它装备上吧！",},
                        [2] = {data = "7_88",dir = 3,dialog="有装备，早你不给我！赶紧的，还有没有！统统给我交出来！还有我刚才只是一时大意！",},
                        [3] = {data = "7_135",dir = 3,dialog="一时大意！我看你是还惦记着刚才那姑娘！- -，我怎么收了这么个徒弟！",},
                        [4] = {data = "7_88",dir = 3,dialog="懒得理你！",},
                    },         
                },              
           [21]={
                begin ={
                        [1] = {scene = "dh_cj02.png",talk="萧炎实力大增，在继续深入修炼时却不小心被狼头佣兵团的哨兵发现了行踪！",},
                    },
                 middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="佣兵",cardID=508,dialog = "萧炎，你跑不掉的！得罪了我们狼头佣兵团，没有你好果子吃！"}},
                    },        
                },         
           [24]={
                begin ={
                        [1] = {data = "7_508",dir = 3,scene = "dh_cj02.png",dialog="哪来的小子，这可是赫蒙大人的营地！",},
                        [2] = {data = "7_88",dir = 3,dialog="赫蒙？狼头佣兵团的三团长么！呵呵，那就让我先收点利息吧！",},
                    },
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="赫蒙",cardID=530,dialog = "你还真是有胆。竟然敢单独地来刺杀我。不过也好，就在这里解决你吧"}},
                    },        
                },
           [25]={
                begin ={
                        [1] = {data = "7_20",dir = 3,scene = "dh_cj02.png",dialog="该死的萧炎，竟然屠杀了赫蒙！当真是没把我们狼头佣兵团放在眼里！",},
                        [2] = {data = "7_88",dir = 3,dialog="你又是哪根葱？",},
                        [3] = {data = "7_20",dir = 3,dialog="老夫就是狼头佣兵团的团长穆蛇！能死在老夫手里也算是你积了八辈子德了！",},
                        [4] = {data = "7_88",dir = 3,dialog="呸，你个老杂毛，想收拾爷，你也配！",},
                        [5] = {data = "7_20",dir = 3,dialog="小混蛋，今天我就要你葬身在这魔兽山脉之中！",},
                    },
                ended = {
                        [1] = {data = "7_20",dir = 3,scene = "dh_cj02.png",dialog="可恶, 竟然让他跑了！",},
                        [2] = {data = "7_88",dir = 3,dialog="今日围杀, 萧炎铭记在心, 来日, 定原封回报！",},
                        [3] = {data = "7_135",dir = 3,dialog="再往前就是魔兽山脉深处了，除了高阶魔兽，还要面临狼头佣兵团的追杀，小子，准备好了么。",},
                        [4] = {data = "7_88",dir = 3,dialog="我日他个仙人板板，谁怕谁吧！ 走！",},
                    },         
                },         
}

FightTaskInfo["4"]={
           [26]={
                begin ={
                        [1] = {data = "7_135",dir = 3,scene = "dh_cj02.png",dialog="请注意，请注意，又一波魔兽从前方袭来！壮士请继续努力！",},
                        [2] = {data = "7_88",dir = 3,dialog="擦！这魔兽怎么没完没了的！这是有多大仇多大怨啊！",},
                        [3] = {data = "7_135",dir = 3,dialog="都跟你说了，剧情需要，不然怎么能显示出你主角的地位！",},
                        [4] = {data = "7_88",dir = 3,dialog="#￥%~·#￥！",},
                    },         
                },        
           [28]={
                begin ={
                        [1] = {data = "7_135",dir = 3,scene = "dh_cj02.png",dialog="这都第三波魔兽了，不对劲，魔兽怎么躁动的这么厉害！",},
                        [2] = {data = "7_88",dir = 3,dialog="呜呜呜。。难道为了我的主角需要，他们冬天也开始发情么。。。天，这是啥？！",},
                        [3] = {data = "7_135",dir = 3,dialog="竟然是五阶魔兽紫晶翼狮王！小子快躲起来！",},
                        [4] = {data = "7_88",dir = 3,dialog="这是什么女人啊，竟然能和狮王激战！芭比金刚么！这么厉害，还给不给我们男人留活路了！",},
                        [5] = {data = "7_135",dir = 3,dialog="应该是斗皇级别的高手！她虽然重创了紫晶狮王，但看情形她自己也伤的不轻！",},
                        [6] = {data = "7_88",dir = 3,dialog="我们过去看看吧！她晕过去了，现在怎么办？",},
                        [7] = {data = "7_135",dir = 3,dialog="你先帮她疗伤吧！",},
                        [8] = {scene = "dh_cj02.png",talk="萧炎刚刚掀开神秘女子的衣服，要帮她上药，女子突然转醒过来！于是。。。",},
                        [9] = {data = "7_91",dir = 3,dialog="啊啊啊！非礼啊！无耻之徒！竟然趁人之危！",},
                        [10] = {data = "7_88",dir = 3,dialog="我去，大姐，我啥都没干啊！我只是想帮你疗伤而已。没有恶意。",},
                        [11] = {data = "7_91",dir = 3,dialog="还敢狡辩！纳命来！",},
                    },
                middle = {
                        {fight = 1,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "<face=4>我冤枉啊！！"}},
                    },
                ended = {
                        [1] = {data = "7_91",dir = 3,scene = "dh_cj02.png",dialog="要不是我斗气被封印，也不会打不过你！",},
                        [2] = {data = "7_88",dir = 3,dialog="我已经解释过了, 你也看到了, 我真的什么都没做。",},
                        [3] = {data = "7_91",dir = 3,dialog="今天的事, 我们都当做没有发生吧, 不然传出去, 对你没什么好处。",},
                        [4] = {data = "7_88",dir = 3,dialog="。。。。。",},
                    },         
                },
           [29]={
                begin ={
                        [1] = {data = "7_91",dir = 3,scene = "dh_cj02.png",dialog="什么声音？你要做什么？",},
                        [2] = {data = "7_88",dir = 3,dialog="外面魔兽暴动的厉害，应该是紫晶狮王在搜寻你的消息，你不要踏出这个山洞!魔兽我来对付！",},
                    },
                ended = {
                        [1] = {data = "7_91",dir = 3,scene = "dh_cj02.png",dialog="天，你受伤了！你没事吧！",},
                        [2] = {data = "7_88",dir = 3,dialog="大姐，我求你了，你最近别再出去乱跑了，再来两拨我可受不了了！",},
                        [3] = {data = "7_91",dir = 3,dialog="你。。好了，你先养伤吧，我。。我会注意的！谢谢你！",},
                    },         
                },  
           [30]={
                begin ={
                        [1] = {data = "7_91",dir = 3,scene = "dh_cj02.png",dialog="我中了紫晶翼狮王的封印,只有紫晶翼狮王山洞里的紫灵晶才能让我恢复。",},
                        [2] = {data = "7_88",dir = 3,dialog="然后呢？",}, 
                        [3] = {data = "7_91",dir = 3,dialog="你怎么不按剧情发展走呢！这时候你应该主动跳出来说你帮我啊！",},
                        [4] = {data = "7_88",dir = 3,dialog="我傻啊！就算我是主角我也不是傻的啊！",}, 
                        [5] = {data = "7_91",dir = 3,dialog="- -！非逼着我用武力！",},
                        [6] = {data = "7_88",dir = 3,dialog="...orz，大姐，我错了，我这就配合你去拿紫灵晶！",}, 
                        [7] = {data = "7_91",dir = 3,dialog="乖！先把门口的魔兽解决了吧！",},                                       
                    },        
                },         
           [31]={
                begin ={
                        [1] = {data = "7_91",dir = 3,scene = "dh_cj02.png",dialog="我会在外面牵制住紫晶翼狮王, 你去山洞里帮我找紫灵晶。",},
                        [2] = {data = "7_88",dir = 3,dialog="好的，女王大人！",},                
                    },   
                middle = {
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "欧漏！为什么这里还有一只紫晶狮王！！"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="药老",cardID=135,dialog = "这是只幼兽，恭喜你中奖啦~果然主角的人生就是这么跌宕起伏的说~"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "orz。。为什么要这么对我！<face=4>"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="药老",cardID=135,dialog = "<face=3>有没有觉得自己萌萌哒~去吧，皮卡丘！"}},
                    },
                ended = {
                        [1] = {data = "7_135",dir = 3,scene = "dh_cj02.png",dialog="叮咚：壮士恭喜您获得紫灵晶，友情提示，您已经激活山洞所有魔兽，请注意安全！请注意安全！",},
                        [2] = {data = "7_88",dir = 3,dialog="死老头！你不帮忙就算了，要不要这么落井下石！！我死了看你去哪找徒弟！",},
                        [3] = {data = "7_135",dir = 3,dialog="哎呀，对哦，我不能眼睁睁看着我徒弟身临险境！我还是回戒指里吧！徒弟，加油~",},
                        [4] = {data = "7_88",dir = 3,dialog="#￥%~·#￥！",},
                    },         
                },         
           [35]={
                begin ={
                        [1] = {data = "7_91",dir = 3,scene = "dh_cj02.png",dialog="紫灵晶到手了么？",},
                        [2] = {data = "7_88",dir = 3,dialog="幸不辱命！",},        
                        [3] = {data = "7_501",dir = 3,dialog="狡猾的人类！竟敢伤我儿子，我紫晶翼狮王，与你誓不罢休！",},  
                        [4] = {data = "7_88",dir = 3,dialog="云芝，小心！",},        
                        [5] = {data = "7_91",dir = 3,dialog="畜生，竟然伤他！我杀了你！",},                                
                    },   
                ended = {
                        [1] = {data = "7_91",dir = 3,scene = "dh_cj02.png",dialog="多亏了你的紫灵晶，我的实力已经恢复了！小家伙，这段日子，谢谢你的照顾！",},
                        [2] = {data = "7_88",dir = 3,dialog="你要走了么...",},        
                        [3] = {data = "7_91",dir = 3,dialog="唉, 日后有缘再见吧！",},
                        [4] = {data = "7_88",dir = 3,dialog="好的。。女王大人！",},        
                        [5] = {data = "7_91",dir = 3,dialog="你。你个小混蛋！保重！",},
                        [6] = {data = "7_88",dir = 3,dialog="她走了么...",}, 
                        [7] = {data = "7_135",dir = 3,dialog="对啊~你个小混蛋~",},
                        [8] = {data = "7_88",dir = 3,dialog="呕。。。",},
                    },         
                },         
}

FightTaskInfo["5"]={
           [36]={
                begin ={
                        [1] = {data = "7_135",dir = 3,scene = "dh_cj02.png",dialog="紫晶狮王一战让你突破，但需要战斗让你的斗气变得更加稳扎。",},
                        [2] = {data = "7_88",dir = 3,dialog="所以。。。",},
                        [3] = {data = "7_135",dir = 3,dialog="所以，奋斗吧，少年~迎接魔兽和佣兵的袭击吧~",},
                    },         
                },
           [38]={
                begin ={
                        [1] = {data = "7_135",dir = 3,scene = "dh_cj02.png",dialog="咱们已经进入魔兽山脉深处了，这里的魔兽比之前的厉害的多！你要多加小心~",},
                        [2] = {data = "7_88",dir = 3,dialog="啊啊啊，我到底还要一个人在这个破山脉待多久！！",},
                        [3] = {data = "7_135",dir = 3,dialog="少年，你空虚么，你寂寞么，你觉得孤独么~魔兽山脉高阶魔兽欢迎您~",},
                        [4] = {data = "7_88",dir = 3,dialog=".....咦，有人的声音，这是青山镇的佣兵团么？太好了，终于看到个人影~去打个招呼！",},
                    },  
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="苓儿",cardID=518,dialog = "哪来的小贼，竟敢偷听我们谈话！"}},
                    },       
                },
		
           [39]={
                begin ={
                        [1] = {data = "7_519",dir = 3,scene = "dh_cj02.png",dialog="小兄弟，不好意思误会你了，我们被狼头佣兵团追杀，不知道小兄弟能否帮个忙，日后必有重谢！",},
                        [2] = {data = "7_88",dir = 3,dialog="又是狼头佣兵团？- -，编剧你还敢再帮他们拉仇恨一点么！",},
                        [3] = {data = "7_135",dir = 3,dialog="小说永恒定律一：主角的敌人就是世界的敌人~",},
                        [4] = {data = "7_88",dir = 3,dialog="orz，好吧，反正我跟他们也有笔帐还没算！",},
                    },  
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="佣兵",cardID=509,dialog = "哈哈，找到卡岗了，快把他们抓回去！"}},
                        {fight = 1,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "我这么英俊帅气，他们竟然没发现我的存在！他们是瞎么？"}},
                        {fight = 1,round = 1,talk = {dir = 0,name="佣兵",cardID=509,dialog = "0.0！！萧炎！！！！"}},
                        {fight = 1,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "现在才发现，果然是瞎的！"}},
                    },       
                },
           [41]={
                begin ={
                        [1] = {data = "7_517",dir = 3,scene = "dh_cj02.png",dialog="没想到追捕卡岗竟然让我发现了萧炎你这条大鱼，哈哈，乖乖把宝藏交出来吧！",},
                        [2] = {data = "7_88",dir = 3,dialog="怎么是根葱就能跑出来跟我叫板？我是专业切葱手么？",},
                        [3] = {data = "7_517",dir = 3,dialog="你！小子别猖狂！我可是狼头佣兵团的二团长！",},
                        [4] = {data = "7_88",dir = 3,dialog="哦，原来是二团长啊，是够二的~想要宝藏，也要你有这个能耐！",},
                    },  
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="甘穆",cardID=517,dialog = "小杂种，你若是落在我手中。定要你生不如死！"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "哎哟，我好怕怕哦~"}},
                    },
                },         
           [44]={
                begin ={
                        [1] = {data = "7_135",dir = 3,scene = "dh_cj02.png",dialog="这么长时间的试炼，你实力大涨，也是时候解决掉狼头佣兵团了！",},
                        [2] = {data = "7_88",dir = 3,dialog="嗯！",},
                    },  
                middle = {
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "穆蛇团长，呵呵，好久不见啊！抱歉，我来踢场！"}},
                        {fight = 2,round = 1,talk = {dir = 0,name="穆蛇",cardID=20,dialog = "今天，你，可以永远的留下了！"}},
                    },
                },
           [45]={
                begin ={
                        [1] = {data = "7_135",dir = 3,scene = "dh_cj02.png",dialog="不错，能消灭七星大斗师，看来试炼效果不错啊！",},
                        [2] = {data = "7_88",dir = 3,dialog="对了，小医仙被他们抓走了，我得把她救出来！",},
                    }, 
                middle = {
                        {fight = 1,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "该死的，怎么有这么多的魔兽！"}},
                        {fight = 3,round = 1,talk = {dir = 0,name="小医仙",cardID=89,dialog = "呃。。啊啊啊啊！"}},
                        {fight = 3,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "怎么回事！小医仙，是我啊，我是萧炎啊！她怎么会突然发狂了。"}},
                        {fight = 3,round = 1,talk = {dir = 1,name="药老",cardID=135,dialog = "果然是啊。。。没想到还能再次见到厄难毒体，先控制住她吧。"}},
                    },
                ended = {
                        [1] = {data = "7_89",dir = 3,dialog="厄难毒体，以毒为生，也许这就是命吧, 我要走了, 或许会去出云帝国看看, 然后四处游历大陆。",},
                        [2] = {data = "7_88",dir = 3,dialog="小医仙, 就在这里分别吧, 日后有缘再见！",},
                        [3] = {data = "7_89",dir = 3,dialog="保重, 萧炎！",},
                        [4] = {data = "7_135",dir = 3,dialog="魔兽山脉的历练已经结束了，你需要一些丹药来提升，去附近的城池看看吧！",},
                   },         
                },         
}

FightTaskInfo["6"]={
           [46]={
                begin ={
                        [1] = {data = "7_135",dir = 3,scene = "dh_cj04.png",dialog="不知道这黑岩城有没有炼药师工会, 如果有的话, 最好去测试一下, 看能不能达到二品吧。",},
                        [2] = {data = "7_88",dir = 3,dialog="去炼药师工会？那不是会暴露我炼药师的身份么？我这么低调~",},
                        [3] = {data = "7_135",dir = 3,dialog="低调你妹！我又没叫你隐瞒身份！明天再去拍卖会看看有没有需要的药材, 希望不会让我们失望。",},
                    },
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="地痞",cardID=538,dialog = "嘿，小子，没看见大爷在这么，想进城，把保护费交了！"}},
                        {fight = 1,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "滚开！"}},
                        {fight = 1,round = 1,talk = {dir = 0,name="喽喽",cardID=538,dialog = "臭小子，敢这么跟本大爷说话！活得不耐烦了！小的们，给我教训教训他！"}},
                    },          
                },
           [47]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="喽喽",cardID=508,dialog = "老大，就是这个小子，不缴进城费，还打伤了我们！"}},
                        {fight = 1,round = 1,talk = {dir = 0,name="佣兵",cardID=533,dialog = "很傲么小子，来人，收拾收拾他。"}},
                    },         
                },         
           [48]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="琳菲",cardID=7,dialog = "哪里来的狂徒，竟然当街欺负人！"}},
                    },
                },
           [49]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="守卫",cardID=508,dialog = "这里是炼药师工会，就凭你可没有资格进去！"}},
                    },
                },         
           [50]={
                begin ={
                        [1] = {data = "7_518",dir = 3,scene = "dh_cj01.png",dialog="这位先生, 抱歉, 我们的佣兵冒犯了, 您请这边进行考核测试。",},
                    },        
                },
           [51]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="弗兰克",cardID=9,dialog = "小家伙。想考炼药师？让老夫来试试你的斤两吧！"}},
                    },
                },         
           [53]={
                begin ={
                        [1] = {data = "7_6",dir = 3,scene = "dh_cj01.png",dialog="竟然成功了？他才十九岁！这怎么可能！不可能, 我不信！",},
                    },
                },         
           [54]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="奥拓",cardID=10,dialog = "打败了雪魅，很不错嘛，试试看能不能过了我这关！"}},
                    },
                },
           [55]={
                begin ={
                        [1] = {data = "7_135",dir = 3,scene = "dh_cj01.png",dialog="炼药工会表现的不错，这艘飞船去往塔戈尔沙漠，我会在这帮你把丹药炼制出来，可能会引来一些宵小之徒，你要小心！",},
                        [2] = {data = "7_520",dir = 3,dialog="这是。。。五品丹药出世！！快！里面的丹药快要炼成了！动手！",},
                        [3] = {data = "7_88",dir = 3,dialog="我看谁敢！跟小爷我抢东西，活得不耐烦了吧！",},
                   },
                ended = {
                        [1] = {data = "7_135",dir = 3,scene = "dh_cj01.png",dialog="贪心的人终归是没有好下场，小子，塔戈尔大沙漠要到了, 走吧…",},
                        [2] = {data = "7_88",dir = 3,dialog="终于要到了么。。",},
                    },         
                },         
}

FightTaskInfo["7"]={
           [56]={
                begin ={
                        [1] = {data = "7_135",dir = 3,scene = "dh_cj05.png",dialog="最后的修行之地，塔戈尔大沙漠，终于抵达了！",},
                        [2] = {data = "7_508",dir = 3,dialog="大人。您是要出城？最近塔戈尔大沙漠里的蛇人有些不安分。您可得小心。",},
                        [3] = {data = "7_88",dir = 3,dialog="蛇人么。。很好, 那就拿你们练手吧！",},
                    },
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="喽喽",cardID=508,dialog = "哪里来的乡巴佬，竟然敢挡药师大人的路，活的不耐烦了！"}},
                    },
                },
           [59]={
                begin ={
                    [1] = {data = "7_135",dir = 3,scene = "dh_cj05.png",dialog="咦, 那边是？",},
                    [2] = {data = "7_88",dir = 3,dialog="蛇人果然是淫乱的一族, 既然碰上了, 就拿你们练练手吧！",},
                   },
                },         
           [60]={
                begin ={
                    [1] = {data = "7_547",dir = 3,scene = "dh_cj05.png",dialog="先生, 你快走, 这次的蛇人里面, 可是有三名九星斗者, 别连累了你",}
                    },
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="蛇人",cardID=511,dialog = "一起上，杀了他！女人抓回去好好享受！"}},
                    },        
                },
           [61]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="蛇人",cardID=511,dialog = "碰上硬茬了，快，召唤族人"}},
                        {fight = 2,round = 1,talk = {dir = 0,name="蛇人头领",cardID=537,dialog = "哪个不开眼的竟然敢在沙漠惹我们蛇人一族！"}},
                    },
                },                 
           [64]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="蛇女",cardID=522,dialog = "哟，好俊的小弟弟，跟姐姐回去，姐姐好好疼你~"}},
                    },
                },
           [65]={
                ended = {
                    [1] = {data = "7_135",dir = 3,scene = "dh_cj05.png",dialog="见识过蛇人的实力了吧, 塔戈尔大沙漠里面的蛇人, 最擅长的便是驱使毒蛇进攻了",},
                    [2] = {data = "7_88",dir = 3,dialog="我们接下来该干什么？",},
                    [3] = {data = "7_135",dir = 3,dialog="前面就是漠城了, 先进城吧。",}
                    },         
                },         
}

FightTaskInfo["8"]={
           [66]={
                begin ={
                    [1] = {data = "7_135",dir = 3,scene = "dh_cj04.png",dialog="先进城去购买一份塔戈尔沙漠的地图吧, 这个很重要, 然后备好足够的水源。",}
                    },
                },
           [68]={
                begin ={
                    [1] = {data = "7_135",dir = 3,scene = "dh_cj01.png",dialog="这。。。果然是它！竟然会在这种地方找到净莲妖火的地图残片！",},
                    [2] = {data = "7_88",dir = 3,dialog="异火榜第三的净莲妖火么！！那必须要得到它！",}
                    },
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="海波东",cardID=94,dialog = "小家伙，虽然我被封印了，但是这地图你最好别打着什么强抢的念头，那对你没什么好处。"}},
                    },
                },
           [69]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="喽喽",cardID=509,dialog = "小子，交出地图！"}},
                    },
                },         
           [71]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="墨家二小姐",cardID=547,dialog = "不知死活的家伙，竟然敢对冰大师如此无礼，当真是鼠目寸光之辈。"}},
                    },
                },         
           [73]={
                begin ={
                    [1] = {data = "7_94",dir = 3,scene = "dh_cj01.png",dialog="小子, 只要你答应帮我搞来沙之曼陀罗。我便将我多年研究的异火消息, 全部给你。",},
                    [2] = {data = "7_88",dir = 3,dialog="成交！",},
                    [3] = {data = "7_94",dir = 3,dialog="这种药材只有在塔戈尔大沙漠里才能找到, 温度越高的地方, 就越容易找到它, 辛苦小兄弟了。",}
                    },
                },         
           [75]={
                begin ={
                    [1] = {data = "7_94",dir = 3,scene = "dh_cj01.png",dialog="小子你终于回来了！怎么样了？",},
                    [2] = {data = "7_88",dir = 3,dialog="你要的药我给你找到了, 现在你的实力可以恢复了！",},
                    [3] = {data = "7_94",dir = 3,dialog="哈哈, 我终于又恢复实力了, 小子, 把地图交出来！",}
                    },
                ended = {
                    [1] = {data = "7_135",dir = 3,scene = "dh_cj01.png",dialog="人心果然是最难琢磨的！也罢，这地图上显示在沙漠深处有异火的存在, 那里可是比魔兽山脉还凶险的地方。",},
                    [2] = {data = "7_88",dir = 3,dialog="沙漠深处。。为了实力提升, 再凶险也要去！",}
                    },         
                },         
}

FightTaskInfo["9"]={
           [79]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="漠铁团员",cardID=508,dialog = "你是谁，是不是沙之佣兵团派你来的，想杀我们，没门！兄弟们，上！"}},
                    },
                },         
           [80]={
                begin ={
                    [1] = {data = "7_508",dir = 3,scene = "dh_cj05.png",dialog="小兄弟, 不好意思刚才误会你了！",},
                    [2] = {data = "7_88",dir = 3,dialog="没关系。",},
                    [3] = {data = "7_508",dir = 3,dialog="小兄弟, 我们的佣兵队伍被蛇人袭击了, 能不能请小兄弟去石漠城漠铁佣兵团帮忙求一下救兵！",},
                    [4] = {data = "7_88",dir = 3,dialog="漠铁佣兵团？石漠城的漠铁佣兵团！",}
                    },
                },
           [81]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="蛇人",cardID=523,dialog = "若是识相，奉劝你现在离开，我可以不计较你伤我手下的过错！"}},
                        {fight = 1,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "抱歉，办不到！"}},
                    },
                },         
           [84]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="蛇族护卫",cardID=511,dialog = "敌袭！保护大人！"}},
                    },
                },
           [85]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="月媚",cardID=23,dialog = "人类小家伙，看了姐姐的便宜，就想这么一走了之么？"}},
                    },
                ended = {
                    [1] = {data = "7_135",dir = 3,scene = "dh_cj05.png",dialog="小子，碰上硬茬了吧！",},
                    [2] = {data = "7_88",dir = 3,dialog="靠, 蛇女也太狠了, 看来我现在遇到真正的强者, 还是不行啊。",},
                    [3] = {data = "7_135",dir = 3,dialog="你以为强者都是虚有名声么, 小子, 路还远着呢！",},
                    [4] = {data = "7_88",dir = 3,dialog="这里离石漠城已经很近了, 去看看大哥他们吧。",}
                    },         
                },         
}

FightTaskInfo["10"]={
           [86]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="漠铁团员",cardID=532,dialog = "什么人！漠铁佣兵团可不是谁都可以闯的！"}},
                    },
                },
           [87]={
                begin ={
                    [1] = {data = "7_508",dir = 3,scene = "dh_cj04.png",dialog="杂种, 滚开。",},
                    [2] = {data = "7_90",dir = 3,dialog="对……对不起……我……我不是故意吓您的。",},
                    [3] = {data = "7_88",dir = 3,dialog="漠铁佣兵团教你欺凌弱小了是么！看来我要代哥哥好好管教管教你们了！",}
                    },
                ended ={
                    [1] = {data = "7_90",dir = 3,scene = "dh_cj01.png",dialog="萧炎少爷。。",},
                    [2] = {data = "7_88",dir = 3,dialog="青鳞，记住，你是为自己而活着，不要太在意别人的目光！",},
                    [3] = {data = "7_90",dir = 3,dialog="嗯！！",}
                    },
                },         
           [88]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="萧厉",cardID=48,dialog = "哈哈，小炎子，让我看看你这家族中的小天才，在这几年时间，能强到何种地步！"}},
                    },
                },
           [89]={
                begin ={
                    [1] = {data = "7_37",dir = 3,scene = "dh_cj01.png",dialog="沙之佣兵团, 你们又来捣乱, 当真欺负我漠铁没人么！",},
                    [2] = {data = "7_509",dir = 3,dialog="我劝你还是乖乖归降我们的好！",}
                    },
                },         
           [91]={
                begin ={
                    [1] = {data = "7_508",dir = 3,scene = "dh_cj04.png",dialog="萧炎少爷, 您赶紧去训练场吧, 我怕团长他们快要支撑不住了！",}
                    },
                middle = {
                        {fight = 1,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "敢伤我哥，你的命，今天我收了……"}},
                    },
                },         
           [93]={
                begin ={
                    [1] = {data = "7_508",dir = 3,scene = "dh_cj01.png",dialog="小少爷！",},
                    [2] = {data = "7_88",dir = 3,dialog="带人, 我们去沙之佣兵团问问沙罗, 看看他究竟是哪里来的胆子。",}
                    },
                },         
           [94]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "沙罗团长，手段挺狠的啊！"}},
                        {fight = 1,round = 1,talk = {dir = 0,name="沙罗",cardID=5,dialog = "我今日倒真是要看看，你凭什么来灭了我沙之佣兵团！"}},
                    },
                },
           [95]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="墨家强者",cardID=524,dialog = "小子，云岚宗是我们墨家的后台，劝你识相些，乖乖跟我们回墨家，不然……"}},
                        {fight = 1,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "呵呵，那就让我试试不识相的后果~"}},
                    },
                ended = {
                    [1] = {data = "7_48",dir = 3,scene = "dh_cj04.png",dialog="小炎子，这次多亏了你在！",},
                    [2] = {data = "7_88",dir = 3,dialog="佣兵团的问题解决了, 我还得继续进入沙漠修行, 顺便探寻异火的消息。",},
                    [3] = {data = "7_90",dir = 3,dialog="那个……少爷, 石漠城的东部位置……似乎有点奇怪的东西。",},
                    [4] = {data = "7_88",dir = 3,dialog="你知道？",},
                    [5] = {data = "7_90",dir = 3,dialog="那里有个地下坑, 半年之前, 我感应到一股极其强大的气息出现在了那里！",},
                    [6] = {data = "7_88",dir = 3,dialog="地下坑么, 太好了！终于有异火的信息了。",}
                    },         
                },         
}

FightTaskInfo["11"]={
           [96]={
                begin ={
                    [1] = {data = "7_90",dir = 3,scene = "dh_cj05.png",dialog="少爷，我们到了！",},
                    [2] = {data = "7_88",dir = 3,dialog="异火……下面真的有么？希望不会让我失望吧……",}
                    },
                },
           [99]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="黑衣人",cardID=535,dialog = "异火可不是你们这些无名小辈可以觊觎的！"}},
                    },
                },         
           [101]={
                begin ={
                    [1] = {data = "7_90",dir = 3,scene = "dh_cj05.png",dialog="少爷, 那股气息, 就在这岩浆下面。",}
                    },
                },         
           [104]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "这是什么！"}},
                        {fight = 1,round = 1,talk = {dir = 1,name="药老",cardID=135,dialog = "双头火灵蛇，生于极热之地，靠吞噬岩浆为生，啧啧，看来这里的确是有着异火的踪迹啊"}},
                    },
                },
           [105]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="青鳞",cardID=90,dialog = "呃。。啊啊啊啊！少爷救我！"}},
                        {fight = 1,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "怎么回事！青鳞！"}},
                        {fight = 1,round = 1,talk = {dir = 1,name="药老",cardID=135,dialog = "竟然是碧蛇三花瞳，这个女娃娃实力太低，快制住她，不然她会被三花瞳反噬的"}},
                    },
                ended = {
                    [1] = {data = "7_135",dir = 3,scene = "dh_cj05.png",dialog="只能暂时帮她将碧蛇三花瞳的能力封印到体内, 以后会是一大助力的。",},
                    [2] = {data = "7_88",dir = 3,dialog="嗯, 这里有七彩蛇鳞, 异火应该是被美杜莎女王取走了, 看来是没希望了。",},
                    [3] = {data = "7_135",dir = 3,dialog="美杜莎天生属性偏阴寒, 她绝对不可能吸收异火, 说不定我们还有机会重新得到异火。",},
                    [4] = {data = "7_88",dir = 3,dialog="那接下来我们怎么办！",},
                    [5] = {data = "7_135",dir = 3,dialog="去美杜莎神殿！",}
                    },         
                },         
}

FightTaskInfo["12"]={
           [106]={
                begin ={
                    [1] = {data = "7_135",dir = 3,scene = "dh_cj05.png",dialog="要前往美杜莎神殿, 必须先经过蛇人部落, 一路都有蛇人防守, 一定要小心。",}
                    },
                },
           [107]={
                begin ={
                    [1] = {data = "7_511",dir = 3,scene = "dh_cj05.png",dialog="警报！警报！上空有人, 飞矛手准备！",},
                    [2] = {data = "7_88",dir = 3,dialog="糟了，被发现了！",}
                    },
                },         
           [108]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="蛇女",cardID=522,dialog = "该死的人类，当我魅蛇部落好欺负不成？今夜竟然敢连番强行破城而入！"}},
                    },
                },
           [110]={
                begin ={
                    [1] = {data = "7_88",dir = 3,scene = "dh_cj05.png",dialog="该死的！怎么蛇人突然防守的这么严！而且看部落的样子, 好像刚刚被人突袭过！",},
                    [2] = {data = "7_135",dir = 3,dialog="看了不止我们在打异火的主意啊, 小子, 要小心了。",}
                    },
                },
           [111]={
                begin ={
                    [1] = {data = "7_135",dir = 3,scene = "dh_cj05.png",dialog="这些就是抢夺异火的人么？",},
                    [2] = {data = "7_88",dir = 3,dialog="看起来实力很强啊！糟了, 被发现了！",},
                    [3] = {data = "7_70",dir = 3,dialog="小子, 既然来了, 就留下来吧。",}
                    },
                },         
           [114]={
                begin ={
                    [1] = {data = "7_135",dir = 3,scene = "dh_cj05.png",dialog="前面就是蛇人要塞，要突破过去可不容易！",}
                    },
                },
           [115]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="墨巴斯",cardID=24,dialog = "女王岂是你们这等肮脏的人类可以亵渎的！想见女王，做梦！"}},
                    },
                ended = {
                    [1] = {data = "7_135",dir = 3,scene = "dh_cj05.png",dialog="前面就是美杜莎神殿了, 接下来要有一场硬仗要打了, 小子, 准备好了么？",},
                    [2] = {data = "7_88",dir = 3,dialog="异火，我志在必得！",}
                    },         
                },         
}

FightTaskInfo["13"]={
           [118]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="月媚",cardID=23,dialog = "哟，小弟弟，又是你，上次让你逃了，这次竟然送上门来了！"}},
                    },
                },
           [121]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="墨巴斯",cardID=24,dialog = "杀了这些人类！"}},
                    },
                },         
           [124]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="花蛇儿",cardID=25,dialog = "美杜莎蛇卫。拦住他！该死的人类。等女王陛下进化成功，你们一个都逃不掉！"}},
                    },
                },
           [125]={
                begin ={
                    [1] = {data = "7_135",dir = 3,scene = "dh_cj05.png",dialog="看来美杜莎正在进化的紧要关头, 不然防守也不能这么严。",},
                    [2] = {data = "7_88",dir = 3,dialog="看来我们要抓紧时间了, 不然等她进化成功了, 我们就没有胜算了。",}
                    },
                middle = {
                        {fight = 3,round = 1,talk = {dir = 0,name="美杜莎",cardID=144,dialog = "竟然敢打断我进化，我饶不了你！"}},
                        {fight = 3,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "这是。。她竟然进化成功了！"}},
                        {fight = 3,round = 1,talk = {dir = 1,name="药老",cardID=135,dialog = "竟然是七彩吞天蟒。。。小子，要小心了！"}},
                    },
                ended = {
                    [1] = {data = "7_135",dir = 3,scene = "dh_cj05.png",dialog="异火终于到手了！赶紧离开这里，找个安静的地方，吞噬异火！",},
                    [2] = {data = "7_88",dir = 3,dialog="是！",}                      
                    },         
                },
}

FightTaskInfo["14"]={
           [126]={
                begin ={
                    [1] = {data = "7_135",dir = 3,scene = "dh_cj05.png",dialog="终于获得你的本源火种了, 实力也有所增长了吧！",},
                    [2] = {data = "7_88",dir = 3,dialog="哈哈, 我终于拥有异火了！哈哈！",},
                    [3] = {data = "7_508",dir = 3,dialog="小少爷, 墨家又派人来了, 而且还把青鳞抓走了！",}
                    },
                },
           [127]={
                begin ={
                    [1] = {data = "7_135",dir = 3,scene = "dh_cj01.png",dialog="这里离云岚宗不远，你要注意隐藏身份！",},
                    [2] = {data = "7_88",dir = 3,dialog="这防卫挺森严的啊。看来想要不惊动任何人潜入进去。还真有点麻烦啊。",},                    
                    },
                },         
           [128]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "交出青鳞。否则今日，血洗墨家！"}},
                        {fight = 2,round = 1,talk = {dir = 0,name="墨承",cardID=11,dialog = "竟然敢来老夫的寿宴上大放厥词，我倒要看看你有多大的能耐！"}},
                    },
                },
           [131]={
                begin ={
                    [1] = {data = "7_525",dir = 3,scene = "dh_cj01.png",dialog="小子，可别乱动啊！",},
                    [2] = {data = "7_88",dir = 3,dialog="青鳞！阁下是谁？为何抢夺青鳞？",}, 
                    [3] = {data = "7_525",dir = 3,dialog="这小家伙名字叫青鳞么？呵呵，挺不错呢。",},
                    },
                },         
           [134]={
                begin ={
                    [1] = {data = "7_525",dir = 3,scene = "dh_cj01.png",dialog="这小子怎么这么难缠！没办法了！白牙，你再不出来老娘扒了你的皮！",},
                    [2] = {data = "7_88",dir = 3,dialog="六阶魔兽？！没想到这女人竟然还有这种同伴？",}, 
                    },
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="白牙",cardID=526,dialog = "绿蛮，你带人先走，嘿嘿，你们的对手是我。"}},
                    },
                },
           [135]={
                middle = {
                        {fight = 3,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "或许这样会更加恐怖……异火，给我凝！"}},
                        {fight = 3,round = 1,talk = {dir = 0,name="海波东",cardID=94,dialog = "靠，疯子，疯子！这家伙绝对疯了"}},
                    },
                ended = {
                    [1] = {data = "7_135",dir = 3,scene = "dh_cj01.png",dialog="你虽然成功创造出了一个强大的技能, 但我的灵魂力量几乎被消耗光了。我可能要沉睡一阵子。",},
                    [2] = {data = "7_88",dir = 3,dialog="对不起, 老师。",},
                    [3] = {data = "7_135",dir = 3,dialog="接下来的一段时间需要靠你自己了, 在三年之约之前, 我希望你能去参加伽玛圣城的炼药师大会！",},
                    [4] = {data = "7_88",dir = 3,dialog="好的, 老师！保重！",}
                    },         
                },         
}

FightTaskInfo["15"]={
           [136]={
                begin ={
                    [1] = {data = "7_51",dir = 3,scene = "dh_cj01.png",dialog="修复灵魂的药？纳兰家贴出榜单，谁能够将纳兰老爷子治好，那便能够得到那株七幻青灵涎！",},
                    [2] = {data = "7_88",dir = 3,dialog="哦？那我倒要去看看了！。",},
                    },
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="护卫",cardID=509,dialog = "小子，这榜可不是揭着玩的！"}},
                    },
                },
           [137]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="药师",cardID=520,dialog = "你一个二品炼药师，有何本事？"}},
                        {fight = 1,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "有没有本事不是你说了算的！"}},
                    },
                },         
           [138]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="纳兰桀",cardID=39,dialog = "小子，我老头子也不是那么好糊弄的！"}},
                    },
                },
           [139]={
                begin ={
                    [1] = {data = "7_51",dir = 3,scene = "dh_cj01.png",dialog="再过几天就是炼药大会了！要去参加么？",},
                    [2] = {data = "7_88",dir = 3,dialog="当然！而且冠军是我的！",},                    
                    },
                },         
           [140]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="柳翎",cardID=21,dialog = "你哪点比得上我！竟然让嫣然对你青睐有加！我要打败你，我才是加玛帝国最杰出的人。"}},
                    },
                },
           [141]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="炎利",cardID=29,dialog = "我说了，冠军是我的！挡我路者，死！"}},
                    },
                },         
           [143]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="木战",cardID=17,dialog = "小子，雅妃是我的女人！不是你能招惹的！"}},
                    },
                },         
           [144]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="木辰",cardID=13,dialog = "竟敢伤我木家子弟！如此桀骜不驯，老夫就带你家大人教教你规矩！"}},
                    },
                },
           [145]={
                middle = {
                        {fight = 3,round = 1,talk = {dir = 0,name="加刑天",cardID=68,dialog = "你是谁家弟子，隐藏身份潜入加玛帝国有什么目的！"}},
                    },
                ended = {
                    [1] = {data = "7_51",dir = 3,scene = "dh_cj01.png",dialog="后天就是那三年之约的日子了，你。。",},
                    [2] = {data = "7_88",dir = 3,dialog="云岚宗，我萧炎来了！",},                    
                    },         
                },         
}

FightTaskInfo["16"]={
           [148]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "三年之约，我如约而至。今日解决掉以往的恩怨吧。当年你给我萧家的耻辱，请还回来……"}},
                    },
                },
           [149]={
                begin ={
                    [1] = {data = "7_95",dir = 3,scene = "dh_cj01.png",dialog="你赢了，我会履行我的承诺！为奴为婢，任你处置！",},
                    [2] = {data = "7_88",dir = 3,dialog="三年之约已经结束, 日后的我们, 不会再有任何纠葛！",},
                    [3] = {data = "7_8",dir = 3,dialog="你……你就是杀了墨承的那个神秘人！",},  
                    },
                },         
           [151]={
                begin ={
                    [1] = {data = "7_27",dir = 3,scene = "dh_cj01.png",dialog="云力, 你们三人拦住他。云岚宗执事听令, 结云岚雾阵！",},
                    },
                },         
           [154]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="云棱",cardID=27,dialog = "好，好……好小子，倒是老夫小瞧你了！今天，你别想安然离开云岚宗。"}},
                    },
                },
           [155]={
                begin ={
                    [1] = {data = "7_27",dir = 3,scene = "dh_cj01.png",dialog="为了宗门声誉, 今天, 你们别！想！离！开！恭请老宗主！",},
                    },
                middle = {
                        {fight = 3,round = 1,talk = {dir = 0,name="云山",cardID=69,dialog = "在云岚宗待半年时间吧，你需要为自己的莽撞，付出一点代价。"}},
                        {fight = 3,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "那就试试看吧！"}},
                    },
                ended = {
                    [1] = {data = "7_27",dir = 3,scene = "dh_cj01.png",dialog="老宗主, 我们就样放任萧炎离开了？他将我们云岚宗搞成这模样……",},
                    [2] = {data = "7_69",dir = 3,dialog="那你还想怎么办？",},
                    [3] = {data = "7_27",dir = 3,dialog="既然他不肯留在云岚宗, 不过我们或许可以去乌坦城将他父亲“请”来……",},
                    },         
                },         
}

FightTaskInfo["17"]={
           [156]={
                begin ={
                    [1] = {data = "7_19",dir = 3,scene = "dh_cj01.png",dialog="表哥, 呜呜, 你回来了, 族里出大事了, 那些坏家伙想要趁火打劫。",},
                    },
                },
           [159-2]={
                begin ={
                    [1] = {data = "7_88",dir = 3,scene = "dh_cj01.png",dialog="云岚宗, 你欺人太甚, 竟然掠我父亲！我萧炎与你不死不休！",},
                    },
                },         
           [160-2]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="米特尔",cardID=40,dialog = "你又跑回来送死么！"}},
                        {fight = 2,round = 1,talk = {dir = 0,name="法犸",cardID=49,dialog = "萧炎，莫要冲动！"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "滚开！"}},
                    },
                },
           [162-2]={
                begin ={
                    [1] = {data = "7_88",dir = 3,scene = "dh_cj01.png",dialog="云棱老狗, 滚出来受死！",},
                    },
                },
           [163-2]={
                begin ={
                    [1] = {data = "7_69",dir = 3,scene = "dh_cj01.png",dialog="你竟敢击杀云棱, 今天, 就算美杜莎护着你, 老夫也要你永远留在云岚宗。",},
                    },  
                },        
           [164-2]={
                begin ={
                    [1] = {data = "7_69",dir = 3,scene = "dh_cj01.png",dialog="萧炎毁我宗门杀我长老, 我以云岚宗第八代宗主之命宣布, 将之列进云岚宗追杀名单。至死不休！",},
                    },
                },
           [165-2]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="喽喽",cardID=509,dialog = "给我抓住他，他便是萧炎！"}},
                    },
                },         
           [166-2]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="蒙力",cardID=527,dialog = "我是镇鬼关副统领蒙力，你擅闯重城，劝你尽早束手就擒，免得自讨苦吃。"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "你就是蒙力？云岚宗的狗？"}},
                        {fight = 2,round = 1,talk = {dir = 0,name="蒙力",cardID=527,dialog = "拿下他！"}},                   
                    },
                },
           [167-2]={
                middle = {
                        {fight = 3,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "没想到你竟是云岚宗的宗主！怎么？想抓我回去，然后让云山将我当众斩杀？"}},
                        {fight = 3,round = 1,talk = {dir = 0,name="云韵",cardID=91,dialog = "不会的，只要你跟我回去，我会力保你性命！好吗？"}},
                        {fight = 3,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "那就带着我的尸体回去吧！"}},                   
                    },
                ended = {
                    [1] = {data = "7_135",dir = 3,scene = "dh_cj01.png",dialog="过了镇鬼关就是黑角域的范围了, 那里鱼龙混杂, 一定要小心！",},
                    [2] = {data = "7_88",dir = 3,dialog="我倒是要看看, 你能乱成何种模样？",},
                     }, 
                },       
}

FightTaskInfo["18"]={
           [168-2]={
                begin ={
                    [1] = {data = "7_88",dir = 3,scene = "dh_cj01.png",dialog="这该死的地方, 竟没有个方向, 看来需要去买张地图了！",}
                    },
                },
           [169-2]={
                begin ={
                    [1] = {data = "7_135",dir = 3,scene = "dh_cj01.png",dialog="小家伙, 提醒你一下, 在这“黑角域”中, 不要有过多的怜悯心",},
                    [2] = {data = "7_88",dir = 3,dialog="老师, 我不是什么滥好人, 杀鸡儆猴, 是这里最有效的手段。",}
                    },
                },         
           [170-2]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="恶霸",cardID=509,dialog = "菜鸟，今天我来教教你一条黑角域的规矩，那便是不要轻易让人看出你是刚进这里的菜鸟。"}},
                    },
                },
           [173-2]={
                begin ={
                    [1] = {data = "7_88",dir = 3,scene = "dh_cj01.png",dialog="唉, 既然接了护卫的活, 那就出手帮他们一次吧！",}
                    },
                },         
           [176-2]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 1,name="药老",cardID=135,dialog = "咦？这个家伙竟然也是个灵魂体？看来是被人控制住了，小子，出手杀了他！"}},
                    },
                },
           [177-2]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="魂殿幽灵",cardID=535,dialog = "桀桀，小子，竟然敢杀了我们控制的灵魂体，你定会后悔今日惹了我们魂殿！"}},
                    },
                ended = {
                    [1] = {data = "7_88",dir = 3,scene = "dh_cj01.png",dialog="这就是“魂殿”的实力么？果然可怕啊。",},
                    [2] = {data = "7_135",dir = 3,scene = "dh_cj01.png",dialog="魂殿有着专门对付灵魂体的手段, 短期内我尽量少出现, 而你现在最重要的就是提升你的实力！",},
                    [3] = {data = "7_88",dir = 3,scene = "dh_cj01.png",dialog="恩, 黑印城有场拍卖会, 也应该去看看, 筹备下材料了！",}
                    },         
                },         
}

FightTaskInfo["19"]={
           [183-2]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="范凌",cardID=41,dialog = "交出卷轴，留你全尸。"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "嘿，抱歉了，我的东西，没人能抢得走，管你是什么少宗主……"}},
                    },
                },         
           [186-2]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="范痨",cardID=46,dialog = "小杂种，你可是让得我好找，给我儿子陪葬去吧！"}},
                    },
                },
           [187-2]={
                middle = {
                        {fight = 3,round = 1,talk = {dir = 0,name="莫崖",cardID=18,dialog = "父亲大人说的果然没错，等你们两败俱伤时，便是我们得手之时！"}},
                        {fight = 3,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "做梦！"}},
                    },
                ended = {
                    [1] = {data = "7_88",dir = 3,scene = "dh_cj01.png",dialog="好险, 看来实力还是不够啊！",},
                    [2] = {data = "7_135",dir = 3,dialog="接下来就要进入迦南学院了！那里应该有很多和你同年的少年高手, 正好助你巩固实力！",},
                    [3] = {data = "7_88",dir = 3,dialog="终于要到了么！",}
                    },         
                },         
}

FightTaskInfo["20"]={
           [189-2]={
                begin ={
                    [1] = {data = "7_509",dir = 3,scene = "dh_cj01.png",dialog="给我拦住那小子！",},
                    [2] = {data = "7_1",dir = 3,dialog="玛言, 别费心思了, 凭你那实力, 还想打我表妹主意？",},
                    [3] = {data = "7_509",dir = 3,dialog="小子, 敬酒不吃……给我上, 不需要他的命, 不过却是必须见红！",}
                    },
                middle = {
                        {fight = 1,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "萧宁，两年不见，你倒是比以前少了许多锐气啊。"}},
                    },
                },         
           [190-2]={
                begin ={
                    [1] = {data = "7_535",dir = 3,scene = "dh_cj01.png",dialog="玄阶三班薛崩, 对战黄阶二班……萧炎！",},
                    [2] = {data = "7_88",dir = 3,dialog="黄阶二班, 萧炎！",}
                    },
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="薛崩",cardID=528,dialog = "狂妄的小子！"}},
                    },
                },
           [192-2]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="陆牧",cardID=529,dialog = "那前五名，我也很感兴趣，怕是不能相让了，所以，我也只能出全力了！"}},
                    },
                },
           [193-2]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="吴昊",cardID=65,dialog = "你便是萧炎？可敢下来与我一战？"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "乐意奉陪！"}},
                    },
                },         
           [196-2]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="琥嘉",cardID=43,dialog = "我倒要和你比比，若是我赢了，便让他把薰儿让给我。。"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "。。。女的也来跟我抢女人。。。"}},
                    },
                },
           [197-2]={
                begin ={
                    [1] = {data = "7_71",dir = 3,scene = "dh_cj01.png",dialog="今年内院选拔赛采取混战淘汰赛, 谁能在这个淘汰赛中坚持越久, 名次便是越高, 而反之亦然。",},
                    [2] = {data = "7_88",dir = 3,dialog="我倒要瞧瞧, 谁有那本事, 将我们打出场外？白山？吴昊？还是那琥嘉？",}
                    },
                ended = {
                    [1] = {data = "7_71",dir = 3,scene = "dh_cj01.png",dialog="此届内院选拔赛到此结束。前五强已经产生, 他们便是萧炎, 萧薰儿, 吴昊, 琥嘉, 白山！",},
                    [2] = {data = "7_88",dir = 3,dialog="走吧, 比赛结束了, 现在便等着那内院通知吧。",}
                    },         
                },         
}

FightTaskInfo["21"]={
           [198-2]={
                begin ={
                    [1] = {data = "7_84",dir = 3,scene = "dh_cj01.png",dialog="我宣布, 这一届的“火能猎捕赛”, 正式开始！同学们, 开始逃亡吧！",}
                    },
                },
           [199-2]={
                begin ={
                    [1] = {data = "7_88",dir = 3,scene = "dh_cj01.png",dialog="从现在开始, 猎人与猎物的位置可以倒换过来了, 因为现在的猎物, 已经开始对猎人感兴趣了……",}
                    },
                },         
           [200-2]={
                begin ={
                    [1] = {data = "7_537",dir = 3,scene = "dh_cj01.png",dialog="啧, 今年的新生果然不一般, 竟然能走到这里, 不过这样也好, 你们的火能, 我们就一并收了吧。",}
                    },
                },
           [201-2]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="帮会杂鱼",cardID=515,dialog = "新生的纳贡费是内院这么多年的规矩，我们可没对你们有所苛刻，所以，还是乖乖地交出来吧"}},
                    },
                },         
           [203-2]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "该按规矩缴纳的“纳贡费”，我们缴。其他的半点我们也不会搭理！"}},
                    },
                },         
           [205-2]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="长老",cardID=543,dialog = "小子，天焚炼气塔可不是你可以随便闯的！"}},
                    },
                },         
           [206-2]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="韩月",cardID=28,dialog = "惊动了我修炼，这一届的新手很狂啊！"}},
                    },
                },
           [207-2]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="白帮喽啰",cardID=532,dialog = "我劝你还是乖乖归顺我白帮，不然有你苦头吃！"}},
                        {fight = 3,round = 1,talk = {dir = 0,name="白程",cardID=14,dialog = "白山，带人动手，让这些新生明白，在这内院，光是拥有硬骨头，是生存不下去的！"}},
                        {fight = 3,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "磐门不会交给任何势力一个人！"}},
                    },
                ended = {
                    [1] = {data = "7_136",dir = 3,scene = "dh_cj01.png",dialog="磐门已经建立, 为了每个成员的利益, 也要加紧提升实力了！",},
                    [2] = {data = "7_88",dialog="嗯, 内院强者如云, 想要在这里立住阵脚, 确实不易。",}
                    },   
                }      
}

FightTaskInfo["22"]={
           [210-2]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="林焱",cardID=93,dialog = "你就是这届新手的头头，萧炎，实力不错嘛，来，咱俩练练！"}},
                    },
                },         
           [211-2]={
                begin ={
                    [1] = {data = "7_545",dir = 3,scene = "dh_cj01.png",dialog="在塔中, 修炼室都是得依靠自己实力争夺, 实力强, 则是能获得最好的修炼条件！",},
                    [2] = {data = "7_88",dir = 3,scene = "dh_cj01.png",dialog="很好, 挺有趣的规则, 那就让我来看看适合我的修炼室吧！",}
                    },
                },
           [212-2]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="柳菲",cardID=548,dialog = "这间修炼事是我的单独修炼地，竟然敢抢，来人，让他知道知道这里的规矩！"}},
                    },
                ended = {
                    [1] = {data = "7_93",dir = 3,scene = "dh_cj01.png",dialog="小子,这丫头是霸帮柳擎的妹妹，惹了她，你可算是跟柳擎结了仇了！",},
                    [2] = {data = "7_88",dir = 3,dialog="呵，我会怕了谁么！",},
                    [3] = {data = "7_93",dir = 3,dialog="小子够狂，不过我喜欢！那就让暴风雨来的更猛烈些吧！",},
                    },         
                },         
           [216-2]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="柳擎",cardID=66,dialog = "希望你不会令我失望。"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "你是个好对手，我自会拼尽全力！"}},
                    },
                },
           [217-2]={
                middle = {
                        {fight = 3,round = 1,talk = {dir = 0,name="紫妍",cardID=139,dialog = "我就是强榜第一，想不到吧！让你见识见识我的实力！"}},
                    },
                ended = {
                    [1] = {data = "7_135",dir = 3,scene = "dh_cj01.png",dialog="小子, 陨落心炎的暴动就在这几天了, 少不得引来黑角域强者的觊觎, 一定要小心！",},
                    [2] = {data = "7_88",dir = 3,dialog="陨落心炎必须是我的！",}
                    },         
                },         
}

FightTaskInfo["23"]={
           [220-2]={
                begin ={
                    [1] = {data = "7_135",dir = 3,scene = "dh_cj01.png",dialog="竟然是雪魔天猿, 小家伙胆子倒是不小, 成年雪魔天猿力量足可碎金裂山！",}
                    },
                },
           [221-2]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="魂殿幽魂",cardID=535,dialog = "异火乃是天地奇物，自有强者得之，你们这般将之封印在此，可是有些太过自私了点！"}},
                        {fight = 1,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "说的这么冠冕堂皇，不还是要抢！有什么实力都拿出来吧！"}},
                    },
                },         
           [223-2]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="金老",cardID=44,dialog = "嘿嘿，凭你就想守住异火！"}},
                        {fight = 2,round = 1,talk = {dir = 0,name="银老",cardID=45,dialog = "想死我们就成全你！"}},
                    },
                },         
           [224-2]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="范痨",cardID=46,dialog = "小杂种，今日我范痨不将你碎尸万段，剥骨抽筋的话，还不如自刎当场！"}},
                        {fight = 1,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "不用你自刎，想死，我帮你！"}},
                    },
                },
           [226-2]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "托你的福，让我遇见了老师，不然的话，我这修炼之路，怕会少了许多精彩。"}},
                        {fight = 1,round = 1,talk = {dir = 0,name="韩枫",cardID=72,dialog = "老不死的，我不管你究竟是活是死，今天，我都会让你们两人彻底地闭上嘴！。"}},
                    },
                },
           [227-2]={
                middle = {
                        {fight = 3,round = 1,talk = {dir = 0,name="鹜护法",cardID=59,dialog = "这便是萧炎体内那个灵魂体么！桀桀！老夫便将你收了吧！"}},
                        {fight = 3,round = 1,talk = {dir = 1,name="药老",cardID=135,dialog = "我能教的都教了，以后便得靠你自己了，魂殿虽强，可你潜力无限，迟早有一天能够与之抗衡。"}},
                    },
                ended = {
                    [1] = {data = "7_88",dir = 3,scene = "dh_cj01.png",dialog="魂殿！我萧炎与你不死不休！",}
                    },         
                },         
}
FightTaskInfo["24"]={
           [226]={
                begin ={
                    [1] = {data = "7_144",dir = 3,scene = "dh_cj02.png",dialog="魂殿身法太诡异，我的能力还没完全恢复，没能帮你救下你师父。。"},
                    [2] = {data = "7_88",dir = 3,dialog="你已经尽力了，谢谢！"},
                    [3] = {data = "7_144",dir = 3,dialog="你现在打算怎么办？"},
                    [4] = {data = "7_88",dir = 3,dialog="终归是我实力不够！我打算进天焚妖塔收服陨落心炎！"},
                    [5] = {data = "7_144",dir = 3,dialog="你。。罢了，便陪你走着一趟吧！"}
                },
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="妖塔护卫",cardID=536,dialog = "迦南禁地，尔敢来犯！看招！"}},
                    },
                },  
           [227]={
                begin ={
                    [1] = {data = "7_144",dir = 3,scene = "dh_cj02.png",dialog="天焚妖塔一共九层，前八层按八卦列位，每层都有妖物镇守！陨落心炎就藏在第九层！一定要小心！",}
                },
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="机关兽",cardID=556,dialog = "叽叽叽叽"}},
                        {fight = 1,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "这是。。什么鬼？"}},
                    },
                },         
           [228]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="玄土兽",cardID=551,dialog = "吼！"}},
                        {fight = 1,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "这又是什么鬼！"}},
                        {fight = 2,round = 1,talk = {dir = 0,name="柳擎",cardID=66,dialog = "死！"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "柳擎，为什么你会在！这是怎么回事？"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="美杜莎",cardID=144,dialog = "陨落心炎能控制人心！这些都是幻象！"}},
                    },
                },         
           [231]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="紫妍",cardID=139,dialog = "死！"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "这是要玩死我的节奏啊！"}},
                    },
                },
           [234]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="苏千",cardID=84,dialog = "死！"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "。。。你们能换句台词么！"}},
                    },
                },
           [235]={
                middle = {
                        {fight = 3,round = 1,talk = {dir = 0,name="陨落心炎",cardID=502,dialog = "叽！"}},
                        {fight = 3,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "你不会说的也是死吧。。能不能有点创意！小子，爷爷今天收了你！"}},
                    },      
                },         
}
FightTaskInfo["25"]={
           [236]={
                begin ={
                    [1] = {data = "7_84",dir = 3,scene = "dh_cj02.png",dialog="陨落心炎暴动，黑角域趁机来犯，欺我迦南无人啊！要是萧炎那小子还在就好了！"},
                    [2] = {data = "7_88",dir = 3,dialog="阿嚏！刚从塔里出来就听见苏长老你念叨我！"},
                    [3] = {data = "7_84",dir = 3,dialog="。。。小兔崽子，赶紧给我去把黑角域的人清出去！！"},
                    [4] = {data = "7_88",dir = 3,dialog="嘿嘿，来的正是时候！让你们看看小爷的威力！"}
                    },
                },
           [238]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="金老",cardID=44,dialog = "萧炎！你。。你竟然还活着！"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "黑盟是吧！呵呵，今日就让它消失吧！"}},
                    },
                },         
           [239]={
                begin ={
                    [1] = {data = "7_84",dir = 3,scene = "dh_cj02.png",dialog="如今你收服了陨落心炎，也灭了黑盟，下一步你打算怎么办？"},
                    [2] = {data = "7_88",dir = 3,dialog="魂殿能够找到这里来，肯定是有人报信，也是时候去云岚宗清算一下旧账了！"},
                    [3] = {data = "7_84",dir = 3,dialog="云山实力不凡，又有魂殿相助，你务必小心！"},
                    [4] = {data = "7_88",dir = 3,dialog="放心吧！我已经不是当年的废物萧炎了！"}
                    },
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="山门守卫",cardID=508,dialog = "站住！云岚宗可不是谁都能来的！"}},
                        {fight = 1,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "呵，还是一样的狗仗人势！"}},
                    },
                },         
           [241]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="云棱",cardID=27,dialog = "萧炎！你竟然还敢回来！"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "为什么不敢！呵，云棱，咱们的旧账也该好好清一清了！"}},
                    },
                },
           [242]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="云岚弟子",cardID=532,dialog = "结阵！"}},
                        {fight = 1,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "还是这一套！一点新意都没有！"}},
                    },
                },
           [244]={
                begin ={
                    [1] = {data = "7_95",dir = 3,scene = "dh_cj02.png",dialog="萧炎你。。你为什么就不能饶了云岚宗？"},
                    [2] = {data = "7_88",dir = 3,dialog="我和云岚宗的事，与你无关！你要拦我？"},
                    [3] = {data = "7_91",dir = 3,dialog="你既然走了，为何还要回来！你。。"},
                    [4] = {data = "7_88",dir = 3,dialog="无需多说，你们有你们的宗门恩情，我也有我必须要算的帐！动手吧！"}
                    },
                },
           [245]={
                begin ={
                    [1] = {data = "7_69",dir = 3,scene = "dh_cj02.png",dialog="小杂种！你还敢回来！"},
                    [2] = {data = "7_88",dir = 3,dialog="有什么不敢的！你联合魂殿，掳我师父！这一笔一笔，今日我就和你算个清楚！"},
                    [3] = {data = "7_69",dir = 3,dialog="是该算一算了，我云岚宗今日倾尽一宗之力，不信留不住你个小杂种！"},
                    [4] = {data = "7_88",dir = 3,dialog="云山老狗！受死吧！"}
                    },
                middle = {
                        {fight = 3,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "佛怒火莲！"}},
                        {fight = 3,round = 1,talk = {dir = 0,name="云山",cardID=69,dialog = "这。。这是什么招式，你，你怎么可能这么厉害！"}},
                    },
                ended = {
                    [1] = {data = "7_88",dir = 3,scene = "dh_cj01.png",dialog="说，魂殿在哪？我师父在哪？"},
                    [2] = {data = "7_69",dir = 3,dialog="哈哈，小杂种，你灭我宗门！你就等着给你师父收尸吧！"},
                    [3] = {data = "7_88",dir = 3,dialog="我一定会救出我师父的！可惜你看不到了！死吧！"}
                    },         
                },         
}
FightTaskInfo["26"]={
           [246]={
                begin ={
                    [1] = {data = "7_49",dir = 3,scene = "dh_cj02.png",dialog="云山一死，云岚宗的气势也就到头了，小子，你之后打算怎么办？"},
                    [2] = {data = "7_88",dir = 3,dialog="魂殿掳我师傅，欺我宗族，这笔账我势必要和他们清算！"},
                    [3] = {data = "7_49",dir = 3,dialog="近来加玛皇城里妖兽遍布，加刑天等皇室也性格大变，恐怕跟魂殿脱不了干系！"},
                    [4] = {data = "7_88",dir = 3,dialog="如果真是魂殿的诡计，那我还真的去皇宫走一趟！"}
                    },
                },
           [247]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "竟然有这么多魔兽。。。这是闹兽灾么！"}},
                    },
                },         
           [248]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="小公主",cardID=50,dialog = "魔兽听令，杀！"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "我去，小公主你这是怎么了！"}},
                    },
                ended = {
                    [1] = {data = "7_50",dir = 3,scene = "dh_cj01.png",dialog="萧。萧炎？快，快去救救老祖和姐姐，他们都被魂殿控制了！"},
                    [2] = {data = "7_88",dir = 3,dialog="果然是魂殿搞的鬼！放心，我肯定不会让他们得逞的！"},
                    },   
                },
           [251]={
                begin ={
                    [1] = {data = "7_26",dir = 3,scene = "dh_cj02.png",dialog="帝国的荣光照耀着你们，战士们，杀！"},
                    [2] = {data = "7_88",dir = 3,dialog="我去，女汉子也太彪悍了吧！"},
                    }, 
                },
           [253]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="飞鹰兽",cardID=552,dialog = "唳！"}},
                        {fight = 1,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "啊啊啊！怎么没完没了了啊！"}},
                    },
                },
           [254]={
                begin ={
                    [1] = {data = "7_68",dir = 3,scene = "dh_cj02.png",dialog="谁都不能阻挡魂帝大人的灭世之举！都去死吧！"},
                    [2] = {data = "7_88",dir = 3,dialog="这难道就是传说中的神经病么！偶买噶~药不能停啊~"},
                    },
                },
           [255]={
                begin ={
                    [1] = {data = "7_500",dir = 3,scene = "dh_cj02.png",dialog="吼！愚昧的人类！竟敢破坏魂帝大人的计划！"},
                    [2] = {data = "7_88",dir = 3,dialog="这就是幽海蛟兽么！看起来也不怎么样嘛！"},
                    [3] = {data = "7_500",dir = 3,dialog="汝等凡人，竟敢小看本尊，受死！"},
                    [4] = {data = "7_88",dir = 3,dialog="怕你啊！"}
                    },
                ended = {
                    [1] = {data = "7_500",dir = 3,scene = "dh_cj01.png",dialog="大神饶命！小的也是受魂帝一时蒙蔽！大神您英明神武魅力非凡~小的拜服~"},
                    [2] = {data = "7_88",dir = 3,dialog="。。。魔兽也这么没有节操么。。说，魂殿在哪？"},
                    [3] = {data = "7_500",dir = 3,dialog="小的也不知道啊！不过魂殿势力庞大！大神您单枪匹马可小心别被弄死了啊~"},
                    [4] = {data = "7_88",dir = 3,dialog="。。。承你贵言。。"},
                    [5] = {data = "7_500",dir = 3,dialog="哦吼吼~大神你真客气~"},
                    [6] = {data = "7_88",dir = 3,dialog="。。。。。"},
                    },         
                },         
}
FightTaskInfo["27"]={
           [256]={
                begin ={
                    [1] = {data = "7_51",dir = 3,scene = "dh_cj02.png",dialog="这次多亏了你，不然加玛帝国百年基业都被魂殿毁了！"},
                    [2] = {data = "7_88",dir = 3,dialog="魂殿势力强大，我孤身一人确实无法与之抗衡，是应该找些盟友了~"},
                    [3] = {data = "7_51",dir = 3,dialog="加玛圣城三大家族势力庞大，不过，想要收服他们，可要拿出你的实力来！"},
                    [4] = {data = "7_88",dir = 3,dialog="那就让他们看看小爷的威力！"}
                    },
                },
           [258]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="米特尔",cardID=40,dialog = "小子，打赢我，我米特尔家就归顺于你！"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "那我就不客气了~"}},
                    },
                },         
           [261]={
                begin ={
                    [1] = {data = "7_95",dir = 3,scene = "dh_cj02.png",dialog="我会试着说服我爹将纳兰家归顺于你的！"},
                    [2] = {data = "7_88",dir = 3,dialog="纳兰嫣然，你无需如此，至于你纳兰家，我会用我的实力来拿下！"},
                    [3] = {data = "7_95",dir = 3,dialog="你终究还是不肯原谅我么。。"},
                    [4] = {data = "7_88",dir = 3,dialog="事已至此，我们都放下吧！"}
                    },
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="纳兰桀",cardID=39,dialog = "小子，纳兰家可不是那么好收服的！"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "那就试试看吧！"}},
                    },
                },         
           [264]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="加刑天",cardID=68,dialog = "想收服我加玛皇室？那就让帝国的战士们看看你的实力吧！"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "那就恭敬不如从命了！"}},
                    },
                },
           [265]={
                begin ={
                    [1] = {data = "7_51",dir = 3,scene = "dh_cj02.png",dialog="三大家族已经都同意和你联盟，但是还有一个最重要的人！"},
                    [2] = {data = "7_88",dir = 3,dialog="是谁？"},
                    [3] = {data = "7_95",dir = 3,dialog="加玛圣城的地下皇帝，天火尊者-曜天火。"},
                    [4] = {data = "7_88",dir = 3,dialog="听起来很强嘛，那就让我会一会他！"}
                    },
                middle = {
                        {fight = 3,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "天火尊者么，我来是希望你能加入我的联盟！"}},
                        {fight = 3,round = 1,talk = {dir = 0,name="曜天火",cardID=110,dialog = "狂妄小子，口出狂言，本尊也是你能收服的！"}},
                        {fight = 3,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "看来免不得要打一场了！"}},
                    },
                ended = {
                    [1] = {data = "7_110",dir = 3,scene = "dh_cj01.png",dialog="若不是我灵魂伤重，今日也不会败于你手！"},
                    [2] = {data = "7_88",dir = 3,dialog="您灵魂受伤了？我是一个炼药师，如果不嫌弃，我可以试着帮您医治！"},
                    [3] = {data = "7_110",dir = 3,dialog="哈哈，你小子不错，既然如此，那我就加入你的联盟！不知联盟名字是？"},
                    [4] = {data = "7_88",dir = 3,dialog="炎盟！"},
                    },         
                },         
} 
FightTaskInfo["28"]={
           [266]={
                begin ={
                    [1] = {data = "7_110",dir = 3,scene = "dh_cj04.png",dialog="炎盟刚刚建立，还有很多事情需要处理，你确定要现在离开么？"},
                    [2] = {data = "7_88",dir = 3,dialog="嗯，师傅现在生死不明，我要尽快找到魂殿的所在！"},
                    [3] = {data = "7_110",dir = 3,dialog="既然这样，那你就去吧，炎盟的事务我会处理妥当的！"},
                    [4] = {data = "7_88",dir = 3,dialog="谢了！"}
                    },
                },
           [268]={
                begin ={
                    [1] = {data = "7_519",dir = 3,scene = "dh_cj02.png",dialog="血战佣兵团，你们不要太过分了！"},
                    [2] = {data = "7_521",dir = 3,dialog="卡岗，我劝你还是乖乖把人交出来！"},
                    [3] = {data = "7_519",dir = 3,dialog="你们。。我跟你们拼了！"},
                    [4] = {data = "7_88",dir = 3,dialog="也算是故人了，就帮你一把吧！"}
                    },
                ended = {
                    [1] = {data = "7_519",dir = 3,scene = "dh_cj01.png",dialog="你。。你是当年的小兄弟！谢谢，谢谢你又一次救了我！"},
                    [2] = {data = "7_88",dir = 3,dialog="也算是缘分吧！"},
                    [3] = {data = "7_519",dir = 3,dialog="这血战佣兵团是这里新兴的势力，人员众多，小兄弟你可要小心啊！"},
                    [4] = {data = "7_88",dir = 3,dialog="放心吧，我已经不是当年被追杀的四处逃窜的小子了！"},
                    },
                 },         
           [269]={
                begin ={
                    [1] = {data = "7_553",dir = 3,scene = "dh_cj02.png",dialog="吼！"},
                    [2] = {data = "7_88",dir = 3,dialog="魔兽山脉还是老样子啊！也好，正好练练身手！"},
                    },
                },         
           [272]={
                begin ={
                    [1] = {data = "7_508",dir = 3,scene = "dh_cj02.png",dialog="是少主下令捉拿的小子，大家上，别让他跑了！"},
                    [2] = {data = "7_88",dir = 3,dialog="呵，不自量力，那就陪你们玩玩！"},
                    },
                },
           [274]={
                begin ={
                    [1] = {data = "7_530",dir = 3,scene = "dh_cj02.png",dialog="你到底是何人，竟然能逃过我赫家的追杀？"},
                    [2] = {data = "7_88",dir = 3,dialog="赫家？算什么东西！"},
                    [3] = {data = "7_530",dir = 3,dialog="你。。嚣张是需要付出代价的！既然来了，就留下吧！"},
                    [4] = {data = "7_88",dir = 3,dialog="不自量力才需要付出代价！"}
                    },
                },
           [275]={
                begin ={
                    [1] = {data = "7_518",dir = 3,scene = "dh_cj02.png",dialog="谢谢你清理了赫家，救了我们！我。。"},
                    [2] = {data = "7_88",dir = 3,dialog="小事，此事已了，就此拜别吧！"},
                    [3] = {data = "7_518",dir = 3,dialog="你。。。再见"},
                    [4] = {data = "7_88",dir = 3,dialog="又回到这里了，也不知道小医仙现在在哪里！谁？！"}
                    },
                middle = {
                        {fight = 3,round = 1,talk = {dir = 0,name="小医仙",cardID=89,dialog = "你为什么还要回来呢！"}},
                        {fight = 3,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "这。。这，小医仙，你这是怎么了！是我啊，萧炎啊！"}},
                    },
                ended = {
                    [1] = {data = "7_89",dir = 3,scene = "dh_cj02.png",dialog="我们现在身份对立，还是不要再见面了！"},
                    [2] = {data = "7_88",dir = 3,dialog="小医仙，你一定要和我对立么！"},
                    [3] = {data = "7_89",dir = 3,dialog="我。。总之，你走吧！"},
                    [4] = {data = "7_88",dir = 3,dialog="我一定会救你出来的！你等着我！"},
                    },         
                },         
}
FightTaskInfo["29"]={
           [276]={
                begin ={
                    [1] = {data = "7_547",dir = 3,scene = "dh_cj02.png",dialog="听说了么，出云帝国联合毒宗、雁落宗已经出兵攻打加玛了！"},
                    [2] = {data = "7_88",dir = 3,dialog="雁落宗、毒宗和出云帝国么？那就一个一个收拾吧！"},
                    },
                },
           [278]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="洪辰",cardID=32,dialog = "你是加玛派来的奸细吗！呵呵，就让你见识见识我风雷弟子的厉害！"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "风雷阁也掺合进来了是么，呵呵，那就正好，一起收拾你们！"}},
                    },
                },         
           [281]={
                begin ={
                    [1] = {data = "7_76",dir = 3,scene = "dh_cj02.png",dialog="竟然偷学我风雷阁秘术-三千雷动，今日必不能饶了你个小贼！"},
                    [2] = {data = "7_88",dir = 3,dialog="呵，自古异宝能者得之，你们风雷阁学不会就应该早点拿出来！"},
                    [3] = {data = "7_76",dir = 3,dialog="庶子狂妄！"},
                    },
                middle = {
                        {fight = 1,round = 1,talk = {dir = 0,name="费天",cardID=76,dialog = "今日定要将你千刀万剐！以销我心头之恨！"}},
                        {fight = 1,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "放马过来吧！"}},
                    },
                },         
           [284]={
                begin ={
                    [1] = {data = "7_82",dir = 3,scene = "dh_cj02.png",dialog="萧姓小贼，竟敢欺我后辈，辱我弟子！受死！"},
                    [2] = {data = "7_88",dir = 3,dialog="这么大岁数了还喊打喊杀的，也不怕闪了你的老腰！"},
                    [3] = {data = "7_82",dir = 3,dialog="我洪天啸今日就让你知道狂妄的后果！"},
                    [4] = {data = "7_88",dir = 3,dialog="洪天啸很了不起么！咬我啊！"}
                    },
                },
           [285]={
                middle = {
                        {fight = 3,round = 1,talk = {dir = 1,name="雁落天",cardID=73,dialog = "你在我雁落宗兴风作浪，是不是太不把我放在眼里了！"}},
                        {fight = 3,round = 1,talk = {dir = 0,name="萧炎",cardID=88,dialog = "我怎么会把你放眼里呢~，我都是把你放骨灰盒里的啊！"}},
                        {fight = 3,round = 1,talk = {dir = 1,name="雁落天",cardID=73,dialog = "找死！"}},
                    },
                ended = {
                    [1] = {data = "7_73",dir = 3,scene = "dh_cj01.png",dialog="萧炎小贼，今日之仇来日必当加倍奉还！"},
                    [2] = {data = "7_88",dir = 3,dialog="雁落宗暂时不成威胁，下一个目标毒宗！呵呵！"},
                    },         
                },         
}
FightTaskInfo["30"]={
           [286]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "毒宗嘛~呵呵，既然小爷来了，那就给你们好好松松筋骨吧！"}},
                    },
                },       
           [291]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "哟，这风雷阁什么时候成了毒宗的走狗，为毒宗卖命了！"}},
                        {fight = 2,round = 1,talk = {dir = 0,name="沈云",cardID=75,dialog = "你以为只凭你一人之力能拯救加玛么！做梦！"}},
                    },
                },
           [294]={
                begin ={
                    [1] = {data = "7_74",dir = 3,scene = "dh_cj02.png",dialog="这位小友闯我宗门，伤我弟子，不知是毒宗哪里得罪了您！"},
                    [2] = {data = "7_88",dir = 3,dialog="说得罪也说不上~我就是来这带走我的女人的！"},
                    [3] = {data = "7_89",dir = 3,dialog="萧炎。。你。。（害羞。。）"},
                    [4] = {data = "7_74",dir = 3,dialog="大胆狂徒，竟敢调戏我毒宗圣女！"}
                    },
                },
           [295]={
                begin ={
                    [1] = {data = "7_74",dir = 3,scene = "dh_cj02.png",dialog="凭你一人之力，竟然我毒宗倾覆，玄冥宗主，你还打算旁观么！！"},
                    [2] = {data = "7_88",dir = 3,dialog="哟，终于知道找帮手了是么！！"},
                    [3] = {data = "7_79",dir = 3,dialog="此子如此年级便有这般修为，放任下去，早晚会成为我们的大敌！今日便是你的死期！"},
                    [4] = {data = "7_88",dir = 3,dialog="不不不，今天，是你的死期~"}
                    },
                middle = {
                        {fight = 3,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "看我的地心火莲！"}},
                        {fight = 3,round = 1,talk = {dir = 0,name="辰天南",cardID=79,dialog = "这。。这竟然是异火，啊！"}},
                    },
                ended = {
                    [1] = {data = "7_88",dir = 3,scene = "dh_cj01.png",dialog="毒宗强者大都被我击伤，应该无力参与加玛之战了！"},
                    [2] = {data = "7_89",dir = 3,dialog="萧炎，你这又是何必呢！你救不了我，我已经坠入毒道，纵使你伤我毒宗众人，出云与加玛之战，我还是会出现！"},
                    [3] = {data = "7_88",dir = 3,dialog="坠入毒道又怎样，你想战，那我便陪你！我会在加玛等着你！"}
                    },         
                },         
}
FightTaskInfo["31"]={
           [296]={
                begin ={
                    [1] = {data = "7_144",dir = 3,scene = "dh_cj02.png",dialog="出云帝国举国来犯，高手林立，我尽力才维持住局面！"},
                    [2] = {data = "7_88",dir = 3,dialog="辛苦你了，彩鳞！接下来的便交给我吧！"},
                    [3] = {data = "7_144",dir = 3,dialog="好！"},
                    },
                },
           [301]={
                begin ={
                    [1] = {data = "7_144",dir = 3,scene = "dh_cj02.png",dialog="小心，这是慕兰谷的慕兰三老，他们最擅长的是合体技！"},
                    [2] = {data = "7_88",dir = 3,dialog="合体技？那就一个一个弄死好了！"},
                    },
                },
           [304]={
                begin ={
                    [1] = {data = "7_89",dir = 3,scene = "dh_cj02.png",dialog="你真的要和我作对么？"},
                    [2] = {data = "7_88",dir = 3,dialog="如果这样才能救你的话！"},
                    [3] = {data = "7_91",dir = 3,dialog="别再说了！动手吧！动手之后你就会知道，我已经回不去了！"},
                    },
                },
           [305]={
                begin ={
                    [1] = {data = "7_73",dir = 3,scene = "dh_cj02.png",dialog="加玛气数已尽，还是乖乖臣服于我们出云帝国吧！"},
                    [2] = {data = "7_88",dir = 3,dialog="雁落天你是不是傻！没吃药就滚回你出云吃药去！"},
                    [3] = {data = "7_69",dir = 3,dialog="你！一起上，杀了萧炎，加玛就是我们的了！"},
                    [4] = {data = "7_88",dir = 3,dialog="唉，药不能停啊！"}
                    },
                ended = {
                    [1] = {data = "7_144",dir = 3,scene = "dh_cj01.png",dialog="出云帝国这次元气大伤，加玛此次的危机算是解了，之后你没事吧？"},
                    [2] = {data = "7_88",dir = 3,dialog="啊？没。。没事啊！干嘛？"},
                    [3] = {data = "7_144",dir = 3,dialog="没事最好，跟我去我族里走一趟吧！蛇族长老要见你！"},
                    [4] = {data = "7_88",dir = 3,dialog="见。。见我。。。0.0"},
                    },         
                },         
}
FightTaskInfo["32"]={
           [306]={
                begin ={
                    [1] = {data = "7_144",dir = 3,scene = "dh_cj02.png",dialog="这里就是我蛇人族的领地了，我不能带你上山，你只能自己进去！我会在山上等你！"},
                    [2] = {data = "7_88",dir = 3,dialog="你确定不是叫我来这杀人灭口的么。。怎么感觉这一路。。不会很太平！"},
                    [3] = {data = "7_144",dir = 3,dialog="^_^，你上来就知道了！"},
                    [4] = {data = "7_88",dir = 3,dialog="娘的，谁怕谁，走就走！"}
                    },
                },
           [308]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="墨巴斯",cardID=24,dialog = "女王大人是我的！！杀杀杀！杀了你！"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "滚开！老子的女人不是你能觊觎的！"}},
                    },
                },             
           [311]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="花蛇儿",cardID=23,dialog = "誓死捍卫女王大人荣威！"}},
                        {fight = 2,round = 1,talk = {dir = 0,name="月魅",cardID=25,dialog = "小小人类，也敢玷污我们女王大人！看招！"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "啊啊，男情敌就算了，为什么连女情敌都有！红颜祸水啊！"}},
                    },
                },
           [314]={
                begin ={
                    [1] = {data = "7_545",dir = 3,scene = "dh_cj02.png",dialog="小子，你跟我族女王之事，是不是应该给我们个交代？"},
                    [2] = {data = "7_88",dir = 3,dialog="我。。我说是误会，你能信么！"},
                    [3] = {data = "7_91",dir = 3,dialog="竟然说出如此不负责任之话！定不能饶你！"},
                    },
                },
           [315]={
                begin ={
                    [1] = {data = "7_144",dir = 3,scene = "dh_cj02.png",dialog="长老检测我已经怀了你的骨肉，你要负责！"},
                    [2] = {data = "7_88",dir = 3,dialog="我去，你说什么？！"},
                    [3] = {data = "7_144",dir = 3,dialog="你不想负责？- -！"},
                    [4] = {data = "7_88",dir = 3,dialog="我靠，大姐，别动手啊！"}
                    },
                middle = {
                        {fight = 3,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "彩鳞，你听我解释啊！"}},
                        {fight = 3,round = 1,talk = {dir = 0,name="美杜莎",cardID=144,dialog = "我不听，我不听！看招！"}},
                    },
                ended = {
                    [1] = {data = "7_88",dir = 3,scene = "dh_cj01.png",dialog="5555，女人都是这么不可理喻的么！我会负责的！"},
                    [2] = {data = "7_144",dir = 3,dialog="哼！"},
                    [3] = {data = "7_88",dir = 3,dialog="不过，彩鳞，你要等我，师傅还在魂殿手上，我必须要把师傅救出来！"},
                    [4] = {data = "7_144",dir = 3,dialog="我懂！你放心的去吧！家里有我！"},
                    },         
                },         
}
FightTaskInfo["33"]={
           [316]={
                begin ={
                    [1] = {data = "7_84",dir = 3,scene = "dh_cj02.png",dialog="你要到天焚炼气塔塔底修炼？"},
                    [2] = {data = "7_88",dir = 3,dialog="那里的岩浆世界正好可以帮助我修炼六合游身尺!"},
                    [3] = {data = "7_84",dir = 3,dialog="唉！你这小子，总是不能安分一点！"},
                    },
                middle = {
                        {fight = 1,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "咦，这里是。。竟然别有洞天！"}},
                    },                },
           [318]={
                middle = {
                        {fight = 1,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "这都是些什么鬼！蜥蜴人！？"}},
                    },
                },             
           [321]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="曜天火",cardID=110,dialog = "狂妄小辈竟敢冒犯本尊尸骨！死！"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "这。。天火尊者，不对，竟是天火尊者的一缕残魂！"}},
                    },
                },
           [324]={
                begin ={
                    [1] = {data = "7_748",dir = 3,scene = "dh_cj02.png",dialog="萧家小子，这里可不是你能来的地方！"},
                    [2] = {data = "7_88",dir = 3,dialog="千百二老！？你们潜藏迦南到底是在守护什么？"},
                    [3] = {data = "7_749",dir = 3,dialog="萧炎，怪只怪你知道的太多了！"},
                    },
                },
           [325]={
                begin ={
                    [1] = {data = "7_748",dir = 3,scene = "dh_cj02.png",dialog="我二人联手竟不是你的对手！这小子怎的如此厉害！"},
                    [2] = {data = "7_88",dir = 3,dialog="我敬二位长老守护迦南多年，可今日之事，需给我个说法！"},
                    [3] = {data = "7_111",dir = 3,dialog="哈哈，说法，小子，老夫给你个说法！"},
                    [4] = {data = "7_88",dir = 3,dialog="这TM又是谁！"}
                    },
                middle = {
                        {fight = 3,round = 1,talk = {dir = 0,name="地魔老鬼",cardID=111,dialog = "老夫筹谋多年，岂能被你一个小辈毁了我毕生心血！"}},
                        {fight = 3,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "那便试试看我有没有这个能力吧！"}},
                    },
                ended = {
                    [1] = {data = "7_111",dir = 3,scene = "dh_cj01.png",dialog="我魔炎谷多年筹谋全部毁于一旦，萧炎！今日之仇老夫来日必报！"},
                    [2] = {data = "7_88",dir = 3,dialog="手下败将！哼！"},
                    [3] = {data = "7_84",dir = 3,dialog="多亏了你小子，不然迦南这次。。唉"},
                    [4] = {data = "7_88",dir = 3,dialog="苏千大长老言重了！"},
                    },         
                },         
}
FightTaskInfo["34"]={
           [326]={
                begin ={
                    [1] = {data = "7_84",dir = 3,scene = "dh_cj01.png",dialog="如今你的实力在迦南已经没有可以提升的空间了，是时候让欣蓝带你动身前往中州了！"},
                    [2] = {data = "7_88",dir = 3,dialog="中州？"},
                    [3] = {data = "7_15",dir = 3,dialog="中州强者如林，异火，古法秘宝，有缘者得之！"},
                    [4] = {data = "7_88",dir = 3,dialog="异火！好！我们这就动身！"}
                    },
                },
           [327]={
                begin ={
                    [1] = {data = "7_15",dir = 3,scene = "dh_cj04.png",dialog="想去中州，必须要通过天涯城的空间虫洞！"},
                    [2] = {data = "7_88",dir = 3,dialog="前面就是天涯城了，万事小心！"},
                    },
                },
           [328]={
                begin ={
                    [1] = {data = "7_750",dir = 3,scene = "dh_cj04.png",dialog="都给本小姐闪开！不长眼的贱民们！"},
                    [2] = {data = "7_88",dir = 3,dialog="这路写着你们家名字呢！老子凭什么给你让路！"},
                    [3] = {data = "7_750",dir = 3,dialog="在天涯城敢惹我罗小天！活得不耐烦了吧！那我成全你！"},
                    },
                },             
           [331]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="柳擎",cardID=66,dialog = "住手！何方宵小竟敢打伤罗小姐！萧炎！？"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "柳擎？呵，没想到你竟然沦落到这种地步！"}},
                        {fight = 2,round = 1,talk = {dir = 0,name="罗小天",cardID=750,dialog = "姓柳的！给我狠狠教训这个贱民，不然你们柳家一家都别想好过！"}},
                        {fight = 2,round = 1,talk = {dir = 0,name="柳擎",cardID=66,dialog = "对不住了，萧炎！"}},
                    },
                },
           [334]={
                begin ={
                    [1] = {data = "7_751",dir = 3,scene = "dh_cj04.png",dialog="敢在天涯城对我罗家之人出手，胆子倒是不小！"},
                    [2] = {data = "7_88",dir = 3,dialog="终于有厉害点的出来了么！不然打的太没劲了！"},
                    [3] = {data = "7_751",dir = 3,dialog="竖子狂妄！"},
                    },
                },
           [335]={
                begin ={
                    [1] = {data = "7_15",dir = 3,scene = "dh_cj04.png",dialog="天涯城的空间虫洞一直都是控制在罗家手里，我们得罪了他们。。。"},
                    [2] = {data = "7_88",dir = 3,dialog="那又怎样！中州我去定了！"},
                    [3] = {data = "7_15",dir = 3,dialog="罗家倒还好，不过空间虫洞内危机重重，我们还是小心为上！"},
                    },
                middle = {
                        {fight = 3,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "我倒要看看这空间虫洞有什么可怕的！"}},
                        {fight = 3,round = 1,talk = {dir = 0,name="虫怪",cardID=752,dialog = "叽！"}},
                    },
                ended = {
                    [1] = {data = "7_15",dir = 3,scene = "dh_cj02.png",dialog="哎呀，这可怎么是好，空间黑洞把我们传送到不同的地方了！"},
                    [2] = {data = "7_88",dir = 3,scene = "dh_cj05.png",dialog="这。。是哪啊！！！"},
                    [3] = {data = "7_15",dir = 3,scene = "dh_cj02.png",dialog="萧大哥，你自求多福吧！"},
                    },         
                },         
}
FightTaskInfo["35"]={
           [336]={
                begin ={
                    [1] = {scene = "dh_cj05.png",talk="在无际的黄沙上，只有有寂寞的风呜咽的吹过",},
                    [2] = {data = "7_88",dir = 3,scene = "dh_cj05.png",dialog="这沙漠啥时候能走到头啊！<face=4>"},
                    },
                },
           [338]={
                begin ={
                    [1] = {data = "7_31",dir = 3,scene = "dh_cj05.png",talk="这里风沙较大，各侍卫注意防护！",},
                    [2] = {data = "7_88",dir = 3,dialog="我去！有人！终于看到人了！求豆麻袋~<face=4>"},
                    [3] = {data = "7_31",dir = 3,dialog="敌袭！！"},
                    },
                ended = {
                    [1] = {data = "7_31",dir = 3,scene = "dh_cj05.png",dialog="...不好意思啊，一场误会，我把你当强盗了！"},
                    [2] = {data = "7_88",dir = 3,dialog="哼！<face=8>"},
                    [3] = {data = "7_31",dir = 3,dialog="少侠如果不嫌弃的话，就跟我们一路吧！"},
                    [4] = {data = "7_88",dir = 3,dialog="好的哇~！"},
                    }, 
                },             
           [341]={
                begin ={
                    [1] = {data = "7_536",dir = 3,scene = "dh_cj05.png",talk="二小姐也真是的！不就是长得好看么！能有啥用！",},
                    [2] = {data = "7_88",dir = 3,dialog="唉，人帅遭人妒啊！我只想安静的做一个美男子！<face=3>"},
                    [3] = {data = "7_536",dir = 3,dialog="呕！！找打！"},
                    },
                },
           [344]={
                begin ={
                    [1] = {data = "7_31",dir = 3,scene = "dh_cj02.png",dialog="前面就要经过夏莽的地盘了！大家千万小心！"},
                    [2] = {data = "7_88",dir = 3,dialog="夏莽是干嘛的？"},
                    [3] = {data = "7_31",dir = 3,dialog="那就是个色胚！唉，希望我们能平安通过吧！"},
                    [4] = {data = "7_753",dir = 3,dialog="女人的香味~！把美女给我留下了！"},
                    },
                },
           [345]={
                begin ={
                    [1] = {data = "7_753",dir = 3,scene = "dh_cj02.png",dialog="小子，你以为你能守得住她们么！做梦！"},
                    [2] = {data = "7_88",dir = 3,dialog="手下败将废什么话！"},
                    [3] = {data = "7_526",dir = 3,dialog="什么人连我小弟也敢欺负！"},
                    [4] = {data = "7_88",dir = 3,dialog="我靠，难怪叫万蛇峡，都TM是蛇啊！"}
                    },
                middle = {
                        {fight = 3,round = 1,talk = {dir = 0,name="天蛇",cardID=526,dialog = "今日就拿你喂我的灵蛇们！"}},
                        {fight = 3,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "密集恐惧症伤不起啊！！"}},
                    },
                ended = {
                    [1] = {data = "7_31",dir = 3,scene = "dh_cj05.png",dialog="这次多亏有你！不然我们韩家车队就危险了！"},
                    [2] = {data = "7_88",dir = 3,dialog="没事，小菜一碟！"},
                    [3] = {data = "7_31",dir = 3,dialog="再往前就是天北城了，不介意的话，暂时先到我家落落脚吧！"},
                    [4] = {data = "7_88",dir = 3,dialog="也好，我也要赶紧和小医仙他们汇合才是！"},
                    },         
                },         
}
FightTaskInfo["36"]={
           [348]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="韩临",cardID=536,dialog = "臭小子，癞蛤蟆想吃天鹅肉！小姐是我的！"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "这话应该是对你自己说的吧！"}},
                    },
                },             
           [351]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="韩月",cardID=28,dialog = "哪里来的小贼，欺我韩家无人么！"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "啊啊，这都什么人啊，上来就打！老子信了你的邪了！"}},
                    },
                ended = {
                    [1] = {data = "7_28",dir = 3,scene = "dh_cj01.png",dialog="嘿嘿，萧炎学弟，不好意思啊，误会，误会！"},
                    [2] = {data = "7_88",dir = 3,dialog="大姐，下次咱看清楚了再动手行么！<face=2>"},
                    },    
                },
           [352]={
                begin ={
                    [1] = {data = "7_508",dir = 3,scene = "dh_cj01.png",dialog="快把韩家小姐交出来！我们洪家少爷等着迎娶两位娇妻呢！"},
                    [2] = {data = "7_88",dir = 3,dialog="靠！一下娶俩，做梦呢吧！"},
                    [3] = {data = "7_28",dir = 3,dialog="萧炎，帮帮我们韩家！"},
                    },
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="喽啰",cardID=508,dialog = "小子，识相的赶紧滚，洪家你可惹不起！"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "哎哟哟，我好怕怕啊！"}},
                    },
                },
           [354]={
                begin ={
                    [1] = {data = "7_32",dir = 3,scene = "dh_cj04.png",dialog="我可是风雷阁的弟子，跟我抢女人！活得不耐烦了吧！"},
                    [2] = {data = "7_88",dir = 3,dialog="风雷阁？很了不起么！打的就是你这样的臭流氓！"},
                    [3] = {data = "7_28",dir = 3,dialog="去死吧！"},
                    },
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="洪辰",cardID=32,dialog = "让你见识一下雷电的力量！"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "莫装逼，装逼遭雷劈！"}},
                    },
                },
           [355]={
                begin ={
                    [1] = {data = "7_32",dir = 3,scene = "dh_cj04.png",dialog="我。。我竟然败了！！"},
                    [2] = {data = "7_88",dir = 3,dialog="都跟你说了，莫装逼！"},
                    [3] = {data = "7_82",dir = 3,dialog="谁敢欺我洪家后辈！也要问过老头我同不同意！"},
                    [4] = {data = "7_88",dir = 3,dialog="又来个老头。。你们这世界老头是团购的么！！"}
                    },
                ended = {
                    [1] = {data = "7_82",dir = 3,scene = "dh_cj04.png",dialog="说！你身上的三千雷动身法是哪来的？"},
                    [2] = {data = "7_88",dir = 3,dialog="关你屁事！"},
                    [3] = {data = "7_82",dir = 3,dialog="不说，那就等着我洪家和风雷阁的追杀吧！"},
                    [4] = {data = "7_88",dir = 3,dialog="唉，没办法，当主角的就是这么招黑的体质！让暴风雨来的更猛烈吧！"},
                    },         
                },         
}
FightTaskInfo["37"]={
           [356]={
                begin ={
                    [1] = {scene = "dh_cj02.png",talk="风雷阁颁布风雷令，全力缉拿萧炎，生死不论！",},
                    [2] = {data = "7_88",dir = 3,scene = "dh_cj02.png",dialog="与其这么躲躲闪闪的，不如干脆直接上风雷阁把事情解决了！"},
                    [3] = {data = "7_28",dir = 3,dialog="风雷阁就在栖凤山顶，萧炎你万事小心！"},
                    [4] = {data = "7_88",dir = 3,dialog="该小心的是他们！"}
                    },
                },
           [358]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="沈云",cardID=75,dialog = "风雷阁全面缉拿，你竟然还敢闯我山门！"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "不然等着你们满大陆的追杀我么！"}},
                    },
                },             
           [361]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="长老",cardID=546,dialog = "风雷子弟听令！布九天雷狱阵！"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "这是要憋大招啊！"}},
                    },
                },
           [364]={
                begin ={
                    [1] = {data = "7_545",dir = 3,scene = "dh_cj02.png",dialog="小子，九天雷狱阵竟然都困不住你！那就让老夫们来试试你的斤两！"},
                    [2] = {data = "7_88",dir = 3,dialog="我能说我已经对老头审美疲劳了么！"},
                    },
                },
           [365]={
                begin ={
                    [1] = {data = "7_545",dir = 3,scene = "dh_cj02.png",dialog="恭迎阁主！"},
                    [2] = {data = "7_88",dir = 3,dialog="风雷阁阁主？！"},
                    [3] = {data = "7_76",dir = 3,dialog="萧炎，今日你闯我山门，伤我风雷弟子，想走，怕是没门了！"},
                    [4] = {data = "7_88",dir = 3,dialog="那不走你还管饭啊！"}
                    },
                ended = {
                    [1] = {data = "7_28",dir = 3,scene = "dh_cj02.png",dialog="这次你侥幸逃脱，风雷阁必不会善罢甘休，你伤成这样，不如去天山血潭试试吧！"},
                    [2] = {data = "7_144",dir = 3,dialog="天山血潭？"},
                    [3] = {data = "7_88",dir = 3,dialog="天山血潭每三年开放一次，可淬炼体质帮助人快速提升实力！"},
                    [4] = {data = "7_144",dir = 3,dialog="哦？那我去看看！也许能有小医仙她们的消息！"},
                    },         
                },         
}
FightTaskInfo["38"]={
           [366]={
                begin ={
                    [1] = {data = "7_88",dir = 3,scene = "dh_cj02.png",dialog="这里就是天目山脉了？天山血潭，我萧炎来了！"},
                    },
                },
           [368]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "竟然遇到狼王，看来血池不远了！"}},
                    },
                },             
           [371]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="王尘",cardID=754,dialog = "无名鼠辈也敢跟我黄泉阁抢东西！"}},
                        {fight = 2,round = 1,talk = {dir = 0,name="唐鹰",cardID=755,dialog = "此次天山血潭我万剑阁势在必得！"}},
                        {fight = 2,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "这年头，资源就是生命啊！又是一场硬仗！"}},
                    },
                },
           [374]={
                begin ={
                    [1] = {data = "7_97",dir = 3,scene = "dh_cj02.png",dialog="你就是毁了风雷北阁的萧炎？看着也不过如此嘛！"},
                    [2] = {data = "7_88",dir = 3,dialog="凤大小姐难道不知人不可貌相！"},
                    [3] = {data = "7_97",dir = 3,dialog="呵，那就让我看看，你有多不可貌相！"},
                    },
                },
           [375]={
                begin ={
                    [1] = {data = "7_77",dir = 3,scene = "dh_cj02.png",dialog="想去天山血潭，也要问过我噬金鼠一族同不同意！"},
                    [2] = {data = "7_88",dir = 3,dialog="噬金鼠又是什么鬼！妈蛋，想提升点实力这么难！"},
                    },
                middle = {
                        {fight = 3,round = 1,talk = {dir = 0,name="金石",cardID=103,dialog = "呵呵，小友实力不凡，老夫陪你过过招！"}},
                        {fight = 3,round = 1,talk = {dir = 1,name="萧炎",cardID=88,dialog = "啊，鼠王，终极大boss啊！"}},
                    },
                ended = {
                    [1] = {data = "7_103",dir = 3,scene = "dh_cj02.png",dialog="天山血潭，能者得之，萧炎小友，这次天山血潭提升机会就是你的了！"},
                    [2] = {data = "7_88",dir = 3,dialog="不容易啊！还是尽快提升实力是正道！"},
                    [3] = {data = "7_103",dir = 3,dialog="一月之后就是四方阁大会了，不知萧炎小友是否参加？"},
                    [4] = {data = "7_88",dir = 3,dialog="四方阁大会！？就是说有机会能见到风尊者了！我必前去！"},
                    },         
                },         
}
FightTaskInfo["39"]={
           [376]={
                begin ={
                    [1] = {data = "7_88",dir = 3,scene = "dh_cj04.png",dialog="这次四方阁大会虽然能见到风尊者，但是我跟其他三阁都有过节，又有一场硬仗要打啊！"},
                    },
                },
           [378]={
                middle = {
                        {fight = 2,round = 1,talk = {dir = 0,name="雷尊者",cardID=104,dialog = "萧炎，今日老夫就跟你好好清清咱们这件的旧账！"}},
                    },
                },             
           [385]={
                begin ={
                    [1] = {data = "7_112",dir = 3,scene = "dh_cj02.png",dialog="以一人之力，挑战三阁尊者，少年很有潜力啊！"},
                    [2] = {data = "7_88",dir = 3,dialog="你就是风尊者？你可认识这枚骨戒！"},
                    [3] = {data = "7_112",dir = 3,dialog="你是谁！你怎么会有他的东西！小贼，找死！"},
                    [4] = {data = "7_88",dir = 3,dialog="要疯了，上岁数的都这么偏执么！"}
                    },
                ended = {
                    [1] = {data = "7_112",dir = 3,scene = "dh_cj02.png",dialog="是我激动了，还以为你谋害了药尘才拿到他的骨戒！药尘现在在哪？"},
                    [2] = {data = "7_88",dir = 3,dialog="师傅被魂殿抓走了！我来中州就是为了找到营救他的方法！"},
                    [3] = {data = "7_112",dir = 3,dialog="魂殿！？好，我们一起把他救出来！"},
                    [4] = {data = "7_88",dir = 3,dialog="嗯！我与魂殿不死不休！"},
                    },         
                },         
}

FightTaskInfo["40"]={
             
}
FightTaskInfo["41"]={
             
}
FightTaskInfo["42"]={
             
}
FightTaskInfo["43"]={
             
}
FightTaskInfo["44"]={
             
}
FightTaskInfo["45"]={
             
}
FightTaskInfo["46"]={
             
}
FightTaskInfo["47"]={
             
}
FightTaskInfo["48"]={
             
}
FightTaskInfo["49"]={
             
}
FightTaskInfo["50"]={
             
}
FightTaskInfo["51"]={
             
}
FightTaskInfo["52"]={
             
}
FightTaskInfo["53"]={
             
}
FightTaskInfo["54"]={
             
}
FightTaskInfo["55"]={
             
}

local param = nil 
function FightTaskInfo.getData(chapterId,barrierId)
    if  FightTaskInfo[tostring(chapterId)][barrierId] then
        param = {}
        param.chapterId = chapterId
        param.barrierId = barrierId
        return FightTaskInfo[tostring(chapterId)][barrierId]
    else
        param = nil 
        return nil
    end
end

function FightTaskInfo.getCurrentInfo()
    return param
end