StaticThing = {

		openHole = 1, --打孔器

		linden = 2, --菩提子

		thing4 = 4, --破镜符

		thing5 = 5, --金刚心

		thing6 = 6, --突破石

		fireCrystal = 7, --火晶

		washRock = 8, --火能石

		silverNote10000 = 9, --银票

		silverNote5000 = 10, --银票

		soulSource = 12, --魂源

		thing13 = 13, --一阶生命魔核

		thing14 = 14, --二阶生命魔核

		thing15 = 15, --三阶生命魔核

		vip0Gift = 16, --vip0级礼包

		vip1Gift = 17, --vip1级礼包

		thing18 = 18, --四阶生命魔核

		thing19 = 19, --五阶生命魔核

		thing20 = 20, --六阶生命魔核

		thing21 = 21, --一阶物防魔核

		thing22 = 22, --二阶物防魔核

		thing23 = 23, --三阶物防魔核

		thing24 = 24, --四阶物防魔核

		thing25 = 25, --五阶物防魔核

		thing26 = 26, --六阶物防魔核

		thing27 = 27, --一阶法防魔核

		thing28 = 28, --二阶法防魔核

		thing29 = 29, --三阶法防魔核

		thing30 = 30, --四阶法防魔核

		thing31 = 31, --五阶法防魔核

		thing32 = 32, --六阶法防魔核

		thing33 = 33, --一阶物攻魔核

		thing34 = 34, --二阶物攻魔核

		thing35 = 35, --三阶物攻魔核

		thing36 = 36, --四阶物攻魔核

		thing37 = 37, --五阶物攻魔核

		thing38 = 38, --六阶物攻魔核

		thing39 = 39, --一阶法攻魔核

		thing40 = 40, --二阶法攻魔核

		thing41 = 41, --三阶法攻魔核

		thing42 = 42, --四阶法攻魔核

		thing43 = 43, --五阶法攻魔核

		thing44 = 44, --六阶法攻魔核

		recruitSign = 71, --兑换令

		peace = 72, --和平牌

		goldBox = 73, --金宝箱

		silverBox = 74, --银宝箱

		copperBox = 75, --铜宝箱

		goldKey = 76, --金钥匙

		silverKey = 77, --银钥匙

		copperKey = 78, --铜钥匙

		vigorPill = 79, --耐力丹

		energyPill = 80, --体力丹

		thing81 = 81, --装备锁

		refreshSign = 82, --刷新令

		thing83 = 83, --进阶石

		thing84 = 84, --蓝岩心石

		thing85 = 85, --紫岩心石

		specialGoldBox = 86, --金宝箱

		realmPill = 87, --境界丹

		wishWater = 88, --祝福水

		luckStore = 89, --幸运石

		thing90 = 90, --祥瑞珠

		thing91 = 91, --神魂凭证

		unionPracticeRoll = 92, --修炼卷

		unionWand = 93, --联盟令

		luckLock = 94, --尘缘锁

		thing95 = 95, --尘缘锁碎片

		thing96 = 96, --愚乐券

		thing97 = 97, --至尊转轮凭证

		thing98 = 98, --劳动奖章

		thing99 = 99, --红装精华

		thing100 = 100, --并蒂莲

		thing101 = 101, --万世巧克力

		thing102 = 102, --合欢锁

		thing103 = 103, --连理枝

		thing104 = 104, --一线牵

		thing105 = 105, --同心结

		thing106 = 106, --红玫瑰

		thing107 = 107, --永恒钻戒

		thing108 = 108, --鸾凤古琴

		thing109 = 109, --巧克力

		holdStarThing = 110, --占星石

		thing111 = 111, --七阶生命魔核

		thing112 = 112, --七阶物攻魔核

		thing113 = 113, --七阶法攻魔核

		thing114 = 114, --七阶物防魔核

		thing115 = 115, --七阶法防魔核

		thing116 = 116, --八阶生命魔核

		thing117 = 117, --八阶物攻魔核

		thing118 = 118, --八阶法攻魔核

		thing119 = 119, --八阶物防魔核

		thing120 = 120, --八阶法防魔核

		thing121 = 121, --初级淬炼石

		thing122 = 122, --中级淬炼石

		thing123 = 123, --高级淬炼石

		thing124 = 124, --超级淬炼石

		thing125 = 125, --斗

		thing126 = 126, --破

		thing127 = 127, --苍

		thing128 = 128, --穹

		thing129 = 129, --圣

		thing130 = 130, --诞

		thing131 = 131, --快

		thing132 = 132, --乐

		thing133 = 133, --超

		thing134 = 134, --值

		thing135 = 135, --团

		thing136 = 136, --购

		thing137 = 137, --团购信物

		thing138 = 138, --圣诞信物 

		thing139 = 139, --魂殿凭证

		thing140 = 140, --腊八粥

		thing141 = 141, --红豆

		thing142 = 142, --花生

		thing143 = 143, --江米

		thing144 = 144, --莲子

		thing145 = 145, --横扫千军凭证

		thing146 = 146, --后宫凭证

		thing147 = 147, --四美凭证

		thing148 = 148, --猴

		thing149 = 149, --年

		thing150 = 150, --大

		thing151 = 151, --吉

		thing152 = 152, --新春凭证

		thing153 = 153, --糯米

		thing154 = 154, --五仁

		thing155 = 155, --葡萄干

		thing156 = 156, --元宵

		thing157 = 157, --活动信物

		thing158 = 158, --改名卡

		thing159 = 159, --联盟改名卡

		thing160 = 160, --先祖之灵

		key = 161, --钥匙

		door = 162, --门

		smallpot = 163, --小血瓶

		bigpot = 164, --大血瓶

		fireBox = 165, --异火宝箱

		fireStone = 166, --火域神石

		fireScore = 167, --火运积分

		thing168 = 168, --大宝剑

		thing169 = 169, --斗魂精魄A

		thing170 = 170, --斗魂精魄B

		thing171 = 171, --黄玫瑰

		thing172 = 172, --甜蜜巧克力

		flower = 173, --鲜花

		thing174 = 174, --完美符

		thing175 = 175, --六

		thing176 = 176, --一

		thing179 = 179, --童乐券

		thing180 = 180, --粽子

		thing181 = 181, --粽叶

		thing182 = 182, --糯米粉

		thing183 = 183, --蜜枣

		thing184 = 184, --祛

		thing185 = 185, --暑

		thing186 = 186, --万能碎片

		thing187 = 187, --玫瑰

		thing188 = 188, --巧克力

		thing189 = 189, --九阶生命魔核

		thing190 = 190, --九阶物攻魔核

		thing191 = 191, --九阶法攻魔核

		thing192 = 192, --九阶物防魔核

		thing193 = 193, --九阶法防魔核

		thing200 = 200, --玄重尺碎片

		thing206 = 206, --万魂剑碎片

		thing207 = 207, --骨皇刀碎片

		thing211 = 211, --寒冰魔枪碎片

		thing212 = 212, --紫月玄扇碎片

		thing218 = 218, --乾坤天斧碎片

		thing220 = 220, --月牙戟枪碎片

		thing222 = 222, --炼狱魔刀碎片

		thing231 = 231, --万魂冥甲碎片

		thing232 = 232, --骨皇圣衣碎片

		thing233 = 233, --玄重天甲碎片

		thing234 = 234, --修罗罡铠碎片

		thing235 = 235, --幻冥皇铠碎片

		thing238 = 238, --天魔火甲碎片

		thing240 = 240, --天玉战铠碎片

		thing241 = 241, --落英神铠碎片

		thing254 = 254, --玄重心链碎片

		thing256 = 256, --骨皇幽珠碎片

		thing257 = 257, --幽鬼项链碎片

		thing258 = 258, --天机锁链碎片

		thing260 = 260, --万魂灵玉碎片

		thing263 = 263, --雪魂丝链碎片

		thing264 = 264, --魔狱项链碎片

		thing265 = 265, --龙吟项链碎片

		thing266 = 266, --玄重帝冠碎片

		thing267 = 267, --骨皇之冕碎片

		thing268 = 268, --青炙头盔碎片

		thing269 = 269, --凌霄翼盔碎片

		thing270 = 270, --虹影面甲碎片

		thing273 = 273, --万魂冠碎片

		thing276 = 276, --圣灵头盔碎片

		thing277 = 277, --锈色之冠碎片

		thing278 = 278, --祥瑞天斧碎片

		thing279 = 279, --祥瑞丝甲碎片

		thing280 = 280, --祥瑞玉髓碎片

		thing281 = 281, --祥瑞灵盔碎片

		thing282 = 282, --龙皇神剑碎片

		thing283 = 283, --龙皇铠甲碎片

		thing284 = 284, --龙皇戒指碎片

		thing285 = 285, --龙皇护盔碎片

		thing300 = 300, --超级境界丹

		thing301 = 301, --超级进阶石

		thing302 = 302, --灵宝精魄

		thing303 = 303, --万魂之源

		thing304 = 304, --异火灵石

		thing305 = 305, --神羽强化石

		thing306 = 306, --一阶神羽碎片

		thing307 = 307, --二阶神羽碎片

		thing308 = 308, --三阶神羽碎片

		thing309 = 309, --霸主之证

		thing310 = 310, --霸主之证碎片

		thing311 = 311, --觉醒之书

		thing312 = 312, --觉醒之书碎片

		thing313 = 313, --周

		thing314 = 314, --年

		thing315 = 315, --庆

		thing316 = 316, --乾

		thing317 = 317, --坤

		thing318 = 318, --问

		thing319 = 319, --鼎

		thing320 = 320, --大

		thing321 = 321, --吉

		thing322 = 322, --斗破信物

		thing323 = 323, --周年信物

		thing324 = 324, --中

		thing325 = 325, --秋

		thing326 = 326, --节

		thing327 = 327, --张

		thing328 = 328, --灯

		thing329 = 329, --结

		thing330 = 330, --彩

		thing331 = 331, --欢

		thing332 = 332, --度

		thing333 = 333, --国

		thing334 = 334, --庆

		thing335 = 335, --国庆信物

		thing336 = 336, --节日信物

		thing337 = 337, --牛奶糖

		thing338 = 338, --什锦糖

		thing339 = 339, --水果糖

		thing340 = 340, --地心魂髓

		thing341 = 341, --丹灵浆

		thing342 = 342, --魂婴果

		thing343 = 343, --香烛草

		thing344 = 344, --紫灵塑体花

		thing345 = 345, --佛焰根

		thing346 = 346, --凤火磷果

		thing347 = 347, --火灵根

		thing348 = 348, --青岩木

		thing349 = 349, --厚土芝

		thing350 = 350, --青莲果

		thing351 = 351, --青岚草

		thing352 = 352, --蛇脱花

		thing353 = 353, --天麻翡石精

		thing500 = 500, --Q群礼包

		thing501 = 501, --公会礼包

		thing502 = 502, --渠道礼包

		thing503 = 503, --体验礼包1

		thing504 = 504, --体验礼包2

		thing505 = 505, --体验礼包3

		thing506 = 506, --体验礼包4

		thing507 = 507, --体验礼包5

		thing508 = 508, --体验礼包6

		thing509 = 509, --体验礼包7

		thing510 = 510, --体验礼包8

		thing511 = 511, --体验礼包9

		thing512 = 512, --体验礼包10

		thing513 = 513, --体验礼包11

		thing514 = 514, --体验礼包12

		thing515 = 515, --体验礼包13

		thing516 = 516, --体验礼包14

		thing517 = 517, --体验礼包15

		lihezuixiazhi = 1000, --极品橙色功法礼盒

		thing1001 = 1001, --橙色功法礼盒

		thing1002 = 1002, --紫色功法礼盒

		thing1003 = 1003, --极品橙色法宝礼盒

		thing1004 = 1004, --橙色法宝礼盒

		thing1005 = 1005, --紫色法宝礼盒

		thing1006 = 1006, --橙色英雄礼盒

		thing1007 = 1007, --紫色英雄礼盒

		thing1008 = 1008, --橙色装备礼盒

		thing1009 = 1009, --紫色装备礼盒

		thing1010 = 1010, --魔核礼盒

		thing1011 = 1011, --元宝礼盒

		thing1012 = 1012, --普天同庆礼盒

		thing1013 = 1013, --至尊宝盒

		thing1014 = 1014, --祥瑞套装礼盒

		thing1015 = 1015, --重阳礼盒

		thing1016 = 1016, --陨落心炎宝盒

		thing1017 = 1017, --超级进阶宝盒

		thing1018 = 1018, --海心焰宝盒

		thing1019 = 1019, --青莲地心火宝盒

		thing1020 = 1020, --斗魂宝盒

		thing1021 = 1021, --玄重套装礼盒

		thing1022 = 1022, --骨皇套装礼盒

		thing1023 = 1023, --超级境界宝盒

		thing1024 = 1024, --元旦礼盒

		thing1025 = 1025, --拼手气礼盒

		groupBox = 1026, --团购宝箱

		bigGroupBox = 1027, --团购大宝箱

		thing1028 = 1028, --腊八返利礼包

		thing1029 = 1029, --抢货节返利宝箱

		thing1030 = 1030, --新春返利红包

		thing1031 = 1031, --元宵返利礼包

		thing1032 = 1032, --女神返利礼包

		thing1033 = 1033, --宝物礼盒

		thing1034 = 1034, --青年节返利礼包

		thing1036 = 1036, --征战宝箱

		thing1037 = 1037, --装备化神宝箱

		thing1038 = 1038, --联盟Boss宝箱

		thing1039 = 1039, --战争宝箱

		thing1040 = 1040, --龙皇套装礼盒

		thing1041 = 1041, --觉醒宝箱

		lihezuidazhi = 1200, --幸运礼盒

		nXuanYiKaiShi = 1300, --N选一开始

		thing1301 = 1301, --累充至尊宝箱

		thing1302 = 1302, --异火至尊宝箱

		thing1303 = 1303, --法宝至尊宝箱

		thing1304 = 1304, --功法至尊宝箱

		thing1305 = 1305, --斗魂至尊宝箱

		thing1306 = 1306, --横扫至尊凭证

		thing1307 = 1307, --后宫至尊凭证

		thing1308 = 1308, --魂殿英雄凭证

		thing1309 = 1309, --红颜英雄凭证

		thing1310 = 1310, --限定至尊宝箱

		thing1311 = 1311, --极致材料宝箱

		thing1312 = 1312, --炼魂至尊凭证

		thing1313 = 1313, --炼宝至尊凭证

		thing1314 = 1314, --巅峰至尊凭证

		thing1315 = 1315, --女神至尊凭证

		thing1316 = 1316, --霸主宝箱

		thing1317 = 1317, --翅膀礼盒

		thing1318 = 1318, --极致套装宝盒

		thing1319 = 1319, --丹心济世凭证

		nXuanYiJieShu = 1400, --N选一结束

		zhandouKaiShi = 1401, --先祖遗宝

		thing1402 = 1402, --劳动宝箱

		zhandouJieShu = 1500 --N选一结束

}
