UIAllianceHelp = {
    TYPES = {"info", "integral", "hero", "dial", "money", "pilltower", "ore", "realm" , "soul", "fire" , "wing", "hero_1" , "star", "war1", "war2", "war3", "purchase", "war4" , "redpackets" , "upstart", "mysteries", "practice" , "meeting", "escort", "barrierRank" , "alliance_run" , "fund", "wawa", "turn" , "goddess", "allianceWar", "qixia", "njsf", "one", "game" , "field", "awaken" ,"bigNumber"}}

UIAllianceHelp.allianceWar =
[[
1.开服第2周开启，每周四21:30-21:55
2.战斗分为外城战和内城战，外城战时间为：21:30-21:40；内城战时间为21:45-21:55。每次战斗开始前5分钟是守方的准备时间，玩家可进驻法阵驻守
3.守方胜利获得霸主宝箱，攻方积分第一的联盟，获得征战宝箱（由盟主或副盟主分配）。每次攻击获得20元宝，每成功驻守法阵60秒可以获得20元宝，并且攻击方随机抽取一名幸运玩家奖励800元宝。守方连续获胜将获得额外的霸主宝箱和霸主之证奖励。
4.战场由13个守方法阵和4个攻方法阵构成；13个守方法阵分为1个法阵阵眼（60积分/5秒），5个核心法阵（30积分/5秒），7个普通法阵（15积分/5秒），守方法阵无攻方玩家占领，将会给守方产生积分；4个攻方法阵（30积分/5秒），每个法阵有10批NPC驻守，驻守为0时，不再产生积分。攻方法阵积分计入攻方。
5.内城战和外城战积分总和判定攻守双方的胜负，内城战的积分双倍产生！攻方和守方积分相同，攻方获得胜利！
6.守方可在准备阶段花费银币或元宝进行属性提升，以应对多联盟的挑战；个人银币和元宝鼓舞属性加成最高上限各提升50%，联盟鼓舞最高属性上限提升100%；守方胜利，下次活动攻方全体玩家全属性加成100%，守方连续获胜，攻方也将获得每次增加100%的全属性累积加成。
]]

UIAllianceHelp.info = 
[[
活动规则：
      1.成员参与建设，可获得联盟经验，用于提升联盟等级。
      2.联盟初始可接纳30名成员，联盟等级每提升1级，成员上限加2，成员最大上限为50名。
      3.联盟等级提升后，在联盟商店中会开放更多奖励道具。
      4.联盟成员可从建设中获得联盟贡献，联盟贡献可在联盟商店购买各种道具。
      5.联盟最多可以有2名副盟主，副盟主有审核、踢出成员、更改内部公告、联盟宣言的权限。
      6.只有盟主可以解散联盟，联盟成员大于5人时禁止解散联盟。
      7.创建联盟10日内，联盟成员只有1人，并且联盟等级为1级时，联盟会自动解散。
      8.联盟内成员可弹劾盟主，弹劾成功后，弹劾者即可成为联盟新盟主！
      弹劾条件：
      （1）弹劾者需入盟满72小时；
      （2）盟主需离线5天以上；
      （3）弹劾需要花费一定元宝！
]]

UIAllianceHelp.integral =
[[
一、活动奖励发放规则：
      1.玩家参与伙伴招募可以获得招募积分，招募积分排行榜靠前的玩家会得到相应奖励。
      2.活动期间内招募积分达到指定条件，即可获得固定奖励。
      3.游戏活动结束后进行抽卡，不计入积分。
      4.积分排行榜可以查看前50名玩家的积分排行。
      5.积分相同时，先达到该积分的玩家排名居前。
      6.活动结束后，奖励通过领奖中心发放。

二、积分规则
      1.白银招募：5分/次
      2.黄金招募：10分/次
      3.白银十连招募：50分/次
      4.黄金十连招募：110分/次
]]

UIAllianceHelp.hero =
[[
活动规则：
      1.每消耗1元宝即可获得1积分。
      2.积分在本服排名前20都能获得对应排名奖励。
      3.积分相同时，先达到该积分的玩家排名居前。
      4.在设定的三个时间节点，每个时间点积分排名第一的玩家可以领取对应奖励。
      5.未入榜玩家只能看到排行榜第16-20名，如果玩家积分进入排行榜，那么只可以看到本人排名及本人前后共5名玩家的排行。
      6.活动结束后，奖励通过领奖中心发放！
]]

UIAllianceHelp.hero_1 =
[[
活动规则：
      1.每消耗1元宝即可获得1积分。
      2.积分在本服排名前20都能获得对应排名奖励。
      3.积分相同时，先达到该积分的玩家排名居前。
      4.在设定的三个时间节点，每个时间点积分排名第一的玩家可以领取对应奖励。
      5.未入榜玩家只能看到排行榜第16-20名，如果玩家积分进入排行榜，那么只可以看到本人排名及本人前后共5名玩家的排行。
      6.设定的3个时间点为3个活动周期，3个周期各自独立不进行累计，每个活动周期结束后清空当前周期内活动积分并重新开始下个周期积分，例如：0点到12点为一个活动周期，周期结束发放本周期活动排名奖励并清空本周期积分，下个周期积分重新计算，望玩家注意！
]]

UIAllianceHelp.dial =
[[
活动开始后玩家可以启动轮盘凭借运气获得轮盘内的奖励！

活动规则：
1.轮盘由八项奖励构成，启动轮盘需要消耗元宝，有机会获得轮盘内的奖励

2.启动之前如果对轮盘内的奖励不满意可以使用轮盘刷新功能，刷新后轮盘内的奖励会被刷新一次

3.轮盘内奖励分“限定奖励”和“普通奖励”两类
（限定奖励：有个数限制，任何玩家转出限定奖励之后对应的限定奖励数量减1，数量为0之后轮盘内将不再出现。）

4.最终排名：活动结束后，会根据积分排行榜发放奖励，具体奖励请点击活动界面，“查看排行大奖”

5.积分计算规则：
玩家每成功启动一次转盘增加10点积分，启动十次功能增加120积分，
玩家每用元宝刷新一次奖励增加1点积分。

6.活动结束之后，根据积分排行发放活动大奖。

7.限定物品活动日12时重置数量。
]]

UIAllianceHelp.money =
[[
活动规则：
　　1. 活动期间，玩家可招财7次，每次所需元宝数量不同，数量依次递增;
　　2. 每次激活招财进宝，均会得到超高返利，最高可返本金2倍元宝;
　　3. 激活元宝数越高，获得返利也越高哦。
]]

UIAllianceHelp.pilltower =
[[
活动规则：
　　1.丹塔副本中，一切退出副本的操作都会使副本重置
　　2.在丹塔挑战的过程中，每场战斗玩家英雄的剩余血量百分比会保留到下一次战斗中
　　3.历史层数达到25层后开启扫荡功能，之后每过10层可以开启新的扫荡层数
　　4.在丹塔每一关战斗中，在3回合内挑战成功，获得3枚勋章，4到6回合获得2枚勋章，大于6回合获得1枚勋章。
　　5.用“徽章补给”功能，消耗一定数量的徽章，可以为英雄恢复生命，或者复活
　　6.丹塔每通关5层都会有一个大奖，每层奖励和每5层的大奖每日只能领取一次，通关的层数越多，奖励越丰厚哦！
]]

UIAllianceHelp.ore = 
[[
活动规则：
      1.成功击败资源矿的原占领者，可占领该资源矿。
      2.占领资源矿后，根据占领的时间可获得大量的银币和进阶石奖励。
      3.奖励在离开矿时进行结算，奖励在领奖中心领取。
      4.占领无人矿和抢夺已有玩家占领的矿，无论成功或失败都要扣除耐力。
      5.部分矿有特殊奖励，矿主或协助者特殊奖励只有1份，被领取后，该矿的后来的占领者或协助者，将不可获得该矿的特殊奖励。
      6.矿主特殊奖励，当次活动，矿的第1位持续占领满2小时者可获得；获得特殊奖励后，将不可获得该矿或其他矿的其他特殊奖励。
      7.协助者特殊奖励，当次活动，矿的第1位持续协助满1小时者可获得；获得特殊奖励后，将不可获得该矿或其他矿的其他特殊奖励。
      8.每位玩家只能占领或协助一座资源矿，占领资源矿的同时，不可协助资源矿。
      9.当资源矿被占领时，玩家所在联盟成员可进行协助；资源矿增加协助者，矿主可获得相当于协助者在协助时间内获得收益的%d%%资源作为额外收益，此额外收益不影响协助者的收益。
      10.收益按照以下规则收益递减，玄天晶矿矿主>紫云晶矿矿主>寒冰晶矿矿主>玄天晶矿协助者>紫云晶矿协助者>寒冰晶矿协助者>翠玉晶矿矿主。
      11.天气会影响矿场的产量收益，不同页的矿区天气可能会不同。
]]

UIAllianceHelp.realm =
[[
活动规则：
      1、潜力值通过修炼转换成英雄属性，并提升英雄战斗力。 
      2、战斗力高的一方在普通战斗中可以享受先手优势！
]]

UIAllianceHelp.soul =
[[
活动规矩：
      1.斗魂可以为英雄增加属性，属性分为增加物攻、增加法攻、增加物防、增加法防、增加生命、增加暴击概率、增加抵抗暴击概率、增加暴击伤害、降低暴击伤害。
      2.选择一位已点亮的猎魂师进行猎魂，低级猎魂师有机率点亮更高一级的猎魂师，高级猎魂师有机会猎取到高级斗魂。
      3.斗魂通过吞噬其他斗魂升级，经验斗魂和银魂不可升级，银魂不可被吞噬。
      4.斗魂品质分为天阶（橙）、地阶（紫）、玄阶（蓝）、黄阶（绿），属性依次递减，银魂无品阶，只能出售换取银币。
      5.可通过给英雄附魂，获得斗魂所带的属性作为英雄属性加成，当你更换上阵英雄后，要记得把斗魂更换给新上阵的英雄。
]]

UIAllianceHelp.fire =
[[
活动规则：
      1.收集齐80个同样的异火火种就可激活相应的异火
      2.异火为卡牌提供强大的辅助功能，不同的卡牌合理搭配选择异火至关重要
      3.一种异火一旦激活，所有开启了异火栏位的卡牌都可以装备该种异火
      4.越多的英雄装备同样一种异火，该异火的火灵值消耗越快
      5.异火只可更换不能卸下，装备时请谨慎选择
      6.异火和异火火种经常用于卡牌的进阶和境界提升，用火种补充异火火灵要慎重
]]

UIAllianceHelp.wing =
[[
活动规则：
      1.需要合成神羽，才能佩戴神羽，合成时可以选择需要合成的神羽类型。
      2.佩戴神羽后，可获得神羽附带的属性值。
      3.神羽需要按顺序进阶，有前一阶的神羽，才能进阶到下一阶。
      4.神羽每进阶一次，可以开启一条属性，同时外形会有改变。
      5.神羽强化可提升神羽的属性。
      6.神羽可转换类型，不仅可以改变样式，还可以对应英雄，激活神羽天赋。
]]

UIAllianceHelp.star =
[[
活动规则：
      1、通过选择占卜星盘点亮上方目标星盘，积累星数获得奖励，达到指定的星数可领取对应奖励。
      2、占卜任意星盘都可获得星数，点亮目标星盘中的全部星盘，额外增加星数奖励。额外奖励星数每轮都会增加。
      3、每日凌晨刷新占卜次数、奖励、当前星数。
      4、三个观星台的奖励不同，开启等级越高，可获得的奖励越丰厚。
      5、通过在奖励界面刷新，可更换奖励物品。
      6、三个观星台每天只能进入其中一个占卜，进入一个观星台，占卜或刷新操作之后，不允许再进行其他观星台的占卜。
]]

UIAllianceHelp.war1 = 
[[
【盟战开启】
本服3级以上联盟超过8个时开启盟战

【参战资格】
1.排名前八的联盟有资格参加
2.加入联盟时间不足72小时的玩家不能参加

【赛程】
1.周六凌晨公布本周对阵（随机分配）
2.周六八强战，周日四强战，周一决赛，三四名决赛
3.八强战被淘汰的联盟，下周盟战全体成员将获得20%%全属性加成
4.布阵时间：0:00—17:00
5.开战时间：21:30

【战场】
1.四个战场依次开战
2.开战前无法查看对手布阵

【积分与获胜】
1.战场积分：消灭某个战场所有敌人，占领该战场并获取积分和奖励
2.击杀积分：每击杀一个对手获取10积分
3.存活积分：占领某战场后，计算存活积分，5积分/人
4.所有战斗结束后，积分高的联盟获胜
5.积分相同时，排名高的联盟获胜

【战场奖励】
1.占领某个战场，所有参战成员将获取该战场奖励
2.奖励于战斗结束后在领奖中心发放

【参战】
1.盟战当日零点系统随机将联盟成员分配至各战场
2.联盟成员可以自由调整战场
3.每个成员只能参与一个战场的争夺
4.联盟成员必须在布阵截止时间前（当日17:00）加入战场，否则将无法出战（伏兵除外）
5.布阵截止时刻（当日17:00）玩家阵容将被记录作为最终参战阵容
6.盟主、副盟主可以在布阵阶段转移成员、调整顺序、设置伏兵
7.17：00-18：30 保持异火种类不更换，以及狂暴状态，才能将异火带入盟战。

【放弃战场与平局】
1.我方未在某战场安排兵力，如果对方有成员参战，将直接判负（伏兵也不能加入）
2.如果双方在某战场都未安排兵力，判定为平局

【伏兵】
1.由盟主、副盟主指定
2.盟战开始后，伏兵可以根据战场形势随时选择加入
3.加入战场后，无法撤离
4.无法加入已被占领的战场
5.联盟等级决定伏兵人数上限

【伏兵奖励】
1.奖励：%s
2.未加入战场的伏兵不能获取奖励
3.奖励于战斗结束后在领奖中心发放

【战斗】
1.双方按顺序出战，采用1v1模式
2.负者直接淘汰，胜者移至队尾
3.胜者各项属性衰减20%%（衰减值持续累积，上限80%%）
4.伏兵加入时添加至队尾

【贡献与MVP】
1.贡献值根据击杀人数、击杀敌人等级、击杀敌人衰减度进行计算
2.盟战胜利方贡献最高的玩家为本场MVP
3.贡献值相同时，MVP随机产生

]]

UIAllianceHelp.war2 =
[[
【伏兵说明】
1.由盟主、副盟主指定
2.盟战开始后，伏兵可以根据战场形势随时选择加入
3.加入战场后，无法撤离
4.无法加入已被占领的战场
5.联盟等级决定伏兵人数上限

【伏兵奖励】
1.奖励：%s
2.未加入战场的伏兵不能获取奖励
3.奖励于战斗结束后在领奖中心发放
]]

UIAllianceHelp.war3 =
[[
【参战】
1.盟战当日零点系统随机将联盟成员分配至各战场
2.联盟成员可以自由调整战场
3.每个成员只能参与一个战场的争夺
4.联盟成员必须在布阵截止时间前（当日17:00）加入战场，否则将无法出战（伏兵除外）
5.布阵截止时刻（当日17:00）玩家阵容将被记录作为最终参战阵容
6.盟主、副盟主可以在布阵阶段转移成员、调整顺序、设置伏兵

【放弃战场与平局】
1.我方未在某战场安排兵力，如果对方有成员参战，将直接判负（伏兵也不能加入）
2.如果双方在某战场都未安排兵力，判定为平局

【战斗】
1.双方按顺序出战，采用1v1模式
2.负者直接淘汰，胜者移至队尾
3.胜者各项属性衰减20%（衰减值持续累积，上限80%）
4.伏兵加入时添加至队尾
]]

UIAllianceHelp.war4 =
[[
【贡献与MVP】
1.贡献值根据击杀人数、击杀敌人等级、击杀敌人衰减度进行计算
2.盟战胜利方贡献最高的玩家为本场MVP
3.贡献值相同时，MVP随机产生
]]

UIAllianceHelp.red =
[[
活动规则：
      1.橙色5星装备可以进阶为红色神兵装备。
      2.装备进阶到红装，可以激活额外属性。
      3.红装进阶需要淬炼度，装备淬炼度满值，装备自动进阶。

]]

UIAllianceHelp.purchase =
[[
活动规则：
      1.玩家初始购买道具是以原价计算。活动结束后，将会按照最后的折扣价格返还玩家多花的元宝。
      2.活动期间，全服玩家每购买一定数量的超值团购礼盒，就会享受团购折扣，满1500个享9折，2500个8折，3500个7折，4000个6折。
      3.购买的宝箱，已保存在背包里面，请到背包里使用。珍惜道具在等着你哦。
]]

UIAllianceHelp.mysteries = 
[[
联盟秘境玩法介绍：
      1.在联盟秘境中，您可以通过晃动手机（或者点击骰子）的方式，掷出点数使得人物前进，从而获得停留处的联盟建设材料和联盟贡献的奖励。
      2.联盟到达3级时，玩家可以组队进行联盟游戏，组队之后您获得掷两个骰子的权利，并且您的联盟队友可以获得和你相同的全程奖励。
      3.每天只有10次掷骰子的机会。
      4.联盟秘境中每前进一圈，奖励增长20%。
      5.合理的组合运用获得的运势牌可以大幅度提高您获得的奖励。
      6.每天活动结束后，联盟中排名靠前的玩家可以在昨日排行榜中领取自己的排名奖励。
      7.每天10次掷骰子机会耗尽之后一次性发放今日所有秘境奖励。
]]

UIAllianceHelp.practice = 
[[
帮助内容：
      1.修炼会给玩家带来属性加成或收益加成。
      2.修炼需要同时消耗联盟贡献和联盟资金，或元宝和联盟资金。
      3.每次修炼可获得1修炼值，不足1修炼值不可修炼。
      4.修炼的技能达到升级需求值，修炼的技能会自动升级，同时获得更高收益。
      5.联盟资金每天20:15:00清空，20:30:00刷新一次，每次刷新后获得的联盟资金，是上次至本次联盟资金刷新时间24小时内，联盟成员累计的资金。
      6.部分技能需要修炼值达到条件才可开启修炼。
      7.当修炼值达到联盟商店道具兑换条件，可使用联盟贡献或联盟令兑换道具。
      8.联盟有职位的成员，可在领奖中心免费获得修炼卷，获得数量由消耗的联盟资金产生，资金消耗越大，领取修炼卷越多。修炼卷可直接修炼技能，提升修炼值。
      9.修炼可提前15分钟进入等待状态，联盟资金刷新后自动进入修炼。
]]

UIAllianceHelp.redpackets = 
[[
联盟红包帮助：
      1.充值 档位越高，红包数量越多，额外发出随机红包数量也越多。
      2.联盟人数小于或等于红包数量，则人人都可以获得红包，并有人可以获得多份红包。以当时充值时候联盟人物为准。
      3.联盟人数大于红包数量，则有部分玩家无法获得红包。再次充值，红包优先发给上次未获得的成员。
      4.每笔充值，每个联盟成员接受的红包数量上限不超过10个。
      5.自己只能收到其他人发来的红包。
]]

UIAllianceHelp.upstart = 
[[
土豪奖励帮助：
      1.发红包数超过200个的前三用户将获专属奖励。
      2.第一名获得神壕奖励，第二名获得仙壕奖励，第三名获得灵壕奖励。
      3.在活动结束时候，奖励由领奖中心发放。
]]

UIAllianceHelp.meeting = 
[[
炼药师大会规则：
    1、点击“炼制”，即可获得一个随机号码和随机道具
    2、【炼魂】有几率获得14卡魂魄，【炼宝】有几率获得高级装备碎片，魔核、稀有道具等
    3、炼制所获得的号码，在每天的23点产生最终大奖号码，拥有此号码的玩家将获得神秘奖励。
    4、本活动消耗1元宝即可获得1积分，达到固定积分可以领取相应奖励。
    5、玩家消耗部分元宝将存入药鼎中，药鼎处于FIRE状态时，玩家点击炼制将有机会获得药鼎中的元宝，FIRE状态时间保持1小时。
    6、药鼎FIRE状态时当元宝数量为0时退出FIRE状态，重新开始存储元宝。
]]

UIAllianceHelp.alliance_run = 
[[
帮助内容：
      1.每周三可选择支持的小龟参加比赛，当天会开启三场比赛，分别为11:30、18:30、21:30；每场比赛开始后的10分钟为休息时间，休息时间结束后，可选择支持下一场比赛的小龟。
      2.玩家可选择一只小龟，并对小龟选择支持的物品数量。
      3.在比赛过程中，小龟的速度随时可能发生变化，并在比赛期间会触发意外事件，影响小龟比赛，有小龟优先到达终点，该小龟为冠军，比赛结束。
      4.比赛结束，支持第一名的小龟将获得支持物品的3倍奖励。
      5.三场比赛结束，连续3场胜利或连续3场失败都会有一份大奖。
      6.玩家每胜一场给联盟增加5分，失败给联盟增加1分，三场比赛结束评出最终联盟排行，进入排行的联盟并参与活动的玩家都将获得奖励奖励。如果联盟积分相同，按照联盟排行排名次
      7.每场小龟快跑，不论胜负，参与玩家都将获得联盟贡献奖励。
]]

UIAllianceHelp.fund = 
[[
天降横财：
    1、满足充值金额后可选激活对应档次横财，6天后横财本金金额返还并获取超值游戏福利。
    2、激活横财可以单选任意满足充值需求的一档，也可以复选同时开启满足充值要求的多个档次。
    3、活动期间，无论单选或是复选激活，均只有一次激活横财机会，请慎重选择激活。
    4、复选开启多档横财，需要分别扣除各档横财所需元宝，6天后多档横财本金全额返还，横财生效6天期间可同时领取复选激活的多档横财福利。
    5、横财激活第六天全额返还所有横财本金以外，将获得额外横财大奖（不同档次横财对应不同大奖），复选可领取对应档次多项横财大奖。
    6、横财奖励每日会发到领奖中心，需要到领奖中心提取。
]]

UIAllianceHelp.escort = 
[[
活动开启条件：服务器有4个联盟到达5级，即全联盟开启镖行天下活动

活动时间：每周1早上8点到周四晚22点

活动开始服务器排名前4的联盟会有金条从中州城运到服务器排名前4的联盟，各位大侠可以用偷窃或者抢夺的方式打劫他们的金条

对方联盟剩余金条越多偷窃装死的成功率越高，遇到该联盟高战力守卫的几率越低

被抢夺的联盟金条只剩初始时的一半时，进入保护状态，不能再被抢夺或者偷窃

所有联盟（包括排名第四名之后的联盟)镖行天下活动开始后的每周都会收到跟前四名的联盟一样的保底奖励

每次战斗即使失败也可以获得可观的帮贡奖励

抢劫或者偷窃除去自己联盟之外金条最多的联盟的马车，可以获得翻倍的夺镖积分

排行榜分为抢夺榜、偷窃榜和护卫榜，还有联盟排行榜
     所有奖励在活动结束后发送到领奖中心。

活动结束后，剩余金条数最多的联盟排名第一，全联盟都可以领奖，奖励发放到领奖中心
]]

UIAllianceHelp.barrierRank =
[[
单个关卡积分：根据评定换算积分
  ● 1星 : 1分
  ● 2星 : 3分
  ● 3星 : 5分
  ● 完胜 : 10分

总积分：所有关卡积分之和

积分相同时，先达到该积分的玩家排名靠前
]]

UIAllianceHelp.wawa = 
[[
1.套娃一共有5层，每打开一层会获得特殊道具。
2.打开套娃有几率开到小丑，若是开打小丑，之前获得的道具全部清空
3.可以在中途放弃开启下一层，可以获得之前开启全部道具
4.活动期间玩家可免费开启一次，童乐券可重置活动次数
5.道具统一发放到领奖中心，请注意领取
]]

UIAllianceHelp.turn = 
[[
1.转轮分为内外两圈：
     外圈为豪华转轮区，活动期间每累计充值满30元可获得一次转轮资格；
     内圈为至尊转轮区，每次转轮需消耗一个“至尊转轮信物”，参与累计充值活动即可获得大量信物，超值大奖尽在其中！
2.在转动外圈豪华转轮时，有一定几率进去内圈至尊转轮区，随机获得一件内圈至尊奖励。
3.保底次数，若是玩家20次豪华转轮均没有进入至尊转轮，那么第21次必然进入至尊转轮
]]

UIAllianceHelp.goddess = 
[[
1 送花分三档，不同的档位可以获得当前女神不同数量的魂魄。
2 滑动屏幕中间可以切换自己中意的女神。
3 每个档位都会积累聊妹指数，当聊妹指数达到相应的进度时候可以获得特殊女神奖励魂魄或卡牌。
4 鲜花可以在商店购买，也可以在活动指定的系统里面获取，请关注活动公告。
5 活动有开启和关闭时间，请留意，以免获取过多鲜花。
]]

UIAllianceHelp.qixia = 
[[
1.器匣共用20个级别，每一个级别都需要祝福水解封才可以精炼。
2.装备精炼时会出现普通、精英和完美三个品级，每个品级对应的增幅值不同。
3.若是对当前精炼品级不满意，可以重复精炼。
4.消耗完美符可以使当前级别一次性达到完美品级。
5.完美度达到条件，装备框形象会发生变化。
]]


UIAllianceHelp.game = 
[[
说明：
基础规则：
1.参战英雄：主力英雄，替补英雄，伙伴英雄（培养中）
2.【异火】，【天玄三玄变】加成，【结界】加成不带入段位赛 
3.每个小队至少保留一名主力英雄
4.缘分只在各个小队内部各英雄之间匹配

---------------------------------------------------
赛制：
1.每个自然月为一个赛季，赛季结束积分重置
2.根据积分评定级别和段位
3.级别分SS、S、A、B、C、D。段位分为1-9段
4.单场比赛采取三局两胜制
5.胜利获得一定积分，失败将扣除一定积分
6.每天有5次免费挑战次数，可额外购买10次挑战次数
7.每次挑战随机刷出3名对手，每次刷新对手冷却10分钟

---------------------------------------------------
积分规则：
1.单场胜利+10分，失败-10分
2.连胜（败）将获得（扣除）额外的积分：
	2连胜+3分		2连败-2分
	3连胜+5分		3连败-3分	
	4连胜+7分		4连败-4分
	5-10连胜+10分	5-10连败-5分
	11-15连胜+15分	11-15连败-5分
3.连胜（败）次数次日清零
4.跨级别挑战获胜+10分（跨段位无额外积分奖励）

---------------------------------------------------
被挑战规则：
1.每日前5次被其他玩家挑战获胜（失败）将获得（扣除）积分
2.被挑战获胜+10分，失败-10分
3.当日被挑战超过5次后，无论胜负都不获得（扣除）积分
4.被挑战胜利（失败）不计入连胜（败）次数

---------------------------------------------------
奖励：
1.根据玩家当前级别段位进行奖励发放
2.奖励分每日奖励和每周奖励
3.每日奖励当日24：00发放至领奖中心
4.每周奖励每周日24:00发放至领奖中�
]]

UIAllianceHelp.njsf = 
[[
1. 一共有9个物品，其中一个是高级英雄魂魄。
2. 点击开始后，9个物品被纳戒吸入并打乱顺序。
3. 每次点击一个纳戒开启，可获得其中的物品。9个纳戒全部打开可获得所有物品。
4. 每轮纳戒都会有一次免费次数，免费次数用完后，需要消耗元宝继续开启纳戒。
5. 每轮开纳戒免费次数用完后可进行免费重置，重置后更新9个物品，可以重新开始开启纳戒
6. 每天开启纳戒的次数和联盟等级有关。联盟5级可以进入活动，联盟每提升2级增加一轮次数。
]]


UIAllianceHelp.one = 
[[
1.每次活动会有三种商品抢购，分别会在9点、14点、19点刷新，每件商品展示的时间只有五小时。旁边的“商品概览”则是可以查看今天上架抢购的全部商品。
2.活动期间，每轮商品最少投入1元宝才可以参与商品抽奖。当全服元宝达到条件即会开奖，随机抽取一个玩家发放商品。抢购时元宝投入越多，开奖获得商品的几率越大。每人投入的元宝上限=全服元宝总数/奖励份数。
3.每件商品展示时间结束时，全服进度未满，按满足最大份数给予奖励（进度达到最大积分1/3，不足2/3，发放一份奖励；达到2/3不足1，发放2份奖励；奖励在商品下架时发放）
4.抢购成功并且中奖的玩家，奖励将通过领奖中心发放。其他没中玩家投入的元宝会转为积分，可以到积分商店兑换道具。
5.活动结束后，所有获得的活动积分将清空重置，玩家一定要在时间内完成兑换！
]]

UIAllianceHelp.field = 
[[
1.结界：
由【培养中】的小伙伴组成，将小伙伴放置于结界位，可以将对应属性值加成到所有上阵主力和替补英雄

2.属性数值计算规则：
例如：
结界位属性【生命+5%】
该位置小伙伴【生命值：100】
全体上阵主力和替补英雄生命增加【100x5%】

3.界门：结界正中位置

4.结界之力：达到对应条件可激活，结界之力的属性数值加成来自于【界门】位置英雄
]]

UIAllianceHelp.awaken = 
[[
1.特殊卡牌在金品2阶开启觉醒功能.
2.卡牌觉醒后会有新形象，而且会增加觉醒技能，原本的三个技能效果也有相应增强。
3.若防止误操作，请锁定不使用的卡牌。
]]

UIAllianceHelp.bigNumber = 
[[
1.活动期间，每消耗1元宝可获取1个积分，活动通过消耗积分抽取幸运数字

2.每次抽取幸运数字消耗一定积分，每次抽取将随机获取幸运数字（较上次变大或变小）

3.玩家可通过【还原最大数字】，将当前数字变为当日抽取的最大数字（每次还原操作将消耗积分）

4.活动当日24:00将根据幸运数字大小进行排名并发送奖励（领奖中心领取）

5.排名计算时，数字相同的玩家，按数字获取时间先后排名（进行【还原最大数】操作，按还原操作时间计算）

6.若活动周期为多日，每日24:00进行结算并清空数字

7.抽取到幸运尾数，可获得额外的幸运奖励
]]

local userData = nil

function UIAllianceHelp.init()
    UIAllianceHelp.Widget:addTouchEventListener(function(sender, eventType)
        if eventType == ccui.TouchEventType.ended then
            UIManager.popScene()
        end
    end)
end

function UIAllianceHelp.setup()
    if userData.titleName then
        ccui.Helper:seekNodeByName(UIAllianceHelp.Widget, "text_title"):setString(userData.titleName)
    end
    local view = ccui.Helper:seekNodeByName(UIAllianceHelp.Widget, "view")

    local height = 0

    local name = userData.type and UIAllianceHelp.TYPES[userData.type + 1] or userData.name
    if name and UIAllianceHelp[name] then
        local str = UIAllianceHelp[name]
        -- richtext的bug，认为空行的高度为0
        str = string.gsub(str, "\n\n", "\n \n")
        local richText = ccui.RichText:create()
        richText:ignoreContentAdaptWithSize(false)
        richText:setContentSize(cc.size(473, 398))
        richText:pushBackElement(ccui.RichElementText:create(1, display.COLOR_WHITE, 255, str, dp.FONT, 22))
        richText:formatText()
        local size = richText:getContentSize()
        text = ccui.Text:create("", dp.FONT, 22)
        text:setTextAreaSize(size)
        text:setName("text_" .. name)
        text:setTextColor(cc.c3b(0xFF, 0xFF, 0xAC))
        text:setString(str)
        text:setAnchorPoint(display.LEFT_TOP)
        text:setPosition(8.16, 415.78)
        view:removeAllChildren()
        view:addChild(text)
        height = size.height
    else
        local children = view:getChildren()
        text = view:getChildByName(name)
        if text then
            text:setVisible(true)
            height = text:getContentSize().height
            for i, child in ipairs(children) do
                if child ~= text then
                    child:setVisible(false)
                end
            end
        end
    end

    local scrollViewSize = view:getContentSize()
    if height < scrollViewSize.height then
        height = scrollViewSize.height
    end
    view:setInnerContainerSize(cc.size(scrollViewSize.width, height))
    text:setPositionY(view:getInnerContainerSize().height - 5)
end

function UIAllianceHelp.free()
    userData = nil
end

function UIAllianceHelp.show(_tableParams)
    userData = _tableParams
    UIManager.pushScene("ui_alliance_help")
end