MailContentConfig={
	['1']={
		['id'] = 1,
		['title'] = "【系统】[副本]奖励",
		['content'] = "亲爱的玩家您好，由于您未能及时领取奖励，[变形地宫]奖励以邮件形式发送给您，请及时领取。",
	},
	['2']={
		['id'] = 2,
		['title'] = "【系统】[副本]奖励",
		['content'] = "亲爱的玩家您好，由于您未能及时领取奖励，[变形地宫]奖励以邮件形式发送给您，请及时领取。",
	},
	['3']={
		['id'] = 3,
		['title'] = "【系统】[副本]奖励",
		['content'] = "亲爱的玩家您好，由于您未能及时领取奖励，[变形地宫]奖励以邮件形式发送给您，请及时领取。",
	},
	['4']={
		['id'] = 4,
		['title'] = "【系统】[副本]奖励",
		['content'] = "亲爱的玩家您好，由于您未能及时领取奖励，[变形地宫]奖励以邮件形式发送给您，请及时领取。",
	},
	['6']={
		['id'] = 6,
		['title'] = "【系统】[副本]奖励",
		['content'] = "亲爱的玩家您好，由于您未能及时领取奖励，[上古战场]奖励以邮件形式发送给您，请及时领取。",
	},
	['21']={
		['id'] = 21,
		['title'] = "【系统】[副本]奖励",
		['content'] = "亲爱的玩家您好，由于您未能及时领取奖励，[诛仙阵]奖励以邮件形式发送给您，请及时领取。",
	},
	['51']={
		['id'] = 51,
		['title'] = "【系统】[世界BOSS]奖励",
		['content'] = "亲爱的玩家您好，感谢您参与世界boss-多臂罗汉的战斗，参战奖励以邮件形式发送给您，请及时领取。",
	},
	['52']={
		['id'] = 52,
		['title'] = "【系统】[世界BOSS]奖励",
		['content'] = "亲爱的玩家您好，感谢您参与世界boss-炽炎浑天兽的战斗，参战奖励以邮件形式发送给您，请及时领取。",
	},
	['53']={
		['id'] = 53,
		['title'] = "【系统】[世界BOSS]奖励",
		['content'] = "亲爱的玩家您好，感谢您参与世界boss-九幽恶灵的战斗，参战奖励以邮件形式发送给您，请及时领取。",
	},
	['54']={
		['id'] = 54,
		['title'] = "【系统】[世界BOSS]奖励",
		['content'] = "亲爱的玩家您好，感谢您参与世界boss-吸血鬼亲王的战斗，参战奖励以邮件形式发送给您，请及时领取。",
	},
	['55']={
		['id'] = 55,
		['title'] = "【系统】[世界BOSS]奖励",
		['content'] = "亲爱的玩家您好，感谢您参与世界boss-蜘蛛女皇的战斗，参战奖励以邮件形式发送给您，请及时领取。",
	},
	['56']={
		['id'] = 56,
		['title'] = "【系统】[世界BOSS]奖励",
		['content'] = "亲爱的玩家您好，感谢您参与世界boss-魔化纣王的战斗，参战奖励以邮件形式发送给您，请及时领取。",
	},
	['57']={
		['id'] = 57,
		['title'] = "【系统】[世界BOSS]奖励",
		['content'] = "亲爱的玩家您好，感谢您参与世界boss-梼杌的战斗，参战奖励以邮件形式发送给您，请及时领取。",
	},
	['58']={
		['id'] = 58,
		['title'] = "【系统】[世界BOSS]奖励",
		['content'] = "亲爱的玩家您好，感谢您参与世界boss-穷奇的战斗，参战奖励以邮件形式发送给您，请及时领取。",
	},
	['59']={
		['id'] = 59,
		['title'] = "【系统】[世界BOSS]奖励",
		['content'] = "亲爱的玩家您好，感谢您参与世界boss-梼杌的战斗，参战奖励以邮件形式发送给您，请及时领取。",
	},
	['103']={
		['id'] = 103,
		['title'] = "【系统】[仙魔战场]活动奖励",
		['content'] = "亲爱的玩家您好，由于您未能及时领取奖励，[仙魔战场]奖励以邮件形式发送给您，请及时领取。",
	},
	['104']={
		['id'] = 104,
		['title'] = "【系统】[个人爬塔]活动奖励",
		['content'] = "亲爱的玩家您好，由于您未能及时领取奖励，[个人爬塔]奖励以邮件形式发送给您，请及时领取。",
	},
	['105']={
		['id'] = 105,
		['title'] = "【系统】[组队经验副本]活动奖励",
		['content'] = "亲爱的玩家您好，由于您未能及时领取奖励，[组队经验副本]奖励以邮件形式发送给您，请及时领取。",
	},
	['106']={
		['id'] = 106,
		['title'] = "【系统】[极限挑战]BOSS排名奖励",
		['content'] = "亲爱的玩家您好，由于您未能及时领取奖励，[极限挑战]BOSS伤害排名奖励以邮件形式发送给您，请及时领取。",
	},
	['108']={
		['id'] = 108,
		['title'] = "【系统】[在线奖励]",
		['content'] = "亲爱的玩家您好，由于您背包已满，[在线奖励]以邮件形式发送给您，请及时领取。",
	},
	['109']={
		['id'] = 109,
		['title'] = "【系统】[副本事件]额外奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，[副本事件额外奖励]以邮件形式发送给您，请及时领取。",
	},
	['110']={
		['id'] = 110,
		['title'] = "【系统】[激活码]奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，[激活码奖励]以邮件形式发送给您，请及时领取。",
	},
	['111']={
		['id'] = 111,
		['title'] = "【系统】[帮派BOSS]奖励",
		['content'] = "亲爱的玩家您好，由于您未能及时领取奖励，[帮派boss奖励]以邮件形式发送给您，请及时领取。",
	},
	['112']={
		['id'] = 112,
		['title'] = "【系统】[帮派战]活动奖励",
		['content'] = "亲爱的玩家您好，由于您未能及时领取奖励，[帮派战奖励]以邮件形式发送给您，请及时领取。",
	},
	['113']={
		['id'] = 113,
		['title'] = "【系统】[日环抽奖]奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，日环抽奖奖励以邮件形式发送给您，请及时领取。",
	},
	['114']={
		['id'] = 114,
		['title'] = "【系统】[等级礼包]奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，[等级奖励]以邮件形式发送给您，请及时领取。",
	},
	['115']={
		['id'] = 115,
		['title'] = "【系统】[日环]额外奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，[日环奖励]以邮件形式发送给您，请及时领取。",
	},
	['116']={
		['id'] = 116,
		['title'] = "【系统】[扫荡]奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，[扫荡奖励]以邮件形式发送给您，请及时领取。",
	},
	['117']={
		['id'] = 117,
		['title'] = "【系统】[签到]奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，[签到奖励]以邮件形式发送给您，请及时领取。",
	},
	['118']={
		['id'] = 118,
		['title'] = "【系统】[微端]奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，[微端奖励]以邮件形式发送给您，请及时领取。",
	},
	['119']={
		['id'] = 119,
		['title'] = "【系统】[等级]奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，[等级奖励]以邮件形式发送给您，请及时领取。",
	},
	['120']={
		['id'] = 120,
		['title'] = "【系统】[组队经验副本]奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，[组队经验副本奖励]以邮件形式发送给您，请及时领取。",
	},
	['121']={
		['id'] = 121,
		['title'] = "【系统】[寻宝]奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，[寻宝奖励]以邮件形式发送给您，请及时领取。",
	},
	['122']={
		['id'] = 122,
		['title'] = "【系统】[神铸]奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，[神铸引导奖励]以邮件形式发送给您，请及时领取。",
	},
	['123']={
		['id'] = 123,
		['title'] = "【系统】[奇遇]奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，[奇遇奖励]以邮件形式发送给您，请及时领取。",
	},
	['124']={
		['id'] = 124,
		['title'] = "【系统】[七日奖励]",
		['content'] = "亲爱的玩家您好，由于您背包已满，[七日登录奖励]以邮件形式发送给您，请及时领取。",
	},
	['125']={
		['id'] = 125,
		['title'] = "【系统】[守护北苍]",
		['content'] = "亲爱的玩家您好，由于您背包已满，[守护北苍奖励]以邮件形式发送给您，请及时领取。",
	},
	['126']={
		['id'] = 126,
		['title'] = "【系统】[任务奖励]",
		['content'] = "亲爱的玩家您好，由于您背包已满，[主线任务奖励]以邮件形式发送给您，请及时领取。",
	},
	['127']={
		['id'] = 127,
		['title'] = "【系统】[宗门奖励]",
		['content'] = "宗门任务完成，任务奖励以邮件形式发送给您，请及时领取。",
	},
	['128']={
		['id'] = 128,
		['title'] = "【系统】[进阶VIP返还]",
		['content'] = "亲爱的玩家您好，由于您背包已满，[进阶vip返还奖励]以邮件形式发送给您，请及时领取。",
	},
	['129']={
		['id'] = 129,
		['title'] = "【系统】[物品下架]",
		['content'] = "亲爱的玩家您好，由于您背包已满，[寄售行物品下架]以邮件形式发送给您，请及时领取。",
	},
	['130']={
		['id'] = 130,
		['title'] = "【系统】[物品出售]",
		['content'] = "亲爱的玩家您好，有玩家购买了您寄售的道具，获得%s元宝收益，收取管理费用%s元宝。请及时领取。",
	},
	['131']={
		['id'] = 131,
		['title'] = "【系统】[物品购买]",
		['content'] = "亲爱的玩家您好，由于您背包已满，[购买物品]以邮件形式发送给您，请及时领取。",
	},
	['210']={
		['id'] = 210,
		['title'] = "【系统】[V计划]礼包",
		['content'] = "亲爱的玩家您好，由于您背包已满，[V计划礼包奖励]以邮件形式发送给您，请及时领取。",
	},
	['211']={
		['id'] = 211,
		['title'] = "【系统】[V计划]提醒信息",
		['content'] = "恭喜您成为v计划会员，您将享受每日超值礼包、超酷专属称号，额外buff加成，等特权。",
	},
	['212']={
		['id'] = 212,
		['title'] = "【系统】[v计划]到期提醒",
		['content'] = "亲爱的玩家您好，您的V计划服务将于%s天后 (%s)到期，服务到期后您的成长值将会以-12点/天的速率减少、不再享受游戏内个性称号、专属buff加成、豪华礼包等海量特权服务！ 以及官网每日免费抽奖、论坛特定勋章、尊贵身份标示等。为不影响您的游戏体验，提醒您及时续费。",
	},
	['213']={
		['id'] = 213,
		['title'] = "【系统】[v计划]过期提醒",
		['content'] = "亲爱的玩家您好，您的V计划服务服务于%s已过期，服务到期后您的成长值将会以-12点/天的速率减少、不再享受游戏内个性称号、专属buff加成、豪华礼包等海量特权服务！ 以及官网每日免费抽奖、论坛特定勋章、尊贵身份标示等。为不影响您的游戏体验，提醒您及时续费。",
	},
	['214']={
		['id'] = 214,
		['title'] = "【系统】[奖励发放]",
		['content'] = "亲爱的玩家您好，您背包已满，任务奖励以邮件形式发送给您，请及时领取。",
	},
	['215']={
		['id'] = 215,
		['title'] = "【系统】[奖励发放]",
		['content'] = "亲爱的玩家您好，您背包已满，斩妖屠魔奖励以邮件形式发送给您，请及时领取。",
	},
	['216']={
		['id'] = 216,
		['title'] = "【系统】[日环抽奖]",
		['content'] = "亲爱的玩家您好，由于您未能及时领取奖励，[日环抽奖]以邮件形式发送给您，请及时领取。",
	},
	['217']={
		['id'] = 217,
		['title'] = "【系统】[日环奖励]奖励",
		['content'] = "亲爱的玩家您好，由于您未能及时领取奖励，[日环奖励]以邮件形式发送给您，请及时领取。",
	},
	['218']={
		['id'] = 218,
		['title'] = "【系统】[成就奖励]",
		['content'] = "亲爱的玩家您好，由于您背包已满，[成就奖励]以邮件形式发送给您，请及时领取。",
	},
	['219']={
		['id'] = 219,
		['title'] = "【系统】[分解装备]",
		['content'] = "亲爱的玩家您好，由于您背包已满，本次[分解装备]得到的材料以邮件形式发送给您，请及时领取。",
	},
	['220']={
		['id'] = 220,
		['title'] = "【系统】[装备打造]",
		['content'] = "亲爱的玩家您好，由于您背包已满，本次[装备打造]得到的装备以邮件形式发送给您，请及时领取。",
	},
	['221']={
		['id'] = 221,
		['title'] = "【系统】[剧情副本]奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，本次[剧情副本]挑战得到的材料以邮件形式发送给您，请及时领取。",
	},
	['222']={
		['id'] = 222,
		['title'] = "【系统】[剧情副本]奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，本次[剧情副本]扫荡得到的材料以邮件形式发送给您，请及时领取。",
	},
	['223']={
		['id'] = 223,
		['title'] = "【系统】[剧情副本]奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，本次[剧情副本]宝箱开启得到的物品以邮件形式发送给您，请及时领取。",
	},
	['224']={
		['id'] = 224,
		['title'] = "【系统】[追回]奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，[追回奖励]以邮件形式发送给您，请及时领取。",
	},
	['225']={
		['id'] = 225,
		['title'] = "【系统】[副本掉落]挽回",
		['content'] = "亲爱的玩家您好，由于您未进行拾取，[副本掉落物品]以邮件形式发送给您，请及时领取。",
	},
	['226']={
		['id'] = 226,
		['title'] = "【系统】[连占礼包]奖励",
		['content'] = "亲爱的玩家您好，由于您在帮派战内表现积极，帮主特为您发放连占礼包。",
	},
	['227']={
		['id'] = 227,
		['title'] = "【系统】[灵兽墓地]奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，[灵兽墓地]过关奖励以邮件形式发送给您，请及时领取。",
	},
	['228']={
		['id'] = 228,
		['title'] = "【系统】[灵兽墓地]奖励",
		['content'] = "亲爱的玩家您好，[灵兽墓地]已过关卡奖励以邮件形式发送给您，请及时领取。",
	},
	['229']={
		['id'] = 229,
		['title'] = "【系统】[极限挑战]活动奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，[极限挑战]BOSS伤害排名奖励以邮件形式发送给您，请及时领取。",
	},
	['230']={
		['id'] = 230,
		['title'] = "【系统】[活跃度]奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，[活跃度]奖励以邮件形式发送给您，请及时领取。",
	},
	['231']={
		['id'] = 231,
		['title'] = "【系统】[极限挑战]杀怪排名奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，[极限挑战]杀怪怪排名奖励以邮件形式发送给您，请及时领取。",
	},
	['232']={
		['id'] = 232,
		['title'] = "【系统】[极限挑战]活动奖励",
		['content'] = "亲爱的玩家您好，由于您未能及时领取奖励，[极限挑战]杀怪排名奖励以邮件形式发送给您，请及时领取。",
	},
	['233']={
		['id'] = 233,
		['title'] = "【系统】[帮派BOSS]活动奖励",
		['content'] = "亲爱的玩家您好，感谢您参与[帮派BOSS]挑战活动，活动奖励以邮件形式发送给您，请及时领取。",
	},
	['234']={
		['id'] = 234,
		['title'] = "【系统】[帮派BOSS]伤害排名奖励",
		['content'] = "亲爱的玩家您好，[帮派BOSS]挑战活动伤害排名奖励以邮件形式发送给您，请及时领取。",
	},
	['235']={
		['id'] = 235,
		['title'] = "【系统】[血战北苍界]活动奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，[血战北苍界]积分排名奖励以邮件形式发送给您，请及时领取。",
	},
	['236']={
		['id'] = 236,
		['title'] = "【系统】[北苍殿]挑战奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，[北苍殿]挑战奖励以邮件形式发送给您，请及时领取。",
	},
	['237']={
		['id'] = 237,
		['title'] = "【系统】[守卫北苍]死亡奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，[守卫北苍]死亡奖励以邮件形式发送给您，请及时领取。",
	},
	['238']={
		['id'] = 238,
		['title'] = "【系统】[经验副本]奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，[经验副本]道具奖励以邮件形式发送给您，请及时领取。",
	},
	['239']={
		['id'] = 239,
		['title'] = "【系统】[V计划]上线",
		['content'] = "亲爱的玩家您好，V计划已经正式上线啦！成为V计划会员，可获得多重惊喜豪礼，更有专属称号。详情请关注V计划专栏！",
	},
	['240']={
		['id'] = 240,
		['title'] = "【系统】[360加速球]",
		['content'] = "亲爱的玩家您好，由于您背包已满，[360加速球]奖励以邮件形式发送给您，请及时领取。",
	},
	['241']={
		['id'] = 241,
		['title'] = "【系统】[跨服1V1]段位上升",
		['content'] = "亲爱的玩家您好，恭喜您在[跨服1V1]活动中战绩惊人，段位获得提升。",
	},
	['242']={
		['id'] = 242,
		['title'] = "【系统】[游戏大厅]",
		['content'] = "亲爱的玩家您好，由于您背包已满，[游戏大厅]奖励以邮件形式发送给您，请及时领取。",
	},
	['243']={
		['id'] = 243,
		['title'] = "【系统】[安全卫士]",
		['content'] = "亲爱的玩家您好，由于您背包已满，[安全卫士]奖励以邮件形式发送给您，请及时领取。",
	},
	['244']={
		['id'] = 244,
		['title'] = "【系统】[跨服1V1]段位下降",
		['content'] = "亲爱的玩家您好，由于您在[跨服1V1]活动中战绩不佳，段位下降。",
	},
	['245']={
		['id'] = 245,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【威力无边】，失去属性：攻击50，防御25，生命200，命中15，闪避15，暴击15。",
	},
	['246']={
		['id'] = 246,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【威力无限】，失去属性：攻击100，防御50，生命400，命中30，闪避30，暴击30。",
	},
	['247']={
		['id'] = 247,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了等级排行榜第一，称号【擎天至尊】已经失效，失去属性：攻击300，防御150，生命1200，命中100，闪避50，暴击50。",
	},
	['248']={
		['id'] = 248,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了战力排行榜第一，称号【通天战皇】已经失效，失去属性：攻击300，防御150，生命1200，命中100，闪避50，暴击50。",
	},
	['249']={
		['id'] = 249,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【众神之王】，失去属性：攻击1000，防御500，生命4000，命中300，闪避300，暴击300。",
	},
	['250']={
		['id'] = 250,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【至尊天盟】，失去属性：攻击88，防御50，生命500，命中30，闪避30，暴击30。",
	},
	['251']={
		['id'] = 251,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【万象尊神】，失去属性：攻击500，防御250，生命2000，命中150，闪避150，暴击150。",
	},
	['252']={
		['id'] = 252,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【青龙真神】，失去属性：攻击250，防御130，生命1000，命中80，闪避80，暴击80。",
	},
	['253']={
		['id'] = 253,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【白虎真神】，失去属性：攻击250，防御130，生命1000，命中80，闪避80，暴击80。",
	},
	['254']={
		['id'] = 254,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【朱雀真神】，失去属性：攻击250，防御130，生命1000，命中80，闪避80，暴击80。",
	},
	['255']={
		['id'] = 255,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【玄武真神】，失去属性：攻击250，防御130，生命1000，命中80，闪避80，暴击80。",
	},
	['256']={
		['id'] = 256,
		['title'] = "【系统】[跨服1V1]段位保持不变",
		['content'] = "亲爱的玩家您好，[跨服1V1]活动中您不受他人影响，纹丝不动，段位保持不变。",
	},
	['257']={
		['id'] = 257,
		['title'] = "【系统】[跨服1V1]赛季奖励",
		['content'] = "亲爱的玩家您好，[跨服1V1]赛季结束，根据您在本赛季中的表现排名，奖励以邮件形式发送给您，请及时领取。",
	},
	['258']={
		['id'] = 258,
		['title'] = "【系统】[VIP奖励]",
		['content'] = "亲爱的玩家您好，由于您背包已满，[vip奖励]以邮件形式发送给您，请及时领取。",
	},
	['259']={
		['id'] = 259,
		['title'] = "【系统】[奖励补发]",
		['content'] = "亲爱的玩家您好，由于您意外掉线，副本通关奖励以邮件形式发送给您，请及时领取。",
	},
	['260']={
		['id'] = 260,
		['title'] = "【系统】[帮派王城战]奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，帮派王城战奖励以邮件形式发送给您，请及时领取。",
	},
	['261']={
		['id'] = 261,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【至尊预约】，失去属性：攻击30，防御15，生命120，命中9，闪避9，暴击9。",
	},
	['262']={
		['id'] = 262,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【360加速球特权】，失去属性：攻击30，防御15，生命120，命中9，闪避9，暴击9。",
	},
	['263']={
		['id'] = 263,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【360积分尊享】，失去属性：攻击30，防御15，生命120，命中9，闪避9，暴击9。",
	},
	['264']={
		['id'] = 264,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【360影视特权】，失去属性：攻击30，防御15，生命120，命中9，闪避9，暴击9。",
	},
	['265']={
		['id'] = 265,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【灵路血祸者】，失去属性：攻击30，防御15，生命120，命中9，闪避9，暴击9。",
	},
	['266']={
		['id'] = 266,
		['title'] = "【系统】[活动礼包]奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，[活动礼包]道具奖励以邮件形式发送给您，请及时领取。",
	},
	['267']={
		['id'] = 267,
		['title'] = "【系统】[团购物品]",
		['content'] = "亲爱的玩家您好，由于您背包已满，[团购物品]道具奖邮件形式发送给您，请及时领取。",
	},
	['268']={
		['id'] = 268,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【海浪】，失去属性：攻击50，防御30，生命200，命中15，闪避15，暴击15。",
	},
	['269']={
		['id'] = 269,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【Z.TAO】，失去属性：攻击50，防御30，生命200，命中15，闪避15，暴击15。",
	},
	['270']={
		['id'] = 270,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【360主宰之神】，失去属性：攻击30，防御18，生命60，命中9，闪避9，暴击9。",
	},
	['271']={
		['id'] = 271,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【大千之巅】，失去属性：攻击188，防御100，生命1500，命中56，闪避56，暴击56。",
	},
	['272']={
		['id'] = 272,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【风华绝代】，失去属性：攻击30，防御15，生命120，命中9，闪避9，暴击9。",
	},
	['273']={
		['id'] = 273,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【出神入化】，失去属性：攻击30，防御15，生命120，命中9，闪避9，暴击9。",
	},
	['274']={
		['id'] = 274,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【王者之风】，失去属性：攻击30，防御15，生命120，命中9，闪避9，暴击9。",
	},
	['275']={
		['id'] = 275,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【君临天下】，失去属性：攻击30，防御15，生命120，命中9，闪避9，暴击9。",
	},
	['276']={
		['id'] = 276,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【三天极境】，失去属性：攻击30，防御15，生命120，命中9，闪避9，暴击9。",
	},
	['277']={
		['id'] = 277,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【灵轮化神】，失去属性：攻击30，防御15，生命120，命中9，闪避9，暴击9。",
	},
	['278']={
		['id'] = 278,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【微博大使】，失去属性：攻击20，防御10，生命80，命中6，闪避6，暴击6。",
	},
	['279']={
		['id'] = 279,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【微信大使】，失去属性：攻击20，防御10，生命80，命中6，闪避6，暴击6。",
	},
	['280']={
		['id'] = 280,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【男神宣传大使】，失去属性：攻击30，防御15，生命120，命中9，闪避9，暴击9。",
	},
	['281']={
		['id'] = 281,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【壕·百万战力】，失去属性：攻击50，防御25，生命200，命中15，闪避15，暴击15。",
	},
	['282']={
		['id'] = 282,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【新手引导员】，失去属性：攻击50，防御25，生命200，命中15，闪避15，暴击15。",
	},
	['283']={
		['id'] = 283,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【叱咤风云】，失去属性：攻击60，防御30，生命240，命中18，闪避18，暴击18。",
	},
	['284']={
		['id'] = 284,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【老练的猎手】，失去属性：攻击30，防御15，生命120，命中9，闪避9，暴击9。",
	},
	['285']={
		['id'] = 285,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【梦想】，失去属性：攻击20，防御10，生命80，命中6，闪避6，暴击6。",
	},
	['286']={
		['id'] = 286,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【嗜血狂魔】，失去属性：攻击780，防御390，生命3120，命中234，闪避234，暴击234。",
	},
	['287']={
		['id'] = 287,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【谁与争锋】，失去属性：攻击30，防御15，生命120，命中9，闪避9，暴击9。",
	},
	['288']={
		['id'] = 288,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【万古不枯】，失去属性：攻击30，防御15，生命120，命中9，闪避9，暴击9。",
	},
	['289']={
		['id'] = 289,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【震慑群雄】，失去属性：攻击2540，防御1270，生命10160，命中762，闪避762，暴击762。",
	},
	['290']={
		['id'] = 290,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【威震苍穹】，失去属性：攻击5100，防御2550，生命20400，命中1530，闪避1530，暴击1530。",
	},
	['291']={
		['id'] = 291,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【潇湘隐士】，失去属性：攻击1280，防御640，生命5120，命中384，闪避384，暴击384。",
	},
	['292']={
		['id'] = 292,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【修罗魔尊】，失去属性：攻击30，防御15，生命120，命中9，闪避9，暴击9。",
	},
	['293']={
		['id'] = 293,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【幽冥皇子】，失去属性：攻击60，防御30，生命240，命中18，闪避18，暴击18。",
	},
	['294']={
		['id'] = 294,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【天下第一帮】，失去属性：攻击50，防御25，生命200，命中15，闪避15，暴击15。",
	},
	['295']={
		['id'] = 295,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【大主宰】，失去属性：攻击30，防御15，生命120，命中9，闪避9，暴击9。",
	},
	['296']={
		['id'] = 296,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【我是大主宰】，失去属性：攻击50，防御25，生命300，命中15，闪避15，暴击15。",
	},
	['297']={
		['id'] = 297,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【17173灵斗强者】，失去属性：攻击20，防御10，生命80，命中6，闪避6，暴击6。",
	},
	['298']={
		['id'] = 298,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【多玩灵院至尊】，失去属性：攻击20，防御10，生命80，命中6，闪避6，暴击6。",
	},
	['299']={
		['id'] = 299,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【新浪灵阵宗师】，失去属性：攻击20，防御10，生命80，命中6，闪避6，暴击6。",
	},
	['300']={
		['id'] = 300,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【07073特权专属】，失去属性：攻击20，防御10，生命80，命中6，闪避6，暴击6。",
	},
	['301']={
		['id'] = 301,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【265G特权专属】，失去属性：攻击20，防御10，生命80，命中6，闪避6，暴击6。",
	},
	['302']={
		['id'] = 302,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【竞技之神】，失去属性：攻击500，防御250，生命2000，命中150，闪避150，暴击150。",
	},
	['303']={
		['id'] = 303,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【竞技之王】，失去属性：攻击300，防御150，生命1200，命中90，闪避90，暴击90。",
	},
	['304']={
		['id'] = 304,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【竞技达人】，失去属性：攻击100，防御50，生命400，命中30，闪避30，暴击30。",
	},
	['305']={
		['id'] = 305,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【倾国倾城】，失去属性：攻击50，防御25，生命200，命中15，闪避15，暴击15。",
	},
	['306']={
		['id'] = 306,
		['title'] = "【系统】[个人BOSS]活动奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，[个人BOSS]挑战奖励以邮件形式发送给您，请及时领取。",
	},
	['307']={
		['id'] = 307,
		['title'] = "【系统】[弹劾通知]",
		['content'] = "亲爱的玩家您好，由于您已连续2天未上线，若超过5天未登录，将被弹劾。",
	},
	['308']={
		['id'] = 308,
		['title'] = "【系统】[弹劾通知]",
		['content'] = "亲爱的玩家您好，由于您已连续5天未上线，已被弹劾，您已降为帮众。",
	},
	['309']={
		['id'] = 309,
		['title'] = "【系统】[帮派仓库审核-通过]",
		['content'] = "亲爱的玩家您好，您在帮派仓库申请的s%,已经审核通过，请查收附件领取。",
	},
	['310']={
		['id'] = 310,
		['title'] = "【系统】[帮派仓库审核-拒绝]",
		['content'] = "亲爱的玩家您好，您在帮派仓库申请的s%,审核被拒绝，您无法获得该物品，如有所需，可重新申请。",
	},
	['311']={
		['id'] = 311,
		['title'] = "【系统】[特权加速奖励]",
		['content'] = "亲爱的玩家您好，由于您背包已满，[特权加速礼包]以邮件形式发送给您，请及时领取。",
	},
	['312']={
		['id'] = 312,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【玩我是大主宰上YYGAME】，失去属性：攻击10，防御5，生命40，命中3，闪避3，暴击3。",
	},
	['313']={
		['id'] = 313,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【玩游戏上顺网】，失去属性：攻击10，防御5，生命40，命中3，闪避3，暴击3。",
	},
	['314']={
		['id'] = 314,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【玩游戏上飞火平台】，失去属性：攻击10，防御5，生命40，命中3，闪避3，暴击3。",
	},
	['315']={
		['id'] = 315,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【顺网会员】，失去属性：攻击30，防御15，生命120，命中9，闪避9，暴击9。",
	},
	['316']={
		['id'] = 316,
		['title'] = "【系统】[组队挑战]奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，[组队挑战]过关奖邮件形式发送给您，请及时领取。",
	},
	['317']={
		['id'] = 317,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【玩我是大主宰只上602.com】，失去属性：攻击10，防御5，生命40，命中3，闪避3，暴击3。",
	},
	['318']={
		['id'] = 318,
		['title'] = "【系统】[奖励补发]",
		['content'] = "亲爱的玩家您好，由于您背包已满，奖励以邮件形式发送给您，请及时领取。",
	},
	['319']={
		['id'] = 319,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【玩我是大主宰只上37.com】，失去属性：攻击10，防御5，生命40，命中3，闪避3，暴击3。",
	},
	['320']={
		['id'] = 320,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【顺网超级会员】，失去属性：攻击50，防御25，生命200，命中15，闪避15，暴击15。",
	},
	['321']={
		['id'] = 321,
		['title'] = "【系统】[地宫争夺战]奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，[地宫争夺战]活动奖励以邮件形式发送给您，请及时领取。",
	},
	['322']={
		['id'] = 322,
		['title'] = "【系统】[地宫竞价]信息",
		['content'] = "亲爱的帮主您好，您的帮派在竞价中被其他帮派超越，请及时加价竞争参与资格。",
	},
	['323']={
		['id'] = 323,
		['title'] = "【系统】[地宫争夺战]资格信息",
		['content'] = "亲爱的玩家您好，您所在的帮派获得了地宫-神墓园的争夺资格，请注意活动时间，及时参与。",
	},
	['324']={
		['id'] = 324,
		['title'] = "【系统】[地宫争夺战]资格信息",
		['content'] = "亲爱的玩家您好，您所在的帮派获得了地宫-熔炉的争夺资格，请注意活动时间，及时参与。",
	},
	['325']={
		['id'] = 325,
		['title'] = "【系统】[地宫争夺战]资格信息",
		['content'] = "亲爱的玩家您好，您所在的帮派获得了地宫-陨落地的争夺资格，请注意活动时间，及时参与。",
	},
	['326']={
		['id'] = 326,
		['title'] = "【系统】[地宫竞价]提醒",
		['content'] = "亲爱的玩家您好，今日开启地宫竞价，请各位帮主注意竞价时间，及时参与。占领地宫帮派可额外获得挂机经验10%加成，并可享受立即传送至BOSS附近特权。",
	},
	['327']={
		['id'] = 327,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【YouXi女神】，失去属性：攻击50，防御25，生命200，命中15，闪避15，暴击15。",
	},
	['328']={
		['id'] = 328,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【YouXi美女会长】，失去属性：攻击50，防御25，生命200，命中15，闪避15，暴击15。",
	},
	['329']={
		['id'] = 329,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【玩我是大主宰只上2217】，失去属性：攻击10，防御5，生命40，命中3，闪避3，暴击3。",
	},
	['330']={
		['id'] = 330,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【王者归来】，失去属性：攻击30，防御15，生命120，命中9，闪避9，暴击9。",
	},
	['331']={
		['id'] = 331,
		['title'] = "【系统】[帮派战-遗迹之战开启]",
		['content'] = "亲爱的玩家您好，本周3晚21：00-21：30即将开启新的一轮帮派战，获胜帮派将获得上古天宫的挑战权，敬请参与。",
	},
	['332']={
		['id'] = 332,
		['title'] = "【系统】[帮派战-遗迹之战开启]",
		['content'] = "亲爱的玩家您好，今晚21：00-21：30即将开启新的一轮帮派战，获胜帮派将获得上古天宫的挑战权，敬请参与。",
	},
	['333']={
		['id'] = 333,
		['title'] = "【系统】[帮派战-遗迹之战开启]",
		['content'] = "亲爱的玩家您好，明天晚上21：00-21：30即将开启新的一轮帮派战，获胜帮派将获得上古天宫的挑战权，敬请参与。",
	},
	['334']={
		['id'] = 334,
		['title'] = "【系统】[帮派战-遗迹之战开启]",
		['content'] = "亲爱的玩家您好，后天晚上21：00-21：30即将开启新的一轮帮派战，获胜帮派将获得上古天宫的挑战权，敬请参与。",
	},
	['335']={
		['id'] = 335,
		['title'] = "【系统】[帮派王城战-上古天宫开启]",
		['content'] = "亲爱的玩家您好，本周5晚21：00-21：30即将开启新的一轮帮派王城战争夺，获胜帮派将赢得上古天宫，帮派荣升【至尊天盟】，所有成员获得炫酷称号。帮主将成为大千神王，获得专属坐骑及独有称号！敬请参与。",
	},
	['336']={
		['id'] = 336,
		['title'] = "【系统】[帮派王城战-上古天宫开启]",
		['content'] = "亲爱的玩家您好，今晚21：00-21：30即将开启新的一轮帮派王城战争夺，获胜帮派将赢得上古天宫，帮派荣升【至尊天盟】，所有成员获得炫酷称号。帮主将成为大千神王，获得专属坐骑及独有称号！敬请参与。",
	},
	['337']={
		['id'] = 337,
		['title'] = "【系统】[帮派王城战-上古天宫开启]",
		['content'] = "亲爱的玩家您好，明天晚上21：00-21：30即将开启新的一轮帮派王城战争夺，获胜帮派将赢得上古天宫，帮派荣升【至尊天盟】，所有成员获得炫酷称号。帮主将成为大千神王，获得专属坐骑及独有称号！敬请参与。",
	},
	['338']={
		['id'] = 338,
		['title'] = "【系统】[帮派王城战-上古天宫开启]",
		['content'] = "亲爱的玩家您好，后天晚上21：00-21：30即将开启新的一轮帮派王城战争夺，获胜帮派将赢得上古天宫，帮派荣升【至尊天盟】，所有成员获得炫酷称号。帮主将成为大千神王，获得专属坐骑及独有称号！敬请参与。",
	},
	['339']={
		['id'] = 339,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【玩游戏上搜狗】，失去属性：攻击10，防御5，生命40，命中3，闪避3，暴击3。",
	},
	['340']={
		['id'] = 340,
		['title'] = "【系统】[套装剥离]",
		['content'] = "亲爱的玩家您好，由于您背包已满，[套装剥离]的道具以邮件形式发送给您，请及时领取。",
	},
	['341']={
		['id'] = 341,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【玩我是大主宰只上PPS】，失去属性：攻击10，防御5，生命40，命中3，闪避3，暴击3。",
	},
	['342']={
		['id'] = 342,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【玩我是大主宰只上ccttx.com】，失去属性：攻击10，防御5，生命40，命中3，闪避3，暴击3。",
	},
	['343']={
		['id'] = 343,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【玩我是大主宰只上PPTV.COM】，失去属性：攻击10，防御5，生命40，命中3，闪避3，暴击3。",
	},
	['344']={
		['id'] = 344,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【无兄弟，不游戏】，失去属性：攻击30，防御15，生命120，命中9，闪避9，暴击9。",
	},
	['345']={
		['id'] = 345,
		['title'] = "【系统】[跨服boss奖励]",
		['content'] = "亲爱的玩家您好，您在本次跨服boss争夺中，参与【火焰泰坦】、 【大地泰坦】、 【死亡泰坦】、 【地狱泰坦】的争夺中，累计获得如下奖励，请查收附件。",
	},
	['346']={
		['id'] = 346,
		['title'] = "【系统】[跨服终极boss奖励]",
		['content'] = "亲爱的玩家您好，您在本次跨服boss争夺中，对终极boss【兽魂魔王】的战斗中，累计获得如下奖励，请查收附件。",
	},
	['347']={
		['id'] = 347,
		['title'] = "【系统】[跨服boss宝箱]",
		['content'] = "亲爱的玩家您好，您在本次跨服boss争夺中，累计抢夺宝箱奖励以邮件形式发送给您，请查收。",
	},
	['348']={
		['id'] = 348,
		['title'] = "【系统】[跨服boss参与奖励]",
		['content'] = "亲爱的玩家您好，您成功参与本次跨服boss击杀，获得如下参与奖励，请查收附件。",
	},
	['349']={
		['id'] = 349,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【youxi美女守护者】，失去属性：攻击20，防御10，生命80，命中6，闪避6，暴击6。",
	},
	['350']={
		['id'] = 350,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【圣诞守护神】，失去属性：攻击20，防御10，生命80，命中6，闪避6，暴击6。",
	},
	['351']={
		['id'] = 351,
		['title'] = "【系统】[手机绑定]",
		['content'] = "亲爱的玩家您好，您成功的绑定了手机，获得手机绑定大礼，请查收附件。",
	},
	['352']={
		['id'] = 352,
		['title'] = "【系统】[跨服擂台赛积分奖励]",
		['content'] = "亲爱的玩家您好，根据您在本次跨服擂台赛中的积分，获得如下参与奖励，请查收附件。",
	},
	['353']={
		['id'] = 353,
		['title'] = "【系统】[跨服擂台赛冠军奖励]",
		['content'] = "亲爱的玩家您好，您在本次跨服擂台赛中获得冠军，获得如下奖励，请查收附件。",
	},
	['354']={
		['id'] = 354,
		['title'] = "【系统】[跨服擂台赛排位奖励]",
		['content'] = "亲爱的玩家您好，根据您在本次跨服擂台赛中的排名，获得如下奖励，请查收附件。",
	},
	['355']={
		['id'] = 355,
		['title'] = "【系统】[跨服擂台赛荣耀奖励]",
		['content'] = "亲爱的玩家您好，本服玩家在本届跨服擂台赛荣获第一名，全服玩家获得荣耀奖励，请查收附件。",
	},
	['356']={
		['id'] = 356,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【玩我是大主宰只上酷狗】，失去属性：攻击10，防御5，生命40，命中3，闪避3，暴击3。",
	},
	['357']={
		['id'] = 357,
		['title'] = "【系统】[附加卷轴]",
		['content'] = "亲爱的玩家您好，由于您背包已满，[附加卷轴]以邮件形式发送给您，请及时领取。",
	},
	['358']={
		['id'] = 358,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【玩我是大主宰只上ku25.com】，失去属性：攻击10，防御5，生命40，命中3，闪避3，暴击3。",
	},
	['359']={
		['id'] = 359,
		['title'] = "【系统】[圣诞奖励]",
		['content'] = "亲爱的玩家您好，由于您背包已满，[圣诞奖励]以邮件形式发送给您，请及时领取。",
	},
	['360']={
		['id'] = 360,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【欢乐圣诞节】，失去属性：攻击30，防御15，生命120，命中9，闪避9，暴击9。",
	},
	['361']={
		['id'] = 361,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【好基友，在一起】，失去属性：攻击30，防御15，生命120，命中9，闪避9，暴击9。",
	},
	['362']={
		['id'] = 362,
		['title'] = "【系统】[婚宴请柬]",
		['content'] = "亲爱的玩家您好，您收到了婚宴喜帖，请注意婚宴时间，及时参与结婚庆典。",
	},
	['363']={
		['id'] = 363,
		['title'] = "【系统】[雪人捕获]",
		['content'] = "亲爱的玩家您好，由于您背包已满，[捕获的小雪人]以邮件形式发送给您，请及时领取。",
	},
	['364']={
		['id'] = 364,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【Legendary】，失去属性：攻击30，防御15，生命120，命中9，闪避9，暴击9。",
	},
	['365']={
		['id'] = 365,
		['title'] = "【系统】[称号丢失]",
		['content'] = "亲爱的玩家您好，您失去了称号【元旦】，失去属性：攻击30，防御15，生命120，命中9，闪避9，暴击9。",
	},
	['366']={
		['id'] = 366,
		['title'] = "【系统】[跨服擂台赛下注奖励]",
		['content'] = "亲爱的玩家您好，您在本次跨服擂台赛下注的玩家获得冠军，下注奖励以邮件方式发送给您，请查收附件。",
	},
	['367']={
		['id'] = 367,
		['title'] = "【系统】[腾讯管家特权礼包]",
		['content'] = "尊敬的腾讯管家特权用户：<br/>602游戏携手腾讯管家给您发放独家特权礼包，礼包物品在邮件附件中，请您提取（提取后会放在您的游戏背包中），更多特权礼包请关注602游戏官方网站 www.602.com。",
	},
	['368']={
		['id'] = 368,
		['title'] = "【系统】[婚宴礼包]",
		['content'] = "亲爱的玩家您好，婚宴礼包以邮件方式发送给您，请查收附件。",
	},
	['369']={
		['id'] = 369,
		['title'] = "【系统】[离婚信息]",
		['content'] = "亲爱的玩家您好，您的配偶已经和您离婚。",
	},
	['370']={
		['id'] = 370,
		['title'] = "【系统】[下注返还]",
		['content'] = "亲爱的玩家您好，由于服务器问题您本次下注金额已返还，请注意查收。",
	},
	['371']={
		['id'] = 371,
		['title'] = "【系统】[结婚请柬]",
		['content'] = "亲爱的玩家您好，由于您背包已满，[婚宴请柬]以邮件形式发送给您，请及时领取。",
	},
	['372']={
		['id'] = 372,
		['title'] = "【系统】[结婚喜糖]",
		['content'] = "亲爱的玩家您好，由于您背包已满，[婚宴喜糖]以邮件形式发送给您，请及时领取。",
	},
	['373']={
		['id'] = 373,
		['title'] = "【系统】[改名失败]",
		['content'] = "亲爱的玩家您好，由于您改名失败，道具已返还，请查收附件。",
	},
	['374']={
		['id'] = 374,
		['title'] = "【系统】[独立副本]奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，[独立副本]过关奖邮件形式发送给您，请及时领取。",
	},
	['375']={
		['id'] = 375,
		['title'] = "【系统】竞技场奖励",
		['content'] = "亲爱的玩家您好，由于您背包已满，奖励以邮件形式发送给您，请及时领取。",
	},
	['376']={
		['id'] = 376,
		['title'] = "【系统】[首日目标]",
		['content'] = "亲爱的玩家您好，由于您背包已满，[首日目标]奖励以邮件形式发送给您，请及时领取。",
	},
	['377']={
		['id'] = 377,
		['title'] = "【系统】[宝石卸载]",
		['content'] = "亲爱的玩家您好，由于您背包已满，[卸载宝石]以邮件形式发送给您，请及时领取。",
	},
	['378']={
		['id'] = 378,
		['title'] = "【系统】[天降宝箱]",
		['content'] = "亲爱的玩家您好，由于您背包已满，[天降宝箱]奖励以邮件形式发送给您，请及时领取。",
	},
	['379']={
		['id'] = 379,
		['title'] = "【系统】[神装收集]",
		['content'] = "亲爱的玩家您好，由于您背包已满，[神装收集]奖励以邮件形式发送给您，请及时领取。",
	},
	['380']={
		['id'] = 380,
		['title'] = "【系统】[开启宝箱]",
		['content'] = "亲爱的玩家您好，由于您背包已满，[开启宝箱]奖励以邮件形式发送给您，请及时领取。",
	},
	['381']={
		['id'] = 381,
		['title'] = "【系统】[背包已满]",
		['content'] = "亲爱的玩家您好，由于您背包已满，获得的奖励以邮件形式发送给您，请及时领取。",
	},
	['382']={
		['id'] = 382,
		['title'] = "【系统】[打宝地宫]",
		['content'] = "亲爱的玩家您好，由于您背包已满，[打宝地宫]在线奖励以邮件形式发送给您，请及时领取。",
	},
	['383']={
		['id'] = 383,
		['title'] = "【系统】[打宝地宫]",
		['content'] = "亲爱的玩家您好，感谢您参与打宝地宫BOSS的战斗，参战奖励以邮件形式发送给您，请及时领取。",
	},
	['384']={
		['id'] = 384,
		['title'] = "【系统】[充值玩家补偿]",
		['content'] = "尊敬的玩家，您好！因游戏内出现战力异常的情况，导致玩家的游戏体验严重受损。现已修复该问题，并根据您在维护前累计充值的金额，补偿一定比例的元宝，请您查收！",
	},
	['385']={
		['id'] = 385,
		['title'] = "【系统】[玩家补偿]",
		['content'] = "由于天神系统改版，系统将根据玩家原天神系统拥有战斗力返还新天神，返还的新天神战斗力将大于原天神系统总战力。",
	},
};