Plugin_listConfig={
	['10']={
		['type'] = "10",
		['descrip'] = "进入游戏欢迎页",
	},
	['20']={
		['type'] = "20",
		['descrip'] = "点击开始游戏",
	},
	['30']={
		['type'] = "30",
		['descrip'] = "加载游戏index页面成功(微端解析登录串自动登录成功)",
	},
	['40']={
		['type'] = "40",
		['descrip'] = "loader加载成功，开始下载foa， sg=3(loader进度0%~10%)",
	},
	['42']={
		['type'] = "42",
		['descrip'] = "加载fob， sg=4(loader进度10%~40%)",
	},
	['44']={
		['type'] = "44",
		['descrip'] = "加载foc、fod， sg=5(loader进度40%~100%)",
	},
	['50']={
		['type'] = "50",
		['descrip'] = "第一次资源加载完成，进入游戏，sg=6",
	},
	['60']={
		['type'] = "60",
		['descrip'] = "客户端程序启动成功",
	},
	['70']={
		['type'] = "70",
		['descrip'] = "请求连接服务器",
	},
	['80']={
		['type'] = "80",
		['descrip'] = "连接服务器成功",
	},
	['90']={
		['type'] = "90",
		['descrip'] = "请求登录验证",
	},
	['100']={
		['type'] = "100",
		['descrip'] = "登录验证成功",
	},
	['110']={
		['type'] = "110",
		['descrip'] = "新用户请求创角角色",
	},
	['120']={
		['type'] = "120",
		['descrip'] = "新用户创角角色成功",
	},
	['130']={
		['type'] = "130",
		['descrip'] = "老用户请求进入游戏",
	},
	['140']={
		['type'] = "140",
		['descrip'] = "服务器返回玩家进入场景,二包开始加载",
	},
	['141']={
		['type'] = "141",
		['descrip'] = "第二次资源加载(10%)",
	},
	['142']={
		['type'] = "142",
		['descrip'] = "第二次资源加载(20%)",
	},
	['143']={
		['type'] = "143",
		['descrip'] = "第二次资源加载(30%)",
	},
	['144']={
		['type'] = "144",
		['descrip'] = "第二次资源加载(40%)",
	},
	['145']={
		['type'] = "145",
		['descrip'] = "第二次资源加载(50%)",
	},
	['146']={
		['type'] = "146",
		['descrip'] = "第二次资源加载(60%)",
	},
	['147']={
		['type'] = "147",
		['descrip'] = "第二次资源加载(70%)",
	},
	['148']={
		['type'] = "148",
		['descrip'] = "第二次资源加载(80%)",
	},
	['149']={
		['type'] = "149",
		['descrip'] = "第二次资源加载(90%)",
	},
	['150']={
		['type'] = "150",
		['descrip'] = "第二次资源加载完成并进入游戏",
	},
};