_G.lovelypetchatcfg={
	--萌宠id牛牛
	-- [1] = {
		-- --萌宠id*1000 + 1休息状态 玩家休息中
		-- [1001] = {
			-- Intervaltime = 300,--100=10s
			-- list = {
				-- [1] = "为什么大家都说我长得像隔壁王叔叔呢…",
				-- [2] = "光天化日，朗朗乾坤，居然就没有个小母牛路过，简直不能忍！",
				-- [3] = "主人，如果有一天我变成色狼，请记得我也曾纯洁过",
				-- [4] = "听说灵光封魔有好多经验，我们去打吧",
				-- [5] = "王叔叔跟我说，世界boss会出卓越武器，等我再长大一点点就能去打了",
				-- [6] = "昨晚我偷看GM洗澡时，听他自言自语说斗破苍穹可以出好装备",
				-- [7] = "经验副本可以出经验！。。。咦，我为什么要这么说？",
				-- [8] = "打宝秘境是什么鬼？好想进去看看啊",
				-- [9] = "等我战力高了，一定要去极限挑战玩玩，向小丽证明我才是最强的牛",
			-- },
		-- },
		-- --萌宠id*1000 + 2战斗状态 玩家战斗中
		-- [1002] = {
			-- Intervaltime = 300,
			-- list = {
				-- [1] = "主人，揍他，狠狠的揍他！",
				-- [2] = "好逊啊，杀怪这么慢，一定是你没搞卓越装备！",
				-- [3] = "主人，主人，其实我再长大点，就能帮你打怪了。",
				-- [4] = "好多怪物啊，要不要吃个多倍经验丹呢",
				-- [5] = "知道嘛，想当初我一只手，错了，是一只蹄子打怪都比你快",
				-- [6] = "GM非要让我告诉你，打造是可以出卓越装备的。",
				-- [7] = "昨晚我偷看GM洗澡时，听他自言自语说斗破苍穹可以出好装备",
				-- [8] = "灵路试练可以出经验！。。。咦，我为什么要这么说？",
				-- [9] = "打宝秘境是什么鬼？好想进去看看啊",
				-- [10] = "等我战力高了，一定要去极限挑战玩玩，向小丽证明我才是最强的牛",
				-- [11] = "灵兽技能好厉害啊",
				-- [12] = "敢不敢放个灵阵玩玩，别告诉我你不会",
				-- [13] = "主人，主人，看到那个头顶duang了好几个小特效的怪物没，杀他可以加属性！",
			-- },
		-- },
		-- --萌宠id*1000 + 3打坐状态 玩家打坐中
		-- [1003] = {
			-- Intervaltime = 300,
			-- list = {
				-- [1] = "祖上曾传下来一句话，结阵打坐效果更好。虽然我也不知道为什么GM让我这么说。",
				-- [2] = "这时候如果有个漂亮的小母牛来一起打坐，那该多好哇~",
				-- [3] = "我好喜欢打坐啊，坐下比较矮，可以看到很多平时看不到的东西~",
				-- [4] = "每次打坐的时候，我都会思考一下人生，就像你需要思考一下怎么提升战斗力一样",
				-- [5] = "本帅牛在这站着，居然没有靓妞儿来搭个讪？",
				-- [6] = "上次我跟小丽约会的时候，我吃了10碗饭，还是她刷的卡，然后就没有然后了",
				-- [7] = "昨晚我偷看GM洗澡时，听他自言自语说斗破苍穹可以出好装备",
				-- [8] = "灵路试练可以出经验！。。。咦，我为什么要这么说？",
				-- [9] = "打宝秘境是什么鬼？好想进去看看啊",
			-- },
		-- },
	-- },
	--萌宠-钢铁侠
		[1] = {
		--萌宠id*1000 + 1休息状态 玩家休息中
		[1001] = {
			Intervaltime = 300,--100=10s
			list = {
				[1] = "你玩游戏可以，游戏玩你不可以；游戏不是人生，人生更不是游戏",
				[2] = "做事必须有超前意识，比如说，抢boss之前先<font color='#00ff00'>装备升星</font>下。",
				[3] = "你就没有睡不着觉的时候？不如我们来聊聊<font color='#00ff00'>宝石</font>的事吧。",
				[4] = "听说<font color='#00ff00'>经验副本</font>可以让你获得更多的经验。",
				[5] = "啊~世界boss，那可是好玩的地方。",
				[6] = "想要保护好你所不能失去的东西，那就努力变强吧。",
				[7] = "据说<font color='#00ff00'>打宝地宫</font>里面有很多宝物，不知道是不是真的！",
				[8] = "<font color='#00ff00'>打宝地宫</font>不知道刷新没刷新，要是刷新了可以拿到好多装备。",
				[9] = "你又在无所事事了么，看看你的任务栏吧，还不快去！",
				[10] = "我好想有个<font color='#00ff00'>神翼</font>，这样我就能飞得更高了！",
			},
		},
		--萌宠id*1000 + 2战斗状态 玩家战斗中
		[1002] = {
			Intervaltime = 300,
			list = {
				[1] = "想要不被欺负，棍子得比别人粗。",
				[2] = "我更喜欢那种一击致命的武器",
				[3] = "我的头撞击完全可以称霸摔跤比赛。",
				[4] = "我已经忍不住想要吃点多倍经验丹了，对，就是那玩意。",
				[5] = "知道吗，我只要抬抬手，杀怪速度就比你高一万倍",
				[6] = "想要变得更强么？用你的大脑想一想，充钱了么？",
				[7] = "是令人恐惧，还是令人尊敬，想二者兼顾，那就得比别人强。",
				[8] = "哎呀呀，贱出来的鲜血快弄脏我的毛了！",
				[9] = "听说PK还是三神铸装备更配哦~！",
			},
		},
		--萌宠id*1000 + 3打坐状态 玩家打坐中
		[1003] = {
			Intervaltime = 300,
			list = {
				[1] = "穿上钢铁盔甲只是让你以全新的身份去思考解决问题的办法。",
				[2] = "我曾身陷钢铁盔甲，如今已因它而得到自由。",
				[3] = "打坐？很有意思的事情，不知道经验加的多不多",
				[4] = "打坐的时候看看风景...",
				[5] = "快看，那个人的<font color='#00ff00'>时装</font>太漂亮了，好像穿一件哦！",
				[6] = "不知道什么时候才能有一个萌萌的<font color='#00ff00'>宠物</font>来陪我一起玩耍呢？",
				[7] = "不知道<font color='#00ff00'>竞技场</font>有没有人能打过我呢？",
				[8] = "<font color='#00ff00'>经验副本</font>的经验，卧...我想说句脏话...卧槽，太TM多了！",
				[9] = "<font color='#00ff00'>飞升</font>？那是什么鬼？能够让我飞得更高么？",
			},
		},
	},
};