_G.t_extrachain={
	[1]={
		['id'] = 1,
		['lv'] = 460,
		['attr'] = "att,25#def,12#hp,250",
		['name'] = "全身达到460级",
	},
	[2]={
		['id'] = 2,
		['lv'] = 1390,
		['attr'] = "att,50#def,25#hp,500",
		['name'] = "全身达到1390级",
	},
	[3]={
		['id'] = 3,
		['lv'] = 3230,
		['attr'] = "att,99#def,50#hp,990",
		['name'] = "全身达到3230级",
	},
	[4]={
		['id'] = 4,
		['lv'] = 6310,
		['attr'] = "att,165#def,83#hp,1650",
		['name'] = "全身达到6310级",
	},
	[5]={
		['id'] = 5,
		['lv'] = 10320,
		['attr'] = "att,215#def,108#hp,2150",
		['name'] = "全身达到10320级",
	},
	[6]={
		['id'] = 6,
		['lv'] = 15400,
		['attr'] = "att,273#def,137#hp,2720",
		['name'] = "全身达到15400级",
	},
};