_G.t_gemlock={
	[1]={
		['id'] = 1,
		['lvl'] = 45,
		['atb'] = "att,25#def,10#hp,240",
		['name'] = "宝石连锁-白鹭晶魄",
	},
	[2]={
		['id'] = 2,
		['lvl'] = 90,
		['atb'] = "att,50#def,25#hp,480",
		['name'] = "宝石连锁-绿鸠晶魄",
	},
	[3]={
		['id'] = 3,
		['lvl'] = 135,
		['atb'] = "att,70#def,35#hp,720",
		['name'] = "宝石连锁-蓝鹇晶魄",
	},
	[4]={
		['id'] = 4,
		['lvl'] = 180,
		['atb'] = "att,95#def,50#hp,960",
		['name'] = "宝石连锁-紫貂晶魄",
	},
	[5]={
		['id'] = 5,
		['lvl'] = 225,
		['atb'] = "att,150#def,75#hp,1500",
		['name'] = "宝石连锁-橙熊晶魄",
	},
	[6]={
		['id'] = 6,
		['lvl'] = 270,
		['atb'] = "att,210#def,105#hp,2100",
		['name'] = "宝石连锁-赤猿晶魄",
	},
};