_G.t_homefighttxt={
	[101]={
		['id'] = 101,
		['txt'] = "经过一番厮打，成功的击败了{1}的守护弟子。战斗收益：{2}",
		['txt2'] = "{1}趁您不备，一记猴子偷逃击败了您的守护弟子，成功抢走奖励：{2}",
	},
	[102]={
		['id'] = 102,
		['txt'] = "您的弟子以一记猴子偷桃击败了{1}的守护弟子。成功抢得：{2}",
		['txt2'] = "{1}冲进您的宗门，横扫您的弟子后扬长而去，损失奖励：{2}",
	},
	[103]={
		['id'] = 103,
		['txt'] = "{1}的守护弟子看到您冲过来，吓得转身就逃，您成功缴获收益：{2}",
		['txt2'] = "{1}一脚踢翻您的守护弟子，成功抢走奖励：{2}",
	},
	[104]={
		['id'] = 104,
		['txt'] = "您的弟子冲入人群，成功击退{1}的守护弟子，获得战斗收益：{2}",
		['txt2'] = "{1}偷偷潜入您的宗门，一棍子打翻守护弟子，成功抢走任务奖励：{2}",
	},
	[105]={
		['id'] = 105,
		['txt'] = "经过一番厮打，成功的击败了{1}的守护弟子。战斗收益：{2}",
		['txt2'] = "{1}冲进宗门，您的弟子拼死抵抗，奈何寡不敌众，被抢走任务奖励：{2}",
	},
	[201]={
		['id'] = 201,
		['txt'] = "您正英勇的与{1}的守护弟子战斗，奈何突然冲出一直野狗咬了您一口，以致功败垂成，未能夺得任何东西。",
		['txt2'] = "{1}冲进您的宗门，正要抢夺，突然冲出一直野狗咬了他一口，以致功败垂成，没有损失任何东西。",
	},
	[202]={
		['id'] = 202,
		['txt'] = "您与{1}的守护弟子斗的难分难解，一不小心踩到碎石崴了脚，只能退走，未能夺得任何东西。",
		['txt2'] = "{1}与您的守护弟子斗的难分难解，一不小心踩到碎石崴了脚，只能退走，没有损失任何东西。",
	},
	[203]={
		['id'] = 203,
		['txt'] = "您正打的{1}的守护弟子抬不起头来，突然天降花盆，将您打晕，对手趁机逃走，未能夺得任何东西。",
		['txt2'] = "{1}冲进您的宗门，打倒您的守护弟子，正准备搬运奖励，突然天降花盆将其打晕，没有损失任何东西。",
	},
	[204]={
		['id'] = 204,
		['txt'] = "您一脚将{1}的守护弟子踢倒，正要抢夺战利品时，被自己绊倒，对手趁机逃走，未能夺得任何东西。",
		['txt2'] = "{1}冲进您的宗门，您的弟子拼死抵抗，将其击退，没有损失任何东西。",
	},
	[205]={
		['id'] = 205,
		['txt'] = "您对{1}的守护弟子一顿猛攻，奈何对手身上矫健，全部躲开，未能夺得任何东西。",
		['txt2'] = "{1}冲进您的宗门，您的弟子拼死抵抗，将其击退，没有损失任何东西。",
	},
};