_G.t_zhuanzhihuizhang={
	[101]={
		['id'] = 101,
		['name'] = "天启",
		['image'] = "",
		['attr'] = "att,100#def,200",
	},
	[102]={
		['id'] = 102,
		['name'] = "飘渺",
		['image'] = "",
		['attr'] = "att,100#def,201",
	},
	[103]={
		['id'] = 103,
		['name'] = "涅槃",
		['image'] = "",
		['attr'] = "att,100#def,202",
	},
	[104]={
		['id'] = 104,
		['name'] = "超越",
		['image'] = "",
		['attr'] = "att,100#def,203",
	},
	[105]={
		['id'] = 105,
		['name'] = "巅峰",
		['image'] = "",
		['attr'] = "att,100#def,204",
	},
	[106]={
		['id'] = 106,
		['name'] = "主宰",
		['image'] = "",
		['attr'] = "att,100#def,205",
	},
	[107]={
		['id'] = 107,
		['name'] = "飞仙",
		['image'] = "",
		['attr'] = "att,100#def,206",
	},
	[108]={
		['id'] = 108,
		['name'] = "神临",
		['image'] = "",
		['attr'] = "att,100#def,207",
	},
	[109]={
		['id'] = 109,
		['name'] = "圣域",
		['image'] = "",
		['attr'] = "att,100#def,208",
	},
	[110]={
		['id'] = 110,
		['name'] = "不朽",
		['image'] = "",
		['attr'] = "att,100#def,209",
	},
};