Config.scenes = Config.scenes or {}
Config.scenes[99] = {
	id 			 = 99,
	name		 = "夺宝奇兵",
	scene_type	 = 0,
	width	 	 = 5184,
	height	 	 = 3328,
	entry_point	 = {x = 0, y = 0},
	
	monsters 	 = {

			 	   },
			 	   
	npcs		 = {

			  	   },
			  	   
	gathers		 = {

			  	   },
			  	   		  	   
	decorations  = {
					{id=1,name="安全区线-1",x=71,y=68},
					{id=1,name="安全区线-1",x=27,y=60},
					{id=1,name="安全区线-1",x=53,y=19},
					{id=1,name="安全区线-1",x=35,y=68},
					{id=1,name="安全区线-1",x=33,y=66},
					{id=1,name="安全区线-1",x=43,y=76},
					{id=1,name="安全区线-1",x=83,y=47},
					{id=1,name="安全区线-1",x=81,y=45},
					{id=1,name="安全区线-1",x=61,y=78},
					{id=1,name="安全区线-1",x=65,y=29},
					{id=1,name="安全区线-1",x=25,y=47},
					{id=1,name="安全区线-1",x=33,y=39},
					{id=1,name="安全区线-1",x=79,y=43},
					{id=1,name="安全区线-1",x=69,y=33},
					{id=1,name="安全区线-1",x=85,y=49},
					{id=1,name="安全区线-1",x=79,y=60},
					{id=1,name="安全区线-1",x=23,y=56},
					{id=1,name="安全区线-1",x=55,y=19},
					{id=1,name="安全区线-1",x=73,y=66},
					{id=1,name="安全区线-1",x=69,y=70},
					{id=1,name="安全区线-1",x=31,y=64},
					{id=1,name="安全区线-1",x=21,y=54},
					{id=1,name="安全区线-1",x=23,y=49},
					{id=1,name="安全区线-1",x=27,y=45},
					{id=1,name="安全区线-1",x=85,y=54},
					{id=1,name="安全区线-1",x=45,y=78},
					{id=1,name="安全区线-1",x=29,y=43},
					{id=1,name="安全区线-1",x=47,y=80},
					{id=1,name="安全区线-1",x=25,y=58},
					{id=1,name="安全区线-1",x=75,y=39},
					{id=1,name="安全区线-1",x=57,y=21},
					{id=1,name="安全区线-1",x=41,y=74},
					{id=1,name="安全区线-1",x=71,y=35},
					{id=1,name="安全区线-1",x=49,y=82},
					{id=1,name="安全区线-1",x=67,y=72},
					{id=1,name="安全区线-1",x=41,y=31},
					{id=1,name="安全区线-1",x=59,y=23},
					{id=1,name="安全区线-1",x=81,y=58},
					{id=1,name="安全区线-1",x=57,y=82},
					{id=1,name="安全区线-1",x=61,y=25},
					{id=1,name="安全区线-1",x=87,y=52},
					{id=1,name="安全区线-1",x=39,y=72},
					{id=1,name="安全区线-1",x=37,y=34},
					{id=1,name="安全区线-1",x=43,y=29},
					{id=1,name="安全区线-1",x=65,y=74},
					{id=1,name="安全区线-1",x=77,y=41},
					{id=1,name="安全区线-1",x=29,y=62},
					{id=1,name="安全区线-1",x=63,y=27},
					{id=1,name="安全区线-1",x=51,y=21},
					{id=1,name="安全区线-1",x=55,y=84},
					{id=1,name="安全区线-1",x=39,y=33},
					{id=1,name="安全区线-1",x=35,y=37},
					{id=1,name="安全区线-1",x=75,y=64},
					{id=1,name="安全区线-1",x=51,y=84},
					{id=1,name="安全区线-1",x=77,y=62},
					{id=1,name="安全区线-1",x=31,y=41},
					{id=1,name="安全区线-1",x=37,y=70},
					{id=1,name="安全区线-1",x=73,y=37},
					{id=1,name="安全区线-1",x=63,y=76},
					{id=1,name="安全区线-1",x=45,y=27},
					{id=1,name="安全区线-1",x=49,y=23},
					{id=1,name="安全区线-1",x=47,y=25},
					{id=1,name="安全区线-1",x=21,y=51},
					{id=1,name="安全区线-1",x=67,y=31},
					{id=1,name="安全区线-1",x=83,y=56},
					{id=1,name="安全区线-1",x=59,y=80},
					{id=1,name="安全区线-1",x=19,y=52},
					{id=1,name="安全区线-1",x=53,y=86}
				   },
				   
	doors		 = {

				   }
}
