Config.scenes = Config.scenes or {}
Config.scenes[2] = {
	id 			 = 2,
	name		 = "比奇城",
	scene_type	 = 0,
	width	 	 = 10000,
	height	 	 = 6000,
	entry_point	 = {x = 0, y = 0},
	
	monsters 	 = {

			 	   },
			 	   
	npcs		 = {

			  	   },
			  	   
	gathers		 = {

			  	   },
			  	   		  	   
	decorations  = {
					{id=1,name="安全区线-1",x=118,y=86},
					{id=1,name="安全区线-1",x=105,y=75},
					{id=1,name="安全区线-1",x=131,y=120},
					{id=1,name="安全区线-1",x=115,y=83},
					{id=1,name="安全区线-1",x=143,y=131},
					{id=1,name="安全区线-1",x=158,y=126},
					{id=1,name="安全区线-1",x=99,y=97},
					{id=1,name="安全区线-1",x=101,y=98},
					{id=1,name="安全区线-1",x=167,y=134},
					{id=1,name="安全区线-1",x=90,y=85},
					{id=1,name="安全区线-1",x=114,y=82},
					{id=1,name="安全区线-1",x=128,y=111},
					{id=1,name="安全区线-1",x=112,y=81},
					{id=1,name="安全区线-1",x=109,y=78},
					{id=1,name="安全区线-1",x=161,y=129},
					{id=1,name="安全区线-1",x=135,y=106},
					{id=1,name="安全区线-1",x=105,y=98},
					{id=1,name="安全区线-1",x=115,y=89},
					{id=1,name="安全区线-1",x=95,y=80},
					{id=1,name="安全区线-1",x=139,y=109},
					{id=1,name="安全区线-1",x=97,y=78},
					{id=1,name="安全区线-1",x=113,y=91},
					{id=1,name="安全区线-1",x=134,y=123},
					{id=1,name="安全区线-1",x=117,y=85},
					{id=1,name="安全区线-1",x=93,y=91},
					{id=1,name="安全区线-1",x=157,y=142},
					{id=1,name="安全区线-1",x=128,y=117},
					{id=1,name="安全区线-1",x=99,y=76},
					{id=1,name="安全区线-1",x=90,y=89},
					{id=1,name="安全区线-1",x=163,y=143},
					{id=1,name="安全区线-1",x=103,y=73},
					{id=1,name="安全区线-1",x=148,y=118},
					{id=1,name="安全区线-1",x=164,y=132},
					{id=1,name="安全区线-1",x=103,y=100},
					{id=1,name="安全区线-1",x=101,y=75},
					{id=1,name="安全区线-1",x=153,y=139},
					{id=1,name="安全区线-1",x=95,y=93},
					{id=1,name="安全区线-1",x=97,y=95},
					{id=1,name="安全区线-1",x=111,y=93},
					{id=1,name="安全区线-1",x=107,y=96},
					{id=1,name="安全区线-1",x=91,y=83},
					{id=1,name="安全区线-1",x=93,y=81},
					{id=1,name="安全区线-1",x=141,y=112},
					{id=1,name="安全区线-1",x=137,y=125},
					{id=1,name="安全区线-1",x=170,y=137},
					{id=1,name="安全区线-1",x=107,y=76},
					{id=1,name="安全区线-1",x=111,y=79},
					{id=1,name="安全区线-1",x=154,y=123},
					{id=1,name="安全区线-1",x=109,y=95},
					{id=1,name="安全区线-1",x=151,y=120},
					{id=1,name="安全区线-1",x=125,y=114},
					{id=1,name="安全区线-1",x=131,y=109},
					{id=1,name="安全区线-1",x=147,y=134},
					{id=1,name="安全区线-1",x=88,y=87},
					{id=1,name="安全区线-1",x=150,y=137},
					{id=1,name="安全区线-1",x=160,y=145},
					{id=1,name="安全区线-1",x=140,y=128},
					{id=1,name="安全区线-1",x=166,y=140},
					{id=1,name="安全区线-1",x=117,y=88},
					{id=1,name="安全区线-1",x=145,y=115}
				   },
				   
	doors		 = {

				   }
}
