Config.scenes = Config.scenes or {}
Config.scenes[3] = {
	id 			 = 3,
	name		 = "土城",
	scene_type	 = 0,
	width	 	 = 7680,
	height	 	 = 4864,
	entry_point	 = {x = 0, y = 0},
	
	monsters 	 = {

			 	   },
			 	   
	npcs		 = {

			  	   },
			  	   
	gathers		 = {

			  	   },
			  	   		  	   
	decorations  = {
					{id=1,name="安全区线-1",x=97,y=105},
					{id=1,name="安全区线-1",x=87,y=99},
					{id=1,name="安全区线-1",x=105,y=86},
					{id=1,name="安全区线-1",x=95,y=87},
					{id=1,name="安全区线-1",x=89,y=81},
					{id=1,name="安全区线-1",x=103,y=64},
					{id=1,name="安全区线-1",x=109,y=70},
					{id=1,name="安全区线-1",x=101,y=62},
					{id=1,name="安全区线-1",x=111,y=72},
					{id=1,name="安全区线-1",x=99,y=96},
					{id=1,name="安全区线-1",x=111,y=80},
					{id=1,name="安全区线-1",x=99,y=99},
					{id=1,name="安全区线-1",x=87,y=102},
					{id=1,name="安全区线-1",x=115,y=76},
					{id=1,name="安全区线-1",x=93,y=105},
					{id=1,name="安全区线-1",x=107,y=68},
					{id=1,name="安全区线-1",x=112,y=74},
					{id=1,name="安全区线-1",x=97,y=96},
					{id=1,name="安全区线-1",x=95,y=65},
					{id=1,name="安全区线-1",x=95,y=96},
					{id=1,name="安全区线-1",x=99,y=105},
					{id=1,name="安全区线-1",x=87,y=79},
					{id=1,name="安全区线-1",x=88,y=72},
					{id=1,name="安全区线-1",x=93,y=96},
					{id=1,name="安全区线-1",x=113,y=78},
					{id=1,name="安全区线-1",x=91,y=105},
					{id=1,name="安全区线-1",x=92,y=67},
					{id=1,name="安全区线-1",x=99,y=102},
					{id=1,name="安全区线-1",x=97,y=89},
					{id=1,name="安全区线-1",x=109,y=82},
					{id=1,name="安全区线-1",x=99,y=60},
					{id=1,name="安全区线-1",x=89,y=105},
					{id=1,name="安全区线-1",x=95,y=105},
					{id=1,name="安全区线-1",x=91,y=96},
					{id=1,name="安全区线-1",x=101,y=89},
					{id=1,name="安全区线-1",x=87,y=105},
					{id=1,name="安全区线-1",x=93,y=85},
					{id=1,name="安全区线-1",x=105,y=66},
					{id=1,name="安全区线-1",x=90,y=70},
					{id=1,name="安全区线-1",x=107,y=84},
					{id=1,name="安全区线-1",x=84,y=76},
					{id=1,name="安全区线-1",x=99,y=91},
					{id=1,name="安全区线-1",x=97,y=63},
					{id=1,name="安全区线-1",x=103,y=88},
					{id=1,name="安全区线-1",x=87,y=96},
					{id=1,name="安全区线-1",x=89,y=96},
					{id=1,name="安全区线-1",x=86,y=74},
					{id=1,name="安全区线-1",x=91,y=83}
				   },
				   
	doors		 = {

				   }
}
