
StrConfig:Add(
{
	["wabao001"] = "数量：<font color='%s'>%s</font>";
	["wabao002"] = "我去，竟然是假的！真是虐心啊！";
	["wabao003"] = "我去，竟然是真的！真是开心啊！";
	["wabao004"] = "请选择您要去的宝藏位置！";
	["wabao005"] = "寻宝次数已用尽!明天再来吧！";
	["wabao006"] = "恭喜您，挖到宝箱了！";
	["wabao007"] = "恭喜您，挖到妖怪了！";
	["wabao008"] = "恭喜您成功挖到：<br/><font color='#29cc00'>%s</font><br/><font color='#29cc00'>5秒后自动执行</font>";
	["wabao009"] = "恭喜您，挖到妖怪了,是否前往？";
	["wabao010"] = "立即传送至宝藏所在地图！<br/>等级达到120级可以使用。<br/>200级后可直接传送至真实的宝藏地点";
	["wabao011"] = "等级达到120级可以使用";
	["wabao012"] = "";
	["wabao013"] = "";
	["wabao014"] = "";
	["wabao015"] = "";
	["wabao016"] = "";
	["wabao017"] = "";


	["wabaocang001"] = "<u>普通藏宝图%s个</u>";
	["wabaocang002"] = "<u>精良藏宝图%s个</u>";
	["wabaocang003"] = "<u>稀有藏宝图%s个</u>";
	["wabaocang004"] = "<u>传说藏宝图%s个</u>";


	["wabaotips001"] = "策划 ------- 1";
	["wabaotips002"] = "策划 ------- 2";
	["wabaotips003"] = "策划 ------- 3";
	["wabaotips004"] = "策划 ------- 4";


}
)